Repository: casper-network/docs-archive
Catalog: locale/*/LC_MESSAGES/archived/contract-dsl-archived/advanced.po
Languages: fr, ru, tr, vi

source: Advanced Options
fr: Options avancées
ru: Продвинутые опции
tr: Gelişmiş Seçenekler
vi: Tuỳ chọn nâng cao

source: Once the base logic of the smart contract is in place, it's desirable to optimize the contract for the blockchain. This will require digging into the actual code that the DSL generates. This section will describe the steps to do this. Once the code has been expanded and then changed, make sure to remove the macros from the project configuration before saving the changes.
fr: Une fois que la logique de base du contrat intelligent est en place, il est souhaitable d'optimiser le contrat pour la blockchain. Cela nécessitera de se plonger dans le code réel que le DSL (Domain Specific Language) génère. Cette section décrit les étapes à suivre pour y parvenir. Une fois le code développé puis modifié, s'assurer de retirer les macros de la configuration du projet avant de sauvegarder les modifications.
ru: Когда базовая логика смарт-контракта оптимизирована, следует оптимизировать контракт под блокчейн. Для этого потребуется погрузиться в код, генерируемый DSL. В данном разделе описываются шаги, как это сделать. Как только код будет расширен и изменен, обязательно удалите макросы из конфигурации проекта и сохраните изменения.
tr: Akıllı kontratın temel mantığı yerine getirildikten sonra kontratın blok zincir için optimize edilmesi gerekir. Bu da, DSL'nin ürettiği gerçek kodun derinliklerine inmeyi gerektirecektir. Bu bölümde bunu yapmak için gerekli adımları açıklayacağız. Kod genişletildikten ve değiştirildikten sonra, değişiklikleri kaydetmeden önce makroları proje yapılandırmasından kaldırdığınızdan emin olun.
vi: Một khi logic cơ sở của hợp đồng thông minh đã có, bạn nên tối ưu hóa hợp đồng cho chuỗi khối. Điều này sẽ yêu cầu đào sâu vào mã hiện thời mà DSL tạo ra. Phần này sẽ mô tả các bước để thực hiện việc này. Khi mã đã được mở rộng và sau đó được thay đổi, hãy đảm bảo xóa macro khỏi cấu hình dự án trước khi lưu các thay đổi.

source: Debugging Contracts
fr: Débogage des contrats
ru: Отладка контрактов
tr: Kontratlarda Hata Ayıklama
vi: Gỡ rối Hợp đồng

source: It is possible to debug Rust contracts inside any IDE that supports breakpoints and watches. Make sure that the IDE supports Rust development and tools.
fr: Il est possible de déboguer des contrats Rust dans n'importe quel IDE (Integrated Development Environment) qui supporte les points d'arrêt et les surveillances (watches). Assurez-vous que l'IDE supporte le développement et les outils Rust.
ru: Отладить Rust-контракты можно в любой интегрированной среде разработки, которая поддерживает методы точек остановки и наблюдения. Убедитесь, что среда разработки поддерживает инструменты разработки и Rust.
tr: Kesme noktalarını ve saatleri destekleyen herhangi bir IDE içinde Rust kontratlarının hatalarını ayıklamak mümkündür. IDE'nin Rust geliştirme ve araçlarını desteklediğinden emin olun.
vi: Có thể gỡ lỗi các hợp đồng Rust bên trong bất kỳ IDE nào hỗ trợ các điểm ngắt và đồng hồ. Đảm bảo rằng IDE hỗ trợ các công cụ và phát triển Rust.

source: Expanding the Code
fr: Extension du code
ru: Расширение кода
tr: Kodu Genişletmek
vi: Mở rộng mã

source: When the rust compiler encounters each of the macros, it 'expands' the code and adds additional lines of code for each of the macros. The resultant expanded code is then compiled to the wasm which can then be deployed to the blockchain.
fr: Lorsque le compilateur rust rencontre chacune des macros, il "étend" le code et ajoute des lignes de code supplémentaires pour chacune des macros. Le code étendu qui en résulte est ensuite compilé dans le wasm qui peut ensuite être déployé sur la blockchain.
ru: Когда компилятор rust обнаруживает все макросы, он "расширяет" код и добавляет дополнительные строки к каждому макросу. Итоговый расширенный код встраивается в двоичный файл WASM, который затем может быть развернут в блокчейне.
tr: Rust derleyici makroların her biriyle karşılaştığında, kodu 'genişletir' ve makroların her biri için ek kod satırları ekler. Elde edilen genişletilmiş kod blok zincirde dağıtılan wasm olarak derlenir.
vi: Khi trình biên dịch rust gặp từng macro, nó sẽ 'mở rộng' mã và thêm các dòng mã bổ sung cho từng macro. Mã mở rộng kết quả sau đó được biên dịch thành wasm, sau đó có thể được triển khai vào chuỗi khối.

source: The ``cargo expand`` tool will run the macros and append the boilerplate code to the contract without compiling the code.
fr: L'outil ``cargo expand`` exécutera les macros et ajoutera le code 'passe-partout' au contrat sans compiler le code.
ru: Утилита ``cargo expand`` запустит макросы и присоединит шаблонный код к контракту, не компилируя сам код.
tr: ``cargo expand`` aracı makroları çalıştıracak ve kodu derlemeden ortak kodu kontrata ekleyecektir.
vi: Công cụ ``cargo expand`` sẽ chạy các macro và nối mã bảng ghi sẵn vào hợp đồng mà không cần biên dịch mã.

source: Install the tooling with the following command:
fr: Installez l'outil avec la commande suivante :
ru: Установите инструментарий с помощью следующей команды:
tr: Araçları aşağıdaki komutla yükleyin:
vi: Cài đặt công cụ bằng lệnh sau:

source: Run this command in the folder containing the smart contract code:
fr: Exécutez cette commande dans le dossier contenant le code du contrat intelligent :
ru: Запустите команду в папке, содержащей код смарт-контракта:
tr: Akıllı kontrat kodunu içeren klasörde bu komutu çalıştırın:
vi: Chạy lệnh này trong thư mục chứa mã hợp đồng thông minh:

source: Example Simple Counter Contract
fr: Exemple Simple Counter Contract
ru: Пример контракта - простой счетчик
tr: Örnek Basit Sayaç Kontratı
vi: Ví dụ hợp đồng tính toán cơ bản

source: Running ``cargo-expand`` on the simple counter contract yeilds this output:
fr: En exécutant ``cargo-expand`` sur le contrat 'Simple Counter Contract', on obtient ce résultat :
ru: Запуск ``cargo-expand`` в контракте простого счетчика выдает следующий результат:
tr: Basit sayaç kontratı üzerinde ``cargo-expand``i çalıştırmak bu çıktıyı verir:
vi: Chạy ``cargo-expand`` trên hợp đồng tính toán đơn giản sẽ tạo ra kết quả này:
