Repository: casper-network/docs-archive
Catalog: locale/*/LC_MESSAGES/archived/contract-dsl-archived/getting-started.po
Languages: fr, ru, tr, vi

source: Getting Started with the DSL
fr: Démarrer avec le DSL (domaine Specific Language)
ru: Начало работы с DSL
tr: DSL'ye Başlarken
vi: Cùng bắt đầu với DSL

source: Since the DSL uses macros, it works like templates in the smart contract, so it's necessary to tell the Rust compiler where the macros are located for each smart contract. The aim of this guide is to describe how to configure the smart contract to use the DSL.
fr: Comme le DSL utilise des macros, il fonctionne comme des modèles dans le contract intelligent. Il est donc nécessaire d'indiquer au compilateur Rust où se trouvent les macros pour chaque contract intelligent. Le but de ce guide est de décrire comment configurer le contrat intelligent pour utiliser le DSL.
ru: Так как доменный язык DSL использует макросы, он работает как темплейты в смарт-контрактах. Поэтому необходимо указывать компилятору Rust, где расположены макросы для каждого контракта. Этот гайд описывает, как сконфигурировать смарт-контракт для использования DSL.
tr: DSL makroları kullandığından, akıllı kontrattaki şablonlar gibi çalışır, bu nedenle Rust derleyicisine her akıllı kontrat için makroların nerede bulunduğunu söylemek gerekir. Bu kılavuzun amacı, DSL'yi kullanmak için akıllı kontratın nasıl yapılandırılacağını açıklamaktır.
vi: Vì DSL sử dụng macro, nó hoạt động giống như các mẫu trong hợp đồng thông minh, vì vậy cần phải cho trình biên dịch Rust biết vị trí của các macro cho mỗi hợp đồng thông minh. Mục đích của hướng dẫn này là mô tả cách cấu hình hợp đồng thông minh để sử dụng DSL.

source: About the DSL
fr: À propos du DSL
ru: О языке DSL
tr: DSL Hakkında
vi: Về DSL

source: The DSL is designed specifically for Rust Smart Contrats.
fr: Le DSL est conçue spécifiquement pour les contrats Rust intelligents (Rust Smart Contrats).
ru: DSL специально разработан под смарт-контракты на Rust.
tr: DSL, özellikle Rust Akıllı Kontratlar için tasarlanmıştır.
vi: DSL được thiết kế đặc biệt cho Hợp đồng thông minh Rust.

source: The ``constructor_macro`` creates the code that sets up the contract in the runtime and locates the contract in the runtime when execution begins (this is the deploy function that creates the entry point & stores the deploy hash stored under some function name in the runtime). Think of the function templated by the constructor macro as your ``main`` function, while the contract macro sets up the function definitions within the calls.
fr: La ``constructor_macro`` crée le code qui configure le contrat dans le runtime et localise le contrat dans le runtime lorsque l'exécution commence (c'est la fonction deploy qui crée le point d'entrée et stocke le hash deploy sous un nom de fonction dans le runtime). Considérez la fonction modélisée par la macro constructeur comme votre fonction ``principale`` (main ), tandis que la macro contrat établit les définitions de fonction dans les appels.
ru: С помощью ``constructor_macro`` создается код, который устанавливает контракт в рабочую среду и размещает в ней, когда начинается исполнение программы (это развертывающая функция, которая создает точку входа и хранит хэш от развертывания в виде специальной функции в рабочей среде). Считайте функцию, сформированную ``constructor_macro`` своей основной функцией, в то время как contract macro создает определения функций внутри вызовов.
tr: ``constructor_macro``, çalışma zamanında kontratı ayarlar ve yürütme başladığında (bu, giriş noktasını oluşturan ve çalışma zamanında bir işlev adı altında depolanan dağıtım karmasını depolayan konuşlandırma işlevidir) kontratı konumlandırır. Kontrat makrosu, çağrılar içinde işlev tanımlarını ayarlarken, yapıcı makro tarafından şablonlanan işlevi ``main`` işleviniz olarak düşünün.
vi: ``constructor_macro`` tạo mã thiết lập hợp đồng trong thời gian chạy và định vị hợp đồng trong thời gian chạy khi bắt đầu thực thi (đây là hàm triển khai tạo điểm nhập & lưu trữ băm triển khai được lưu trữ dưới một số tên hàm trong thời gian chạy). Hãy nghĩ về hàm được tạo bởi macro hàm tạo như là hàm ``main`` của bạn, trong khi macro hợp đồng thiết lập các định nghĩa hàm trong các lệnh gọi.

source: The ``contract_macro`` generates the code for the headers for each of the entry points that use it.
fr: Le ``contract_macro`` génère le code des en-têtes (headers) pour chacun des points d'entrée qui l'utilisent.
ru: ``contract_macro`` генерирует код заголовков для каждой точки входа которую вы используете.
tr: ``contract_macro`` onu kullanan her giriş noktası başlıkları için kod üretir.
vi: ``contract_macro`` tạo mã cho các tiêu đề cho mỗi điểm nhập sử dụng nó.

source: The ``casperlabs_method`` creates an entry point for any function in your contract.
fr: La fonction ``casperlabs_method`` crée un point d'entrée pour toute fonction de votre contrat.
ru: ``casperlabs_method`` создает точку входа для любой функции в вашем контракте.
tr: ``casperlabs_method`` kontratınızdaki herhangi bir işlev için bir giriş noktası oluşturur.
vi: ``casperlabs_method`` tạo một điểm vào cho bất kỳ chức năng nào trong hợp đồng của bạn.

source: Pre-Requisites - Set up the Rust SDK
fr: Pré-requis - Configurer le SDK Rust
ru: Предварительные требования - установка Rust SDK
tr: Ön Koşullar - Rust SDK'yı kurun
vi: Điều kiện tiên quyết - Thiết lập SDK Rust

source: Please use the Rust SDK to `create your smart contract project <https://docs.casperlabs.io/en/latest/dapp-dev-guide/setup-of-rust-contract-sdk.html>`_ before setting up the DSL.
fr: Veuillez utiliser le SDK Rust pour créer votre projet de contrat intelligent. <https://docs.casperlabs.io/fr/latest/dapp-dev-guide/setup-of-rust-contract-sdk.html>`_ avant de configurer le DSL.
ru: Пожалуйста, используйте Rust SDK для `create your smart contract project <https://docs.casperlabs.io/en/latest/dapp-dev-guide/setup-of-rust-contract-sdk.html>`_ перед настройкой DSL
tr: Lütfen DSL'yi ayarlamadan önce `akıllı kontrat projenizi oluşturmak <https://docs.casperlabs.io/en/latest/dapp-dev-guide/setup-of-rust-contract-sdk.html>`_ için Rust SDK'yı kullanın.
vi: Vui lòng sử dụng SDK Rust để `tạo dự án hợp đồng thông minh của bạn <https://docs.casperlabs.io/en/latest/dapp-dev-guide/setup-of-rust-contract-sdk.html>`_ trước khi thiết lập DSL.

source: Getting the Macros
fr: Obtention des macros
ru: Получение макросов
tr: Makroları Almak
vi: Lấy ra Macros

source: The source code for the macros is located at `GitHub <https://github.com/CasperLabs/casperlabs_contract_macro>`_. To import the macros, include a line in the ``Cargo.toml`` file in the ``/contract`` folder for your smart contract. The entry needs to appear in the\ ``[dependencies]`` section. This entry will import the macros into your project. There are a few sources for the macros.
tr: Makroların kaynak kodu `GitHub <https://github.com/CasperLabs/casperlabs_contract_macro>`_'da yer almaktadır. Makroları içe aktarmak için, akıllı kontratınız için ``/contract`` dizinindeki ``Cargo.toml`` dosyasına bir satır ekleyin. Girdinin \ ``[dependencies]`` bölümünde görünmesi gerekiyor. Bu girdi makroları projenize aktaracaktır. Makrolar için birkaç kaynak bulunmaktadır.

source: From Crates.io
fr: De Crates.io
ru: Crates.io
tr: Crates.io'dan
vi: Từ Crates.io

source: To use the crate available on `crates.io <https://crates.io/crates/casperlabs_contract_macro>`_ include the following entry in the ``Cargo.toml`` file for the smart contract.
fr: Pour utiliser le paquet (crate) disponible sur `crates.io <https://crates.io/crates/casperlabs_contract_macro>`_ inclure l'entrée suivante dans le fichier ``Cargo.toml`` pour le contrat intelligent.
ru: Для использования контейнеров доступных в `crates.io <https://crates.io/crates/casperlabs_contract_macro>`_ добавьте следующую запись в файл ``Cargo.toml`` для смарт-контракта.
tr: `crates.io <https://crates.io/crates/casperlabs_contract_macro>`_'da bulunan paketi kullanabilmek için, akıllı kontrat için ``Cargo.toml`` dosyasına aşağıdaki girdiyi ekleyin.
vi: Để sử dụng giỏ có sẵn trên `crates.io <https://crates.io/crates/casperlabs_contract_macro>`_, hãy đưa vào mục nhập sau trong tệp ``Cargo.toml`` cho hợp đồng thông minh.

source: From Github
tr: Github'dan

source: To obtain the macros from Github, include this entry in ``Cargo.toml``\ :
tr: Github'dan makroları almak için bu girdiyi ``Cargo.toml`` dosyasına dahil edin\ :

source: Local package
ru: Локальный пакет
tr: Yerel paket
vi: Gói cục bộ

source: This example ``Cargo.toml`` entry uses a local path for the macros:
fr: Pour obtenir les macros de Github, incluez cette entrée dans ``Cargo.toml`` \ :
ru: В этом примере ``Cargo.toml`` в записи используется локальный путь для макроса.
tr: Bu örnek ``Cargo.toml`` girdisi, makrolar için yerel bir yol kullanır:
vi: Mục nhập ``Cargo.toml`` trong ví dụ này sử dụng một đường dẫn cục bộ cho các macro:

source: Using the DSL
fr: Utilisation du DSL
ru: Использование DSL
tr: DSL kullanmak
vi: Sử dụng DSL

source: To use the DSL, simply add the following line to the ``use`` section of the contract.
fr: Pour utiliser le DSL, il suffit d'ajouter la ligne suivante à la section ``use`` du contrat.
ru: Для использования DSL, просто добавьте следующую линию в раздел ``use`` контракта.
tr: DSL kullanmak için basitçe aşağıdaki satırı kontratın ``use`` bölümüne ekleyin.
vi: Để sử dụng DSL, chỉ cần thêm dòng sau vào phần ``use`` của hợp đồng.

source: This line can go after the last ``use`` line in the blank contract created by ``cargo-casperlabs``.
fr: Cette ligne peut être placée après la dernière ligne ``use`` dans le contrat vierge créé par ``cargo-casperlabs``.
ru: Эта линия располагается под последней линией раздела ``use`` в бланке контракта, созданного с ``cargo-casperlabs``.
tr: Bu satır, ``cargo-casperlabs`` tarafından oluşturulan boş kontrattaki son ``use`` satırının altına eklenebilir.
vi: Dòng này có thể đi sau dòng ``use`` cuối cùng trong hợp đồng trống được tạo bởi ```cargo-casperlabs``.

source: Remember, if you are using the crates.io package, you may have to use the package as ``casperlabs_contract_macro``. This depends entirely on how you import the package in your ``Cargo.toml`` file
fr: N'oubliez pas que si vous utilisez le paquet crates.io, vous devrez peut-être utiliser le paquet en tant que ``casperlabs_contract_macro``. Cela dépend entièrement de la façon dont vous importez le paquet dans votre fichier ``Cargo.toml``
ru: Запомните, если вы используете пакет crates.io, вам возможно понадобится использовать пакет как ``casperlabs_contract_macro``. Это полностью зависит от того, как вы импортируете пакет данных в файл ``Cargo.toml`` .
tr: Unutmayın, eğer crates.io paketini kullanıyorsanız paketi ``casperlabs_contract_macro`` olarak kullanmak zorunda kalabilirsiniz. Bu, tamamen paketi ``Cargo.toml`` dosyanıza nasıl aktardığınıza bağlıdır.
vi: Hãy nhớ rằng, nếu bạn đang sử dụng gói crates.io, bạn có thể phải sử dụng gói dưới dạng ``casperlabs_contract_macro``. Điều này hoàn toàn phụ thuộc vào cách bạn kết nhập gói vào tệp ``Cargo.toml`` của mình

source: The following contract creates a counter in storage. Each time the contract is invoked, the counter is incremented by 1.
fr: Le contrat suivant crée un compteur dans le stockage. Chaque fois que le contrat est invoqué, le compteur est incrémenté de 1.
ru: Следующий контракт создает счетчик в хранилище. При каждом обращении к контракту счетчик инкрементируется на 1.
tr: Aşağıdaki kontrat, depoda bir sayaç oluşturur. Kontrat her çağrıldığında sayaç 1 arttırılır.
vi: Hợp đồng sau đây tạo ra một bộ đếm trong bộ nhớ. Mỗi khi hợp đồng được gọi, bộ đếm được tăng thêm 1.

source: If you set up your contract using ``cargo-casperlabs`` you can test your contract using the local runtime.
fr: Si vous configurez votre contrat à l'aide de ``cargo-casperlabs``, vous pouvez tester votre contrat en utilisant le runtime local.
ru: Если вы настроите контракт с использованием ``cargo-casperlabs``, вы сможете протестировать контракт внутри рабочей среды.
tr: Eğer kontratınızı ``cargo-casperlabs`` kullanarak kurarsanız, kontratınızı yerel çalışma zamanını kullanarak test edebilirsiniz.
vi: Nếu bạn thiết lập hợp đồng của mình bằng cách sử dụng ``cargo-casperlabs``, bạn có thể kiểm tra hợp đồng của mình bằng cách sử dụng thời gian chạy cục bộ.

source: Set up the runtime following the steps in the `testing </./dapp-dev-guide/testing.md>`_ section of this guide to set up the runtime context.
fr: Configurez le runtime en suivant les étapes de la section `testing </./dapp-dev-guide/testing.md>`_ de ce guide pour configurer le contexte du runtime.
ru: Настройте контекст рабочей среды, следуя шагам в секции `testing </./dapp-dev-guide/testing.md>`_ этого гайда.
tr: Çalışma zamanı bağlamını ayarlamak için, bu kılavuzun `test etme </./dapp-dev-guide/testing.md>`_ bölümündeki adımları izleyerek çalışma zamanını ayarlayın.
vi: Thiết lập thời điểm chạy theo các bước trong phần `testing </./dapp-dev-guide/testing.md>`_ của hướng dẫn này để thiết lập ngữ cảnh thời điểm chạy.

source: The following test will check whether or not the tutorial contract is working properly:
fr: Le test suivant vérifiera si le contrat du tutoriel fonctionne correctement ou non :
ru: Следующий тест проверит правильность работы учебного контракта:
tr: Aşağıdaki test, eğitim kontratının düzgün çalışıp çalışmadığını kontrol edecektir:
vi: Bài kiểm thử sau đây sẽ kiểm tra xem hợp đồng hướng dẫn có hoạt động bình thường hay không:

source: To import the macros, include a line in the ``Cargo.toml`` file in the ``/contract`` folder for your smart contract. The entry needs to appear in the\ ``[dependencies]`` section. This entry will import the macros into your project. There are a few sources for the macros.
fr: Pour importer les macros, insérez une ligne dans le fichier ``Cargo.toml`` dans le dossier ``/contract`` de votre contrat intelligent. La saisie doit apparaître dans la section ``[dependencies]``. Cette saisie permettra d'importer les macros dans votre projet. Il existe quelques sources pour les macros.
ru: Для импорта макросов, включите строку в файл ``Cargo.toml`` в папке ``/contract`` вашего смарт-контракта. Вход появится в секции зависимостей ``[dependencies]``. Этот вход импортирует макросы в ваш проект. Есть несколько источников макросов.
vi: Để nhập macro, hãy đưa vào một dòng trong tệp ``Cargo.toml`` trong thư mục ``/contract`` cho hợp đồng thông minh của bạn. Mục nhập cần xuất hiện trong phần\ ``[dependencies]``. Mục nhập này sẽ kết nhập macro vào dự án của bạn. Có một vài nguồn cho macro.
