Repository: casper-network/docs-archive
Catalog: locale/*/LC_MESSAGES/dapp-dev-guide/calling-contracts.po
Languages: fr, ru, tr, vi

source: Calling Contracts
fr: Invocation des Contrats
ru: Вызов файлов контрактов
tr: Kontratları Çağırmak
vi: Gọi Hợp đồng

source: The most efficient way to use blockchain is to store (install) your contract on the system and then call it. This section outlines the steps to do this.
fr: La manière la plus efficace d'utiliser la blockchain est de stocker (installer) votre contrat sur le système, puis de l'appeler. Cette section présente les étapes à suivre pour y parvenir.
ru: Наиболее эффективный способ использования блокчейн - хранение (внесение) контрактов в систему и в дальнейшем - их вызов.
tr: Blokzinciri kullanmanın en verimli yolu, kontratınızı sistemde depolamak (kurmak) ve ardından onu çağırmaktır. Bu bölüm, bunu yapmak için gereken adımları özetlemektedir.
vi: Cách hiệu quả nhất để sử dụng blockchain là lưu trữ (cài đặt) hợp đồng của bạn trên hệ thống và sau đó gọi nó. Phần này phác thảo các bước để thực hiện việc này.

source: Installing a Smart Contract
fr: Installation d'un contrat intelligent
ru: Установка смарт-контракта
tr: Bir Akıllı Kontrat Yükleme
vi: Cài đặt Hợp đồng thông minh

source: First, set up the contract name so you can call it using the name in subsequent deploys. The following code sample uses ``sample_contract`` as the contract name.
fr: Tout d'abord, configurez le nom du contrat afin de pouvoir l'appeler en utilisant ce nom dans les déploiements ultérieurs. L'exemple de code suivant utilise ``sample_contract`` comme nom de contrat.
ru: Для начала установите название для контракта, чтобы в дальнейшем вызывать его, вводя имя в последующих развертываниях. Данный сэмпл код использует в качестве имени ``sample_contract``.
tr: Öncelikle, sonraki dağıtımlarda adı kullanarak arayabilmeniz için kontrat adını ayarlayın. Aşağıdaki kod örneği, kontrat adı olarak ``sample_contract`` kullanır.
vi: Đầu tiên, hãy thiết lập tên hợp đồng để bạn có thể gọi nó bằng tên này trong các lần triển khai tiếp theo. Mẫu mã sau sử dụng ``sample_contract`` làm tên hợp đồng.

source: Next, deploy the smart contract using the ``put-deploy`` command and send in the compiled wasm as ``--session code``.
fr: Ensuite, déployez le contrat intelligent en utilisant la commande ``put-deploy`` et envoyez le wasm compilé comme ``--session code``.
ru: Затем разверните смарт-контракт, используя команду ``put-deploy`` и отправьте в компилированный wasm файл в виде ``--session code``.
tr: Sonra, ``put-deploy`` komutunu kullanarak akıllı kontratı dağıtın ve derlenmiş wasm'ı ``--session code`` olarak gönderin.
vi: Tiếp theo, triển khai hợp đồng thông minh bằng lệnh `put-deploy`` và gửi wasm đã biên dịch dưới dạng ``--session code``.

source: Querying Global State for the Address of a Contract
fr: Interrogation du Global State pour l'adresse d'un contrat
ru: Запрос адреса контракта через глобальное состояние
tr: Bir Kontratın Adresi için Küresel Durumu Sorgulama
vi: Truy vấn trạng thái toàn cục để biết địa chỉ của hợp đồng

source: The ``query-state`` command is a generic query against `global state <https://docs.casperlabs.io/en/latest/glossary/G.html#global-state>`_. Earlier, we queried global state for the account's main purse. Here, we query the state of a contract. We can do so by including the contract address rather than the account public key in the ``query-state`` command.
fr: La commande ``query-state`` est une requête générique sur le `global state <https://docs.casperlabs.io/en/latest/glossary/G.html#global-state>`_. Auparavant, nous avons interrogé le global state du livret principal (main purse). Là, nous interrogeons l'état d'un contrat. Nous pouvons le faire en incluant l'adresse du contrat plutôt que la clé publique du compte dans la commande ``query-state``.
ru: Команда ``query-state`` - это общий запрос против `global state <https://docs.casperlabs.io/en/latest/glossary/G.html#global-state>`_. Ранее мы запросили главный кошелек счета через глобальное состояние. Здесь же мы запрашиваем состояние контракта. Это мы можем сделать добавляя в команду ``query-state`` адрес контракта, а не публичный ключ счета.
tr: ``query-state`` komutu, ``küresel durum <https://docs.casperlabs.io/en/latest/glossary/G.html#global-state>"a karşı genel bir sorgudur. Daha önce, hesabın ana cüzdanı için küresel durumu sorguladık. Burada bir kontratın durumunu sorgularız. Bunu, ``query-state`` komutuna hesap genel anahtarı yerine kontrat adresini ekleyerek yapabiliriz.
vi: Lệnh ``query-state`` là một truy vấn chung đối với `global state <https://docs.casperlabs.io/en/latest/glossary/G.html#global-state>`_. Trước đó, chúng tôi đã truy vấn trạng thái toàn cục cho ví chính của tài khoản. Ở đây, chúng tôi truy vấn trạng thái của một hợp đồng. Chúng tôi có thể làm như vậy bằng cách đưa vào địa chỉ hợp đồng thay vì khóa công khai của tài khoản trong lệnh ``query-state``.

source: Here we query to get the address of an ERC20 contract from Global State.
fr: Ici nous faisons une requête pour obtenir l'adresse d'un contrat ERC20 auprès du Global State.
ru: Здесь мы делаем запрос на получение адреса контракта ERC20 из глобального состояния.
tr: Burada Küresel Durum'dan bir ERC20 kontratının adresini almak için sorguluyoruz.
vi: Ở đây, chúng tôi truy vấn để lấy địa chỉ của hợp đồng ERC20 từ Global State.

source: Step 1: Get the Latest Global State Hash
fr: Étape 1 : Obtenir le dernier Hach du Global State
ru: Шаг 1: получение последнего хеша из глобального состояния
tr: Adım 1: En Son Küresel Durum Özetini (hash) Alın
vi: Bước 1: Nhận Hàm băm (Hash) mới nhất của Trạng thái toàn cục (Global State)

source: We need to obtain the global state hash after our contract has been deployed to the network.
fr: Nous devons obtenir le hash du global state après que notre contrat ait été déployé sur le réseau.
ru: Нам требуется получить хеш глобального состояния после того, как наш контракт был развернут в сети.
tr: Kontratımız ağa dağıtıldıktan sonra küresel durum özetini (hash) almamız gerekiyor.
vi: Chúng ta cần lấy hàm băm trạng thái toàn cục sau khi hợp đồng của chúng ta đã được triển khai vào mạng.

source: Step 2: Query State
fr: Étape 2 : Interroger l'État (State)
ru: Шаг 2: состояние запроса
tr: 2. Adım: Sorgu Durumu
vi: Bước 2: Truy vấn trạng thái

source: Take the global state hash from Step 1 and include it here, along with the account public key that created the contract.
fr: Prenez le hach du globale state de l'étape 1 et incluez-le ici, avec la clé publique du compte qui a créé le contrat.
ru: Берем полученный из глобального состояния хеш из Шага 1 и вставляем сюда совместно с публичным ключом счета, который открыл контракт.
tr: Adım 1'deki genel durum özetini (hash) alın ve kontratı oluşturan hesap ortak anahtarıyla birlikte buraya ekleyin.
vi: Lấy hàm băm của trạng thái toàn cục từ Bước 1 và đưa nó vào đây, cùng với khóa công khai của tài khoản đã tạo hợp đồng.

source: Example Result
fr: Exemple de résultat
ru: Пример результата
tr: Örnek Sonuç
vi: Kết quả của ví dụ

source: If there is a contract stored in an account, it will appear under ``named-keys``.
fr: Si un contrat est stocké dans un compte, il apparaîtra dans la section ``named-keys``.
ru: Если на счету имеется сохраненный контракт, он появится под ``named-keys``.
tr: Bir hesapta kayıtlı bir kontrat varsa, `named-keys`` altında görünecektir.
vi: Nếu có một hợp đồng được lưu trữ trong một tài khoản, nó sẽ xuất hiện trong phần ``named-keys``.

source: Step 3: Query the contract State
fr: Étape 3 : Interroger l'État du contrat
ru: Шаг 3: запрос состояния контракта
tr: 3. Adım: Sözleşme Durumunu Sorgulayın
vi: Bước 3: Truy vấn trạng thái hợp đồng

source: Now that we have the hash of the contract, we can query the contract's internal state. To do this, we pass in the contract's hash and the global state hash. If we look at the ERC20 contract, we see a token name specified as ``_name``. We can query for the value stored here.
fr: Maintenant que nous avons le hash du contrat, nous pouvons interroger l'état interne du contrat. Pour ce faire, nous fournissons le hash du contrat et le hash du global state. Si nous regardons le contrat ERC20, nous voyons un nom de jeton spécifié comme ``_name``. Nous pouvons demander la valeur stockée ici.
ru: Когда у нас уже собран хеш контракта, мы можем запросить внутреннее состояние контракта. Чтобы это сделать, мы передаем хеш контракта и хеш глобального состояния. И если мы посмотрим на контракт ERC20, то увидим имя токена, определенное как ``_name``. Теперь можем запросить вложенную ценность.
tr: Artık kontratın özetine (hash) sahip olduğumuza göre, kontratın iç durumunu sorgulayabiliriz. Bunu yapmak için, kontratın özetini (hash) ve küresel durum özetini (hash) geçiyoruz. ERC20 kontratına bakarsak ``_name`` olarak belirtilmiş bir token ismi görürüz. Burada saklanan değeri sorgulayabiliriz.
vi: Bây giờ chúng ta đã có hàm băm của hợp đồng, chúng ta có thể truy vấn trạng thái bên trong của hợp đồng. Để làm điều này, chúng ta chuyển hàm băm của hợp đồng và hàm băm trạng thái toàn cục. Nếu chúng ta nhìn vào hợp đồng ERC20, chúng ta thấy tên mã thông báo được chỉ định là ``_name``. Chúng ta có thể truy vấn giá trị được lưu trữ ở đây.

source: And we should see something like this:
fr: Et on devrait voir quelque chose comme ceci :
ru: И мы увидим что-то подобное:
tr: Ve şöyle bir şey görmeliyiz:
vi: Và chúng ta sẽ thấy một cái gì đó như thế này:

source: **Note**: This result is returned as bytes. These bytes need to be deserialized into the correct CLType in a smart contract or a dApp. Refer to `casper-types <https://docs.rs/casperlabs-types/latest/casperlabs_types/bytesrepr/index.html>`_ to find the latest APIs for deserialization.
fr: **Note** : Ce résultat est retourné sous forme d'octets. Ces octets doivent être désérialisés dans le bon CLType dans un contrat intelligent ou une dApp. Reportez-vous à `casper-types <https://docs.rs/casperlabs-types/latest/casperlabs_types/bytesrepr/index.html>`_ pour trouver les dernières API de désérialisation.
ru: **Внимание**: здесь результат возвращается в битах. Эти биты должны быть десериализованы в правильный формат CLType в смарт-контракте или в децентрализованном приложении типа dApp. Обратитесь к `casper-types <https://docs.rs/casperlabs-types/latest/casperlabs_types/bytesrepr/index.html>`_ , чтобы найти последние интерфейсы API для десериализации.
tr: **Not**: Bu sonuç bayt olarak döndürülür. Bu baytların bir akıllı kontratta veya bir dApp'de doğru CLType'a seri hale getirilmesi gerekir. Seri durumdan çıkarma amacıyla en son API'leri bulmak için `casper-types <https://docs.rs/casperlabs-types/latest/casperlabs_types/bytesrepr/index.html>`_ bölümüne bakın.

source: Calling a Contract by Name & Entry Point
fr: Appeler un contrat par nom et point d'entrée
ru: Вызов контракта по имени и точке входа
tr: Adına ve Giriş Noktasına Göre Bir Kontratın Çağrılması
vi: Gọi một hợp đồng theo Tên gọi và Điểm vào

source: To call a contract by its name, run the ``put-deploy`` command using the ``session-name`` option:
fr: Pour appeler un contrat par son nom, exécutez la commande ``put-deploy`` en utilisant l'option ``session-name`` :
ru: Чтобы вызвать контракт по его названию, запустите команду ``put-deploy``, используя опцию ``session-name``:
tr: Bir kontratı adıyla çağırmak için, ``session-name`` seçeneğini kullanarak ``put-deploy`` komutunu çalıştırın:
vi: Để gọi một hợp đồng bằng tên của nó, hãy chạy lệnh ``put-deploy`` bằng cách sử dụng tùy chọn ``session-name``:

source: It is possible to create entry points in the contract, which you can invoke while the contract lives on the blockchain. The following code shows you an example entry point:
fr: Il est possible de créer des points d'entrée dans le contrat, que vous pouvez invoquer pendant que le contrat vit sur la blockchain. Le code suivant vous montre un exemple de point d'entrée :
ru: Есть возможность создать точки входа для контракта, к которым можно обращаться, пока контракт находится в блокчейн. Следующий код показывает пример точки входа:
tr: Kontrat blokzincirde yaşarken çağırabileceğiniz kontratta giriş noktaları oluşturmak mümkündür. Aşağıdaki kod size örnek bir giriş noktası gösterir:
vi: Có thể tạo các điểm vào trong hợp đồng, mà bạn có thể gọi trong khi hợp đồng tồn tại trên blockchain. Đoạn mã sau hiển thị cho bạn một điểm vào mẫu:

source: Calling a Contract by Hash and Entry Point
fr: Appel d'un contrat par Hash et point d'entrée
ru: Вызов контракта через хеш и точку входа:
tr: Özet (hash) ve Giriş Noktası ile Sözleşme Çağırma
vi: Gọi một hợp đồng theo Hàm băm và Điểm vào

source: After deploying a contract and querying the global state, you can use a contract's hash to call it in a new deploy. An entry point is required when calling a contract by its hash.
fr: Après avoir déployé un contrat et interrogé le global state, vous pouvez utiliser le hash d'un contrat pour l'appeler dans un nouveau déploiement. Un point d'entrée est nécessaire pour appeler un contrat par son hash.
ru: После развертывания контракта и запроса глобального состояния вы можете использовать хеш контракта, чтобы вызвать его уже в новом развертывании. Для вызова контракта через хеш требуется точка входа.
tr: Bir kontratı dağıttıktan ve genel durumu sorguladıktan sonra, yeni bir dağıtımda çağırmak için bir kontratın özetini (hash) kullanabilirsiniz. Bir kontratı özetine (hash) göre çağırırken bir giriş noktası gereklidir.
vi: Sau khi triển khai hợp đồng và truy vấn trạng thái toàn cục, bạn có thể sử dụng hàm băm của hợp đồng để gọi nó trong những lần sau. Một điểm nhập là bắt buộc khi gọi một hợp đồng bằng hàm băm của nó.

source: **Note**: This result is returned as bytes. These bytes need to be deserialized into the correct CLType in a smart contract or a dApp. Refer to `casper-types <https://docs.rs/casper-types/latest/casper_types/bytesrepr/index.html>`_ to find the latest APIs for deserialization.
vi: **Lưu ý**: Kết quả này được trả về dưới dạng byte. Các byte này cần được giải mã thành đúng CLType trong hợp đồng thông minh hoặc dApp. Tham khảo `casper-types <https://docs.rs/casper-types/latest/casper_types/bytesrepr/index.html>`_ để tìm các API mới nhất cho quá trình giải mã.
