Repository: casper-network/docs-archive
Catalog: locale/*/LC_MESSAGES/dapp-dev-guide/deploying-contracts.po
Languages: fr, ru, tr

source: Refer to the `runtime economics <https://docs.casperlabs.io/en/latest/economics/runtime.html?highlight=consensus-before-execution%20model#gas-allocation>`_ section for more details about gas usage, fees, and refunding mechanisms.
fr: Reportez-vous à la section `Economie du runtime <https://docs.casperlabs.io/fr/latest/economics/runtime.html?highlight=consensus-before-execution%20model#gas-allocation>`_ pour plus de détails sur l'utilisation du gaz, les frais et les mécanismes de remboursement.
ru: Обратитесь к разделу об экономике рабочей среды `runtime economics <https://docs.casperlabs.io/en/latest/economics/runtime.html?highlight=consensus-before-execution%20model#gas-allocation>`_ для получения большей ифнормации об использовании газа, сборах и механизмах вознаграждения.

source: Advanced Deployments
fr: Déploiements avancés
ru: Продвинутые развертывания
tr: Gelişmiş Dağıtımlar

source: The Casper Network supports complex deployments.
fr: Le réseau Casper prend en charge les déploiements complexes.
ru: Сеть Casper поддерживает сложные развертывания.

source: Using Arguments with Deployments
fr: Utilisation d'arguments avec les déploiements
ru: Работа со спорами о развертываниях
tr: Dağıtımlarla Bağımsız Değişkenleri Kullanma

source: Casper contracts support arguments for deployments, which enables powerful capabilities for smart contract development. The casper client provides some examples on how to do this:
fr: Les contrats Casper prennent en charge les arguments pour les déploiements, ce qui permet des capacités puissantes pour le développement des contrats intelligents. Le client Casper fournit quelques exemples sur la manière de procéder :
ru: Контракты в Casper поддерживают споры для развертываний, что предоставляет мощные возможности для разработки смарт-контрактов. Клиент Casper показывает несколько примеров, как это делается:
tr: Casper kontratları, akıllı kontrat geliştirme amacıyla güçlü yetenekler sağlayan dağıtımlar için argümanları destekler. Casper istemcisi bunun nasıl yapılacağına dair bazı örnekler sunar:

source: Creating, signing, and deploying contracts with multiple signatures
fr: Créer, signer et déployer des contrats à signatures multiples
ru: Создание, подпись и развертывание контрактов с мультиподписями:
tr: Birden çok imzayla kontratlar oluşturma, imzalama ve dağıtma

source: The ``deploy`` command on its own provides multiple actions strung together optimizing for the common case, with the capability to separate concerns between your key management and deploy creation. See details about generating account key pairs in the Developer Guide.
fr: La commande ``deployer`` à elle seule fournit de multiples actions enchaînées optimisant le cas commun, avec la possibilité de séparer les activités de gestion des clés et de création du déploiement. Voir les détails sur la génération de paires de clés de compte dans le Guide du développeur.
ru: Команда ``deploy`` сама по себе предоставляет множество действий, собранных вместе и оптимизирующих общие случаи, а также дающих возможность разделить задачи между ключевым менеджментом и созданием развертываний. Смотрите детали о генерировании пар ключей для счета в Гайде Разработчика.
tr: ``deploy`` komutu tek başına, ortak durum için optimize edilen birden çok eylemi bir araya getirerek anahtar yönetiminiz ve dağıtım oluşturma arasındaki endişeleri ayırma yeteneği sağlar. Geliştirici Kılavuzu'nda hesap anahtarı çiftleri oluşturmaya ilişkin ayrıntılara bakın.

source: Every account can associate multiple keys with it and give each a weight. Collective weight of signing keys decides whether an action of certain type can be made. To learn more about how weights and threshholds work, please review the `Blockchain Design <https://docs.casperlabs.io/en/latest/implementation/accounts.html>`_. In order to collect weight of different associated keys, a deploy has to be signed by corresponding private keys. The ``put-deploy`` command creates a deploy, signs it and deploys to the node but doesn\'t allow for signing with multiple keys. Therefore, we split ``deploy`` into separate commands:
fr: Chaque compte peut être associé à plusieurs clés et donner à chacune un poids. Le poids collectif des clés de signature décide si une action d'un certain type peut être effectuée. Pour en savoir plus sur le fonctionnement des poids et des seuils, veuillez consulter la `Conception Blockchain <https://docs.casperlabs.io/fr/latest/implementation/accounts.html>`_. Afin de collecter le poids des différentes clés associées, un deploy doit être signé par les clés privées correspondantes. La commande ``put-deploy`` crée un deploy, le signe et le déploie sur le nœud mais ne permet pas de signer avec plusieurs clés. Par conséquent, ``deploy`` a été divisée en commandes séparées :
ru: Каждый аккаунт может быть связан с несколькими ключами и давать каждому из них вес. Коллективный вес подписей ключей определяет возможность совершения действий определенного типа. Чтобы узнать больше о том, как работает вес и пороговые значения, обратитесь пожалуйста к `Blockchain Design <https://docs.casperlabs.io/en/latest/implementation/accounts.html>`_. Чтобы собрать вес от разных связанных ключей, развертывание должно быть подписано соответствующими приватными ключами. Команда ``put-deploy`` создает развертывание, подписывает его и разворачивает в ноду, но не дает разрешения на подпись множественными ключами. Поэтому мы разделяем развертывание ``deploy`` на несколько команд:

source: ``make-deploy`` - creates a deploy from input parameters
fr: ``make-deploy`` - crée un déploiement à partir de paramètres d'entrée
ru: ``make-deploy`` - создает развертывание из введенных параметров
tr: ``make-deploy`` - giriş parametrelerinden bir dağıtım oluşturur

source: ``sign-deploy`` - signs a deploy with given private key
fr: ``sign-deploy`` - signe un déploiement avec la clé privée passé en paramètre.
ru: ``sign-deploy`` - подписывает развертывание заданным приватным ключом
tr: ``sign-deploy`` - verilen özel anahtarla bir dağıtımı imzalar

source: ``send-deploy`` - sends a deploy to a Casper node
fr: ``send-deploy`` - envoie un déploiement à un noeud Casper
ru: ``send-deploy`` - отправляет развертывание в ноду Casper

source: To make a deploy signed with multiple keys: first create the deploy with ``make-deploy``. This generates a deploy file that can be sent to the other signers, who then sign it with their keys by calling ``sign-deploy`` for each key. Signatures need to be gathered on the deploy one after another, untill all requisite parties have signed the deploy. Finally the signed deploy is sent to the node with ``send-deploy`` for processing by the network.
fr: Pour faire un déploiement signé avec plusieurs clés : créez d'abord le déploiement avec ``make-deploy``. Cela génère un fichier de déploiement qui peut être envoyé aux autres signataires, qui le signent ensuite avec leurs clés en appelant ``sign-deploy`` pour chaque clé. Les signatures doivent être rassemblées sur le fichier deploy l'une après l'autre, jusqu'à ce que toutes les parties requises aient signé le déploiement. Enfin, le déploiement signé est envoyé au noeud avec ``send-deploy`` pour être traité par le réseau.
ru: Чтобы создать развертывание с возможностью мультиподписи: сначала создайте развертывание с ``make-deploy``. Это сгенерирует файл развертывания, который затем может быть отправлен другим подписантам, которые подпишут его своими ключами, задавая ``sign-deploy`` для каждого ключа. Подписи должны быть собраны в развертывании одна за другой, пока все необходимые стороны не подпишут его. В конце концов подписанное развертывание отправляется в ноду с командой ``send-deploy`` для дальнейшего процессинга в сети.
tr: Birden çok anahtarla imzalanmış bir dağıtım yapmak için: önce dağıtımı ``make-deploy`` ile oluşturun. Bu, diğer imzalayıcılara gönderilebilecek bir dağıtım dosyası oluşturur ve bu dosya daha sonra her bir anahtar için ``sign-deploy``u çağırarak anahtarlarıyla imzalar. Tüm gerekli taraflar dağıtımı imzalayana kadar dağıtımda imzaların birbiri ardına toplanması gerekir. Son olarak imzalı dağıtım, ağ tarafından işlenmek üzere ``send-deploy`` ile düğüme gönderilir.

source: This section will help you get set up with each pre-requisite.
tr: Bu bölüm, her bir ön koşulu ayarlamanıza yardımcı olacaktır.

source: Client
tr: İstemci

source: The client software communicates with the network to transmit your deployments to the network. Clients can be created for any application platform, such as JavaScript or Python. The official client for Casper is a Rust client.
tr: İstemci yazılımı, dağıtımlarınızı ağa iletmek için ağ ile iletişim kurar. İstemciler, JavaScript veya Python gibi herhangi bir uygulama platformu için oluşturulabilir. Casper'ın resmi istemcisi bir Rust istemcisidir.

source: **Ensure that your client matches the version of the network you intend to deploy to.**
tr: **İstemcinizin, dağıtmayı düşündüğünüz ağ sürümüyle eşleştiğinden emin olun.**

source: Using Binaries
tr: İkili Kodları Kullanma

source: Building from Source
tr: Kaynaktan Derlemek

source: `Instructions <https://github.com/CasperLabs/casper-node/tree/master/client>`_
tr: `Talimatlar <https://github.com/CasperLabs/casper-node/tree/master/client>`_

source: There is an official Rust client, that works with the Delta Testnet.
tr: Delta Testnet ile çalışan resmi bir Rust istemcisi var.

source: Sending a Deployment to the Delta Testnet
tr: Delta Testnet'e Dağıtım Gönderme

source: The easiest way to deploy a contract is to use an existing public network. CasperLabs provides a Testnet for this. The Testnet is operated by external validators that can accept transactions.
tr: Bir kontratı dağıtmanın en kolay yolu, mevcut bir genel ağı kullanmaktır. CasperLabs bunun için bir Testnet sağlar. Testnet, işlemleri kabul edebilen harici doğrulayıcılar tarafından çalıştırılır.

source: It is also possible to check the contract's state by performing a ``query-state`` command using the client.
tr: İstemciyi kullanarak bir ``query-state`` komutu ile kontratın durumunu kontrol etmek de mümkündür.

source: A common question that frequently arises is: "How do I know what the payment amount (gas cost) should be?" The honest answer is that we are hard at work to create tools to help you estimate your costs. Currently, we recommend using the `NCTL <https://docs.casperlabs.io/en/latest/dapp-dev-guide/setup-nctl.html>`_ tool on your local machine or the testnet to deploy your contracts in a test environment. As you just saw, you can check a deploy status and roughly see how much it would actually cost when deployed.
tr: Sıklıkla ortaya çıkan yaygın bir soru şudur: "Ödeme tutarının (yakıt maliyeti) ne olması gerektiğini nasıl bilebilirim?" Dürüst cevap, maliyetlerinizi tahmin etmenize yardımcı olacak araçlar oluşturmak için çok çalışıyoruz. Şu anda, bir test ortamında kontratlarınızı dağıtmak için yerel makinenizde veya test ağında `NCTL <https://docs.casperlabs.io/en/latest/dapp-dev-guide/setup-nctl.html>`_ aracını kullanmanızı öneririz. Az önce gördüğünüz gibi, bir dağıtım durumunu kontrol edebilir ve dağıtıldığında gerçekte ne kadara mal olacağını kabaca görebilirsiniz.

source: CasperLabs supports complex deployments.
tr: CasperLabs, karmaşık dağıtımları destekler.

source: Every account can associate multiple keys with it and give each a weight. Collective weight of signing keys decides whether an action of certain type can be made. To learn more about how weights and threshholds work, please review the `Blockchain Design <https://docs.casperlabs.io/en/latest/implementation/accounts.html>`_. In order to collect weight of different associated keys, a deploy has to be signed by corresponding private keys. The ``put-deploy`` command creates a deploy, signs it and deploys to the node but doesn't allow for signing with multiple keys. Therefore, we split ``deploy`` into separate commands:
tr: Her hesap, onunla birden fazla anahtarı ilişkilendirebilir ve her birine bir ağırlık verebilir. İmzalama anahtarlarının toplu ağırlığı, belirli türde bir eylemin yapılıp yapılamayacağına karar verir. Ağırlıkların ve eşiklerin nasıl çalıştığı hakkında daha fazla bilgi edinmek için lütfen `Blokzincir Tasarımı <https://docs.casperlabs.io/en/latest/implementation/accounts.html>` sayfasını inceleyin. Farklı ilişkili anahtarların ağırlığını toplamak için, bir dağıtımın karşılık gelen özel anahtarlarla imzalanması gerekir. ``put-deploy`` komutu bir dağıtım oluşturur, imzalar ve düğüme dağıtır ancak birden çok anahtarla imzalamaya izin vermez. Bu nedenle, ``deploy``u ayrı komutlara böldük:

source: ``send-deploy`` - sends a deploy to CasperLabs node
tr: ``send-deploy`` - CasperLabs düğümüne bir dağıtım gönderir
