Repository: casper-network/docs-archive
Catalog: locale/*/LC_MESSAGES/dapp-dev-guide/deploying-contracts.po
Languages: fr, ru, tr

source: Deploying Contracts
fr: Déploiement des contrats
ru: Развертывание контрактов
tr: Kontratları Dağıtma

source: Ultimately, smart contracts are meant to run on the blockchain. Once your smart contract is complete, it's time to deploy the contract to the blockchain. There are a few pre-requisites to doing this:
fr: En fin de compte, les contrats intelligents sont destinés à être exécutés sur la blockchain. Une fois que votre contrat intelligent est terminé, il est temps de le déployer sur la blockchain. Il y a quelques pré-requis pour ce faire :
ru: Прежде всего, смарт-контракты должны работать на блокчейн. Как только вы завершили работу со своим смарт-контрактом, нужно его развертывать в блокчейн. Чтобы это сделать, нужно выполнить некоторые предварительные условия:
tr: Sonuç olarak, akıllı kontratların blokzincir üzerinde çalışması amaçlanmıştır. Akıllı kontratınız tamamlandığında, kontratı blokzincire yerleştirme zamanıdır. Bunu yapmak için birkaç ön koşul vardır:

source: A Client that communicates with the network
fr: Un Client qui communique avec le réseau
ru: Клиент, взаимодействующий с сетью
tr: Ağ ile iletişim kuran bir İstemci

source: The private key for the account that pays for the deployment
fr: La clé privée du compte qui paie pour le déploiement.
ru: Приватный ключ для счета, который платит за развертывание
tr: Dağıtım için ödeme yapan hesabın özel anahtarı

source: Token to pay for the deployment on the network in the account associated with the private key. Each token transfer costs exactly 0.0001 CSPR (10000 motes). Also, the amount transferred needs to be a minimum of 2.5 CSPR.
fr: Jetons permettant de payer le déploiement sur le réseau dans le compte associé à la clé privée. Chaque transfert de jetons coûte exactement 0,0001 CSPR (10000 motes). Aussi, le montant transféré doit-il être au minimum de 2,5 CSPR.
ru: Токен, оплачивающий развертывание в сети счета, связан с приватным ключом. Каждый перевод токена стоит 0.0001 CSPR (10000 motes). Также объем перевода должен составлять минимум 2.5 CSPR.
tr: Özel anahtarla ilişkili hesapta ağdaki dağıtım için ödeme yapmak için token. Her token transferinin maliyeti tam olarak 0.0001 CSPR (10000 motes)'dir. Ayrıca, transfer edilen tutarın minimum 2,5 CSPR olması gerekir.

source: This section will help you get set up with each prerequisite.
fr: Cette section vous aidera à mettre en place chaque prérequis.
ru: Эта секция поможет настроить каждый пререквизит.

source: The Casper Client
fr: Le Client Casper
ru: Клиент Casper

source: You can find the default Casper client on `crates.io <https://crates.io/crates/casper-client>`_. This client communicates with the network to transmit your deployments.
fr: Vous pouvez trouver le client Casper standard sur `crates.io <https://crates.io/crates/casper-client>`_. Ce client communique avec le réseau pour transmettre vos déploiements.
ru: Вы можете найти дефолтный клиент Casper тут `crates.io <https://crates.io/crates/casper-client>`_. Этот клиент взаимодействует с сетью для передачи ваших развертываний.

source: Run the commands below to install the client on most flavors of Linux and macOS. You will need the nightly version of the compiler.
fr: Exécutez les commandes ci-dessous pour installer le client Casper sur la plupart des versions de Linux et macOS. Vous aurez besoin de la version 'nightly' (nocturne) du compilateur
ru: Запустите команды ниже для установки клиента на большинстве Linux и macOS. Вам потребуется nightly версия компилятора.

source: Doing this, you'll see a warning, which you can ignore for now.
fr: En faisant cela, vous verrez un avertissement, que vous pouvez ignorer pour le moment.
ru: Вы увидите предупреждение которое вы можете сейчас проигнорировать.

source: The Casper client can print out `help` information, which provides an up-to-date list of supported commands.
fr: Le client Casper peut fournir des informations d'aide (`help`), qui fournissent une liste à jour des commandes prises en charge.
ru: Клиент Casper может распечатать вспомогательную информацию `help`, которая дает список самых последних поддерживаемых команд.

source: Building the Client from Source
fr: Construire le Client à partir des Sources
ru: Сборка клиента из источника

source: `Instructions <https://github.com/casper-network/casper-node/tree/master/client>`_
fr: `Instructions <https://github.com/CasperLabs/casper-node/tree/master/client>`_
ru: Инструкции `Instructions <https://github.com/casper-network/casper-node/tree/master/client>`_

source: Check the Client Version
fr: Vérifier la Version du Client
ru: Проверка версии программы-клиента
tr: İstemci Sürümünü Kontrol Edin

source: There is an official Rust client, that works with the Casper `Testnet <https://testnet.cspr.live/>`_ and `Mainnet <https://cspr.live/>`_.
fr: Il existe un client Rust officiel, qui fonctionne avec le `Testnet <https://testnet.cspr.live/>`_ et le `Mainnet <https://cspr.live/>`_ de Casper.
ru: Есть также официальный клиент Rust, который работает с тестнет Casper `Testnet <https://testnet.cspr.live/>`_ и с майннет `Mainnet <https://cspr.live/>`_.

source: To check the client version run:
fr: Pour vérifier la version du client, exécuter :
ru: Чтобы проверить версию клиента, запустите:
tr: İstemci sürümünü kontrol etmek için şunu çalıştırın:

source: If you want to send your deployments to an external network, use the latest released version of the client. If you are building the client locally, check the gitHash and ensure it matches the githash of the network.
fr: Si vous souhaitez envoyer vos déploiements vers un réseau externe, utilisez la dernière version du client. Si vous construisez le client localement, vérifiez le gitHash et assurez-vous qu'il correspond au gitHash du réseau.
ru: Если вы хотите отправить ваши развертывания во внешнюю сеть, используйте новейшую на данный момент версию программы-клиента. Если вы разрабатываете клиент в местной сети, проверьте gitHash и убедитесь, что он совместим с githash сети.
tr: Dağıtımlarınızı harici bir ağa göndermek istiyorsanız, istemcinin en son yayınlanan sürümünü kullanın. İstemciyi yerel olarak oluşturuyorsanız, gitHash'i kontrol edin ve ağın githash'iyle eşleştiğinden emin olun.

source: Token to Pay for Deployments
fr: Jetons pour payer les Déploiements
ru: Токен для оплаты развертываний
tr: Dağıtımlar için Ödenecek Token

source: Blockchains are supported by infrastructure providers called "Validators". To use the Validator infrastructure, it's necessary to acquire token to pay for deployments (transactions). In a testnet, this is possible by using a faucet. Alternatively, accounts can be funded in Genesis, or token can be transferred from a Genesis account to a new account. In a production system, token is typically acquired by visiting an exchange.
fr: Les blockchains sont soutenues par des fournisseurs d'infrastructure appelés "Validateurs". Pour utiliser l'infrastructure Validateur, il est nécessaire d'acquérir des jetons pour payer les déploiements (transactions). Dans un réseau testnet, les jetons peuvent être réclamés à un distributeur 'faucet'. Sinon, les comptes peuvent être alimentés dans 'Genesis', ou les jetons peuvent être transférés d'un compte Genesis vers un nouveau compte. Dans un système de production, les jeton doivent être acquis sur les marchés d'échange (Exchange).
ru: Блокчейны поддерживаются провайдерами инфраструктуры - так называемыми "Валидаторами". Чтобы использовать инфраструктуру валидатора, необходимо получить токен для оплаты развертываний (транзакций). В тестовой сети это можно сделать с помощью крана криптовалют Faucet. В качестве альтернативы, счета могут быть сформированы на Genesis, либо токены могут быть переведены со счета Genesis на новый счет. В системе производства токен обычно получается за посещение обменника.
tr: Blokzincirler, "Doğrulayıcılar" adı verilen altyapı sağlayıcıları tarafından desteklenir. Doğrulayıcı altyapısını kullanmak amacıyla dağıtımlar (işlemler) için ödeme yapmak üzere token edinilmesi gerekir. Bir test ağında bu, bir musluk kullanılarak mümkündür. Alternatif olarak, hesaplar Genesis'te finanse edilebilir veya token bir Genesis hesabından yeni bir hesaba aktarılabilir. Bir üretim sisteminde, token tipik olarak bir borsayı ziyaret ederek elde edilir.

source: Target Network
fr: Réseau cible
ru: Целевая сеть
tr: Hedef Ağ

source: When sending a deploy, the client needs to know which host will receive the deployment. The ``node-address`` and ``chain-name`` parameters provide this info.
fr: Lorsqu'il envoie un déploiement, le client doit savoir quel hôte recevra le déploiement. Les paramètres ``node-address`` et ``chain-name`` fournissent cette information.
ru: При отправке развертывания клиент должен знать, какой сервер его получит. Данная информация предоставлена в параметрах адреса нода ``node-address`` и названия цепочки ``chain-name`` .
tr: Bir dağıtım gönderirken, istemcinin dağıtımı hangi ana bilgisayarın alacağını bilmesi gerekir. ``node-address`` ve ``chain-name`` parametreleri bu bilgiyi sağlar.

source: Creating Keys
fr: Création des clés
ru: Создание ключей
tr: Anahtar Oluşturma

source: Blockchains use asymmetric key encryption to secure transactions. The secret key used to sign the deployment will be the secret key of the account that is being used to pay for the transaction. The transaction will execute in this account's context unless key delegation and the ``from`` parameter is being used. To create keys using the rust client, execute the following commandd:
fr: Les blockchains utilisent un chiffrement à clé asymétrique pour sécuriser les transactions. La clé secrète utilisée pour signer le déploiement sera la clé secrète du compte qui est utilisé pour payer la transaction. La transaction sera exécutée dans le contexte de ce compte, à moins que la délégation de clés et le paramètre ``from`` ne soient utilisés. Pour créer des clés à l'aide du client rust, exécuter la commande suivante :
ru: Блокчейны используют ассиметричное шифрование ключей для защиты транзакций. Секретный ключ, который используется как подпись к развертыванию, становится секретным ключом счета, который используется для оплаты транзакции. Транзакция будет исполнена в контексте данного счета, кроме случаев делегирования ключа и использования параметра ``from`` . Чтобы создать ключи на клиенте Rust, выполните следующую команду:
tr: Blokzincirler, işlemleri güvence altına almak için asimetrik anahtar şifrelemesi kullanır. Dağıtımı imzalamak için kullanılan gizli anahtar, işlem için ödeme yapmak için kullanılan hesabın gizli anahtarı olacaktır. Anahtar delegasyonu ve ``from`` parametresi kullanılmadığı sürece işlem bu hesabın bağlamında yürütülür. Rust istemcisini kullanarak anahtarlar oluşturmak için aşağıdaki komutu çalıştırın:

source: This process will create 3 files:
fr: Ce processus va créer 3 fichiers :
ru: Этот процесс создаст 3 файла:
tr: Bu işlem 3 dosya oluşturacaktır:

source: When passing in the public key as hex, it's recommended to ``$(cat public_key_hex)`` in the transaction, or extract the contents of the file.\ :raw-html-m2r:`<br>` Use the secret-key.pem file to sign transaction.
fr: Lorsque vous passez l'argument 'clé publique' sous forme hexadécimale, il est recommandé de faire ``$(cat public_key_hex)`` dans la transaction, ou extraire le contenu du fichier.\ :raw-html-m2r:`<br>` Utilisez le fichier secret-key.pem pour signer la transaction.
ru: При передаче публичного ключа в шестнадцатеричном коде hex, рекомендуется сделать ``$(cat public_key_hex)`` в транзакции либо извлечь содержимое файла \ :raw-html-m2r:`<br>` . Используйте файл secret-key.pem для подписи транзакции.
tr: Açık anahtarı onaltılı olarak iletirken, işlemde ``$(cat public_key_hex)`` kullanılması veya dosyanın içeriğini çıkarmanız önerilir.\ :raw-html-m2r:`<br>` İşlemi imzalamak için secret-key.pem dosyasını kullanın.

source: Sending a Deployment to the Testnet
fr: Envoi d'un déploiement au réseau Testnet
ru: Отправка развертывания в тестнет

source: The easiest way to deploy a contract is to use an existing public network. The Testnet is operated by external validators that can accept transactions.
fr: La façon la plus simple de déployer un contrat est d'utiliser un réseau public existant. Ce réseau est géré par des validateurs externes qui peuvent accepter des transactions.
ru: Самый простой способ развернуть контракт - использовать существующую публичную сеть. Тестовая сеть Testnet оперируется внешними валидаторами, которые могут принимать транзакции.

source: Obtain Token
fr: Obtenir un jeton
ru: Получение токена
tr: Token Edinmek

source: To send a deploy to the network, create keys and obtain token. Token can be obtained via a faucet or by a participant that has token. Connect to our `Discord <https://discordapp.com/invite/Q38s3Vh>`_ to get token via an existing participant.
fr: Pour envoyer un déploiement sur le réseau, il faut créer les clés et obtenir des jetons. Les jetons peuvent être obtenu via un distributeur 'faucet' ou d'un participant qui possède des jetons. Connectez-vous à notre `Discord <https://discordapp.com/invite/Q38s3Vh>`_ pour réclamer des jetons à un un participant existant.
ru: Чтобы отправить развертывание в сеть, создайте ключи и получите токен. Получить токен можно через кран или у участника, у которого он уже есть. Чтобы получить токен через участника, подсоединитесь к нашей `Discord <https://discordapp.com/invite/Q38s3Vh>`_ .
tr: Ağa bir dağıtım göndermek için anahtarlar oluşturun ve token alın. Token, bir musluk aracılığıyla veya tokeni olan bir katılımcı tarafından elde edilebilir. Mevcut bir katılımcı aracılığıyla token almak için `Discord <https://discordapp.com/invite/Q38s3Vh>`_ sayfamıza bağlanın.

source: A Basic Deployment using the Command Line (Rust Client)
fr: Déploiement de base en utilisant la ligne de commande (Client Rust)
ru: Основное развертывание с использованием командной строки (в клиенте Rust)
tr: Komut Satırını Kullanan Temel Bir Dağıtım (Rust İstemcisi)

source: As described above, a basic deployment must provide some essential information. Here is an example deployment using the Rust client that will work with the basic contract we created using the `Contracts SDK for Rust <writing-rust-contracts>`_. The default port is 7777:
fr: Comme décrit ci-dessus, un déploiement de base doit fournir certaines informations essentielles. Voici un exemple de déploiement utilisant le client Rust qui fonctionnera avec le contrat de base que nous avons créé à l'aide de `Contracts SDK for Rust <writing-rust-contracts>`_. Le port par défaut est 7777:
ru: Как описано выше, основное развертывание должно обеспечить некоторую необходимую информацию. Здесь пример развертывания с использованием Rust клиента на примере работы с основным контрактом, который мы создали с `Contracts SDK for Rust <writing-rust-contracts>`_. Порт по умолчанию 7777:
tr: Yukarıda açıklandığı gibi, temel bir dağıtım bazı temel bilgileri sağlamalıdır. İşte `Rust için Kontrat SDK <writing-rust-contracts>`_ kullanarak oluşturduğumuz temel kontratla çalışacak Rust istemcisini kullanan örnek bir dağıtım. Varsayılan bağlantı noktası 7777'dir:

source: If your deployment command is correct, expect to see a success message that looks like this:
fr: Si votre commande de déploiement est correcte, attendez-vous à voir un message de succès qui ressemble à ceci :
ru: Если команда к развертыванию введена правильно, ожидайте сообщение, которое выглядит вот так:
tr: Dağıtım komutunuz doğruysa, aşağıdakine benzer bir başarı mesajı görmeyi bekleyin:

source: Note: Each deploy gets a unique hash. This is part of the cryptographic security of blockchain technology. No two deploys will ever return the same hash.
fr: Remarque : Chaque déploiement reçoit un hash unique. Cela fait partie de la sécurité cryptographique de la technologie blockchain. Deux déploiements ne renverront jamais le même hash.
ru: Внимание: у каждого развертывания свой уникальный хеш. Это часть криптографической безопасности технологии блокчейн. Не существует двух разных развертываний с одинаковым хешем.
tr: Not: Her dağıtım benzersiz bir özet (hash) alır. Bu, blokzincir teknolojisinin kriptografik güvenliğinin bir parçasıdır. Hiçbir zaman iki dağıtım aynı özet (hash) değerini döndürmez.

source: Check Deploy Status
fr: Vérifier l'état du déploiement
ru: Проверка статуса развертывания
tr: Dağıtım Durumunu Kontrol Edin

source: Once the network has received the deployment, it will queue up in the system before being listed in a block for execution. Sending a transaction (deployment) to the network does not mean that the transaction processed successfully. Therefore, it's important to check to see that the contract executed properly, and that the block was finalized.
fr: Une fois que le réseau a reçu le déploiement, celui-ci est mis en file d'attente dans le système avant d'être listé dans un bloc pour exécution. L'envoi d'une transaction (déploiement) au réseau ne signifie pas que la transaction a été traitée avec succès. Il est donc important de vérifier que le contrat s'est exécuté correctement et que le bloc a été finalisé.
ru: Как только сеть получила развертывание, оно будет ожидать в системе, прежде чем будет помещено в блок для исполнения. Отправка транзакции (развертывания) в сеть не означает, что транзакция прошла успешно. Поэтому важно проверять, исполнен ли контракт корректно и финализирован ли блок.
tr: Ağ dağıtımı aldıktan sonra, yürütme için bir blokta listelenmeden önce sistemde sıraya girer. Ağa bir işlem (dağıtım) göndermek, işlemin başarıyla işlendiği anlamına gelmez. Bu nedenle, kontratın düzgün bir şekilde yürütüldüğünü ve bloğun kesinleştiğini kontrol etmek önemlidir.

source: Which will return a data structure like this:
fr: Ce qui renverra une structure de données comme celle-ci :
ru: Что вернет структуру данных в виде:
tr: Bunun gibi bir veri yapısı döndürecek olan:

source: From this data structure we can observe some properties about the deploy (some of which can be set by the user):
fr: À partir de cette structure de données, nous pouvons identifier certaines propriétés du déploiement (dont certaines peuvent être définies par l'utilisateur) :
ru: Из этой структуры данных мы можем наблюдать некоторые частности о развертывании (некоторые из них могут быть настроены пользователем):
tr: Bu veri yapısından dağıtımla ilgili bazı özellikleri gözlemleyebiliriz (bazıları kullanıcı tarafından ayarlanabilir):

source: Execution cost 164645 gas
fr: Coût de l'exécution 164645 gaz
ru: Исполнение стоит 164645 газ
tr: Yürütme maliyeti 164645 yakıt

source: No errors were returned by the contract
fr: Aucune erreur n'a été renvoyée par le contrat
ru: Ошибок в контракте не обнаружилось
tr: Kontrat tarafından hiçbir hata döndürülmedi

source: There were no dependencies for this deploy
fr: Il n'y avait pas de dépendances pour ce déploiement
ru: Для данного развертывания нет зависимостей
tr: Bu dağıtım için hiçbir bağımlılık yoktu

source: The Time to Live was 1 hour
fr: La durée de vie (TTL=Time to Live) était de 1 heure
ru: Продолжительность жизни составила 1 час
tr: Yaşam Süresi 1 saatti

source: It is also possible to check the contract\'s state by performing a ``query-state`` command using the client.
fr: Il est également possible de vérifier l'état du contrat en exécutant la commande ``query-state`` à l'aide du client.
ru: Также состояние контракта можно проверить с помощью выполнения команды запроса ``query-state`` из программы-клиента.

source: A Note about Gas Prices
fr: Une note sur les prix du Gas
ru: Заметка о ценах газа
tr: Yakıt Fiyatları Hakkında Bir Not

source: If you notice in the put-deploy command above, we supplied a payment amount argument:
fr: Vous remarquez que dans la commande put-deploy ci-dessus, nous avons fourni un argument pour le montant du paiement :
ru: Если вы заметили в команде put-deploy выше, мы удовлетворили спор о размере выплаты:
tr: Yukarıdaki put-deploy komutunda fark ederseniz, bir ödeme tutarı argümanı sağladık:

source: But the actual execution cost was only ``164645`` when it was run on the chain!
fr: Mais le coût d'exécution réel n'était que de ``164645`` lorsqu'il était exécuté sur la chaîne !
ru: Но актуальная стоимость исполнения была только``164645`` , когда она производилась в сети!
tr: Ancak, zincir üzerinde çalıştırıldığında gerçek yürütme maliyeti yalnızca ```164645`` idi!

source: A common question that frequently arises is: \"How do I know what the payment amount (gas cost) should be?\" The honest answer is that we are hard at work to create tools to help you estimate your costs. Currently, we recommend using the `NCTL <https://docs.casperlabs.io/en/latest/dapp-dev-guide/setup-nctl.html>`_ tool on your local machine or the testnet to deploy your contracts in a test environment. As you just saw, you can check a deploy status and roughly see how much it would actually cost when deployed.
fr: Une question qui revient souvent est : "Comment puis-je savoir quel doit être le montant du paiement (coût du gas) ?". La réponse honnête est que nous travaillons dur pour créer des outils qui vous aideront à estimer vos coûts. Actuellement, nous recommandons d'utiliser l'outil `NCTL <https://docs.casperlabs.io/fr/latest/dapp-dev-guide/setup-nctl.html>`_ sur votre machine locale ou le réseau testnet pour déployer vos contrats dans un environnement de test. Comme vous venez de le voir, vous pouvez vérifier l'état d'un déploiement et voir approximativement combien il coûterait réellement une fois déployé.
ru: Такой вопрос часто возникает: "Как я могу знать, какой должен быть размер выплаты (стоимость в газ)?". По правде говоря, мы усиленно работаем над созданием инструментария, который поможет вам оценивать вашу стоимость. А пока что мы рекомендуем использовать инструмент `NCTL <https://docs.casperlabs.io/en/latest/dapp-dev-guide/setup-nctl.html>`_ на своей локальной машине или в тестнете, где вы развертываете свои контракты в тестовой среде. Как вы сейчас увидели, вы можете проверить статус развертывания и прикинуть, сколько это будет стоить по завершении развертывания.

source: You can estimate the costs in this way, and then add a small buffer in case the network state has changed. So in this example above, you might have chosen to set the payment to 175000 or 200000, rather than the 10000000 that was used.
fr: Vous pouvez estimer les coûts de cette manière, puis ajouter un petit tampon (buffer) au cas où l'état du réseau aurait changé. Ainsi, dans l'exemple ci-dessus, vous auriez pu choisir de fixer le paiement à 175000 ou 200000, plutôt que les 10000000 utilisés.
ru: Можете оценивать таким способом и затем добавлять сверху небольшой буфер на случай изменения состояния сети. Так, в этом примере выше, вы могли бы выбрать стоимость 175000 или 2000000 вместо 10000000, которая была поставлена.
tr: Maliyetleri bu şekilde tahmin edebilir ve ardından ağ durumunun değişmesi durumunda küçük bir tampon ekleyebilirsiniz. Dolayısıyla, yukarıdaki bu örnekte, ödemeyi kullanılan 10000000 yerine 175000 veya 200000 olarak ayarlamayı seçmiş olabilirdiniz.
