Repository: casper-network/docs-archive
Catalog: locale/*/LC_MESSAGES/dapp-dev-guide/getting-help.po
Languages: fr, ru, tr, vi

source: Getting Help
fr: Obtenir de l'aide
ru: Получение помощи
tr: Yardım Almak
vi: Tìm kiếm Trợ giúp

source: Frequently Asked Questions
fr: Foire aux questions
ru: Часто задаваемые вопросы
tr: Sıkça Sorulam Sorular
vi: Câu hỏi thường gặp

source: This section covers frequently asked questions and our recommendations.
fr: Cette section couvre les questions fréquemment posées et nos recommandations.
ru: В этом разделе освещены часто задаваемые вопросы и наши рекомендации.
tr: Bu bölümde sık sorulan sorular ve önerilerimiz yer almaktadır.
vi: Phần này bao gồm các câu hỏi thường gặp và khuyến nghị của chúng tôi.

source: Deploy Processing
fr: Traitement des déploiements
ru: Процессинг развертывания
tr: Dağıtım İşleme
vi: Triển khai tiến trình

source: **Question**: How do I know that a deploy was finalized?
fr: **Question** : Comment puis-je savoir qu'un déploiement a été finalisé ?
ru: **Вопрос**: как я могу понять, что развертывание финализировано?
tr: **Soru**: Bir dağıtımın kesinleştirildiğini nasıl bilebilirim?
vi: **Câu hỏi**: Làm cách nào để biết rằng một lệnh triển khai đã được hoàn tất?

source: **Answer**: If a deploy was executed, then it has been finalized. If the deploy status comes back as null, that means the deploy has not been executed yet. Once the deploy executes, it is finalized, and no other confirmation is needed. Exchanges that are not running a read-only node must also keep track of `finality signatures <#finality-signatures>`_ to prevent any attacks from high-risk nodes.
fr: **Réponse** : Si un déploiement a été exécuté, alors il a été finalisé. Si le statut du déploiement est égal à 'null', cela signifie que le déploiement n'a pas encore été exécuté. Une fois le déploiement exécuté, il est finalisé, et aucune autre confirmation n'est nécessaire. Les marchés d'échange (Exchanges) qui n'exécutent pas un nœud en lecture seule doivent également garder la trace des `signatures de finalité <#finality-signatures>`_ pour prévenir toute attaque provenant de nœuds à haut risque.
ru: **Ответ**: развертывание считается финализированным тогда, когда оно исполнено. Если статус развертывания отображается как null - развертывание еще не исполнено. Как только развертывание исполнено, оно сразу финализируется и не требует дальнейшего подтверждения. Обмены, которые не управляются нодой read-only должны также отслеживать `finality signatures <#finality-signatures>`_ в целях предотвращения любых атак от высокорискованных нод.
tr: **Yanıt**: Eğer bir dağıtım yürütüldüyse, kesinleştirilmiş demektir. Dağıtım durumu null olarak geri gelirse, bu, dağıtımın henüz yürütülmediği anlamına gelir. Dağıtım bir kez yürütüldüğünde, o dağıtım kesinleştirilir, ve başka bir onay gerekli değildir. Salt okunur bir düğüm çalıştırmayan borsalar, yüksek riskli düğümlerden herhangi bir saldırıyı önlemek için `kesinleştirme imzalarını <#finality-signatures>`_ takip etmelidir.
vi: **Trả lời**: Nếu một triển khai đã được thực thi, thì nó đã được hoàn tất. Nếu trạng thái triển khai trả lại là null, điều đó có nghĩa là triển khai vẫn chưa được thực hiện. Sau khi triển khai thực thi, nó sẽ được hoàn tất và không cần xác nhận nào khác. Các trao đổi không chạy nút chỉ đọc cũng cần theo dõi `finality signatures <#finality-signatures>`_để ngăn chặn bất kỳ cuộc tấn công nào từ các nút có nguy cơ cao.

source: Finality Signatures
fr: Signatures de finalité
ru: Итоговые подписи
tr: Kesinlik İmzaları
vi: Chữ ký cuối cùng

source: **Question**: When are finality signatures needed?
fr: **Question** : Quand les signatures de finalité (finality signatures) sont-elles nécessaires ?
ru: **Вопрос**: В каких случаях требуются итоговые подписи?
tr: **Soru**: Kesinlik imzaları ne zaman gereklidir?
vi: **Câu hỏi**: Khi nào thì cần chữ ký cuối cùng?

source: **Answer**: Finality signatures are confirmations from validators that they have executed the transaction. Exchanges should be asserting finality by collecting the weight of two-thirds of transaction signatures. If an exchange runs a read-only node, it can collect these finality signatures from its node. Otherwise, the exchange must assert finality by collecting finality signatures and have proper monitoring infrastructure to prevent a Byzantine attack.
fr: **Réponse** : Les signatures de finalité sont des confirmations des validateurs qu'ils ont exécuté la transaction. Les marchés d'échange (Exchange) devraient affirmer la finalité en recueillant le poids des deux tiers des signatures de transaction. Si un marché exploite un nœud en lecture seule, il peut collecter ces signatures de finalité à partir de son nœud. Sinon, le marché doit affirmer la finalité en collectant les signatures de finalité et disposer d'une infrastructure de surveillance appropriée pour éviter une attaque de type Byzantine.
ru: **Ответ**: Итоговые подписи являются подтверждением от валидаторов, что они исполнили транзакцию. Обмены должны подтверждать итоговые подписи путем сбора веса двух третей от подписей к транзакции. Если обмен запущен в режиме read-only, он может собирать итоговые подписи из своей ноды. В других случаях обмен должен подтверждаться собранными итоговыми подписями и иметь подобающую структуру мониторинга для предотвращения Византийского разлома.
tr: **Yanıt**: Kesinlik imzaları, doğrulayıcıların işlemi gerçekleştirdiklerine dair onaylardır. Borsalar, işlem imzalarının üçte ikisinin ağırlığını toplayarak kesinlik iddiasında bulunmalıdır. Bir borsa, salt okunur bir düğüm çalıştırıyorsa, bu kesinlik imzalarını borsanın düğümünden toplayabilir. Aksi takdirde, borsa kesinlik imzalarını toplayarak kesinliği beyan etmeli ve Bizans saldırısını önlemek için uygun izleme altyapısına sahip olmalıdır.
vi: **Trả lời**: Chữ ký cuối cùng là xác nhận từ người xác thực rằng họ đã thực hiện giao dịch. Các trao đổi nên xác nhận tính cuối cùng bằng cách thu thập trọng số của hai phần ba chữ ký giao dịch. Nếu một trao đổi chạy một nút chỉ đọc, nó có thể thu thập các chữ ký cuối cùng này từ nút của nó. Nếu không, trao đổi này phải xác nhận tính chính thức bằng cách thu thập chữ ký cuối cùng và có cơ sở hạ tầng giám sát thích hợp để ngăn chặn một cuộc tấn công Byzantine.

source: Suppose an exchange connects to someone else's node RPC to send transactions to the network. In this case, the node is considered high risk, and the exchange must assert finality by checking to see how many validators have run the transactions in the network.
fr: Supposons qu'un marché d'échange (Exchange) se connecte au nœud RPC d'une autre personne pour envoyer des transactions au réseau. Dans ce cas, le nœud est considéré comme à haut risque, et le marché doit affirmer la finalité en contrôlant combien de validateurs ont exécuté les transactions sur le réseau.
ru: Предположим обмен связывается со сторонним RPC сервером ноды, чтобы отправить транзакции в сеть. В таком случае нода считается высокорискованной и обмен должен утвердить финализацию с помощью проверки количества валидаторов, совершивших транзакции в сети.
tr: Bir borsanın, işlemleri ağa göndermek için başka birinin düğüm RPC'sine bağlandığını varsayalım. Bu durumda, düğüm yüksek riskli olarak kabul edilir ve borsa, ağdaki işlemleri kaç doğrulayıcının çalıştırdığını kontrol ederek kesinliği kanıtlamalıdır.
vi: Giả sử một trao đổi kết nối với nút RPC của người khác để gửi các giao dịch đến mạng. Trong trường hợp này, nút được coi là có rủi ro cao và trao đổi xác nhận tính cuối cùng bằng cách kiểm tra xem có bao nhiêu trình xác thực đã chạy các giao dịch trong mạng.

source: deploy_hash vs. transfer_hash
ru: Разница между deploy_hash и transfer_hash
tr: deploy_hash mi transfer_hash mi
vi: deploy_hash so với transfer_hash

source: **Question**: How is a deploy_hash different than a transfer_hash?
fr: **Question** : En quoi un deploy_hash est-il différent d'un transfer_hash ?
ru: **Вопрос**: В чем разница между deploy_hash и transfer_hash?
tr: **Soru**: deploy_hash'in transfer_hash'ten farkı nedir?
vi: **Câu hỏi**: deploy_hash khác với transfer_hash như thế nào?

source: **Answer**: Essentially, there is no difference between a `deploy_hash` and a `transfer_hash` since they are both deploy transactions. However, the platform is labeling the subset of deploys which are transfers, to filter transfers from other types of deploys. In other words, a `transfer_hash` is a native transfer, while a `deploy_hash` is another kind of deploy.
fr: **Réponse** : Essentiellement, il n'y a pas de différence entre un `deploy_hash` et un `transfer_hash` puisqu'ils sont tous deux des transactions de déploiement. Cependant, la plate-forme étiquette le sous-ensemble de déploiements qui sont des transferts, pour filtrer les transferts des autres types de déploiements. En d'autres termes, un `transfer_hash` est un transfert natif, tandis qu'un `deploy_hash` est un autre type de déploiement.
ru: **Ответ**: В целом существенной разницы между `deploy_hash` и `transfer_hash` нет, так как обе операции являются транзакциями развертывания. Но платформа специфицирует подкатегории развертываний, которые являются переводами, чтобы отличать их от других типов развертываний. Другими словами `transfer_hash` это нативный перевод, а `deploy_hash` - это другой вид развертывания.
tr: **Yanıt**: Esasen, `deploy_hash` ve `transfer_hash` arasında hiçbir fark yoktur, çünkü ikisi de dağıtım işlemleridir. Ancak platform, diğer dağıtım türlerinden gelen aktarımları filtrelemek için aktarım olan dağıtımların alt kümesini etiketliyor. Başka bir deyişle, `deploy_hash` başka bir dağıtım türü iken `transfer_hash` yerel bir aktarımdır.
vi: **Trả lời**: Về cơ bản, không có sự khác biệt giữa `deploy_hash` và` transfer_hash` vì cả hai đều đang triển khai các giao dịch. Tuy nhiên, nền tảng đang gắn nhãn cho tập con các việc triển khai là chuyển giao, để lọc chuyển giao từ các loại triển khai khác. Nói cách khác, một `transfer_hash` là một chuyển giao gốc, trong khi một `deploy_hash` là một loại triển khai khác.

source: account-hex vs. account-hash
ru: Разница между account-hex и account-hash
tr: account-hex mi account-hash mi
vi: account-hex so với account-hash

source: **Question**: Should a customer see the account-hex or the account-hash?
fr: **Question** : Un client doit-il voir le 'account-hex' ou le 'account-hash' ?
ru: **Вопрос**: должен ли покупатель видеть account-hex или account-hash?
tr: **Soru**: Bir müşteri account-hex mi yoksa account-hash mi görmeli?
vi: **Câu hỏi**: Khách hàng nên xem account-hex hay account-hash?

source: **Answer**: Exchange customers or end-users only need to see the `account-hex`. They do not need to know the `account_hash`. The `account_hash` is needed in the backend to verify transactions. Store the `account-hash` to query and monitor the account. Customers do not need to know this value, so to simplify their experience, we recommend storing both values and displaying only the `account-hex`.
fr: **Réponse** : Les clients ou utilisateurs finaux des marchés d'échange (Exchanges) ont seulement besoin de voir le `account-hex`. Ils n'ont pas besoin de connaître le `account_hash`. Le `account_hash` est nécessaire dans le backend pour vérifier les transactions. Stockez le `account-hash` pour interroger et contrôler le compte. Les clients n'ont pas besoin de connaître cette valeur, donc pour simplifier leur expérience, nous recommandons de stocker les deux valeurs et de n'afficher que le `account-hex`.
ru: **Ответ**: Пользователи обменников и конечные потребители должна видеть только `account-hex`. Им не требуется знать `account_hash`. Хеш `account_hash` требуется бэкенд разработчикам для верификации транзакций. Поместите `account-hash` в запрос для мониторинга счета. А покупатели не должны знать эти значения, так что для облегчения их операций мы рекомендуем хранить оба значения, но отображать только `account-hex`.
tr: **Yanıt**: Borsa müşterilerinin veya son kullanıcıların yalnızca `account-hex` i görmeleri gerekir. `account_hash` i bilmeleri gerekmez. İşlemleri doğrulamak için arka uçta `account-hash` gereklidir. Hesabı sorgulamak ve izlemek için `account-hash` saklayın. Müşterilerin bu değeri bilmesine gerek yoktur, bu nedenle deneyimlerini basitleştirmek için her iki değeri de saklamanızı ve yalnızca `account-hex` göstermenizi öneririz.
vi: **Trả lời**: Khách hàng phần trao đổi hoặc người dùng cuối chỉ cần xem `account-hex`. Họ không cần biết `account_hash`. Cần có `account_hash` ở phía lớp sau để xác minh các giao dịch. Lưu trữ `account-hash` để truy vấn và giám sát tài khoản. Khách hàng không cần biết giá trị này, vì vậy để đơn giản hóa trải nghiệm của họ, chúng tôi khuyên bạn nên lưu trữ cả hai giá trị và chỉ hiển thị `account-hex`.

source: Example Deploy
fr: Exemple de déploiement
ru: Пример развертывания
tr: Örnek Dağıtım
vi: Ví dụ triển khai

source: **Question**: Can you provide an example of a deploy?
fr: **Question** : Pouvez-vous fournir un exemple de déploiement ?
ru: **Вопрос**: можно ли посмотреть пример развертывания?
tr: **Soru**: Bir dağıtım örneği verebilir misiniz?
vi: **Câu hỏi**: Bạn có thể cung cấp một ví dụ về triển khai không?

source: **Answer**: You can find a *testDeploy* reference in `GitHub <https://github.com/casper-ecosystem/casper-js-sdk/blob/next/test/lib/DeployUtil.test.ts#L5>`_.
fr: **Answer** : Vous pouvez trouver une référence à l'example *testDeploy* dans `GitHub <https://github.com/casper-ecosystem/casper-js-sdk/blob/next/test/lib/DeployUtil.test.ts#L5>`_.
ru: **Ответ**: Вы можете найти пример развертывания *testDeploy* в `GitHub <https://github.com/casper-ecosystem/casper-js-sdk/blob/next/test/lib/DeployUtil.test.ts#L5>`_.
tr: **Cevap**: `GitHub <https://github.com/casper-ecosystem/casper-js-sdk/blob/next/test/lib/DeployUtil.test.ts#L5>`_'da bir *testDeploy* referansı bulabilirsiniz
vi: **Trả lời**: Bạn có thể thấy *testDeploy* tham chiếu tại `GitHub <https://github.com/casper-ecosystem/casper-js-sdk/blob/next/test/lib/DeployUtil.test.ts#L5>`_.

source: Operating with Keys
fr: Travailler avec les clés (keys)
ru: Работа с ключами
tr: Anahtarlarla Çalışmak
vi: Thao tác với Khoá

source: **Question**: How should we work with the PEM keys?
fr: **Question** : Comment devons-nous travailler avec les clés PEM ?
ru: **Вопрос**: как работать с ключами формата PEM?
tr: **Soru**: PEM anahtarlarıyla nasıl çalışmalıyız?
vi: **Câu hỏi**: Chúng ta nên làm việc với các khóa PEM như thế nào?

source: **Answer**: The `Keys API <https://casper-ecosystem.github.io/casper-js-sdk/next/modules/_lib_keys_.html>`_ provides methods for `Ed25519` and `Secp256K1` keys. Also, review the tests in `GitHub <https://github.com/casper-ecosystem/casper-js-sdk/blob/next/test/lib/Keys.test.ts#L39>`_ and the `Working with Keys <https://docs.casperlabs.io/en/latest/dapp-dev-guide/keys.html>`_ documentation.
fr: **Réponse** : La Keys API `Keys API <https://casper-ecosystem.github.io/casper-js-sdk/next/modules/_lib_keys_.html>`_ fournit des méthodes pour les clés `Ed25519` et `Secp256K1`. Passez également en revue les tests dans `GitHub <https://github.com/casper-ecosystem/casper-js-sdk/blob/next/test/lib/Keys.test.ts#L39>`_ et la documentation `Working with Keys <https://docs.casperlabs.io/en/latest/dapp-dev-guide/keys.html>`_.
ru: **Ответ**: Ресурс `Keys API <https://casper-ecosystem.github.io/casper-js-sdk/next/modules/_lib_keys_.html>`_ предоставляет методы для ключей `Ed25519` и `Secp256K1` . Также смотрите тесты в `GitHub <https://github.com/casper-ecosystem/casper-js-sdk/blob/next/test/lib/Keys.test.ts#L39>`_ и документацию о работе с ключами `Working with Keys <https://docs.casperlabs.io/en/latest/dapp-dev-guide/keys.html>`_ .
tr: **Yanıt**: `Anahtarlar APIsi <https://casper-ecosystem.github.io/casper-js-sdk/next/modules/_lib_keys_.html>`_ , `Ed25519` ve `Secp256K1` anahtarları için yöntemler sağlar. Ayrıca, `GitHub <https://github.com/casper-ecosystem/casper-js-sdk/blob/next/test/lib/Keys.test.ts#L39>`_ içindeki testleri ve `Anahtarlarla birlikte çalışmak <https://docs.casperlabs.io/en/latest/dapp-dev-guide/keys.html>`_ belgelendirmesini gözden geçirin.
vi: **Trả lời**: `Keys API <https://casper-ecosystem.github.io/casper-js-sdk/next/modules/_lib_keys_.html>`_ cung cấp các phương thức cho khoá `Ed25519` và `Secp256K1`. Ngoài ra, hãy xem các bài kiểm thử tại `GitHub <https://github.com/casper-ecosystem/casper-js-sdk/blob/next/test/lib/Keys.test.ts#L39>`_ và tài liệu `Working with Keys <https://docs.casperlabs.io/en/latest/dapp-dev-guide/keys.html>`.

source: Useful Resources
fr: Ressources utiles
ru: Полезные ресурсы
tr: Yararlı Kaynaklar
vi: Tài nguyên hữu ích

source: CasperLabs makes available the following resources for you to connect and get support:
fr: CasperLabs met à votre disposition les ressources suivantes pour vous permettre de vous connecter et d'obtenir de l'aide :
ru: Вам будут доступны полезные ресурсы CasperLabs, где вы можете получить обратную связь и поддержку:
tr: CasperLabs, bağlantı kurmanız ve destek almanız için aşağıdaki kaynakları kullanıma sunar:
vi: CasperLabs cung cấp các tài nguyên sau để bạn kết nối và nhận hỗ trợ:

source: On our `Discord Channel <https://discordapp.com/invite/mpZ9AYD>`_, connect live with members of our Engineering Team available to support you with the progress of your projects
fr: Sur notre canal `Discord <https://discordapp.com/invite/mpZ9AYD>`_, connectez-vous en direct avec les membres de notre équipe d'ingénieurs disponibles pour vous soutenir dans l'avancement de vos projets.
ru: На нашем канале `Discord Channel <https://discordapp.com/invite/mpZ9AYD>`_ можно вживую пообщаться с сотрудниками из инженерной команды, которые готовы поддержать вас в работе над проектами
tr: `Discord Kanalımızda <https://discordapp.com/invite/mpZ9AYD>`_, projelerinizin süreçlerinde size destek olmak için mevcut Mühendislik Ekibimizin üyeleriyle canlı bağlantı kurun
vi: Trên `Kênh Discord <https://discordapp.com/invite/mpZ9AYD>`_ của chúng tôi, kết nối trực tiếp với các thành viên trong Nhóm kỹ thuật, chúng tôi sẵn sàng hỗ trợ về tiến độ các dự án của bạn

source: Join the `CasperLabs Community Forum <https://forums.casperlabs.io/>`_ that includes technical discussions on using Casper features, obtain support, and pose questions to the CasperLabs Core Engineering Team
fr: Rejoignez le `Forum communautaire CasperLabs <https://forums.casperlabs.io/>`_ qui comprend des discussions techniques sur l'utilisation des fonctionnalités de Casper, obtenez de l'aide et posez des questions aux ingénieurs de CasperLabs.
ru: Присоединитесь к форуму `CasperLabs Community Forum <https://forums.casperlabs.io/>`_ , где есть технические дискуссии об использовании возможностей Casper, получение поддержки и возможность разместить вопросы к основной инженерной команде CasperLabs.
tr: Casper özelliklerinin kullanımıyla ilgili teknik tartışmaları içeren `CasperLabs Topluluk Forumu'na <https://forums.casperlabs.io/>`_ katılın, destek alın ve CasperLabs Çekirdek Mühendislik Ekibine sorular sorun
vi: Tham gia `CasperLabs Community Forum <https://forums.casperlabs.io/>`_ bao gồm các cuộc thảo luận kỹ thuật về cách sử dụng các tính năng của Casper, nhận hỗ trợ và đặt câu hỏi cho Nhóm kỹ thuật chính của CasperLabs

source: Subscribe to the `CasperLabs Official Telegram Channel <https://t.me/CasperLabs>`_ for general information and updates about our platform
fr: Abonnez-vous au `CasperLabs Official Telegram Channel <https://t.me/CasperLabs>`_ pour obtenir des informations générales et des mises à jour sur notre plateforme.
ru: Подпишитесь на официальный телеграм-канал `CasperLabs Official Telegram Channel <https://t.me/CasperLabs>`_ для получения основной информации и уведомлений об обновлениях на платформе
tr: Platformumuzla ilgili genel bilgiler ve güncellemeler için `CasperLabs Resmi Telegram Kanalına <https://t.me/CasperLabs>`_ abone olun
vi: Đăng ký `Kênh Telegram chính thức của CasperLab <https://t.me/CasperLabs>`_ để biết thông tin chung và cập nhật về nền tảng của chúng tôi

source: If you find issues related to the smart contracts maintained by CasperLabs, file an issue in the `Casper Ecosystem repository <https://github.com/casper-ecosystem/>`_.
fr: Si vous rencontrez des problèmes liés aux contrats intelligents maintenus par CasperLabs, créez un ticket dans le dépôt `Casper Ecosystem <https://github.com/casper-ecosystem/>`_.
ru: Если возникнут вопросы по смарт-контрактам, обслуживаемым CasperLabs, направьте файл с вашим случаем в репозиторий `Casper Ecosystem repository <https://github.com/casper-ecosystem/>`_.
tr: CasperLabs tarafından yürütülen akıllı kontratlatla ilgili sorunlar bulursanız, `Casper Ekosistem deposuna <https://github.com/casper-ecosystem/>`_ bir sorun bildirin.
vi: Nếu bạn tìm thấy các vấn đề liên quan đến các hợp đồng thông minh do CasperLabs đang hỗ trợ, hãy gửi vấn đề vào `Casper Ecosystem repository <https://github.com/casper-ecosystem/>`_.

source: For other issues, search the main `CasperLabs repository <https://github.com/CasperLabs>`_ and file the issue in the related project.
fr: Pour les autres problèmes, recherchez dans le dépôt principal de `CasperLabs <https://github.com/CasperLabs>`_ et créez un ticket dans le projet correspondant.
ru: Для других случаев воспользуйтесь поиском по основному репозиторию `CasperLabs repository <https://github.com/CasperLabs>`_ и поместите ваш файл в соответствующий раздел.
tr: Diğer sorunlar için ana `CasperLabs kod deposunda <https://github.com/CasperLabs>`_ arama yapın ve sorunu ilgili projeye bildirin.
vi: Đối với các sự cố khác, hãy tìm kiếm `Kho chứa chính của CasperLabs <https://github.com/CasperLabs>`_ và gửi sự cố vào dự án liên quan.

source: Otherwise, use our `Jira Service Desk <https://casperlabs.atlassian.net/servicedesk>`_ for situations such as:
fr: Sinon, utilisez notre `Jira Service Desk <https://casperlabs.atlassian.net/servicedesk>`_ pour des situations telles que :
ru: Также вы можете использовать нашу сервисную панель `Jira Service Desk <https://casperlabs.atlassian.net/servicedesk>`_ в следующих ситуациях:
tr: Aksi takdirde, aşağıdaki gibi durumlar için `Jira Servis Masamızı <https://casperlabs.atlassian.net/servicedesk>`_ kullanın:
vi: Nếu không, hãy sử dụng `Jira Service Desk <https://casperlabs.atlassian.net/servicedesk>`_ của chúng tôi cho các trường hợp như:

source: questions that are not issues
fr: des questions qui ne sont pas des problèmes
ru: вопросы, не входящие в темы
tr: sorun olmayan sorular
vi: những câu hỏi không phải là vấn đề

source: needing technical support
fr: besoin d'un support technique
ru: необходимость технической поддержки
tr: teknik desteğe ihtiyaç duyuyorum
vi: cần hỗ trợ kỹ thuật

source: wanting to give feedback
fr: donner un retour (feedback)
ru: запрос на получение обратной связи
tr: geri bildirim vermek istiyorum
vi: muốn đưa ra phản hồi

source: suggesting improvements
fr: suggérer des améliorations
ru: предложения по усовершенствованию
tr: iyileştirme önerilerinde bulunmak
vi: đề xuất cải tiến

source: participating in a bounty
fr: participation à une prime (bounty)
ru: участие в баунти
tr: bir ödül (bounty) programına katılım
vi: tham gia nhận thưởng
