Repository: casper-network/docs-archive
Catalog: locale/*/LC_MESSAGES/dapp-dev-guide/index.po
Languages: fr, tr, vi

source: Introduction
tr: Giriş
vi: Giới thiệu

source: Developers
fr: Développeurs
tr: Geliştiriciler
vi: Nhà phát triển

source: This guide is designed to support developers getting started with the development of smart contracts on the Casper blockchain in AssemblyScript or Rust. For Rust, there is a contract development kit that includes a runtime environment, reference documentation, and test framework. You can install our environment locally, create and test Smart Contracts with our Smart Contracts and Test Libraries, and use these libraries to build your own applications.
fr: Ce guide est conçu pour aider les développeurs à concevoir des contrats intelligents sur la blockchain Casper en AssemblyScript ou Rust. Pour Rust, il existe un kit de développement de contrats qui comprend un environnement d'exécution (Runtime), une documentation de référence et un environnement de test. Vous pouvez installer notre environnement localement, créer et tester des contrats intelligents avec nos bibliothèques de test et de contrats intelligents, et utiliser ces bibliothèques pour créer vos propres applications.
tr: Bu rehber, Casper blokzinciri üzerinde AssemblyScript ve Rust ile akıllı kontratların geliştirilmesi konusuna yeni başlayan geliştiricileri desteklemek üzere tasarlanmıştır. Rust için; çalışma zamanı ortamı, başvuru belgeleri ve test çatısı içeren bir geliştirme kiti bulunmaktadır. Ortamımızı yerel olarak kurabilir, Akıllı Kontratlar ve Test Kütüphanelerimiz ile Akıllı Kontratlar oluşturup test edebilir ve kendi uygulamalarınızı inşa etmek için bu kütüphaneleri kullanabilirsiniz.
vi: Hướng dẫn này được thiết kế để hỗ trợ các nhà phát triển bắt đầu phát triển các hợp đồng thông minh trên chuỗi khối Casper trong AssemblyScript hoặc Rust. Đối với Rust, có một bộ phát triển hợp đồng bao gồm môi trường chạy thời gian thực, tài liệu tham khảo và nền tảng kiểm thử. Bạn có thể cài đặt cục bộ môi trường của chúng tôi, tạo và kiểm thử Hợp đồng thông minh với Hợp đồng thông minh và Thư viện kiểm thử của chúng tôi, đồng thời sử dụng các thư viện này để xây dựng các ứng dụng của riêng bạn.

source: It is recommended you have prior knowledge about Unix-based operating systems, like GNU/Linux or macOS, and programming knowledge with:
fr: Il est recommandé d'avoir des connaissances préalables sur les systèmes d'exploitation de type Unix, comme GNU/Linux ou macOS, et des connaissances en programmation avec :
tr: GNU/Linux ya da macOS gibi Unix temelli işletim sistemleri hakkında ön bilgiye ve şu dillerde programlama bilgisine sahip olmanız önerilir:
vi: Bạn nên có kiến thức trước về hệ điều hành dựa trên Unix, như GNU / Linux hoặc macOS và kiến thức lập trình với:

source: JavaScript (optional)
fr: JavaScript (facultatif)
tr: JavaScript (isteğe bağlı)
vi: JavaScript (tuỳ chọn)

source: Python (optional)
fr: Python (facultatif)
tr: Python (isteğe bağlı)
vi: Python (tuỳ chọn)

source: The topics on the index include present and future documentation initiatives in our roadmap and are organized so that you will be able to:
fr: Les sujets de l'index comprennent les initiatives de documentation actuelles et futures de notre feuille de route et sont organisés de manière à ce que vous puissiez les consulter :
tr: Dizindeki konu başlıkları, yol haritamızdaki güncel ve gelecek belgelendirme inisiyatiflerini içerir ve şunları yapabilmenize olanak tanıyacak şekilde düzenlenmiştir:
vi: Các chủ đề trong chỉ mục bao gồm các tài liệu khởi tạo hiện tại và tương lai trong lộ trình của chúng tôi và được sắp xếp để bạn có thể:

source: Understand what CasperLabs is building.
fr: Comprendre ce que CasperLabs veut construire.
tr: CasperLabs'ın ne inşa etmekte olduğunu anlamak.

source: Learn how to build and operate applications on the platform.
fr: Apprenez à créer et à exploiter des applications sur la plate-forme.
tr: Platform üzerinde nasıl uygulama geliştirileceğini ve çalıştırılacağını öğrenmek.

source: Learn how to set up the CasperLabs environment locally.
fr: Mettre en place l'environnement CasperLabs en local.
tr: CasperLabs ortamının yerel olarak nasıl kurulacağını öğrenmek.

source: Work with our Contracts API to access our Rust resources.
fr: Travailler avec notre API de contrats pour accéder à nos ressources Rust.
tr: Rust kaynaklarımıza erişmek için Kontrat API'ımızla çalışmak.

source: Learn how to create and test Smart Contracts with our libraries.
fr: Créer et tester des contrats intelligents avec nos librairies (API).
tr: Kütüphanelerimizle nasıl Akıllı Kontratlar oluşturup test edileceğini öğrenmek.

source: Work with the multi-signature capability to sign transactions.
fr: Utiliser la fonction de signature multiple pour signer les transactions.
tr: İşlemleri (transactions) imzalamak için çoklu-imza yetenekleri ile çalışmak.

source: The motivation for our roadmap is inspired by feedback we are receiving from your recommendations. We hope you continue to provide your feedback as you embark on this journey with us -- we look forward to building a decentralized future together.
fr: La motivation pour notre feuille de route est inspirée par le retour que nous recevons de vos recommandations. Nous espérons que vous continuerez à nous faire part de vos commentaires tout au long de ce projet - nous sommes impatients de construire ensemble un avenir décentralisé.
tr: Tavsiyelerinizden aldığımız geri dönüşler, yol haritamızın esin kaynağıdır. Bizimle çıktığınız bu yolculuğa devam ettikçe geri dönüşlerinizi bizimle paylaşmaya devam edeceğinizi ümit ediyor ve birlikte merkeziyetsiz bir gelecek inşa edeceğimiz günleri dört gözle bekliyoruz.
vi: Động lực cho lộ trình của chúng tôi được truyền cảm hứng từ phản hồi mà chúng tôi nhận được từ các đề xuất của bạn. Chúng tôi hy vọng bạn tiếp tục cung cấp phản hồi của mình khi bạn bắt đầu cuộc hành trình này với chúng tôi - chúng tôi mong muốn cùng nhau xây dựng một tương lai phi tập trung.

source: `Coding Standards and Review <https://github.com/CasperLabs/CasperLabs/blob/master/CONTRIBUTING.md/>`_ cover best practices and recommendations following our coding standards, code reviews and publishing your code to our GitHub.
fr: `Normes de codage et révision <https://github.com/CasperLabs/CasperLabs/blob/master/CONTRIBUTING.md/>`_ couvrent les meilleures pratiques et recommandations inspirées de nos normes de codage, des révisions de code et la publication de votre code sur notre GitHub.
tr: `Kodlama Standartları ve Denetleme (Review) <https://github.com/CasperLabs/CasperLabs/blob/master/CONTRIBUTING.md/>`_, kodlama standartlarımıza uygun en iyi mesleki uygulamaları ve önerileri, kod denetlemeyi ve kodlarınızı GitHub'da yayımlamayı kapsar.

source: Understand more about the Casper Network
vi: Hiểu thêm về Mạng Casper

source: Learn how to build and operate applications on the platform
vi: Tìm hiểu cách xây dựng và vận hành các ứng dụng trên nền tảng

source: Learn how to set up a Casper Network locally
vi: Tìm hiểu cách thiết lập Mạng Casper cục bộ

source: Work with the contracts API to access the network\'s Rust resources
vi: Làm việc với API hợp đồng để truy cập tài nguyên Rust của mạng

source: Learn how to create and test smart contracts using available libraries
vi: Tìm hiểu cách tạo và kiểm thử các hợp đồng thông minh bằng cách sử dụng các thư viện có sẵn

source: Work with the multi-signature capability to sign transactions
vi: Làm việc với khả năng đa chữ ký để ký các giao dịch
