Repository: casper-network/docs-archive
Catalog: locale/*/LC_MESSAGES/dapp-dev-guide/keys.po
Languages: fr, tr, vi

source: Working with Cryptographic Keys
fr: Travailler avec des clés cryptographiques
tr: Şifreleme Anahtarlarıyla Birlikte Çalışmak
vi: Làm việc với các khoá mật mã

source: The Casper platform supports two types of signatures for creating accounts and signing transactions: ``secp256k1`` and ``ed25519``. You can generate keys using the Casper client in both formats. It is also possible to work with existing Ethereum keys.
fr: La plateforme Casper prend en charge deux types de signatures pour la création de comptes et la signature de transactions : ``secp256k1`` et ``ed25519``. on peut générer des clés à l'aide du client Casper dans les deux formats. Il est également possible de travailler avec des clés Ethereum.
tr: Casper platformu, hesap oluşturmak ve işlemleri imzalamak için iki tür imzayı destekler: ``secp256k1`` ve ``ed25519``. Casper istemcisini kullanarak her iki biçimde de anahtarlar oluşturabilirsiniz. Mevcut Ethereum anahtarları ile çalışmak da mümkündür.
vi: Nền tảng Casper hỗ trợ hai loại chữ ký để tạo tài khoản và ký giao dịch: ``secp256k1`` và ``ed25519``. Bạn có thể tạo khóa bằng ứng dụng khách Casper ở cả hai định dạng. Nó cũng có thể làm việc với các khóa Ethereum hiện có.

source: Key Generation
fr: Generation des clés
tr: Anahtar Üretimi
vi: Thế hệ khoá

source: Ethereum Keys
fr: Clés Ethereum
tr: Ethereum Anahtarları
vi: Các khoá Ethereum

source: To create ``secp256k1`` keys, commonly known as Ethereum keys, follow these steps:
fr: Pour créer des clés ``secp256k1``, communément appelées clés Ethereum, suivre ces étapes :
tr: Genellikle Ethereum anahtarları olarak bilinen ``secp256k1`` anahtarlarını oluşturmak için şu adımları izleyin:
vi: Để tạo mới khóa ``secp256k1``, thường được gọi là khóa Ethereum, hãy làm theo các bước sau:

source: Looking at the public-key-hex file, we see that ``secp256k1`` public hex keys start with `02` in Casper:
fr: En examinant le fichier 'public-key-hex', on voit que les clés publiques hexadecimales ``secp256k1`` commencent par `02` dans Casper :
tr: public-key-hex dosyasına bakarak, Casper'da ``secp256k1`` genel hex anahtarlarının `02` ile başladığını görürüz:
vi: Nhìn vào tệp public-key-hex, chúng ta thấy rằng khóa hex công khai ``secp256k1`` bắt đầu bằng `02` trong Casper:

source: EdDSA Keys
fr: Clés EdDSA
tr: EdDSA Anahtarları
vi: Các khoá EdDSA

source: It is also possible to create ``ed25519`` keys, which use the Edwards-curve Digital Signature Algorithm (EdDSA). To generate EdDSA keys, follow these steps:
fr: Il est également possible de créer des clés ``ed25519``, qui utilisent l'algorithme de signature numérique Edwards-curve (EdDSA). Pour générer des clés EdDSA, suivre ces étapes :
tr: Edwards eğrisi Dijital İmza Algoritmasını (EdDSA) kullanan ``ed25519`` anahtarları oluşturmak da mümkündür. EdDSA anahtarları oluşturmak için şu adımları izleyin:
vi: Cũng có thể tạo các khóa ``ed25519``, sử dụng Thuật toán chữ ký kỹ thuật số đường cong Edwards (EdDSA). Để tạo khóa EdDSA, hãy làm theo các bước sau:

source: Looking at the public-key-hex file, we see that keys of this type are pre-pended with `01`:
fr: En examinant le fichier 'public-key-hex', nous voyons que les clés de ce type sont précédées de `01` :
tr: public-key-hex dosyasına bakarak, bu tür anahtarların başlarına `01` eklendiğini görürüz:
vi: Nhìn vào tệp public-key-hex, chúng ta thấy rằng các khóa thuộc loại này được thêm sẵn `01`:

source: Working with Existing Ethereum Keys
fr: Travailler avec des clés Ethereum existantes
tr: Mevcut Ethereum Anahtarlarıyla Çalışmak
vi: Làm việc với khác khoá Ethereum đã có

source: It is also possible to use existing Ethereum keys in Casper. Here is an example set of Ethereum keys and their corresponding address:
fr: Il est également possible d'utiliser des clés Ethereum existantes dans Casper. Voici un exemple d'ensemble de clés Ethereum et de leur adresse correspondante :
tr: Casper'da mevcut Ethereum anahtarlarını kullanmak da mümkündür. İşte örnek bir Ethereum anahtarları seti ve bunlara karşılık gelen adres:
vi: Cũng có thể sử dụng các khóa Ethereum hiện có trong Casper. Dưới đây là một tập hợp ví dụ về các khóa Ethereum và địa chỉ tương ứng của chúng:

source: To use existing Ethereum keys, the Casper VM needs to know that the key is a ``secp256k1`` type.
fr: Pour utiliser des clés Ethereum existantes, la machine virtuelle (VM) Casper doit savoir que la clé est de type "secp256k1".
tr: Mevcut Ethereum anahtarlarını kullanmak için Casper VM'nin anahtarın ``secp256k1`` türünde olduğunu bilmesi gerekir.
vi: Để sử dụng các khóa Ethereum hiện có, máy ảo Casper cần biết rằng khóa là loại ``secp256k1``.

source: The Rust `casper-client` provides an example of how this works. Pre-pending the public key with a `02` indicates the key is a ``secp256k1`` key.
fr: Le client Rust `casper-client` fournit un exemple montrant comment cela fonctionne. La clé publique précédée d'un `02` indique que la clé est une clé ``secp256k1``.
tr: Rust `casper-client` bunun nasıl çalıştığına dair bir örnek sağlar. Genel anahtarın başına `02` eklenmesi, anahtarın ``secp256k1`` anahtarı olduğunu gösterir.
vi: Rust `casper-client` cung cấp một ví dụ về cách hoạt động của nó. Khóa công khai bắt đầu với `02` cho biết khóa đó là khóa ``secp256k1``.

source: **Example**:
fr: **Exemple**:
tr: **Örnek**:
vi: **Ví dụ**:

source: The following transaction sends 100 CSPR.
fr: La transaction suivante envoie 100 CSPR.
tr: Aşağıdaki işlem 100 CSPR gönderir.
vi: Giao dịch sau gửi 100 CSPR.

source: The Rust `casper-client` requires the secret key to be in `PEM` format to send a transaction from this account. If you want to use existing Ethereum keys with the Rust client, a conversion to `PEM` format is needed.
fr: Le `casper-client` de Rust requiert que la clé secrète soit au format `PEM` pour envoyer une transaction depuis ce compte. Pour utiliser des clés Ethereum existantes avec le client Rust, une conversion au format `PEM` est nécessaire.
tr: Rust `casper-client`, bu hesaptan bir işlem göndermek için gizli anahtarın `PEM` biçiminde olmasını gerektirir. Rust istemcisi ile birlikte mevcut Ethereum anahtarlarını kullanmak istiyorsanız, `PEM` formatına dönüştürme gereklidir.
vi: Rust `casper-client` yêu cầu khóa bí mật ở định dạng `PEM` để gửi giao dịch từ tài khoản này. Nếu bạn muốn sử dụng các khóa Ethereum hiện có với ứng dụng khách Rust, cần chuyển đổi sang định dạng `PEM`.

source: The following example is a JS script that generates a `PEM` file, using `key encoder <https://github.com/blockstack/key-encoder-js>`_ and node.js. To install these components, do the following:
fr: L'exemple suivant est un script JS qui génère un fichier `PEM`, en utilisant `key encoder <https://github.com/blockstack/key-encoder-js>`_ et node.js. Pour installer ces composants, procéder comme suit :
tr: Aşağıdaki örnek, `anahtar kodlayıcı <https://github.com/blockstack/key-encoder-js>`_ ve node.js kullanarak bir `PEM`dosyası oluşturan bir JS betiğidir. Bu bileşenleri yüklemek için aşağıdakileri yapın:
vi: Ví dụ sau là một tập lệnh JS script tạo tệp `PEM`, sử dụng `key encoder <https://github.com/blockstack/key-encoder-js>`_ và node.js. Để cài đặt các thành phần này, hãy làm như sau:

source: Then create the JS script ``convert-to-pem.js`` using `vi` or `nano` and include this content:
fr: Créer ensuite le script JS ``convert-to-pem.js`` en utilisant `vi` ou `nano` et inclure ce contenu :
tr: Ardından, `vi` veya `nano` kullanarak ``convert-to-pem.js`` JS betiğini oluşturun ve şu içeriği ekleyin:
vi: Sau đó, tạo tập lệnh JS script ``convert-to-pem.js`` bằng cách sử dụng `vi` hoặc` nano` và đưa vào nội dung này:

source: Then run the script using node.js. Name the secret key something different.
fr: Ensuite, exécuter le script en utilisant node.js. Donner un nom différent à la clé secrète.
tr: Ardından betiği node.js kullanarak çalıştırın. Gizli anahtara farklı bir ad verin.
vi: Sau đó, chạy script bằng cách sử dụng node.js. Đặt tên khác cho khóa bí mật.

source: To view the secret key, use `cat`:
fr: Pour voir la clé secrète, utiliser `cat` :
tr: Gizli anahtarı görüntülemek için `cat` kullanın:
vi: Để xem khoá bí mật, sử dụng `cat`:
