Repository: casper-network/docs-archive
Catalog: locale/*/LC_MESSAGES/dapp-dev-guide/setup-of-rust-contract-sdk.po
Languages: fr, tr, vi

source: **Note**: Since the test script automatically builds the contract, during development you only need to run the command ``cargo test`` without the need for ``cargo build``.
fr: **Note** : Comme le script de test construit automatiquement le contrat, pendant le développement, il suffit d'exécuter la commande ``cargo test`` sans avoir besoin de ``cargo build``.
tr: **Not**: Test komut dosyası kontratı otomatik olarak oluşturduğundan, geliştirme sırasında yalnızca ``cargo test`` komutunu ``cargo build`` komutuna gerek kalmadan çalıştırmanız gerekir.
vi: **Lưu ý**: Vì tập lệnh thử nghiệm tự động xây dựng hợp đồng, trong quá trình phát triển, bạn chỉ cần chạy lệnh ``cargo test`` mà không cần ``cargo build``.

source: A successful test run indicates that your smart contract environment is set up correctly.
fr: Un test réussi indique que votre environnement de contrat intelligent est correctement configuré.
tr: Başarılı bir şekilde çalışan test, akıllı kontrat ortamınızın doğru şekilde kurulduğunu gösterir.
vi: Quá trình chạy thử nghiệm thành công cho thấy rằng môi trường hợp đồng thông minh của bạn được thiết lập chính xác.

source: After the compilation finishes, the test should run and you should see output similar to this message in your terminal:
fr: Une fois la compilation terminée, le test devrait s'exécuter et on devrait voir une sortie similaire à ce message dans le terminal :
tr: Derleme tamamlandıktan sonra test çalışmalı ve terminalinizde bu mesaja benzer bir çıktı görmelisiniz:
vi: Sau khi quá trình biên dịch kết thúc, quá trình kiểm tra sẽ chạy và bạn sẽ thấy đầu ra tương tự như thông báo này trong màn hình của mình:

source: As a brief example, open up *my-project/contract/src/main.rs* in your editor, modify the *KEY* value in the contract, and then rerun the ``cargo test`` command. You should observe that the smart contract recompiles and the test fails now.
fr: À titre d'exemple, ouvrir *my-project/contract/src/main.rs* dans un éditeur, modifier la valeur *KEY* dans le contrat, puis ré-exécuter la commande ``cargo test``. On devrait observer que le contrat intelligent se recompile et que le test échoue maintenant.
tr: Kısa bir örnek olarak, editörünüzde *my-project/contract/src/main.rs* dosyasını açın, kontrattaki *KEY* değerini değiştirin ve ardından ``cargo test`` komutunu yeniden çalıştırın. Akıllı kontratın yeniden derlendiğini ve testin şimdi başarısız olduğunu gözlemlemelisiniz.
vi: Ví dụ ngắn gọn, hãy mở *my-project/contract/src/main.rs* trong trình soạn thảo của bạn, sửa đổi giá trị *KEY* trong hợp đồng, sau đó chạy lại lệnh ``cargo test``. Bạn nên quan sát rằng hợp đồng thông minh sẽ biên dịch lại và kiểm tra không thành công ngay bây giờ.

source: Rust Resources
fr: Resources Rust
tr: Rust Kaynakları
vi: Tài nguyên Rust

source: These Rust resources are excellent and we highly recommend them:
fr: Ces ressources Rust sont excellentes et nous les recommandons vivement :
tr: Bu Rust kaynakları mükemmel ve bunları şiddetle tavsiye ediyoruz:
vi: Các tài nguyên Rust này rất tuyệt vời và chúng tôi đặc biệt khuyên bạn nên sử dụng chúng:
