Repository: casper-network/docs-archive
Catalog: locale/*/LC_MESSAGES/dapp-dev-guide/setup-of-rust-contract-sdk.po
Languages: fr, tr, vi

source: Getting Started
fr: Démarrage
tr: Başlarken
vi: Bắt đầu

source: This guide covers the basic tools you will need to set up your first Casper smart contract. You will also be able to build a sample smart contract and run a few basic tests on it on your local machine.
fr: Ce guide couvre les outils de base dont vous aurez besoin pour configurer votre premier contrat intelligent Casper. Vous serez également en mesure de créer un exemple de contrat intelligent et d'effectuer quelques tests de base sur votre machine locale.
tr: Bu kılavuz, ilk Casper akıllı kontratınızı oluşturmak için ihtiyaç duyacağınız temel araçları kapsar. Ayrıca örnek bir akıllı kontrat oluşturabilecek ve bunun üzerinde yerel makinenizde birkaç temel test gerçekleştirebileceksiniz.
vi: Hướng dẫn này bao gồm các công cụ cơ bản bạn sẽ cần để thiết lập hợp đồng thông minh Casper đầu tiên của mình. Bạn cũng sẽ có thể xây dựng một hợp đồng thông minh mẫu và chạy một vài thử nghiệm cơ bản về hợp đồng đó trên máy cục bộ của mình.

source: Casper’s blockchain is built upon the Rust programming language and compiles down to WebAssembly. The Rust contract SDK is the easiest way to get started with smart contract development. This guide will walk you through the steps to set up your development environment and build your first contract.
fr: La blockchain de Casper est construite autour du langage de programmation Rust et se compile avec WebAssembly. Le kit de développement de contrat Rust est le moyen le plus simple de se lancer dans le développement de contrats intelligents. Ce guide vous accompagnera à travers les étapes pour configurer votre environnement de développement et construire votre premier contrat.
tr: Casper'ın blokzinciri, Rust programlama dili üzerine kuruludur ve WebAssembly'e kadar derlenir. Rust kontrat SDK'sı, akıllı kontrat geliştirmeye başlamanın en kolay yoludur. Bu kılavuz, geliştirme ortamınızı kurma ve ilk kontratınızı oluşturma adımlarında size yol gösterecektir.
vi: Chuỗi khối của Casper được xây dựng dựa trên ngôn ngữ lập trình Rust và được biên dịch thành WebAssembly. SDK hợp đồng Rust là cách dễ nhất để bắt đầu với việc phát triển hợp đồng thông minh. Hướng dẫn này sẽ hướng dẫn bạn các bước để thiết lập môi trường phát triển và xây dựng hợp đồng đầu tiên của bạn.

source: Video Tutorial
fr: Tutoriel vidéo
tr: Eğitim Videosu
vi: Video hướng dẫn

source: For a video walkthrough of this guide, feel free to check out this quick-start video.
fr: Pour une présentation vidéo de ce guide, n'hésitez pas à consulter cette vidéo de prise en main rapide.
tr: Bu kılavuzun bir video incelemesi için, bu hızlı başlangıç videosuna göz atmaktan çekinmeyin.
vi: Để xem hướng dẫn bằng video, vui lòng xem video bắt đầu nhanh này.

source: Prerequisites
fr: Prérequis
tr: Önkoşullar
vi: Điều kiện cần

source: Installing Rust
fr: Installation de Rust
tr: Rust Kurulumu
vi: Cài đặt Rust

source: Install the `Rust programming language <https://www.rust-lang.org>`_ if you don’t already have it on your computer.
fr: Installer le langage de programmation `Rust <https://www.rust-lang.org>`_ si on l'a pas déjà sur votre machine.
tr: Bilgisayarınızda henüz yoksa, `Rut programlama dili <https://www.rust-lang.org>`_ni kurun.
vi: Cài đặt ngôn ngữ lập trình Rust <https://www.rust-lang.org>`_ nếu bạn chưa có trên máy tính của mình.

source: The `official Rust guide <https://www.rust-lang.org/tools/install>`_ recommends installing Rust by using ``curl``:
fr: Le `guide officiel de Rust <https://www.rust-lang.org/tools/install>`_ recommande d'installer Rust en utilisant ``curl`` :
tr: `Resmi Rust kılavuzu <https://www.rust-lang.org/tools/install>`_, Rust'ı ``curl`` kullanarak yüklemenizi önerir:
vi: `Hướng dẫn chính thức về Rust <https://www.rust-lang.org/tools/install>`_ khuyên bạn nên cài đặt Rust bằng cách sử dụng ``curl``:

source: You can also use ``brew`` on MacOS or ``apt`` on Linux to install Rust.
fr: On peut également utiliser ``brew`` sur MacOS ou ``apt`` sur Linux pour installer Rust.
tr: Rust'ı yüklemek için MacOS'ta ``brew`` veya Linux`ta ``apt`` kullanabilirsiniz.
vi: Bạn cũng có thể sử dụng ``brew`` trên MacOS hoặc ``apt`` trên Linux để cài đặt Rust.

source: You will need to customize the build so that you are installing the nightly build as your default toolchain. Once you finish installing Rust, check your version:
fr: On doit personnaliser la construction (build) pour mettre en place la construction nocturne automatisée (nightly build) comme chaîne d'outils ( toolchain) par défaut. Une fois l'installation de Rust terminée, vérifier la version :
tr: Gecelik derlemeyi varsayılan araç zinciriniz olarak kurabilmeniz için yapıyı özelleştirmeniz gerekecektir. Rust'ı yüklemeyi bitirdikten sonra sürümünüzü kontrol edin:
vi: Bạn sẽ cần phải tùy chỉnh bản dựng do bạn đang cài đặt bản dựng đêm làm chuỗi công cụ mặc định của mình. Sau khi bạn cài đặt xong Rust, hãy kiểm tra phiên bản của bạn:

source: Your terminal output should resemble something like the following (note: at the time of the writing of this tutorial, the latest version of Rust was 1.23.1 and may differ for you):
fr: La sortie du terminal devrait ressembler à quelque chose comme ce qui suit (note : au moment de l'écriture de ce tutoriel, la dernière version de Rust était 1.23.1 et peut différer pour vous) :
tr: Terminal çıktınız aşağıdakine benzer olmalıdır (not: bu rehberin yazıldığı sırada, Rust'ın en son sürümü 1.23.1 idi ve sizin için farklı olabilir):
vi: Trên màn hình thiết bị của bạn sẽ hiển thị giống như sau (lưu ý: tại thời điểm viết hướng dẫn này, phiên bản mới nhất của Rust là 1.23.1 và có thể khác đối với bạn):

source: **Casper Rust Packages**
tr: **Casper Rust Paketleri**
vi: **Gói Rust của Casper**

source: We publish three crates on `crates.io <https://crates.io/>`_ to support smart contract development with Rust:
fr: Nous publions trois packets (crates) sur `crates.io <https://crates.io/>`_ pour supporter le développement de contrats intelligents avec Rust :
tr: Rust ile akıllı kontrat geliştirmeyi desteklemek için `crates.io <https://crates.io/>`_ üzerinde üç paket yayınlıyoruz:
vi: Chúng tôi xuất bản ba gói trên ``crates.io <https://crates.io/>`_ để hỗ trợ phát triển hợp đồng thông minh với Rust:

source: `Casper Contract <https://crates.io/crates/casper-contract>`_ - a library supporting communication with the blockchain. This is the main library you will need to write smart contracts.
fr: `Contrat Casper <https://crates.io/crates/casper-contract>`_ - une librairie supportant la communication avec la blockchain. C'est la principale librairie dont vous aurez besoin pour écrire des contrats intelligents.
tr: `Casper Kontratı <https://crates.io/crates/casper-contract>`_ - blokzincir ile iletişimi destekleyen bir kütüphane. Bu, akıllı kontratlar yazmak için ihtiyaç duyacağınız ana kütüphanedir.
vi: `Casper Contract <https://crates.io/crates/casper-contract>`_ - một thư viện hỗ trợ giao tiếp với chuỗi khối. Đây là thư viện chính mà bạn sẽ cần để viết các hợp đồng thông minh.

source: `Casper Test Support <https://crates.io/crates/casper-engine-test-support>`_ - an in-memory virtual machine against which you can test your smart contracts.
fr: `Casper Test Support <https://crates.io/crates/casper-engine-test-support>`_ - une machine virtuelle embarquée en mémoire sur laquelle on peut tester des contrats intelligents.
tr: `Casper Test Desteği <https://crates.io/crates/casper-engine-test-support>`_ - akıllı kontratlarınızı test edebileceğiniz bir bellek içi sanal makine.
vi: `Hỗ trợ kiểm thử Casper <https://crates.io/crates/casper-engine-test-support>`_ - một máy ảo của bộ nhớ trong mà bạn có thể kiểm thử các hợp đồng thông minh của mình.

source: `Casper Types <https://crates.io/crates/casper-types>`_ - a library with types we use across the Rust ecosystem.
fr: `Types Casper <https://crates.io/crates/casper-types>`_ - une librairie avec des 'types' que nous utilisons à travers l'écosystème Rust.
tr: `Casper Türleri <https://crates.io/crates/casper-types>`_ - Rust ekosisteminde kullandığımız türleri içeren bir kitaplık.
vi: `Casper Types <https://crates.io/crates/casper-types>`_ - một thư viện với các kiểu mà chúng tôi sử dụng trong hệ sinh thái Rust.

source: A crate is a compilation unit, which can be compiled into a binary or a library.
fr: Un packet (crate) est une unité de compilation, qui peut être compilée en un binaire ou une librairie.
tr: Bir paket, ikili dosya veya kitaplık olarak derlenebilen bir derleme birimidir.
vi: Một gói là một đơn vị biên dịch, có thể được biên dịch thành một tệp nhị phân hoặc một thư viện.

source: **API Documentation for Smart Contracts**
fr: **Documentation API pour les contrats intelligents**
tr: **Akıllı Kontratlar için API Belgelendirme**
vi: **Tài liệu API cho Hợp đồng thông minh**

source: Each of the Casper crates comes with API documentation and examples for each function, located at `https://docs.rs <https://docs.rs/releases/search?query=casper>`_. The contract API documentation is specific for a given version. For example, you can find documentation for version **0.7.6** at `<https://docs.rs/casper-contract/0.7.6>`_.
fr: Chacune des 'crate' Casper est fournie avec une documentation API et des exemples pour chaque fonction, disponibles sur `https://docs.rs <https://docs.rs/releases/search?query=casper>`_. La documentation de l'API du contrat est spécifique à une version donnée. Par exemple, on peut trouver la documentation pour la version **0.7.6** à `<https://docs.rs/casper-contract/0.7.6>`_.
tr: Casper paketlerinin her biri, `https://docs.rs <https://docs.rs/releases/search?query=casper>`_ konumunda bulunan API belgeleri ve her işlev için örneklerle birlikte gelir. Kontrat API Belgelendirme, belirli bir sürüme özeldir. Örneğin, **0.7.6** sürümüne ilişkin belgeleri `<https://docs.rs/casper-contract/0.7.6>`_ adresinde bulabilirsiniz.
vi: Mỗi gói Casper đi kèm với tài liệu API và ví dụ cho từng chức năng, có tại `https://docs.rs <https://docs.rs/releases/search?query=casper>`_. Tài liệu API hợp đồng dành riêng cho một phiên bản nhất định. Ví dụ: bạn có thể tìm tài liệu cho phiên bản ** 0.7.6 ** tại `<https://docs.rs/casper-contract/0.7.6>`_.

source: Installing Dependencies
fr: Installation des dépendances
tr: Bağımlılıkları Yükleme
vi: Cài đặt các phần phụ thuộc

source: CMake is a popular build tool that we will utilize, and you may very well have it already installed. If you do, make sure that you have the latest version (currently 3.19.4). If you need to install or upgrade it, follow the steps located here: https://cmake.org/install/. Once installed, check your version as shown below. It should resemble this output:
fr: CMake est un outil de construction (build tool) courant que nous utiliserons, et il est fort possible que vous l'ayez déjà installé. Si c'est le cas, assurez-vous que vous avez la dernière version (actuellement 3.19.4). Si vous devez l'installer ou le mettre à jour, suivez les étapes indiquées ici : https://cmake.org/install/. Une fois installé, vérifiez la version comme indiqué ci-dessous. Elle devrait ressembler à cette sortie :
tr: CMake, kullanacağımız popüler bir derleme aracıdır ve zaten yüklemiş olabilirsiniz. Bunu yaparsanız, en son sürüme (şu anda 3.19.4) sahip olduğunuzdan emin olun. Yüklemeniz veya yükseltmeniz gerekiyorsa, burada bulunan adımları izleyin: https://cmake.org/install/. Kurulduktan sonra, sürümünüzü aşağıda gösterildiği gibi kontrol edin. Bu çıktıya benzemelidir:
vi: CMake là một công cụ xây dựng phổ biến mà chúng tôi sẽ sử dụng và rất có thể bạn đã cài đặt nó. Nếu bạn làm vậy, hãy đảm bảo rằng bạn có phiên bản mới nhất (hiện tại là 3.19.4). Nếu bạn cần cài đặt hoặc nâng cấp nó, hãy làm theo các bước có tại đây: https://cmake.org/install/. Sau khi cài đặt, hãy kiểm tra phiên bản của bạn như hình dưới đây. Nó sẽ giống như thế này:

source: Development Environment Setup
fr: Configuration de l'environnement de développement
tr: Geliştirme Ortamı Kurulumu
vi: Thiết lập môi trường phát triển

source: Installing the Casper Crates
fr: Installation des packets Casper
tr: Casper Paketlerini Kurma
vi: Cài đặt Casper Crates

source: The best and fastest way to set up a Casper Rust Smart Contract project is to use :code:`cargo-casper`. When you use this, it will set the project up with a simple contract, a runtime environment and a testing framework with a simple test. *Cargo* is a build system and package manager for Rust (much like *pip* if you are familiar with Python). It is possible to use this configuration in your CI/CD pipeline as well.
fr: Le meilleur moyen et le plus rapide de mettre en place un projet de contrat intelligent Casper Rust est d'utiliser :code:`cargo-casper`. Lorsque vous l'utilisez, le projet sera configuré avec un contrat simple, un environnement d'exécution et un environnement de test avec un test simple. *Cargo* est un système de construction et un gestionnaire de paquets pour Rust (un peu comme *pip* si vous êtes familier avec Python). Il est possible d'utiliser cette configuration dans votre pipeline CI/CD également.
tr: Bir Casper Rust Akıllı Kontrat projesi oluşturmanın en iyi ve en hızlı yolu :code:`cargo-casper` kullanmaktır. Bunu kullandığınızda, projeyi basit bir kontrat, bir çalışma zamanı ortamı ve bir test çatısı ile kuracaktır. *Cargo*, Rust için bir derleme sistemi ve paket yöneticisidir (Python'a aşina iseniz, *pip* gibi). Bu yapılandırmayı CI/CD veri hattınızda da kullanmak mümkündür.
vi: Cách tốt nhất và nhanh nhất để thiết lập dự án Hợp đồng thông minh Casper Rust là sử dụng :code:`cargo-casper`. Khi bạn sử dụng, nó sẽ thiết lập dự án với một hợp đồng đơn giản, một môi trường thời gian chạy và một khung kiểm thử với một bài kiểm tra đơn giản. *Cargo* là một hệ thống xây dựng và trình quản lý gói cho Rust (giống như *pip* nếu bạn đã quen thuộc với Python). Bạn cũng có thể sử dụng cấu hình này trong hệ thống CI/CD của mình.

source: Creating a Project
fr: Créer un projet
tr: Bir Proje Oluşturma
vi: Tạo một dự án

source: You can create a new sample project very easily with the Casper crate. For example, let’s say that I want to create a project named **my-project** for this tutorial (you can choose a different name if you wish), then I can simply run the command:
fr: Vous pouvez créer un nouveau projet type très facilement avec le packet (crate) Casper. Par exemple, disons que l'on veut créer un projet nommé **my-project** pour ce tutoriel (vous pouvez choisir un nom différent si vous le souhaitez), alors on peut simplement exécuter la commande
tr: Casper paket ile çok kolay bir şekilde yeni bir örnek proje oluşturabilirsiniz. Örneğin, bu eğitim için **my-project** adlı bir proje oluşturmak istediğimi varsayalım (isterseniz farklı bir ad seçebilirsiniz), ardından basitçe şu komutu çalıştırabilirim:
vi: Bạn có thể tạo một dự án mẫu mới rất dễ dàng với gói Casper. Ví dụ: giả sử tôi muốn tạo một dự án có tên **my-project** cho hướng dẫn này (bạn có thể chọn một tên khác nếu muốn), sau đó tôi có thể chỉ cần chạy lệnh:

source: If you look inside the newly-created *my-project* folder, you will find two crates: ``contract`` and ``tests``. This is a complete basic smart contract that saves a value, passed as an argument, on the blockchain. The ``tests`` crate provides a runtime environment of the Casper virtual machine, and a basic smart contract test.
fr: Si vous examinez le dossier *my-project* nouvellement créé, vous trouverez deux packets (crates) : ``contract'' et ``tests''. Il s'agit d'un contrat intelligent de base complet qui enregistre une valeur, passée en argument, sur la blockchain. Le packet ``tests`` fournit un environnement d'exécution de la machine virtuelle Casper, et un test du contrat intelligent de base.
tr: Yeni oluşturulan *my-project* klasörünün içine bakarsanız, iki paket bulacaksınız: "contract" ve "tests". Bu, blokzincirde argüman olarak iletilen bir değeri kaydeden eksiksiz bir temel akıllı contrattır. "tests" paketi, Casper sanal makinesinin çalışma zamanı ortamını ve temel bir akıllı kontrat testi sağlar.
vi: Nếu bạn nhìn vào bên trong thư mục *my-project* mới được tạo, bạn sẽ thấy hai gói: `` hợp đồng`` và ``thử nghiệm``. Đây là một hợp đồng thông minh cơ bản hoàn chỉnh giúp lưu một giá trị, được thông qua như một đối số trên blockchain. Gói ``tests`` cung cấp môi trường thời gian chạy của máy ảo Casper và kiểm tra hợp đồng thông minh cơ bản.

source: Compiling to WASM
fr: Compilation en WASM (WebAssembly)
tr: WASM'e Derleme
vi: Biên dịch sang WASM

source: The Casper blockchain uses WebAssembly (WASM) in its runtime environment. Compilation targets for WASM are available for Rust, giving developers access to all the Rust ecosystem tools when developing smart contracts.
fr: La blockchain Casper utilise WebAssembly (WASM) dans son environnement d'exécution. Des cibles (targets) de compilation pour WASM sont disponibles pour Rust et permettent aux développeurs d'accéder à tous les outils de l'écosystème Rust lors du développement de contrats intelligents.
tr: Casper blokzinciri, çalışma zamanı ortamında WebAssembly (WASM) kullanır. WASM için derleme hedefleri Rust için mevcuttur ve geliştiricilere akıllı kontratlar geliştirirken tüm Rust ekosistem araçlarına erişim sağlar.
vi: Chuỗi khối Casper sử dụng WebAssembly (WASM) trong môi trường thời gian chạy của nó. Khả năng biên dịch sang WASM có sẵn trong Rust, cho phép các nhà phát triển truy cập vào tất cả các công cụ của hệ sinh thái Rust khi phát triển các hợp đồng thông minh.

source: Casper contracts support Rust tooling such as :code:`clippy` for linting contracts. Feel free to use them!
fr: Les contrats Casper supportent des outils Rust tels que :code:`clippy` pour la vérification des contrats. N'hésitez pas à les utiliser !
tr: Casper kontratları, şekli denetim (linting) için :code:`clippy` gibi Rust araçlarını destekler. Kullanmaktan çekinmeyin!
vi: Hợp đồng Casper hỗ trợ công cụ Rust như: :code:`clippy` cho các hợp đồng linting. Hãy sử dụng chúng!

source: The project requires a specific nightly version of Rust and requires a WASM target to be added to that Rust version. You can see more information by running:
fr: Le projet nécessite une version nocturne spécifique de Rust et exige qu'une cible (target) WASM soit ajoutée à cette version de Rust. Vous pouvez avoir plus d'informations en exécutant :
tr: Proje, Rust'ın belirli bir gecelik sürümünü gerektiriyor ve bu Rust sürümüne eklenecek bir WASM hedefi gerektiriyor. Çalıştırarak daha fazla bilgi görebilirsiniz:
vi: Dự án yêu cầu một phiên bản Rust hàng đêm riêng và yêu cầu thêm đích WASM vào phiên bản Rust đó. Bạn có thể xem thêm thông tin bằng cách chạy:

source: To build the project, go into the ``contract`` folder, install the Rust toolchain and specify the target build as WebAssembly (wasm32):
fr: Pour construire le projet, aller dans le dossier ``contract``, installer la chaîne d'outils Rust (toolchain) et spécifier la cible de construction comme WebAssembly (wasm32) :
tr: Projeyi oluşturmak için ``contract`` klasörüne gidin, Rust araç zincirini kurun ve hedef derlemeyi WebAssembly (wasm32) olarak belirtin:
vi: Để xây dựng dự án, hãy vào thư mục ``contract``, cài đặt chuỗi công cụ Rust và chỉ định xây dựng đích là WebAssembly (wasm32):

source: Build the Contract
fr: Construire le contrat
tr: Kontratı Derle
vi: Xây dựng Hợp đồng

source: The next step is to compile the smart contract into WASM. Inside the contract folder, run the following command:
fr: L'étape suivante consiste à compiler le contrat intelligent dans WASM. Dans le dossier du contrat, exécuter la commande suivante :
tr: Bir sonraki adım, akıllı kontratı WASM'da derlemektir. Kontrat klasörünün içinde aşağıdaki komutu çalıştırın:
vi: Bước tiếp theo là biên dịch hợp đồng thông minh thành WASM. Bên trong thư mục hợp đồng, hãy chạy lệnh sau:

source: **NOTE: It's important to build the contract using ``--release`` as a debug build will produce a contract which is much larger and more expensive to execute.**
fr: **NOTE : Il est important de construire le contrat en utilisant ``--release`` car une construction de type 'debug' produira un contrat beaucoup plus gros et plus coûteux à exécuter**.
tr: **NOT: Hata ayıklama derlemesi çok daha büyük ve yürütülmesi daha pahalı bir kontrat üreteceğinden, kontratı ``--release`` kullanarak oluşturmak önemlidir.**
vi: **LƯU Ý: Điều quan trọng là xây dựng hợp đồng bằng cách sử dụng ``--release`` như bản dựng gỡ rối sẽ tạo ra một hợp đồng lớn hơn và đắt hơn nhiều để thực hiện.**

source: Inside of the folder, you will now see a *target* folder that will contain the compiled smart contract named *contract.wasm* at :code:`my-project/contract/target/wasm32-unknown-unknown/release/contract.wasm`.
fr: À l'intérieur du dossier, on verra maintenant un dossier *target* qui contient le contrat intelligent compilé et nommé *contract.wasm* à :code:`my-project/contract/target/wasm32-unknown-unknown/release/contract.wasm`.
tr: Klasörün içinde, şimdi :code:`my-project/contract/target/wasm32-unknown-unknown/release/contract.wasm`. adresinde *contract.wasm* adlı derlenmiş akıllı kontratı içerecek bir *target* klasörü göreceksiniz.
vi: Bên trong thư mục, bây giờ bạn sẽ thấy một thư mục *đích* sẽ chứa hợp đồng thông minh đã biên dịch có tên là *contract.wasm* tại :code:`my-project/contract/target/wasm32-unknown-unknown/release/contract.wasm`.

source: Test the Contract
fr: Testez le contrat
tr: Kontratı Test Et
vi: Kiểm thử Hợp đồng

source: In addition to creating the contract, the Casper crate also automatically created sample tests in the *my-project/tests* folder.
fr: En plus de créer le contrat, le paquet (crate) Casper a automatiquement créé des exemples de tests dans le dossier *my-project/tests*.
tr: Casper paketi, kontratı oluşturmaya ek olarak, *my-project/tests* klasöründe otomatik olarak örnek testler de oluşturdu.
vi: Ngoài việc tạo hợp đồng, gói Casper cũng tự động tạo các bài kiểm thử mẫu trong thư mục *my-project/tests*.

source: The Casper local environment provides an in-memory virtual machine against which you can run your contract for testing. When you run the test crate, it will automatically build the smart contract in release mode and then run a series of tests against it in the Casper runtime environment. The custom build script is named ``build.rs`` if you are interested in looking more into it.
fr: L'environnement local Casper propose une machine virtuelle embarquée (en mémoire) sur laquelle on peut exécuter le contrat pour le tester. Lorsque on exécute le packet (crate) test, il construit automatiquement le contrat intelligent en mode release, puis exécute une série de tests dans l'environnement d'exécution Casper. Le script de construction personnalisé est nommé ``build.rs`` si on souhaite en savoir plus.
tr: Casper yerel ortamı, test için kontratınızı çalıştırabileceğiniz bir bellek içi sanal makine sağlar. Test paketini çalıştırdığınızda, akıllı kontratı sürüm kipinde otomatik olarak oluşturacak ve ardından Casper çalışma zamanı ortamında buna karşı bir dizi test çalıştıracaktır. Daha fazla araştırmak ilgileniyorsanız özel derleme komut dosyası ``build.rs`` olarak dlandırılır.
vi: Môi trường cục bộ Casper cung cấp một máy ảo trong bộ nhớ mà bạn có thể chạy hợp đồng của mình để thử nghiệm. Khi bạn chạy gói thử nghiệm, nó sẽ tự động xây dựng hợp đồng thông minh ở chế độ phát hành và sau đó chạy một loạt các thử nghiệm đối với nó trong môi trường thời gian chạy Casper. Tập lệnh xây dựng tùy chỉnh được đặt tên là ``build.rs`` nếu bạn muốn tìm hiểu thêm về nó.
