Repository: casper-network/docs-archive
Catalog: locale/*/LC_MESSAGES/dapp-dev-guide/setup-nctl.po
Languages: fr, tr, vi

source: Local Network Testing
fr: Test du réseau local
tr: Yerel Ağ Testi
vi: Kiểm thử mạng nội bộ

source: NCTL stands for network/node control. `NCTL <https://github.com/casper-network/casper-node/tree/master/utils/nctl>`_ is a CLI application you can use to set up and control multiple local Casper networks during development. Many developers wish to spin up relatively small test networks to localize their testing before deploying to the blockchain. Adopting a standardized approach in the community is also helpful for troubleshooting and reporting issues.
fr: NCTL est l'abréviation de network/node control. `NCTL <https://github.com/casper-network/casper-node/tree/master/utils/nctl>`_ est une application CLI que vous pouvez utiliser pour configurer et contrôler plusieurs réseaux Casper locaux pendant le développement. De nombreux développeurs souhaitent faire tourner des réseaux de test relativement petits pour localiser leurs tests avant de les déployer sur la blockchain. L'adoption d'une approche standardisée au sein de la communauté est également utile pour le dépannage et le signalement des problèmes.

source: Prerequisites
fr: Prérequis
tr: Önkoşullar
vi: Điều kiện cần

source: You have completed the `Getting Started section <dapp-dev-guide/setup-of-rust-contract-sdk>`_, which shows you how to install your development environment, including tools like *CMake* (version 3.1.4+), *Cargo*, and *Rust*.
fr: Vous avez terminé la section `Getting Started section <dapp-dev-guide/setup-of-rust-contract-sdk>`_, qui montre comment installer votre environnement de développement, notamment des outils comme *CMake* (version 3.1.4+), *Cargo* et *Rust*.
tr: *CMake* (sürüm 3.1.4+), *Cargo* ve *Rust*. gibi araçlar da dahil olmak üzere geliştirme ortamınızı nasıl kuracağınızı gösteren `Başlarken bölümü <dapp-dev-guide/setup-of-rust-contract-sdk>`_nü tamamladınız.
vi: Bạn đã hoàn thành phần `Bắt đầu <dapp-dev-guide/setup-of-rust-contract-sdk>`_, phần này chỉ cho bạn cách cài đặt môi trường phát triển của mình, bao gồm các công cụ như *CMake* (phiên bản 3.1.4+ ), *Cargo*, và *Rust*.

source: Make sure you have `Python 3 installed <https://www.python.org/downloads/>`_ if your operating system does not include Python.
fr: S'assurer que `Python 3 est installé <https://www.python.org/downloads/>`_ si votre système d'exploitation (OS) n'inclut pas Python.
tr: İşletim sisteminiz Python içermiyorsa `Python 3'ün <https://www.python.org/downloads/>`_ kurulu olduğundan emin olun.
vi: Đảm bảo rằng bạn đã cài đặt `Python 3 installed <https://www.python.org/downloads/>`_ nếu hệ điều hành của bạn không bao gồm Python.

source: To run NCTL, you will also need `the bash shell <https://www.gnu.org/software/bash/>`_.
fr: Pour exécuter NCTL, vous aurez également besoin du shell bash `the bash shell <https://www.gnu.org/software/bash/>`_.
tr: NCTL'yi çalıştırmak için ayrıca `bash kabuğuna <https://www.gnu.org/software/bash/>` ihtiyacınız olacak.
vi: Để chạy NCTL, bạn cũng sẽ cần `bash shell <https://www.gnu.org/software/bash/>`_.

source: Video Tutorial
fr: Tutoriel vidéo
tr: Eğitim Videosu
vi: Video hướng dẫn

source: If you prefer a video walkthrough of this guide, you can check out this video.
fr: Si on préfère une présentation vidéo de ce guide, on peut consulter cette vidéo.
tr: Bu kılavuzun bir videosunu izlemeyi tercih ederseniz, bu videoya göz atabilirsiniz.
vi: Nếu bạn thích hướng dẫn bằng video hơn, bạn có thể xem video này.

source: Installing a Virtual Environment
fr: Installation d'un environnement virtuel (Virtual Environment)
tr: Sanal Ortam Kurulumu
vi: Cài đặt môi trường ảo

source: We will show you how to run NCTL in a virtual environment. If you want to run NCTL at the system level, you can, but we recommend that you only do that if you are sure you know what you are doing.
fr: Nous allons vous montrer comment exécuter NCTL dans un environnement virtuel. Si vous souhaitez exécuter NCTL au niveau du système, vous pouvez le faire, mais nous vous recommandons de ne le faire que si vous êtes sûr de savoir ce que vous faites.
tr: NCTL'yi sanal bir ortamda nasıl çalıştıracağınızı göstereceğiz. NCTL'yi sistem düzeyinde çalıştırmak istiyorsanız yapabilirsiniz, ancak bunu yalnızca ne yaptığınızı bildiğinizden eminseniz yapmanızı öneririz.
vi: Chúng tôi sẽ hướng dẫn bạn cách chạy NCTL trong môi trường ảo. Nếu bạn muốn chạy NCTL ở cấp hệ thống, bạn có thể, nhưng chúng tôi khuyên bạn chỉ nên làm điều đó nếu bạn chắc chắn rằng bạn biết mình đang làm gì.

source: First, you will need to install a set of tools required for running NCTL.
fr: Tout d'abord, nous devons installer un ensemble d'outils nécessaires à l'exécution de NCTL.
tr: İlk olarak, NCTL'yi çalıştırmak için gerekli bir takım araçları kurmanız gerekecek.
vi: Trước tiên, bạn sẽ cần cài đặt một bộ công cụ cần thiết để chạy NCTL.

source: **Step 1.** The first tool you will need is **pip**, a package manager for Python. Pip comes with the Python 3 installation from python.org, but if you do not have it already, follow the steps below or `the full installation instructions <https://pip.pypa.io/en/stable/installing/>`_.
fr: **Etape 1.** Le premier outil dont nous aurons aurez besoin est **pip**, un gestionnaire de paquets pour Python. Pip est fourni avec l'installation de Python 3 , mais si on ne l'a pas encore, suivre les étapes ci-dessous ou `les instructions d'installation complètes <https://pip.pypa.io/en/stable/installing/>`_.
tr: **Adım 1.** İhtiyacınız olan ilk araç, Python için bir paket yöneticisi olan **pip**'tir. Pip, python.org'dan Python 3 kurulumuyla birlikte gelir, ancak henüz sahip değilseniz, aşağıdaki adımları veya `tam kurulum talimatlarını <https://pip.pypa.io/en/stable/installing/>`_ takip edin.
vi: **Bước 1.** Công cụ đầu tiên bạn cần là **pip**, một trình quản lý gói cho Python. Pip đi kèm với cài đặt Python 3 từ python.org, nhưng nếu bạn chưa có, hãy làm theo các bước bên dưới hoặc `hướng dẫn cài đặt đầy đủ <https://pip.pypa.io/en/stable/installing/>`_.

source: Instructions for MacOS:
fr: Instructions pour MacOS:
tr: MacOS için talimatlar:
vi: Hướng dẫn cho MacOS:

source: Instructions for Linux:
fr: Instructions pour Linux:
tr: Linux için talimatlar:
vi: Hướng dẫn cho Linux:

source: **Step 2.** Install **pkg-config**, a program used to compile and link against one or more libraries.
fr: **Etape 2.** Installer **pkg-config**, un programme utilisé pour compiler et lier une ou plusieurs librairies.
tr: **Adım 2.** Bir veya daha fazla kitaplığı derlemek ve bunlarla bağlantı kurmak için kullanılan bir program olan **pkg-config**'i kurun.
vi: **Bước 2.** Cài đặt **pkg-config**, một chương trình được sử dụng để biên dịch và liên kết với một hoặc nhiều thư viện.

source: **Step 3.** Install either **libssl-dev** (Linux) or **openssl** (MacOS), which are toolkits for the Transport Layer Security (TLS) and Secure Sockets Layer (SSL) protocols. They also serve as general-purpose cryptography libraries.
fr: **Installer **libssl-dev** (Linux) ou **openssl** (MacOS), qui sont des boîtes à outils pour les protocoles Transport Layer Security (TLS) et Secure Sockets Layer (SSL). Elles servent également de librairies de cryptographie à usage général.
tr: **Adım 3.** Transfer Katmanı Güvenliği (TLS) ve Güvenli Yuva Katmanı (SSL) protokolleri için araç takımları olan **libssl-dev** (Linux) veya **openssl** (MacOS) yükleyin. Ayrıca genel amaçlı kriptografi kitaplıkları olarak da hizmet ederler.
vi: **Bước 3.** Cài đặt **libssl-dev** (Linux) hoặc **openssl** (MacOS), là các bộ công cụ dành cho các giao thức Bảo mật lớp truyền tải (TLS) và Lớp cổng bảo mật (SSL). Chúng cũng đóng vai trò như các thư viện mật mã có mục đích chung.

source: **Step 4.** You will also need the **gcc** and **g++** compilers, which usually come as part of developer command-line tools (versions 7.5.0 at the time of this writing).
fr: *On aura également besoin des compilateurs **gcc** et **g++**, qui font généralement partie des outils de ligne de commande des développeurs (versions 7.5.0 au moment de la rédaction de ce document).
tr: **Adım 4.** Genellikle geliştirici komut satırı araçlarının bir parçası olarak gelen **gcc** ve **g++** derleyicilerine de ihtiyacınız olacaktır (bu yazı yazıldığı sırada sürüm 7.5.0).
vi: **Bước 4.** Bạn cũng sẽ cần các trình biên dịch **gcc** và **g ++**, thường là một phần của các công cụ dòng lệnh dành cho nhà phát triển (phiên bản 7.5.0 tại thời điểm viết bài này).

source: **Step 5.** Create and activate a new virtual environment. **Commands applicable to the virtual environment will be prefixed with (env)**. Run the following commands to set it up.
fr: **Etape 5.** Créer et activer un nouvel environnement virtuel. **Les commandes applicables à l'environnement virtuel seront préfixées par (env)**. Exécuter les commandes suivantes pour le configurer.
tr: **Adım 5.** Yeni bir sanal ortam oluşturun ve etkinleştirin. **Sanal ortam için geçerli komutların önüne (env)** eklenecektir. Ayarlamak için aşağıdaki komutları çalıştırın.
vi: **Bước 5.** Tạo mới và kích hoạt một môi trường ảo mới. **Các lệnh áp dụng cho môi trường ảo sẽ có tiền tố là (env)**. Chạy các lệnh sau để thiết lập nó.

source: Instructions for MacOS and Linux:
fr: Instructions pour MacOS et Linux :
tr: MacOS ve Linux için talimatlar:
vi: Hướng dẫn cho MacOS và Linux:

source: **Step 6.** Inside the virtual environment, upgrade **pip** to the latest version.
fr: **Etape 6.** Dans l'environnement virtuel, mettre à jour **pip** à la dernière version.
tr: **Adım 6.** Sanal ortamın içinde **pip**'i en son sürüme yükseltin.
vi: **Bước 6.** Bên trong môi trường ảo, hãy nâng cấp **pip** lên phiên bản mới nhất.

source: **Step 7.** Install **jq**, a command-line JSON processor.
fr: **Etape 7.** Installer **jq**, un processeur JSON en ligne de commande.
tr: **Adım 7.** Bir komut satırı JSON işlemcisi olan **jq**'yi yükleyin.
vi: **Bước 7.** Cài đặt **jq**, một bộ xử lý JSON bằng dòng lệnh.

source: **Step 8.** Install **supervisor**, a cross-platform process manager.
fr: **Etape 8.** Installer **supervisor**, un gestionnaire de processus multiplateforme.
tr: **Adım 8.** Platformlar arası bir süreç yöneticisi olan **supervisor**ı kurun.
vi: **Bước 8.** Cài đặt **supervisor**, một trình quản lý tiến trình đa nền tảng.

source: **Step 9.** Install **toml**, a configuration file parser.
fr: **Etape 9.** Installer **toml**, un parseur de fichiers de configuration.
tr: **Adım 9.** Bir yapılandırma dosyası ayrıştırıcısı olan **toml**u yükleyin.
vi: **Bước 9.** Cài đặt **toml**, một trình phân tích cú pháp tệp cấu hình.

source: Setting up the Network
fr: Configuration du réseau
tr: Ağı Kurmak
vi: Cài đặt mạng

source: You are now ready to set up and run your local network of Casper nodes.
fr: Vous êtes maintenant prêt à configurer et à faire fonctionner votre réseau local de nœuds Casper.
tr: Artık yerel Casper düğümleri ağınızı kurmaya ve çalıştırmaya hazırsınız.
vi: Bây giờ bạn đã sẵn sàng để thiết lập và chạy mạng cục bộ gồm các nút Casper của mình.

source: **Step 10.** Clone the *casper-node-launcher* software in your working directory, which we will call *WORKING_DIRECTORY*. **Very Important!!! Choose a short path for your working directory**; otherwise, the NCTL tool will report that the path is too long.
fr: **Etape 10.** Cloner le projet *casper-node-launcher* dans votre répertoire de travail, que nous appellerons *WORKING_DIRECTORY*. **Très important ! !! Choisir un chemin court pour votre répertoire de travail** ; sinon, l'outil NCTL signalera que le chemin est trop long.
tr: **Adım 10.** WORKING_DIRECTORY* adını vereceğimiz çalışma dizininize *casper-node-launcher* yazılımını klonlayın. **Çok önemli!!! Çalışma dizininiz için kısa bir yol seçin**; aksi takdirde, NCTL aracı yolun çok uzun olduğunu bildirecektir.
vi: **Bước 10.** Sao chép phần mềm *casper-node-launcher* trong thư mục làm việc của bạn, mà chúng tôi sẽ gọi là *WORKING_DIRECTORY*. **Rất quan trọng!!! Chọn một đường dẫn ngắn cho thư mục làm việc của bạn**; nếu không, công cụ NCTL sẽ báo rằng đường dẫn quá dài.

source: **Step 11.** Next, clone the *casper-node* software, also in your working directory.
fr: **Etape 11.** Ensuite, cloner le projet *casper-node* dans votre répertoire de travail.
tr: **Adım 11.** Ardından, *casper-node* yazılımını da çalışma dizininizde klonlayın.
vi: **Bước 11.** Tiếp theo, sao chép phần mềm *casper-node*, cũng trong thư mục làm việc của bạn.

source: **Step 12.** Activate the NCTL environment with the following command.
fr: **Etape 12.** Activer l'environnement NCTL avec la commande suivante.
tr: **Adım 12.** Aşağıdaki komutla NCTL ortamını etkinleştirin.
vi: **Bước 12.** Kích hoạt môi trường NCTL bằng lệnh sau.

source: **Step 13.** Compile the NCTL binary scripts. The following command compiles both the *casper-node* and the *casper-client* in release mode.
fr: **Étape 13 .** Compiler les scripts binaires NCTL. La commande suivante compile à la fois *casper-node* et *casper-client* en mode 'release'.
tr: **Adım 13.** NCTL ikili komut dosyalarını derleyin. Aşağıdaki komut, sürüm modunda hem *casper-node* hem de *casper-client*'ı derler.
vi: **Bước 13.** Biên dịch các script nhị phân NCTL. Lệnh sau đây biên dịch cả *casper-node* và *casper-client* trong chế độ phát hành.

source: **Step 14.** Set up all the assets required to run a local network, including binaries, chainspec, config, faucet, and keys. Also, spin up the network right after. The default network will have 10 nodes, with 5 active nodes and 5 inactive nodes.
fr: **Etape 14.** Installer tous les éléments nécessaires au fonctionnement d'un réseau local, y compris les binaires, chainspec, config, faucet et les clés. Lancer le réseau juste après. Le réseau par défaut aura 10 noeuds, avec 5 noeuds actifs et 5 noeuds inactifs.
tr: **Adım 14.** İkili dosyalar, zincir belirtimi, yapılandırma, musluk ve anahtarlar dahil olmak üzere yerel bir ağı çalıştırmak için gereken tüm varlıkları ayarlayın. Ayrıca, hemen ardından ağı açın. Varsayılan ağ, 5 etkin düğüm ve 5 etkin olmayan düğüm olmak üzere 10 düğüme sahip olacaktır.
vi: **Bước 14.** Thiết lập tất cả các nội dung cần thiết để chạy một mạng cục bộ, bao gồm tệp nhị phân, chuỗi mã, cấu hình, chốt và khóa. Ngoài ra, hãy quay lại mạng ngay sau đó. Mạng mặc định sẽ có 10 nút, với 5 nút hoạt động và 5 nút không hoạt động.

source: Once a network is up and running, you can control each node within the network and add new nodes to the network.
fr: Une fois qu'un réseau est opérationnel, on peut contrôler chaque nœud du réseau et ajouter de nouveaux nœuds au réseau.
tr: Bir ağ çalışır duruma geldiğinde, ağ içindeki her bir düğümü kontrol edebilir ve ağa yeni düğümler ekleyebilirsiniz.
vi: Sau khi mạng được thiết lập và chạy, bạn có thể kiểm soát từng nút trong mạng và thêm các nút mới vào mạng.

source: Several other NCTL commands are available via aliases for execution from within a terminal session. All such commands are prefixed by *nctl-* and allow you to perform various tasks.
fr: Plusieurs autres commandes NCTL sont disponibles via des alias pour une exécution à partir d'une session de terminal. Toutes ces commandes sont préfixées par *nctl-* et permettent d'effectuer diverses tâches.
tr: Diğer birkaç NCTL komutu, bir terminal oturumundan yürütülmek üzere takma adlar aracılığıyla kullanılabilir. Tüm bu komutların önüne *nctl-* eklenir ve çeşitli görevleri gerçekleştirmenize izin verir.
vi: Một số lệnh NCTL khác có sẵn thông qua Alias để thực hiện từ bên trong phiên máy trạm. Tất cả các lệnh như vậy đều có tiền tố là * nctl- * và cho phép bạn thực hiện các tác vụ khác nhau.

source: You should see the new directory *utils/nctl/assets*, with the following structure.
fr: On devrait voir le nouveau répertoire *utils/nctl/assets*, avec la structure suivante.
tr: Aşağıdaki yapıya sahip yeni *utils/nctl/asset* dizinini görmelisiniz.
vi: Bạn sẽ thấy thư mục mới *utils/nctl/asset*, với cấu trúc như sau.

source: Image showing the folders created by nctl.
fr: Image montrant les dossiers créés par nctl.
tr: Nctl tarafından oluşturulan klasörleri gösteren resim.
vi: Hình ảnh hiển thị các thư mục được tạo bởi nctl.

source: Here is the command line output you would expect.
fr: Voici la sortie de la ligne de commande à laquelle on peut s'attendre.
tr: İşte beklediğiniz komut satırı çıktısı.
vi: Đây là kết quả dòng lệnh mà bạn mong đợi.

source: Image showing successful nctl output.
fr: Image montrant une sortie nctl réussie.
tr: Başarılı nctl çıktısını gösteren resim.
vi: Hình ảnh hiển thị đầu ra nctl thành công.

source: Stopping the Network
fr: Arrêt du réseau
tr: Ağı Durdurmak
vi: Đang dừng mạng

source: **Step 15.** Although not necessary, you can stop and clean the NCTL setup with the following commands.
fr: **Etape 15.** Bien que cela ne soit pas nécessaire, on peut arrêter et nettoyer la configuration NCTL avec les commandes suivantes.
tr: **Adım 15.** Gerekli olmasa da aşağıdaki komutlarla NCTL kurulumunu durdurabilir ve temizleyebilirsiniz.
vi: **Bước 15.** Mặc dù không cần thiết, bạn có thể dừng và dọn dẹp phần cài đặt NCTL bằng các lệnh sau.

source: Next Steps
fr: Étapes suivantes
tr: Sonraki Adımlar
vi: Các bước tiếp theo

source: Explore the `various NCTL commands <https://github.com/casper-network/casper-node/blob/master/utils/nctl/docs/commands.md>`_.
fr: Explorer les `nombreuses commandes NCTL <https://github.com/casper-network/casper-node/blob/master/utils/nctl/docs/commands.md>`_.

source: Explore the `NCTL usage guide <https://github.com/casper-network/casper-node/blob/master/utils/nctl/docs/usage.md>`_.
fr: Explorer le `guide d'utilisation NCTL <https://github.com/casper-network/casper-node/blob/master/utils/nctl/docs/usage.md>`_.

source: NCTL stands for network/node control. `NCTL <https://github.com/CasperLabs/casper-node/tree/master/utils/nctl>`_ is a CLI application you can use to set up and control multiple local Casper networks during development. Many developers wish to spin up relatively small test networks to localize their testing before deploying to the blockchain. Adopting a standardized approach in the community is also helpful for troubleshooting and reporting issues.
tr: NCTL, ağ/düğüm kontrolü anlamına gelir. `NCTL <https://github.com/CasperLabs/casper-node/tree/master/utils/nctl>`_ geliştirme sırasında birden fazla yerel Casper ağını kurmak ve kontrol etmek için kullanabileceğiniz bir CLI uygulamasıdır. Birçok geliştirici, blokzincire dağıtmadan önce testlerini yerelleştirmek için nispeten küçük test ağlarını döndürmek ister. Toplulukta standartlaştırılmış bir yaklaşımın benimsenmesi, sorunların giderilmesi ve raporlanması için de yararlıdır.
vi: NCTL là viết tắt của điều khiển mạng/nút. `NCTL <https://github.com/CasperLabs/casper-node/tree/master/utils/nctl>`_ là một ứng dụng CLI bạn có thể sử dụng để thiết lập và kiểm soát nhiều mạng Casper cục bộ trong quá trình phát triển. Nhiều nhà phát triển muốn tạo ra các mạng thử nghiệm tương đối nhỏ để bản địa hóa thử nghiệm của họ trước khi triển khai vào blockchain. Việc áp dụng phương pháp tiếp cận được chuẩn hóa trong cộng đồng cũng hữu ích cho việc khắc phục sự cố và báo cáo các vấn đề.

source: Explore the `various NCTL commands <https://github.com/CasperLabs/casper-node/blob/master/utils/nctl/docs/commands.md>`_.
tr: `Çeşitli NCTL komutlarını <https://github.com/CasperLabs/casper-node/blob/master/utils/nctl/docs/commands.md>` keşfedin.
vi: Khám phá `các lệnh NCTL <https://github.com/CasperLabs/casper-node/blob/master/utils/nctl/docs/commands.md>`_.

source: Explore the `NCTL usage guide <https://github.com/CasperLabs/casper-node/blob/master/utils/nctl/docs/usage.md>`_.
tr: `NCTL kullanım kılavuzunu <https://github.com/CasperLabs/casper-node/blob/master/utils/nctl/docs/usage.md>`_ keşfedin.
vi: Khám phá `Hướng dẫn sử dụng NCTL <https://github.com/CasperLabs/casper-node/blob/master/utils/nctl/docs/usage.md>`_.
