Repository: casper-network/docs-archive
Catalog: locale/*/LC_MESSAGES/dapp-dev-guide/solidity.po
Languages: fr, ru, tr, vi

source: Transpiling Solidity to Rust
fr: Transpiler (Transpiling) Solidity en Rust
ru: Транспиляция Solidity в Rust
tr: Solidity'i Rust'a Çevirmek
vi: Chuyển từ Solidity sang Rust

source: **Introducing Caspiler - Transpile Solidity to Rust and access the cool features of Casper!**
fr: **Introduction à Caspiler - Transpiler Solidity en Rust et accéder aux fonctionnalités de Casper!**
ru: **Представляем Caspiler - транспилер Solidity на Rust и доступ к крутым возможностям Casper!**
tr: **Caspiler tanıtımı - Solidity'i Rust'a çevirin ve Casper'ın harika özelliklerine erişin!**
vi: **Giới thiệu Caspiler - Chuyển từ Solidity sang Rust và truy cập các tính năng thú vị của Casper!**

source: Smart Contracts on Casper
fr: Contrats intelligents sur Casper
ru: Смарт-контракты Casper
tr: Casper'da Akıllı Kontratlar
vi: Hợp đồng thông minh trên Casper

source: The Casper Virtual Machine runs smart contracts that compile to Webassembly. There are two ecosystems that provide compilation targets for webassembly: Rust and AssemblyScript. CasperLabs provides smart contract libraries to support development for both of these languages. The core development of the Casper Protocol is taking place in Rust, and as a result, there are many Rust tools that make rapid Smart Contracts development possible. It is widely recognized that most smart contracts in use today have been authored in Solidity for the EVM (Ethereum Virtual Machhine).
fr: La machine virtuelle Casper exécute des contrats intelligents qui sont compilés en Webassembly. Il existe deux écosystèmes qui fournissent des cibles (target) de compilation pour Webassembly : Rust et AssemblyScript. CasperLabs fournit des librairies de contrats intelligents pour soutenir le développement dans ces deux langages. Le cœur du développement du protocole Casper se fait en langage Rust et, par conséquent, il existe de nombreux outils Rust qui permettent un développement rapide des contrats intelligents. Il est largement reconnu que la plupart des contrats intelligents utilisés aujourd'hui ont été rédigés en Solidity pour l'EVM (Ethereum Virtual Machhine).
ru: Виртуальная машина Casper выполняет смарт-контракты, которые компилируются в Webassembly. Есть две экосистемы, которые компилируются для в webassembly: Rust и AssemblyScript. CasperLabs предоставляет библиотеки смарт-контрактов для поддержки разработки для обоих этих языков. Основная разработка протокола Casper происходит в Rust, и, как следствие, существует множество инструментов Rust, которые делают возможной быструю разработку смарт-контрактов. Широко признано, что большинство используемых сегодня смарт-контрактов были созданы в Solidity для EVM (Ethereum Virtual Machhine).
tr: Casper Virtual Machine, Webassembly için derlenen akıllı kontratlar çalıştırır. Webassembly için derleme hedefleri sağlayan iki ekosistem vardır: Rust ve AssemblyScript. CasperLabs, bu dillerin her ikisi için de geliştirmeyi desteklemek için akıllı kontrat kitaplıkları sağlar. Casper Protokolünün temel gelişimi Rust'ta gerçekleşiyor ve sonuç olarak, hızlı Akıllı Kontratlar geliştirmeyi mümkün kılan birçok Rust aracı var. Bugün kullanılan akıllı kontratların çoğunun Solidity for the EVM (Ethereum Virtual Machine)'de yazıldığı yaygın olarak kabul edilmektedir.
vi: Máy ảo Casper chạy các hợp đồng thông minh được biên dịch sang Webassembly. Có hai hệ sinh thái cung cấp đíchbiên dịch cho webassembly: Rust và AssemblyScript. CasperLabs cung cấp các thư viện hợp đồng thông minh để hỗ trợ phát triển cho cả hai ngôn ngữ này. Sự phát triển cốt lõi của Giao thức Casper đang diễn ra ở Rust và do đó, có nhiều công cụ Rust giúp cho việc phát triển Hợp đồng thông minh nhanh chóng có thể thực hiện được. Được công nhận rộng rãi rằng hầu hết các hợp đồng thông minh đang được sử dụng ngày nay đều được tạo ra trong Solidity cho EVM (Ethereum Virtual Machine).

source: Without any doubt, the existence and simplicity of Solidity is one of the key factors behind the growth of Ethereum. There is a large group of developers for whom Solidity is still the best tool for expressing their Smart Contract ideas. At CasperLabs we feel a strong connection with the Ethereum community, so we decided to include support for Solidity via a transpiler.
fr: Sans aucun doute, l'existence et la simplicité de Solidity est l'un des facteurs clés de la croissance d'Ethereum. Il existe un grand groupe de développeurs pour qui Solidity reste le meilleur outil pour exprimer leurs idées de contrats intelligents. Chez CasperLabs, nous ressentons un lien fort avec la communauté Ethereum, c'est pourquoi nous avons décidé d'inclure le support de Solidity via un 'transpilateur'.
ru: Без сомнения, емкость и простота Solidity - один из ключевых факторов роста Ethereum. Существует большая группа разработчиков, для которых Solidity по-прежнему является лучшим инструментом для выражения своих идей в смарт-контрактах. В CasperLabs мы чувствуем сильную связь с сообществом Ethereum, поэтому мы решили включить поддержку Solidity с помощью транспилятора.
tr: Hiç şüphesiz, Solidity'nin varlığı ve sadeliği, Ethereum'un büyümesinin arkasındaki kilit faktörlerden biridir. Solidity'nin Akıllı Kontrat fikirlerini ifade etmek için hâlâ en iyi araç olduğu büyük bir geliştirici grubu var. CasperLabs'ta Ethereum topluluğu ile güçlü bir bağ hissediyoruz, bu nedenle bir aktarıcı aracılığıyla Solidity desteğini dahil etmeye karar verdik.
vi: Không nghi ngờ gì nữa, sự tồn tại và đơn giản của Solidity là một trong những yếu tố quan trọng đằng sau sự phát triển của Ethereum. Có một nhóm lớn các nhà phát triển mà Solidity vẫn là công cụ tốt nhất để thể hiện ý tưởng Hợp đồng thông minh của họ. Tại CasperLabs, chúng tôi cảm thấy có mối liên hệ chặt chẽ với cộng đồng Ethereum, vì vậy chúng tôi quyết định đưa vào hỗ trợ cho Solidity thông qua một bộ chuyển mã.

source: Transpiler
fr: Transpilateur
ru: Транспилятор
tr: Aktarıcı
vi: Bộ chuyển mã

source: Transpiling is a well known process of turning code written in one high-level language into another high-level language. At the moment the most popular example is the TypeScript to JavaScript transpiler.
fr: Le transpilage est un processus bien connu qui consiste à transformer du code écrit dans un langage de haut niveau en un autre langage de haut niveau. À l'heure actuelle, l'exemple le plus populaire est le transpilateur TypeScript vers JavaScript.
ru: Транспилирование - это общеизвестный процесс превращения кода, написанного на одном языке высокого уровня, в другой язык высокого уровня. На данный момент наиболее популярным примером является транспилятор TypeScript в JavaScript.
tr: Aktarma, bir yüksek seviyeli dilde yazılmış kodu başka bir yüksek seviyeli dile çevirmek için iyi bilinen bir işlemdir. Şu anda en popüler örnek TypeScript'ten JavaScript'e aktarıcıdır.
vi: Chuyển mã là một quá trình để biến mã được viết bằng một ngôn ngữ cấp cao này thành một ngôn ngữ cấp cao khác. Hiện tại, ví dụ phổ biến nhất là bộ chuyển mã TypeScript sang JavaScript.

source: We have concluded that Solidity support is much easier and efficient to achieve by transpiling Solidity to Rust, rather than by compiling Solidity to WASM bytecode for the following reasons:
fr: Nous avons conclu que le support de Solidity est beaucoup plus facile et efficace à réaliser en transposant Solidity en Rust, plutôt qu'en compilant Solidity en bytecode WASM pour les raisons suivantes :
ru: Мы пришли к выводу, что поддержку Solidity намного проще и эффективнее реализовать путем транспиляции Solidity в Rust, а не компиляции Solidity в байт-код WASM по следующим причинам:
tr: Şu nedenlerle Solidity'yi WASM bayt koduna derlemek yerine, Solidity'yi Rust'a aktararak Solidity desteğini elde etmenin çok daha kolay ve verimli olduğu sonucuna vardık:
vi: Chúng tôi đã kết luận rằng hỗ trợ Solidity dễ dàng hơn và hiệu quả hơn nhiều để đạt được bằng cách chuyển Solidity sang Rust, thay vì biên dịch Solidity sang WASM bytecode vì những lý do sau:

source: Solidity features are easy to express in Rust, which is a much richer language.
fr: Les fonctionnalités de Solidity sont faciles à exprimer en Rust, qui est un langage beaucoup plus riche.
ru: Возможности Solidity легко выразить в Rust, который обладает гораздо большими возможностями.
tr: Çok daha zengin bir dil olan Rust'ta sağlamlık özelliklerinin ifade edilmesi kolaydır.
vi: Các tính năng solidity rất dễ diễn đạt bằng Rust, một ngôn ngữ phong phú hơn nhiều.

source: The shape of CasperLabs DSL is similar to Solidity.
fr: La forme du DSL de CasperLabs est similaire à celle de Solidity.
ru: CasperLabs DSL в многом аналогична Solidity.
tr: CasperLabs DSL'nin şekli Solidity'ye benzer.
vi: Dạng của CasperLabs DSL tương tự như Solidity.

source: The CasperLabs Rust toolchain is something we want to leverage, rather than coding it from scratch.
fr: Nous souhaitons tirer parti de la chaîne d'outils (toolchain) Rust de CasperLabs, plutôt que de la coder à partir de zéro.
ru: Набор инструментов CasperLabs Rust - это то, что мы хотим использовать, а не кодировать с нуля.
tr: CasperLabs Rust araç zinciri, sıfırdan kodlamak yerine kullanmak istediğimiz bir şey.
vi: Chuỗi công cụ CasperLabs Rust là thứ mà chúng tôi muốn tận dụng, thay vì lập trình nó từ đầu.

source: The Casper execution model is different than Ethereum's, therefore it's easier to translate it on the language level, than on the bytecode level.
fr: Le modèle d'exécution de Casper est différent de celui d'Ethereum, il est donc plus facile de le traduire au niveau du langage qu'au niveau du bytecode.
ru: Модель выполнения Casper отличается от модели Ethereum, поэтому ее легче перевести на уровень языка, чем на уровень байт-кода.
tr: Casper yürütme modeli Ethereum'dan farklıdır, bu nedenle onu dil düzeyinde çevirmek bayt kodu düzeyinden daha kolaydır.
vi: Mô hình thực thi của Casper khác với Ethereum, do đó, việc dịch nó ở cấp độ ngôn ngữ sẽ dễ dàng hơn so với cấp độ bytecode.

source: Solidity to Rust Migration
fr: Migration de Solidity à Rust
ru: Миграция с Solidity на Rust
tr: Solidity'den Rust'a Göç
vi: Solidity sang Rust Migration

source: Having transpiler gives Smart Contract developers a powerful tool for the migration of the existing Solidity source code to Rust if they wish to use it.
fr: Le transpilateur offre aux développeurs de contrats intelligents un outil puissant pour la migration du code source existant de Solidity vers Rust s'ils souhaitent l'utiliser.
ru: Наличие транспилятора обеспечивает разработчиков смарт-контрактов мощным инструментом для миграции существующего исходного кода Solidity на Rust, если они хотят его использовать.
tr: Aktarıcıya sahip olmak, Akıllı Kontrat geliştiricilerine, kullanmak isterlerse mevcut Solidity kaynak kodunu Rust'a taşımak için güçlü bir araç sağlar.
vi: Việc có bộ chuyển mã cung cấp cho các nhà phát triển Hợp đồng Thông minh một công cụ mạnh mẽ để chuyển mã nguồn Solidity hiện có sang Rust nếu họ muốn sử dụng nó.

source: Simple Example
fr: Example Simple
ru: Простой пример
tr: Basit Örnek
vi: Ví dụ đơn giản

source: Let's see how the Solidity code is being transpiled to the CasperLabs Rust DSL. There is almost one to one translation of the core components: ``contract``\ , ``constructor`` and ``method``.
fr: Voyons comment le code Solidity est transposé dans le DSL Rust de CasperLabs. Il y a une traduction presque intégrale des composants de base : ```contract``\ , ``constructor`` et ``method``.
ru: Давайте посмотрим, как код Solidity переносится в CasperLabs Rust DSL. Основные компоненты переводятся практически один в один: ``contract``\ , ``constructor`` and ``method``.
tr: Solidity kodunun CasperLabs Rust DSL'ye nasıl aktarıldığını görelim. Temel bileşenlerin neredeyse bire bir çevirisi var: ``contract``\ , ``constructor`` ve ``method``.
vi: Hãy xem cách mã Solidity đang được chuyển sang CasperLabs Rust DSL. Gần như có một bản dịch tương ứng của các thành phần cốt lõi: ``contract``\ , ``constructor`` và ``method``.

source: CasperLabs Rust DSL
fr: Le DSL CasperLabs Rust

source: It is possible to transpile a complex Smart Contracts like ERC20 Token. Full example with tests can be found in this `GitHub repository <https://github.com/casper-ecosystem/erc20>`_.
fr: Il est possible de transpiler un contrat intelligent complexe comme un Token ERC20. Un exemple complet avec des tests peut être trouvé dans ce dépôt `GitHub <https://github.com/casper-ecosystem/erc20>`_.
ru: Можно перенести сложные смарт-контракты, такие как токен ERC20. Полный пример с тестами можно найти по ссылке <https://github.com/casper-ecosystem/erc20>`_.
tr: ERC20 Token gibi karmaşık Akıllı Kontratları aktarmak mümkündür. Testlerle ilgili tam örnek bu `GitHub deposunda <https://github.com/casper-ecosystem/erc20>`_ bulunabilir.
vi: Có thể truyền một Hợp đồng thông minh phức tạp như Token ERC20. Có thể tìm thấy đầy đủ ví dụ về các bài kiểm thử trong `kho chứa GitHub <https://github.com/casper-ecosystem/erc20>`_.

source: Deploying to Testnet.
fr: Déploiement sur Testnet.
ru: Развертывание в Testnet.
tr: Testnet'e dağıtma.
vi: Triển khai Mạng thử nghiệm

source: Take a look at the deployment instructions in the dApp developer guide for details.
fr: Pour plus de détails, consultez les instructions de déploiement dans le guide du développeur de dApp.
ru: Ознакомьтесь с инструкциями по развертыванию в руководстве разработчика dApp для получения подробной информации.
tr: Ayrıntılar için dApp geliştirici kılavuzundaki dağıtım talimatlarına bakın.
vi: Hãy xem hướng dẫn triển khai trong hướng dẫn dành cho nhà phát triển dApp để biết chi tiết.
