Repository: casper-network/docs-archive
Catalog: locale/*/LC_MESSAGES/dapp-dev-guide/testing.po
Languages: fr, ru, tr, vi

source: Testing Contracts
fr: Test des Contrats
ru: Тестирование контрактов
tr: Kontratları Test Etmek
vi: Kiểm thử Hợp đồng

source: As part of the Casper local Rust contract development environment we provide an in-memory virtual machine you can run your contract against. A full node is not required for testing. The testing framework is designed to be used in the following way:
fr: Dans le cadre de l'environnement de développement du contrat local Rust de Casper, nous fournissons une machine virtuelle embarquée sur laquelle vous pouvez exécuter votre contrat. Un nœud complet n'est pas nécessaire pour les tests. Le cadre de test est conçu pour être utilisé de la manière suivante :
ru: В рамках локальной среды разработки контрактов на Rust Casper мы предоставляем виртуальную машину в памяти, с которой вы можете выполнять свой контракт. Для тестирования полная нода не требуется. Среда тестирования предназначена для использования следующим образом:
tr: Casper yerel Rust kontrat geliştirme ortamının bir parçası olarak, kontratı çalıştırabileceğiniz bir bellek içi sanal makine sağlıyoruz. Test için tam bir düğüm gerekli değildir. Test çatısı aşağıdaki şekilde kullanılmak üzere tasarlanmıştır:
vi: Là một phần của môi trường phát triển hợp đồng Rust cục bộ trên Casper, chúng tôi cung cấp một máy ảo trong bộ nhớ mà bạn có thể chạy hợp đồng của mình. Một nút đầy đủ không cần thiết để thử nghiệm. Nền tảng thử nghiệm được thiết kế để sử dụng theo cách sau:

source: Initialize the system (context).
fr: Initialiser le système (context).
ru: Инициализировать систему (контекст).
tr: Sistemi başlatın (bağlam).
vi: Khởi tạo hệ thống (ngữ cảnh).

source: Deploy or call the smart contract.
fr: Déployer ou appeler le contrat intelligent.
ru: Развернуть смарт-контракт.
tr: Akıllı kontratı dağıtın veya çağırın.
vi: Triển khai hoặc gọi hợp đồng thông minh.

source: Query the context for changes and assert the result data matches expected values.
fr: Interroger le contexte pour détecter les changements et vérifier que les données du résultat correspondent aux valeurs attendues.
ru: Запросите контекст на предмет изменений и подтвердите, что данные результата соответствуют ожидаемым значениям.
tr: Değişiklikler için bağlamı sorgulayın ve sonuç verilerinin beklenen değerlerle eşleştiğini teyit edin.
vi: Truy vấn ngữ cảnh cho các thay đổi và xác nhận dữ liệu kết quả khớp với các giá trị mong đợi.

source: It is also possible to create build scripts with this environment and set up continuous integration for contract code.\ :raw-html-m2r:`<br>` This environment enables the testing of blockchain enabled systems from end to end.
fr: Il est également possible de créer des scripts de construction (build scripts) avec cet environnement et de mettre en place une intégration continue pour le contrat code.\ :raw-html-m2r:`<br>` Cet environnement permet de tester de bout en bout les systèmes compatibles avec la blockchain.
ru: Также можно создавать сценарии сборки с этой средой и настраивать непрерывную интеграцию для кода контракта. \ :raw-html-m2r:`1` Эта среда позволяет тестировать системы с поддержкой блокчейн от начала до конца.
tr: Bu ortamla derleme betikleri oluşturmak ve kontrat kodu için sürekli entegrasyon kurmak da mümkündür.\ :raw-html-m2r:`<br>` Bu ortam, blokzincir etkin sistemlerin uçtan uca test edilmesini sağlar.
vi: Cũng có thể tạo script xây dựng với môi trường này và thiết lập tích hợp liên tục cho mã hợp đồng.\ :raw-html-m2r:`<br>` Môi trường này cho phép thử nghiệm các hệ thống hỗ trợ blockchain từ đầu đến cuối.

source: The TestContext for Rust Contracts
fr: Le TestContext pour les contrats Rust
ru: TestContext for Rust контрактов
tr: Rust Kontratları için TestContext
vi: TestContext cho Hợp đồng Rust

source: A `TestContext <https://docs.rs/casper-engine-test-support/latest/casper_engine_test_support/struct.TestContext.html>`_ provides a virtual machine instance. It should be a mutable object as its internal data will change with each deploy. It's also important to set an initial balance for the account to use for deploys, as the system requires a balance in order to create an account.
fr: Un `TestContext <https://docs.rs/casper-engine-test-support/latest/casper_engine_test_support/struct.TestContext.html>`_ fournit une instance de machine virtuelle. Il doit s'agir d'un objet mutable, car ses données internes changeront à chaque déploiement. Il est également important de configurer un solde initial pour le compte à utiliser pour les déploiements, car le système requiert un solde pour créer un compte.
ru: `TestContext <https://docs.rs/casper-engine-test-support/latest/casper_engine_test_support/struct.TestContext.html>`_ предоставляет экземпляр виртуальной машины. Это должен быть мутабельный объект, поскольку его внутренние данные будут изменяться при каждом развертывании. Также важно установить начальный баланс для учетной записи, которая будет использоваться для развертывания, поскольку системе требуется баланс для создания учетной записи.
tr: Bir `TestContext <https://docs.rs/casper-engine-test-support/latest/casper_engine_test_support/struct.TestContext.html>`_ bir sanal makine örneği sağlar. Dahili verileri her dağıtımda değişeceğinden, değişken bir nesne olmalıdır. Sistem bir hesap oluşturmak için bir bakiye gerektirdiğinden, hesabın dağıtımlarda kullanması için bir başlangıç ​​bakiyesi ayarlamak da önemlidir.
vi: `TestContext <https://docs.rs/casper-engine-test-support/latest/casper_engine_test_support/struct.TestContext.html>`_ cung cấp một phiên bản máy ảo. Nó phải là một đối tượng có thể thay đổi vì dữ liệu bên trong của nó sẽ thay đổi với mỗi lần triển khai. Điều quan trọng là phải đặt dự phòng ban đầu cho tài khoản để sử dụng cho các đợt triển khai, vì hệ thống yêu cầu số dư để tạo tài khoản.

source: Account is type of ``[u8; 32]``. Balance is type of ``U512``.
fr: Le compte (Account) est de type ``[u8; 32]``. Le solde (Balance) est de type ``U512``.
ru: Тип акаунта - ``[u8; 32]``. Тип баланса - ``U512``.
tr: Hesap ``[u8; 32]`` türündedir. Bakiye ``U512`` türündedir.
vi: Tài khoản là kiểu ``[u8; 32]``. Số dư là kiểu ``U512``.

source: Running the Rust Smart Contract
fr: Exécution du Smart Contract Rust
ru: Выполнение Rust смарт контракта
tr: Rust Akıllı Kontratını Çalıştırmak
vi: Chạy Hợp đồng Thông minh Rust

source: Before the contract can be deployed to the context, the request has to be prepared. A request is referred to as a `Session <https://docs.rs/casper-engine-test-support/latest/casper_engine_test_support/struct.Session.html>`_. Each session call has 4 elements:
fr: Avant de déployer le contrat dans le contexte, la requête (request) doit être préparée. Une requête est appelée `Session <https://docs.rs/casper-engine-test-support/latest/casper_engine_test_support/struct.Session.html>`_. Chaque session d'appel se compose de 4 éléments :
ru: Прежде чем контракт можно будет развернуть в контексте, необходимо подготовить запрос. Запрос обозначается как `Session <https://docs.rs/casper-engine-test-support/latest/casper_engine_test_support/struct.Session.html>`_. Каждая сессия должна содержать 4 элемента:
tr: Kontrat bağlama dağıtılabilir olmadan önce talebin hazırlanmış olması gerekir. Bir istek, `Oturum <https://docs.rs/casper-engine-test-support/latest/casper_engine_test_support/struct.Session.html>`_ olarak adlandırılır. Her oturum çağrısı 4 öğeye sahiptir:
vi: Trước khi hợp đồng có thể được triển khai đến ngữ cảnh, yêu cầu phải được chuẩn bị. Một yêu cầu được gọi là `Session <https://docs.rs/casper-engine-test-support/latest/casper_engine_test_support/struct.Session.html>`_. Mỗi cuộc gọi phiên có 4 phần tử:

source: A Wasm file path.
fr: Un chemin de fichier Wasm.
ru: Путь к Wasm файлу.
tr: Bir Wasm dosya yolu.
vi: Đường dẫn tệp Wasm.

source: A list of arguments.
fr: Une liste d'arguments.
ru: Список агрументов.
tr: Bir argümanlar listesi.
vi: Danh sách các đối số.

source: The account context for execution.
fr: Le contexte du compte pour l'exécution.
ru: Контекст акаунта для выполнения.
tr: Yürütme için hesap bağlamı.
vi: Tài khoản ngữ cảnh để thực thi.

source: The list of keys that authorize the call.
fr: La liste des clés qui autorisent l'appel.
ru: Список ключей авторизации запроса.
tr: Aramayı yetkilendiren anahtarların listesi.
vi: Danh sách các khoá cho phép cuộc gọi.

source: Here is an example of a prepared request:
fr: Voici un exemple de requête préparée :
ru: Пример подготовленного запроса:
tr: İşte bir hazırlanmış istek örneği:
vi: Dưới đây là một ví dụ về một yêu cầu đã chuẩn bị:

source: Executing ``run`` will panic if the code execution fails.
fr: L'exécution de ``run`` produira un code 'panic' si l'exécution du code échoue.
ru: Выполнение ```run`` выведет сообщения об ошибке, если выполнение кода не удастся.
tr: Kod yürütme başarısız olursa ``run`` yürütmek panik yapacaktır.
vi: Việc thực thi ``run`` sẽ gây lo ngại nếu quá trình thực thi mã không thành công.

source: Query and Assert
fr: Requête et Assertion
ru: Запрос и подтверждение
tr: Sorgula ve Teyit Et
vi: Truy vấn và Xác thực

source: The smart contract creates a new value ``"hello world"`` under the key ``"special_value"``. Using the ``query`` function it's possible to extract this value from the global state of the blockchain.
fr: Le contrat intelligent crée une nouvelle valeur ``"hello world"`` sous la clé ``"special_value"``. En utilisant la fonction ``query``, il est possible d'extraire cette valeur de l'état global de la blockchain.
ru: Смарт-контракт создает новое значение``"hello world"`` с ключом``"special_value"`` Используя функцию ``query`` , можно извлечь это значение из глобального состояния блокчейн.
tr: Akıllı kontrat, ``"special_value"`` anahtarının altında yeni bir ``"hello world"`` değeri oluşturur. ``query`` işlevini kullanarak bu değeri blokzincirinin küresel durumundan çıkarmak mümkündür.
vi: Hợp đồng thông minh tạo ra một giá trị mới ``"hello world"`` dưới khóa ``"special_value"``. Sử dụng hàm ``query``, bạn có thể trích xuất giá trị này từ trạng thái toàn cục của chuỗi khối.

source: Note that the ``expected_value`` is a ``String`` type lifted to the ``Value`` type. It was also possible to map ``returned_value`` to the ``String`` type.
fr: Noter que la ``expected_value`` est de type ``String`` élevé au type ``Value``. Il était également possible de faire mapper ``returned_value`` au type ``String``.
ru: Обратите внимание, что ``expected_value`` - это тип ``String``, преобразованный в тип ``Value`` . Также было возможно сопоставить ``returned_value`` с типом ``String``.
tr: ``expected_value`` türünün ``Value`` türüne yükseltilmiş bir ``String`` türü olduğuna unutmayın. Ayrıca, ``returned_value`` değerini ``String`` türüne eşlemek de mümkündü.
vi: Lưu ý rằng ``expected_value`` là kiểu ``String`` được nâng lên thành kiểu ``Value``. Cũng có thể ánh xạ ``returned_value`` thành kiểu ``String``.

source: Final Test
fr: Test Final
ru: Финальный тест
tr: Son Test
vi: Kiểm thử lần cuối

source: The code below is the simple test generated by `cargo-casper <https://crates.io/crates/cargo-casper>`_ (found in ``tests/src/integration_tests.rs`` of a project created by the tool).
fr: Le code ci-dessous est le test simple généré par `cargo-casper <https://crates.io/crates/cargo-casper>`_ (trouvé dans ``tests/src/integration_tests.rs`` d'un projet crée par l'outil).
ru: Приведенный ниже код представляет собой простой тест, сгенерированный `cargo-casper <https://crates.io/crates/cargo-casper>`_ (находится в ``tests/src/integration_tests.rs`` сгенерированного проекта)
tr: Aşağıdaki kod, `cargo-casper <https://crates.io/crates/cargo-casper>`_ tarafından oluşturulan basit testtir (araç tarafından oluşturulan bir projenin ``tests/src/integration_tests.rs`` kısmı içinde bulunur).
vi: Đoạn mã dưới đây là bài kiểm thử đơn giản được tạo bởi `cargo-casper <https://crates.io/crates/cargo-casper>`_ (trong ``tests/src/integration_tests.rs`` của một dự án được tạo bởi công cụ).
