Repository: casper-network/docs-archive
Catalog: locale/*/LC_MESSAGES/dapp-dev-guide/writing-contracts/assemblyscript.po
Languages: fr, tr, vi

source: CasperLabs maintains the `casper-contract <https://www.npmjs.com/package/casper-contract>`_ to allow developers to create smart contracts using `AssemblyScript <https://www.npmjs.com/package/assemblyscript>`_. The package source is hosted in the `main Casper Network repository <https://github.com/casper-network/casper-node/tree/master/smart_contracts/contract_as/assembly>`_.
fr: CasperLabs maintient le `casper-contract <https://www.npmjs.com/package/casper-contract>`_ pour permettre aux développeurs de créer des contrats intelligents en utilisant `AssemblyScript <https://www.npmjs.com/package/assemblyscript>`_. La source du package est hébergée dans le `dépôt principal du réseau Casper <https://github.com/casper-network/casper-node/tree/master/smart_contracts/contract_as/assembly>`_.
tr: CasperLabs, geliştiricilerin `AssemblyScript <https://www.npmjs.com/package/assemblyscript>`_ kullanarak akıllı kontratlar oluşturmasına olanak sağlamak için `casper-contract <https://www.npmjs.com/package/casper-contract>`_ı muhafaza eder. Paket kaynağı, `ana Casper Network kod deposu <https://github.com/casper-network/casper-node/tree/master/smart_contracts/contract_as/assembly>`_. içinde barındırılır.
vi: CasperLabs duy trì `casper-contract <https://www.npmjs.com/package/casper-contract>`_ để cho phép các nhà phát triển tạo các hợp đồng thông minh bằng cách sử dụng `AssemblyScript <https://www.npmjs.com/package/assemblyscript>`_. Nguồn của gói được lưu trữ trong `kho chứa chính Casper Network <https://github.com/casper-network/casper-node/tree/master/smart_contracts/contract_as/assembly>`_.

source: Installation
tr: Kurulum
vi: Cài đặt

source: For each smart contract, it is necessary to create a project directory and initialize it.
fr: Pour chaque contrat intelligent, il est nécessaire de créer un répertoire de projet et de l'initialiser.
tr: Her akıllı kontrat için bir proje dizini oluşturmak ve onu başlatmak gereklidir.
vi: Đối với mỗi hợp đồng thông minh, cần tạo một thư mục dự án và khởi tạo nó.

source: The ``npm init`` process prompts for various details about the project. Answer as you see fit, but you may safely default everything except ``name``, which needs to be specified. In this guide, we will refer to the contract name as ``your-contract-name``.
fr: Le process ``npm init`` demande divers détails sur le projet. Répondre comme on l'entend, mais on mettre des valeurs par défaut sauf pour ``name``, qui doit être spécifié. Dans ce guide, nous nous référerons au nom du contrat en tant que ``your-contract-name``.
tr: ``npm init`` işlemi, proje hakkında çeşitli ayrıntılar için istekte bulunur. Uygun gördüğünüz gibi yanıtlayın, ancak belirtilmesi gereken ``name`` dışında her şeyi güvenle varsayılan yapabilirsiniz. Bu kılavuzda, kontrat adına ``your-contract-name`` olarak atıfta bulunacağız.
vi: Tiến trình ``npm init`` gợi nhắc các chi tiết khác nhau về dự án. Có thể trả lời khi bạn thấy phù hợp, nhưng bạn có thể để mặc định mọi thứ một cách an toàn, ngoại trừ cần chỉ định ``name``. Trong hướng dẫn này, chúng tôi sẽ gọi tên hợp đồng là ``your-contract-name``.

source: Then install AssemblyScript and this package in the project directory.
fr: Ensuite, installer AssemblyScript et ce paquet dans le répertoire du projet.
tr: Ardından AssemblyScript ve bu paketi proje dizinine kurun.
vi: Sau đó cài đặt AssemblyScript và để trong thư mục dự án.

source: Contract API Documentation
fr: Documentation sur les API Contrat
tr: Kontrat API Belgelendirmesi
vi: Tài liệu API của hợp đồng

source: The Assemblyscript contract API documentation can be found at https://www.npmjs.com/package/casper-contract.
fr: La documentation de l'API contrat Assemblyscript est disponible à l'adresse https://www.npmjs.com/package/casper-contract.
tr: AssemblyScript kontrat API Belgelendirmesi https://www.npmjs.com/package/casper-contract adresinde bulunabilir
vi: Bạn có thể tìm thấy tài liệu API của hợp đồng Assemblyscript tại https://www.npmjs.com/package/casper-contract.

source: Usage
tr: Kullanım
vi: Sử dụng

source: Add script entries for AssemblyScript to your project's ``package.json``. Note that your contract name is used for the name of the WASM file. Replace *your-contract-name* with the name of your contract.
fr: Ajouter des entrées de script pour AssemblyScript au ``package.json`` du projet. Noter que le nom de votre contrat est utilisé pour le nom du fichier WASM. Remplacer *your-contract-name* par le nom de du contrat.
tr: Projenizin ``package.json`` dosyasına AssemblyScript için betik girdileri ekleyin. Kontrat adınızın WASM dosyasının adı için kullanıldığını unutmayın. *your-contract-name* kısmını kontrat adınız ile değiştirin.
vi: Thêm các mục nhập script cho AssemblyScript vào ``package.json`` dự án của bạn. Lưu ý rằng tên hợp đồng của bạn được sử dụng cho tên của tệp WASM. Thay thế *your-contract-name* bằng tên hợp đồng của bạn.

source: In the project root, create an ``index.js`` file with the following contents. Replace *your-contract-name* with the name of your contract.
fr: Dans la racine du projet, créer un fichier ``index.js`` avec le contenu suivant. Remplacer *your-contract-name* par le nom du contrat.
tr: Proje kökünde, aşağıdaki içeriğe sahip bir ``index.js`` dosyası oluşturun. *your-contract-name* kısmını kontrat adınız ile değiştirin.
vi: Trong thư mục gốc của dự án, hãy tạo tệp ``index.js`` với nội dung sau. Thay thế *your-contract-name* bằng tên hợp đồng của bạn.

source: Next, create a directory called ``assembly``, and in that directory, create a file called ``tsconfig.json`` in the following way:
fr: Ensuite, créer un répertoire appelé ``assembly``, et dans ce répertoire, créer un fichier appelé ``tsconfig.json`` de la manière suivante :
tr: Ardından, ``assembly`` adında bir dizin oluşturun ve bu dizinde aşağıdaki şekilde ``tsconfig.json`` adında bir dosya oluşturun:
vi: Tiếp theo, tạo một thư mục có tên là ``assembly`` và trong thư mục đó, tạo một tệp có tên là ``tsconfig.json`` theo cách sau:

source: Sample smart contract
fr: Exemple de contrat intelligent
tr: Örnek akıllı kontrat
vi: Ví dụ hợp đồng thông minh

source: In the ``assembly`` directory, also create an ``index.ts`` file, where the code for the contract needs to go.
fr: Dans le répertoire ``assembly``, créer également un fichier ``index.ts``, qui contiendra le code du contrat.
tr: ``assembly`` dizininde, kontrat için olan kodun gitmesi gereken bir ``index.ts`` dosyası da oluşturun.
vi: Trong thư mục ``assembly``, cũng tạo một tệp ``index.ts``, nơi chứa mã cho hợp đồng.

source: You can use the following sample snippet, which demonstrates a simple smart contract that immediately returns an error and writes a message to a block when executed on the Casper Network.
fr: Vous pouvez utiliser l'exemple suivant, qui présente un contrat intelligent simple qui renvoie immédiatement une erreur et écrit un message dans un bloc lorsqu'il est exécuté sur le réseau Casper.
tr: Casper Network'te yürütüldüğünde hemen bir hata döndüren ve bir bloğa mesaj yazan basit bir akıllı kontrat gösteren aşağıdaki örnek parçacığı kullanabilirsiniz.
vi: Bạn có thể sử dụng đoạn mã mẫu sau, minh họa một hợp đồng thông minh đơn giản ngay lập tức trả về lỗi và ghi thông báo vào một khối khi được thực thi trên Mạng Casper.

source: If you prefer a more complicated first contract, you can look at example contracts on the `Casper Ecosystem GitHub <https://github.com/casper-ecosystem>`_ repository for inspiration.
fr: Pour avoir un exemple de contrat plus complexe, on peut consulter les exemples de contrats dans le dépôt Github `Casper Ecosystem GitHub <https://github.com/casper-ecosystem>`_ pour s'en inspirer.
tr: Daha karmaşık bir ilk kontrat tercih ederseniz, ilham almak için `Casper Ecosystem GitHub <https://github.com/casper-ecosystem>`_ kod deposundaki örnek kontratlara bakabilirsiniz.
vi: Nếu bạn thích hợp đồng đầu tiên phức tạp hơn, bạn có thể xem các hợp đồng mẫu trên kho lưu trữ `GitHub hệ sinh thái Casper<https://github.com/casper-ecosystem>`_ để tìm cảm hứng.

source: Compile to WASM
fr: Compiler en WASM
tr: WASM'e Derleme
vi: Biên dịch sang WASM

source: To compile the contract to WASM, use *npm* to run the *asbuild* script from the project root:
fr: Pour compiler le contrat en WASM, utiliser *npm* pour exécuter le script *asbuild* à partir de la racine du projet :
tr: Sözleşmeyi WASM'e derlemek için, proje kökünden olan *asbuild* betiğini çalıştırmak için *npm* kullanın:
vi: Để biên dịch hợp đồng sang WASM, hãy sử dụng *npm* để chạy script *asbuild* từ gốc dự án:

source: If the build is successful, there will be a ``dist`` folder in the ``root`` folder and in it should be ``your-contract-name.wasm``.
fr: Si la compilation est réussie, il y aura un dossier ``dist`` dans le dossier ``root`` et il devrait contenir ``your-contract-name.wasm``.
tr: Derleme başarılı olursa, ``root`` klasörünün içerisinde bir ``dist`` klasörü olacak ve bunun içinde ```your-contract-name.wasm`` olmalıdır.
vi: Nếu xây dựng thành công, sẽ có một thư mục ``dist`` trong thư mục ``root`` và trong đó phải là `your-contract-name.wasm``.
