Repository: casper-network/docs-archive
Catalog: locale/*/LC_MESSAGES/dapp-dev-guide/writing-contracts/writing-rust-contracts.po
Languages: fr, tr, vi

source: This section explains step by step how to write a new smart contract on Casper. Start with ``main.rs`` from the previous section.
fr: Cette section explique étape par étape comment écrire un nouveau contrat intelligent sur Casper. Commencez par le fichier ``main.rs`` de la section précédente.
tr: Bu bölüm adım adım Casper'da yeni bir akıllı kontratın nasıl yazılacağını açıklar. Önceki bölümden ``main.rs`` ile başlayın.
vi: Phần này giải thích từng bước cách viết hợp đồng thông minh mới trên Casper. Bắt đầu với `` main.rs '' từ phần trước.

source: A Basic Smart Contract in Rust
fr: Contrat Intelligent de base en Rust
tr: Rust'ta Temel Bir Akıllı Kontrat
vi: Hợp đồng Thông minh cơ bản trong Rust

source: The Casper VM executes a smart contract by calling the ``call`` function specified in the contract. If the function is missing, the smart contract is not valid. The simplest possible example is an empty ``call`` function.
fr: La VM Casper exécute un contrat intelligent en appelant la fonction ``call`` spécifiée dans le contrat. Si la fonction est manquante, le contrat intelligent n'est pas valide. L'exemple le plus simple possible est une fonction ``call`` vide.
tr: Casper VM, kontratta belirtilen ``call`` işlevini çağırarak bir akıllı kontrat yürütür. İşlev eksikse akıllı kontrat geçerli değildir. Mümkün olan en basit örnek, boş bir ``call`` işlevidir.
vi: Máy ảo Casper thực thi hợp đồng thông minh bằng cách gọi hàm ``call`` được chỉ định trong hợp đồng. Nếu thiếu chức năng, hợp đồng thông minh không hợp lệ. Ví dụ đơn giản nhất có thể là một hàm ``call`` trống.

source: The ``#[no_mangle]`` attribute prevents the compiler from changing (mangling) the function name when converting to the binary format of Wasm. Without it, the VM exits with the error message: ``Module doesn't have export call``.
fr: L'attribut ``#[no_mangle]`` empêche le compilateur de changer le nom de la fonction (mangling) lors de la conversion au format binaire de Wasm. Sans cet attribut, la VM s'arrête avec le message d'erreur : ``Module doesn't have export call``.
tr: ``#[no_mangle]`` özelliği, derleyicinin Wasm ikili biçimine dönüştürürken işlev adını değiştirmesini (mangling) engeller. Onsuz, VM şu hata mesajını verir: ``Modül dışa aktarma çağrısına sahip değil``.
vi: Thuộc tính ``# [no_mangle] `` ngăn trình biên dịch thay đổi (mangling) tên hàm khi chuyển đổi sang định dạng nhị phân của Wasm. Nếu không có nó, máy ảo sẽ thoát với thông báo lỗi: ``Mô-đun không có hàm call export``.

source: Arguments
tr: Argümanlar
vi: Đối số

source: It's possible to pass arguments to smart contracts. To leverage this feature, use `runtime::get_named_arg <https://docs.rs/casper-contract/latest/casper_contract/contract_api/runtime/fn.get_named_arg.html>`_.
fr: Il est possible de passer des arguments aux contrats intelligents. Pour tirer parti de cette fonctionnalité, utiliser `runtime::get_named_arg <https://docs.rs/casper-contract/latest/casper_contract/contract_api/runtime/fn.get_named_arg.html>`_.
tr: Akıllı kontratlara argümanlar iletmek mümkündür. Bu özellikten yararlanmak için `runtime::get_named_arg <https://docs.rs/casper-contract/latest/casper_contract/contract_api/runtime/fn.get_named_arg.html>`_ kullanın.
vi: Có thể chuyển các đối số cho các hợp đồng thông minh. Để tận dụng tính năng này, hãy sử dụng `runtime::get_named_arg <https://docs.rs/casper-contract/latest/casper_contract/contract_api/runtime/fn.get_named_arg.html>`_.

source: Storage
fr: Stockage
tr: Depolama
vi: Lưu trữ

source: Saving and reading values to and from the blockchain is a manual process in Casper. It requires more code to be written, but also provides a lot of flexibility. The storage system works similarly to a file system in an operating system. Let's say we have a string ``"Hello Casper!"`` that needs to be saved. To do this, use the text editor, create a new file, paste the string in and save it under a name in some directory. The pattern is similar on the Casper blockchain. First you have to save your value to the memory using `storage::new_uref <https://docs.rs/casper-contract/latest/casper_contract/contract_api/storage/fn.new_uref.html>`_. This returns a reference to the memory object that holds the ``"Hello Casper!"`` value. You could use this reference to update the value to something else. It's like a file. Secondly you have to save the reference under a human-readable string using `runtime::put_key <https://docs.rs/casper-contract/latest/casper_contract/contract_api/runtime/fn.put_key.html>`_. It's like giving a name to the file. The following function implements this scenario:
fr: L'écriture et la lecture de valeurs sur la blockchain est un processus manuel dans Casper. Il nécessite l'écriture de plus de code, mais offre également beaucoup de flexibilité. Le système de stockage fonctionne de manière similaire à un système de fichiers dans un système d'exploitation. Disons que nous avons une chaîne de caractères "Hello Casper !" qui doit être sauvegardée. Pour ce faire, utiliser un éditeur de texte, créer un nouveau fichier, y coller la chaîne et l'enregistrer sous un nom dans un répertoire quelconque. Le schéma est similaire sur la blockchain Casper. Tout d'abord, on doit enregistrer la valeur dans la mémoire en utilisant `storage::new_uref <https://docs.rs/casper-contract/latest/casper_contract/contract_api/storage/fn.new_uref.html>`_. Cela renvoie une référence à l'objet mémoire qui contient la valeur "Hello Casper !". on pourrait utiliser cette référence pour mettre à jour la valeur en quelque chose d'autre. C'est comme un fichier. Ensuite, on doit enregistrer la référence sous une chaîne de caractères lisible en utilisant `runtime::put_key <https://docs.rs/casper-contract/latest/casper_contract/contract_api/runtime/fn.put_key.html>`_. C'est comme donner un nom au fichier. La fonction suivante met en œuvre ce scénario :
tr: Blokzincire ve blokzincirden değerleri kaydetmek ve okumak Casper'da manuel bir işlemdir. Yazılması için daha fazla kod gerektirir, ancak aynı zamanda çok fazla esneklik sağlar. Depolama sistemi, bir işletim sistemindeki dosya sistemine benzer şekilde çalışır. Diyelim ki kaydetmemiz gereken bir ``"Merhaba Casper!"`` dizgemiz var. Bunu yapmak için metin düzenleyiciyi kullanın, yeni bir dosya oluşturun, dizeyi yapıştırın ve bir dizinde bir ad altında kaydedin. Model, Casper blokzincirindekine benzer. Öncelikle `storage::new_uref <https://docs.rs/casper-contract/latest/casper_contract/contract_api/storage/fn.new_uref.html>`_ kullanarak değerinizi belleğe kaydetmelisiniz. Bu, ``"Merhaba Casper!"`` değerini tutan bellek nesnesine bir başvuru döndürür. Değeri başka bir şeye güncellemek için bu referansı kullanabilirsiniz. Bir dosya gibi. İkinci olarak, `runtime::put_key <https://docs.rs/casper-contract/latest/casper_contract/contract_api/runtime/fn.put_key.html>`_ kullanarak referansı insan tarafından okunabilir bir dize altına kaydetmeniz gerekir. Dosyaya bir isim vermek gibi. Aşağıdaki işlev bu senaryoyu uygular:
vi: Lưu và đọc các giá trị đến và đi từ chuỗi khối là một quy trình thủ công trong Casper. Nó đòi hỏi viết nhiều mã hơn, nhưng cũng cung cấp rất nhiều tính linh hoạt. Hệ thống lưu trữ hoạt động tương tự như hệ thống tệp trong hệ điều hành. Giả sử chúng ta có một chuỗi ``"Hello Casper!"`` cần được lưu. Để thực hiện việc này, hãy sử dụng trình soạn thảo văn bản, tạo một tệp mới, dán chuỗi vào và lưu nó dưới một tên trong thư mục nào đó. Mô hình tương tự trên blockchain Casper. Đầu tiên, bạn phải lưu giá trị của mình vào bộ nhớ bằng cách sử dụng ``storage::new_uref <https://docs.rs/casper-contract/latest/casper_contract/contract_api/storage/fn.new_uref.html>`_. Điều này trả về một tham chiếu đến đối tượng bộ nhớ có giá trị `` "Hello Casper!" ``. Bạn có thể sử dụng tham chiếu này để cập nhật giá trị cho một thứ khác. Nó giống như một tệp. Thứ hai, bạn phải lưu tham chiếu dưới một chuỗi mà con người có thể đọc được bằng cách sử dụng `rruntime::put_key <https://docs.rs/casper-contract/latest/casper_contract/contract_api/runtime/fn.put_key.html>`_. Nó giống như việc đặt tên cho tệp. Hàm sau thực hiện kịch bản này:

source: After this function is executed, the context (Account or Smart Contract) will have the content of the ``value`` stored under ``KEY`` in its named keys space. The named keys space is a key-value storage that every context has. It's like a home directory.
fr: Après l'exécution de cette fonction, le contexte (compte ou contrat intelligent) aura le contenu de la ``value`` stockée sous ``KEY`` dans son espace de clés nommé. L'espace des clés nommées est un stockage clé-valeur que chaque contexte possède. C'est comme un répertoire personnel.
tr: Bu işlev yürütüldükten sonra, bağlam (Hesap veya Akıllı Kontrat), adlandırılmış anahtar alanında ``KEY`` altında depolanan ``value``nun içeriğine sahip olacaktır. Adlandırılmış anahtarlar alanı, her bağlamın sahip olduğu bir anahtar-değer deposudur. Ev dizini gibi.
vi: Sau khi chức năng này được thực thi, ngữ cảnh (Tài khoản hoặc Hợp đồng thông minh) sẽ có nội dung của ``value`` được lưu trữ dưới ``KEY`` trong không gian khóa được đặt tên của nó. Không gian khóa được đặt tên là nơi lưu trữ khóa-giá trị mà mọi ngữ cảnh đều có. Nó giống như một thư mục chính.

source: Final Smart Contract
fr: Contrat intelligent final
tr: Nihai Akıllı Kontrat
vi: Hợp đồng thông minh cuối

source: The code below is the simple contract generated by `cargo-casper <https://crates.io/crates/cargo-casper>`_ (found in ``contract/src/main.rs`` of a project created by the tool). It reads an argument and stores it in the memory under a key named ``"special_value"``.
fr: Le code ci-dessous est le contrat simple généré par `cargo-casper <https://crates.io/crates/cargo-casper>`_ (trouvé dans ``contract/src/main.rs`` d'un projet créé par l'outil). Il lit un argument et le stocke en mémoire sous une clé nommée ``"special_value"``.
tr: Aşağıdaki kod, `cargo-casper <https://crates.io/crates/cargo-casper>`_ (oluşturulan projenin ``contract/src/main.rs`` dizininde bulunur) tarafından oluşturulan basit kontrattır. Bir argümanı okur ve bunu hafızada ``"special_value"``. adlı bir anahtar altında saklar.
vi: Đoạn mã dưới đây là hợp đồng đơn giản được tạo bởi `cargo-casper <https://crates.io/crates/cargo-casper>`_ (trong ``contract/src/main.rs`` của một dự án được tạo bởi dụng cụ). Nó đọc một đối số và lưu trữ nó trong bộ nhớ dưới một khóa có tên là ``"special_value"``.

source: Using Error Codes
fr: Utilisation des codes d'erreur
tr: Hata Kodlarını Kullanmak
vi: Sử dụng mã lỗi

source: The Casper VM supports error codes in smart contracts. A contract can stop execution and exit with a given error via the `runtime::revert <https://docs.rs/casper-contract>`_ function:
fr: La VM Casper supporte les codes d'erreur dans les contrats intelligents. Un contrat peut arrêter son exécution et sortir avec une erreur donnée via la fonction `runtime::revert <https://docs.rs/casper-contract>`_ :
tr: Casper VM, akıllı kontratlardaki hata kodlarını destekler. Bir kontrat yürütmeyi durdurabilir ve `runtime::revert <https://docs.rs/casper-contract>`_ işlevi aracılığıyla verilen bir hatayla çıkabilir:
vi: Casper VM hỗ trợ mã lỗi trong hợp đồng thông minh. Hợp đồng có thể ngừng thực thi và thoát với một lỗi nhất định thông qua hàm `runtime::revert <https://docs.rs/casper-contract>`_:

source: Casper has `several built-in error variants <https://crates.io/crates/casper-types/latest/casper_types/>`_ , but it's possible to create a custom set of error codes for your smart contract. These can be passed to `runtime::revert <https://docs.rs/casper-contract/latest/casper_contract/contract_api/runtime/fn.revert.html>`_ via `ApiError::User(<your error code>) <https://docs.rs/casper-types/latest/casper_types/enum.ApiError.html#variant.User>`_.
fr: Casper dispose de `plusieurs variantes d'erreur intégrées <https://crates.io/crates/casper-types/latest/casper_types/>`_ , mais il est possible de créer un ensemble personnalisé de codes d'erreur pour votre contrat intelligent. Ceux-ci peuvent être passés à `runtime::revert <https://docs.rs/casper-contract/latest/casper_contract/contract_api/runtime/fn.revert.html>`_ via `ApiError::User'(<your error code>) <https://docs.rs/casper-types/latest/casper_types/enum.ApiError.html#variant.User>`_.
tr: Casper'ın birkaç `yerleşik hata çeşidi <https://crates.io/crates/casper-types/latest/casper_types/>`_ vardır, ancak akıllı kontratınız için özel bir dizi hata kodu oluşturmak mümkündür. Bunlar, `ApiError::User(<your error code>) <https://docs.rs/casper-types/latest/casper_types/enum.ApiError.html#variant.User>`_ aracılığıyla `runtime::revert <https://docs.rs/casper-contract/latest/casper_contract/contract_api/runtime/fn.revert.html>`_ e iletilibilirler.
vi: Casper có `` một số biến thể lỗi tích hợp sẵn <https://crates.io/crates/casper-types/latest/casper_types/>`_, nhưng bạn có thể tạo một bộ mã lỗi tùy chỉnh cho hợp đồng thông minh của mình. Chúng có thể được chuyển tới `runtime::revert <https://docs.rs/casper-contract/latest/casper_contract/contract_api/runtime/fn.revert.html>`_ thông qua `ApiError::User(<your error code>) <https://docs.rs/casper-types/latest/casper_types/enum.ApiError.html#variant.User>`_.

source: When a contract exits with an error code, the exit code is visible in the Block Explorer.
fr: Lorsqu'un contrat se termine avec un code d'erreur, le code de sortie est visible dans l'explorateur de blocs.
tr: Bir kontrat bir hata koduyla çıktığında, çıkış kodu Blok Tarayıcısı'nda görünür.
vi: Khi hợp đồng thoát với mã lỗi, mã thoát sẽ hiển thị trong Block Explorer.

source: Tests
tr: Testler
vi: Kiểm thử

source: As part of the Casper local environment we provide the in-memory virtual machine you can run your contract against. The testing framework is designed to be used in the following way:
fr: Dans le cadre de l'environnement local Casper, nous fournissons la machine virtuelle embarquée en mémoire sur laquelle vous pouvez exécuter votre contrat. Le cadre de test est conçu pour être utilisé de la manière suivante :
tr: Casper yerel ortamının bir parçası olarak, kontratınızı çalıştırabileceğiniz bellek içi sanal makineyi sağlıyoruz. Test çerçevesi aşağıdaki şekilde kullanılmak üzere tasarlanmıştır:
vi: Là một phần của môi trường cục bộ Casper, chúng tôi cung cấp máy ảo trong bộ nhớ mà bạn có thể chạy theo hợp đồng của mình. Khung kiểm thử được thiết kế để sử dụng theo cách sau:

source: Initialize the context.
fr: Initialiser le contexte.
tr: Bağlamı başlatın
vi: Khởi tạo ngữ cảnh.

source: Deploy or call the smart contract.
fr: Déployer ou appeler le contrat intelligent.
tr: Akıllı kontratı dağıtın veya çağırın.
vi: Triển khai hoặc gọi hợp đồng thông minh.

source: Query the context for changes and assert the result data matches expected values.
fr: Interroger le contexte pour détecter les changements et vérifier que les données du résultat correspondent aux valeurs attendues.
tr: Değişiklikler için bağlamı sorgulayın ve sonuç verilerinin beklenen değerlerle eşleştiğini teyit edin.
vi: Truy vấn ngữ cảnh cho các thay đổi và xác nhận dữ liệu kết quả khớp với các giá trị mong đợi.

source: A `TestContext <https://docs.rs/casper-engine-test-support/latest/casper_engine_test_support/struct.TestContext.html>`_ provides a virtual machine instance. It should be a mutable object as we will change its internal data while making deploys. It's also important to set an initial balance for the account to use for deploys.
fr: Un `TestContext <https://docs.rs/casper-engine-test-support/latest/casper_engine_test_support/struct.TestContext.html>`_ fournit une instance de machine virtuelle. Il doit s'agir d'un objet mutable, car ses données internes changeront à chaque déploiement. Il est également important de configurer un solde initial pour le compte à utiliser pour les déploiements, car le système requiert un solde pour créer un compte.
tr: `TestContext <https://docs.rs/casper-engine-test-support/latest/casper_engine_test_support/struct.TestContext.html>`_, bir sanal makine örneği sağlar. Dağıtım yaparken dahili verilerini değiştireceğimiz için değiştirilebilir bir nesne olmalıdır. Hesabın dağıtımlar için kullanması maksadıyla bir başlangıç bakiyesi ayarlamak da önemlidir.
vi: `TestContext <https://docs.rs/casper-engine-test-support/latest/casper_engine_test_support/struct.TestContext.html>`_ cung cấp một phiên bản máy ảo. Nó phải là một đối tượng có thể thay đổi vì chúng tôi sẽ thay đổi dữ liệu bên trong của nó trong khi triển khai. Điều quan trọng là phải đặt số dư ban đầu cho tài khoản để sử dụng cho các đợt triển khai.

source: Account is type of ``[u8; 32]``. Balance is type of ``U512``.
fr: Le compte (Account) est de type ``[u8; 32]``. Le solde (Balance) est de type ``U512``.
tr: Hesap ``[u8; 32]`` türündedir. Bakiye ``U512`` türündedir.
vi: Tài khoản là kiểu ``[u8; 32]``. Số dư là kiểu ``U512``.

source: Run Smart Contract
fr: Exécuter le contrat intelligent
tr: Akıllı Kontratı Çalıştır
vi: Chạy Hợp đồng Thông minh

source: Before we can deploy the contract to the context, we need to prepare the request. We call the request a `Session <https://docs.rs/casper-engine-test-support/latest/casper_engine_test_support/struct.Session.html>`_. Each session call should have 4 elements:
fr: Avant de déployer le contrat dans le contexte, la requête (request) doit être préparée. Une requête est appelée `Session <https://docs.rs/casper-engine-test-support/latest/casper_engine_test_support/struct.Session.html>`_. Chaque session d'appel se compose de 4 éléments :
tr: Kontratı bağlama yerleştirmeden önce talebi hazırlamamız gerekir. Talebi bir `Oturum <https://docs.rs/casper-engine-test-support/latest/casper_engine_test_support/struct.Session.html>`_ olarak adlandırıyoruz. Her oturum çağrısının 4 unsuru olmalıdır:
vi: Trước khi có thể triển khai hợp đồng với ngữ cảnh, chúng ta cần chuẩn bị yêu cầu. Chúng ta gọi yêu cầu là phiên (`Session <https://docs.rs/casper-engine-test-support/latest/casper_engine_test_support/struct.Session.html>`_). Mỗi cuộc gọi phiên phải có 4 phần tử:

source: Wasm file path.
fr: Un chemin de fichier Wasm.
tr: Wasm dosya yolu.
vi: Đường dẫn tệp Wasm

source: List of arguments.
fr: Une liste d'arguments.
tr: Argümanlar listesi.
vi: Danh sách đối số

source: Account context of execution.
fr: Le contexte du compte pour l'exécution.
tr: Yürütmenin hesap bağlamı.
vi: Ngữ cảnh tài khoản thực thi.

source: List of keys that authorize the call. See: TODO insert keys management link.
fr: Liste des clés qui autorisent l'appel. Voir : TODO insérer le lien vers la gestion des clés.
tr: Aramayı yetkilendiren anahtarların listesi. Bakınız: YAPILACAKLAR anahtar yönetimi bağlantısı ekleyin.
vi: Danh sách các khoá cho phép cuộc gọi. Xem: TODO thêm liên kết quản lý khóa.

source: Executing ``run`` will panic if the code execution fails.
fr: L'exécution de ``run`` produira un code 'panic' si l'exécution du code échoue.
tr: Kod yürütme başarısız olursa ``run`` yürütmek panik yapacaktır.
vi: Việc thực thi ``run`` sẽ gây lo lắng nếu quá trình thực thi mã không thành công.

source: Query and Assert
fr: Requête et Assertion
tr: Sorgula ve Teyit Et
vi: Truy vấn và xác nhận

source: The smart contract we deployed creates a new value ``"hello world"`` under the key ``"special_value"``. Using the ``query`` function it's possible to extract this value from the blockchain.
fr: Le contrat intelligent crée une nouvelle valeur ``"hello world"`` sous la clé ``"special_value"``. En utilisant la fonction ``query``, il est possible d'extraire cette valeur de l'état global de la blockchain.
tr: Dağıttığımız akıllı kontrat, ``"special_value"`` anahtarının altında yeni bir``"hello world"`` değeri oluşturur. Sorgu işlevini kullanarak bu değeri blokzincirden çıkarmak mümkündür.
vi: Hợp đồng thông minh mà chúng tôi đã triển khai tạo ra một giá trị mới ```"hello world"`` dưới khoá ``"special_value"``. Sử dụng hàm ``query``, bạn có thể trích xuất giá trị này từ chuỗi khối.

source: Note that the ``expected_value`` is a ``String`` type lifted to the ``Value`` type. It was also possible to map ``returned_value`` to the ``String`` type.
fr: Noter que la ``expected_value`` est de type ``String`` élevé au type ``Value``. Il était également possible de faire mapper ``returned_value`` au type ``String``.
tr: ``expected_value`` değerin, ``Value`` türüne yükseltilmiş bir ``String`` türü olduğuna dikkat edin. ``returned_value`` değerini ``String`` türüne eşlemek de mümkündü.
vi: Lưu ý rằng ``expected_value`` là kiểu``String`` được nâng lên thành kiểu ``Value``. Cũng có thể ánh xạ ``returned_value`` thành kiểu ``String``.

source: Final Test
fr: Test Final
tr: Son Test
vi: Lần kiểm thử cuối cùng

source: The code below is the simple test generated by `cargo-casper <https://crates.io/crates/cargo-casper>`_ (found in ``tests/src/integration_tests.rs`` of a project created by the tool).
fr: Le code ci-dessous est le test simple généré par `cargo-casper <https://crates.io/crates/cargo-casper>`_ (trouvé dans ``tests/src/integration_tests.rs`` d'un projet crée par l'outil).
tr: Aşağıdaki kod, `cargo-casper <https://crates.io/crates/cargo-casper>`_ tarafından oluşturulan basit testtir (oluşturulan bir projenin ``tests/src/integration_tests.rs`` dosyasında bulunur).
vi: Đoạn mã dưới đây là bài kiểm thử đơn giản được tạo bởi `cargo-casper <https://crates.io/crates/cargo-casper>`_ (trong ``tests/src/integration_tests.rs`` của một dự án được tạo bởi dụng cụ).

source: WASM File Size
fr: Taille du fichier WASM
tr: WASM Dosya Boyutu
vi: Kích thước tệp WASM

source: We encourage shrinking the WASM file size as much as possible. Smaller deploys cost less and save the network bandwidth. We recommend reading `Shrinking .wasm Code Size <https://rustwasm.github.io/docs/book/reference/code-size.html>`_ chapter of `The Rust Wasm Book <https://rustwasm.github.io/docs/book/>`_.
fr: Nous encourageons la réduction de la taille du fichier WASM autant que possible. Les déploiements plus petits coûtent moins cher et économisent la bande passante du réseau. Nous recommandons de lire le chapitre `Shrinking .wasm Code Size <https://rustwasm.github.io/docs/book/reference/code-size.html>`_ de `The Rust Wasm Book <https://rustwasm.github.io/docs/book/>`_.
tr: WASM dosya boyutunu mümkün olduğunca küçültmenizi öneririz. Daha küçük dağıtımlar daha az maliyetlidir ve ağ bant genişliğinden tasarruf sağlar. `The Rust Wasm Book <https://rustwasm.github.io/docs/book/>`_ un `Shrinking .wasm Code Size <https://rustwasm.github.io/docs/book/reference/code-size.html>`_ bölümünü okumanızı öneririz.
vi: Chúng tôi khuyến khích thu nhỏ kích thước tệp WASM càng nhiều càng tốt. Các triển khai nhỏ hơn có chi phí thấp hơn và tiết kiệm băng thông mạng. Chúng tôi khuyên bạn nên đọc chương `Shrinking .wasm Code Size <https://rustwasm.github.io/docs/book/reference/code-size.html>`_ của The Rust Wasm Book <https://rustwasm.github.io/docs/book/>`_.
