Repository: casper-network/docs-archive
Catalog: locale/*/LC_MESSAGES/disclaimer.po
Languages: tr

source: **Disclaimer**
tr: **Sorumluluk Reddi**

source: By accepting this CasperLabs Tech Spec (this "**Whitepaper**"), each recipient hereof acknowledges and agrees that is not authorised to, and may not, forward or deliver this Whitepaper, electronically or otherwise, to any other person or reproduce this Whitepaper in any manner whatsoever. Any forwarding, distribution or reproduction of this Whitepaper in whole or in part is unauthorised. Failure to comply with this directive may result in a violation of applicable laws of any affected or involved jurisdiction.
tr: Bu CasperLabs Tech Spec (bu "**Rapor**") belgesini kabul ederek, bu belgenin her bir alıcısı, bu Raporu elektronik olarak veya başka bir şekilde başka birisine iletme veya dağıtma yetkisi olmadığını kabul ve beyan eder. Bu Raporun tamamen veya kısmen iletilmesi, dağıtılması veya çoğaltılması yasaktır. Bu direktife uyulmaması, etkilenen veya ilgili yargı merciinin yürürlükteki yasalarının ihlaline neden olabilir.

source: Nothing in this Whitepaper constitutes an offer to sell, or a solicitation to purchase, the tokens native to the Casper blockchain (“**CSPR**”). In any event, were this Whitepaper to be deemed to be such an offer or solicitation, no such offer or solicitation is intended or conveyed by this Whitepaper in any jurisdiction where it is unlawful to do so, where such an offer or solicitation would require a license or registration, or where such an offer or solicitation is subject to restrictions. In particular, any CSPR to be issued have not been, and, as of the date of issuance of this Whitepaper, are not intended to be, registered under the securities or similar laws of any jurisdiction, whether or not such jurisdiction considers the CSPR to be a security or similar instrument, and specifically, have not been, and, as of the date of issuance of this Whitepaper are not intended to be, registered under the U.S. Securities Act of 1933, as amended, or the securities laws of any state of the United States of America or any other jurisdiction and may not be offered or sold in any jurisdiction where to do so would constitute a violation of the relevant laws of such jurisdiction.
tr: Bu Rapordaki hiçbir şey, Casper blokzincirine (“**CSPR**”) özgü token'leri satma teklifi veya satın alma talebi teşkil etmez. Buna karşın, bu Rapor böyle bir teklif veya talep olarak kabul edilirse, böyle bir teklif veya talep kasti değildir veya böyle bir teklif veya talebin lisans veya kayıt gerektireceği, böyle bir teklif veya talebin kısıtlamalara tabi olduğu, herhangi bir yargı makamı tarafından yasadışı olduğu durumda, bu teklif veya talep bu Rapor tarafından iletilmemiştir. Özellikle, bu Rapor'un düzenlenme tarihi itibarıyle, herhangi bir yargı makamının, ki bu yargı makamı CSPR'yi bir menkul kıymet veya benzeri bir enstrüman olarak değerlendirse dahi, menkul kıymetleri veya benzer yasaları kapsamında tescil edilmemiştir ve özellikle, bu Rapor'un düzenlenme tarihi itibarıyle, düzenlenmiş şekliyle, 1933 ABD Menkul Kıymetler Yasası veya Amerika Birleşik Devletlerinin herhangi bir eyaletinin menkul kıymetler kanunları veya herhangi bir diğer yargı makamı altında tescil edilmemiş, tescili amaçlanmamıştır ve ilgili yasa ve yargı makamlarının ihlaline sebebiyet verecek herhangi bir yargı makamında teklifi ve satışı yapılamaz.

source: This Whitepaper constitutes neither a prospectus according to Art. 652a of the Swiss Code of Obligations (the "**CO**") or Art. 1156 CO nor a prospectus or basic information sheet according to the Swiss Financial Services Act (the "**FinSA**") nor a listing prospectus nor a simplified prospectus according to Art. 5 of the Swiss Collective Investment Schemes Act (the "**CISA**") nor any other prospectus according to CISA nor a prospectus under any other applicable laws.
tr: Bu Rapor, İsviçre Borçlar Hukuku ("**CO**") 652a'ya veya BH 1156 maddesine göre izahname, İsviçre Finansal Hizmetler Yasası'na ("**FinSA**") göre bir izahname veya temel bilgi sayfası, İsviçre Kollektif Yatırım Programı Yasası ("**CISA**") 5. maddesine göre bir liste izahnamesi veya temel izahname ve CISA'ya göre herhangi bir diğer uygulanabilir yasaya göre izahname teşkil etmez.

source: The CSPR are not expected to be instruments in an offer and sale which are subject to the jurisdiction or oversight of the U.S. Securities Exchange Commission (the “**SEC**”). In any event, however, CSPR have not been approved or disapproved by, and are not expected to be approved or disapproved by, the SEC nor by the securities regulatory authority of any state of the United States of America or of any other jurisdiction, and neither the SEC nor any such securities regulatory authority has passed, or is expected to pass, upon the accuracy or adequacy of this Whitepaper.
tr: CSPR'nin, ABD Menkul Kıymetler Borsası Komisyonu'nun ("**SEC**") yargı yetkisine veya denetimine tabi olan bir teklif ve satış aracı olması beklenmemektedir. Bununla birlikte, her halükarda, CSPR, SEC veya Amerika Birleşik Devletleri'nin herhangi bir eyaletinin veya başka herhangi bir yargı makamının menkul kıymetler düzenleyici otoritesi tarafından onaylanmadı ve onaylanması veya onaylanmaması beklenmiyor ve ne SEC ne de bu tür menkul kıymetler düzenleyici otoritesi bu Raporun doğruluğunu veya yeterliliğini onaylamamıştır veya onaylaması beklenmemektedir.

source: The distribution of this Whitepaper and the purchase, holding, and/or disposal of CSPR may be restricted by law in certain jurisdictions. Persons reading this Whitepaper should inform themselves as to (i) the possible tax consequences, (ii) the legal and regulatory requirements, and (iii) any foreign exchange restrictions or exchange control requirements, which they might encounter under the laws of the countries of their citizenship, residence or domi-cile and which might be relevant to the purchase, holding or disposal of CSPR. No action has been taken to authorise the distribution of this Whitepaper in any jurisdiction in which such authorisation might be required.
tr: Bu Raporun dağıtımı ve CSPR'nin satın alınması, elde tutulması ve/veya elden çıkarılması belirli yargı alanlarında kanunla kısıtlanmış olabilir. Bu Raporu okuyan kişiler, vatandaşlık sahibi oldukları, ikamet ettikleri veya yaşadıkları ülkenin yasaları altında karşılaşabilecekleri, CSPR'nin satın alınması, elde tutulması veya elden çıkarılması ile ilgili olabilecek (i) olası vergi sonuçları, (ii) yasal ve düzenleyici gereklilikler ve (iii) ülkelerinin yasaları kapsamında karşılaşabilecekleri herhangi bir kambiyo kısıtlaması veya kambiyo kontrolü gereksinimleri hakkında kendilerini bilgilendirmelidir. Bu Rapor'un bu tür bir yetkilendirmenin gerekli olabileceği herhangi bir yargı bölgesinde dağıtılmasına izin vermek için herhangi bir işlem yapılmamıştır.

source: No action has been or is intended to be taken by CasperLabs Networks AG and/or any of its affiliates in any jurisdiction that would or is intended to, permit a public sale or offering of any CSPR, or possession or distribution of this Whitepaper (in preliminary, proof or final form) or any other sale, offering or publicity material relating to the CSPR, in any country or jurisdiction where action for that purpose is required. Each recipient of this Whitepaper is reminded that it has received this Whitepaper on the basis that it is a person into whose possession this Whitepaper may be lawfully delivered in accordance with the laws of the jurisdiction in which it is located and/or bound and it may not nor is it authorised to deliver this document, electronically or otherwise, to any other person. If the recipient receives this document by e-mail, then its use of this e-mail is at its own risk and it is the recipient’s responsibility to take precautions to ensure that such e-mail is free from viruses and other items of a destructive nature.
tr: CasperLabs Networks AG ve/veya herhangi bir bağlı kuruluşu tarafından, CSPR'nin veya bu Rapor'un (ilk, tespit veya son hali) veya CSPR'nin herhangi bir diğer satışı, teklifi veya aleni malzemesinin sahipliği veya dağıtımına dair bu amaç için eylemin gerektiği herhangi bir ülkede veya yargı bölgesinde herhangi bir eylem alınmamıştır veya alınması planlanmamıştır. Bu Rapor'un her alıcısına, bu Rapor'u, bulunduğu ve/veya bağlı olduğu yargı bölgesinin yasalarına uygun olarak yasal olarak teslim edilebilecek bir kişi olduğu temelinde bu Rapor'u aldığı hatırlatılır ve bu belgeyi elektronik veya başka bir şekilde başka herhangi bir kişiye teslim etmeye yetkili değildir. Alıcı bu belgeyi e-posta ile alırsa, bu e-postayı kullanma riski kendisine aittir ve bu tür e-postanın virüslerden ve diğer yıkıcı öğelerden arındırılmış olmasını sağlamak için önlem almak alıcının sorumluluğundadır.

source: **Preliminary Nature of this Whitepaper**
tr: **Bu Rapor'un Ön Hazırlık Mahiyeti**

source: This Whitepaper is a draft and the information set out herein is of a preliminary nature. Consequently, neither CasperLabs Networks AG nor any of its affiliates assumes any responsibility that the information set out herein is final or correct and each of the foregoing disclaims, to the fullest extent permitted by applicable law, any and all liability whether arising in tort, contract or otherwise in respect of this Whitepaper. Neither this Whitepaper nor anything contained herein shall form the basis of or be relied on in connection with or act as an inducement to enter into any contract or commitment whatsoever. Recipients should note that the final structuring of CSPR and the Casper blockchain is subject to ongoing technical, legal, regulatory and tax considerations and each is, therefore, subject to material changes. In particular, neither the applicability nor the non-applicability of Swiss financial market regulations on the CSPR sale has not been confirmed by the Swiss Financial Market Supervisory Authority ("**FINMA**"). CasperLabs Networks AG and all its affiliates reserve the right to not assist in the completion of the software underlying CSPR and the CasperLabs blockchain, to not participate in the issuance or creation of CSPR or to change the structure of CSPR and/or the Casper blockchain for any reason, each at its sole discretion.
tr: Bu Rapor bir taslaktır ve burada belirtilen bilgiler ön hazırlık mahiyetindedir. Sonuç olarak, ne CasperLabs Networks AG ne de bağlı kuruluşları, burada belirtilen bilgilerin nihai veya doğru olduğuna dair herhangi bir sorumluluk kabul etmez ve yukarıdakilerin her biri, yürürlükteki yasaların izin verdiği en geniş ölçüde, haksız fiilden, sözleşmeden veya bu Rapor'dan kaynaklanan her türlü sorumluluğu reddeder. Ne bu Rapor ne de burada yer alan herhangi bir şey, herhangi bir sözleşme veya taahhüdün temelini oluşturmayacak veya bunlarla bağlantılı olarak güvenilmeyecek veya bir teşvik olarak düşünülmeyecektir. Alıcılar, CSPR ve Casper blokzincirinin nihai yapılandırılmasının devam eden teknik, yasal, düzenleyici ve vergisel hususlara tabi olduğunu ve bu nedenle her birinin maddi değişikliklere tabi olduğunu unutmamalıdır. Özellikle, CSPR satışına ilişkin İsviçre finans piyasası düzenlemelerinin ne uygulanabilirliği ne de uygulanamazlığı İsviçre Mali Piyasa Denetleme Kurumu ("**FINMA**") tarafından teyit edilmemiştir. CasperLabs Networks AG ve tüm bağlı kuruluşları, herhangi bir nedenle, her biri kendi takdirine bağlı olarak, CSPR'nin ve CasperLabs blok zincirinin altında yatan yazılımın tamamlanmasına yardımcı olmama, CSPR'nin yayınlanmasına veya oluşturulmasına katılmama veya CSPR'nin ve/veya Casper blok zincirinin yapısını değiştirme hakkını saklı tutar.

source: **Forward-Looking Statements**
tr: **İleriye Dönük Beyanlar**

source: This Whitepaper includes "forward-looking statements", which are all statements other than statements of historical facts included in this Whitepaper. Words like "believe", "anticipate", "expect", "project", "estimate", "predict", "intend", "target", "assume", "may", "might", "could", "should", "will" and similar expressions are intended to identify such forward-looking statements. Such forward-looking statements involve known and unknown risks, uncertainties and other factors, which may cause the actual functionality, performance or features of the Casper blockchain and/or CSPR to be materially different from any future functionality, performance or features expressed or implied by such forward-looking statements. Such forward-looking statements are based on numerous assumptions regarding the CasperLabs Networks AG’s and/or any of its affiliates’ present and future expectations regarding the development of the Casper blockchain and the associated software.
tr: Bu Rapor, tamamı bu Rapor'da yer alan tarihsel olguların ifadeleri dışında "ileriye dönük ifadeler" içermektedir. "İnanmak", "tahmin etmek", "beklemek", "öngörmek", "niyet etmek", "hedeflemek", "varsaymak", "olabilir", "olabilirdi", "olmalı", "olacak", "gerekir", "olacak" gibi kelimeler ve benzeri ifadeler, bu tür ileriye dönük ifadeleri tanımlamayı amaçlamaktadır. Bu tür ileriye dönük beyanlar, Casper blokzincirinin ve/veya CSPR'nin gerçek işlevselliğinin, performansının veya özelliklerinin, tarafından ifade edilen veya ima edilen gelecekteki işlevsellik, performans veya özelliklerden önemli ölçüde farklı olmasına neden olabilecek bilinen ve bilinmeyen riskleri, belirsizlikleri ve diğer faktörleri içerir. Bu tür ileriye dönük beyanlar, CasperLabs Networks AG'nin ve/veya herhangi bir bağlı kuruluşunun Casper blokzincirinin ve ilgili yazılımın geliştirilmesine ilişkin mevcut ve gelecekteki beklentilerine ilişkin çok sayıda varsayıma dayanmaktadır.

source: These forward-looking statements speak only as of the date of this Whitepaper. CasperLabs Networks AG and its affiliates expressly disclaim any obligation or undertaking to release any updates of or revisions to any forward-looking statement contained herein to reflect any change in CasperLabs Networks AG’s and/or any of its affiliates’ expectations with regard thereto or any change in events, conditions or circumstances on which any such statement is based.
tr: Bu ileriye dönük beyanlar yalnızca bu Rapor'un yayınlandığı tarihten itibaren geçerlidir. CasperLabs Networks AG ve bağlı kuruluşları, CasperLabs Networks AG'nin ve/veya herhangi bir bağlı kuruluşunun bununla ilgili beklentilerindeki herhangi bir değişikliği veya herhangi bir değişikliği yansıtmak için burada yer alan herhangi bir ileriye dönük beyanda herhangi bir güncelleme veya revizyon yayınlama yükümlülüğünü veya taahhüdünü, bu tür herhangi bir beyanın dayandığı olaylar, koşullar veya durumlarda, açıkça reddeder.

source: **Risk Factors**
tr: **Risk Faktörleri**

source: Furthermore, by accepting this Whitepaper, the recipient of hereof (the “**Recipient**”) acknowledges and agrees that it understands the inherent risks associated with blockchain and distributed ledger technology, tokens and cryptocurrencies in general and the CSPR in particular, including, but not limited to, those outlined hereinafter.
tr: Ayrıca, bu Rapor'u kabul etmekle, bu belgenin alıcısı ("**Alıcı**") blokzinciri ve dağıtık defter teknolojisi, genel olarak token'ler ve kripto para birimleri ve özel olarak CSPR ile ilişkili ve bunlarla sınırlı olmamak üzere, aşağıda özetlenen riskleri anladığını kabul ve beyan eder.

source: **Risks associated with CasperLabs Networks AG’s experience**: the Recipient is aware that CasperLabs Networks AG and its affiliates constitute a start-up group of companies. Inability of such companies to manage their affairs, including any failure to attract and retain appropriate personnel, could affect the completion and functionality of the Casper blockchain.
tr: **CasperLabs Networks AG'nin deneyimiyle ilişkili riskler**: Alıcı, CasperLabs Networks AG ve bağlı kuruluşlarının bir start-up şirketler grubu oluşturduğunun farkındadır. Bu tür şirketlerin, uygun personeli çekme ve elinde tutmadaki herhangi bir başarısızlık da dahil olmak üzere işlerini yönetememeleri, Casper blok zincirinin tamamlanmasını ve işlevselliğini etkileyebilir.

source: **Risks associated with CSPR relative value**: the Recipient understands and accepts that a purchaser of CSPR may experience financial losses relative to other assets, including fiat currency and/or any other cryptocurrency (including any cryptocurrency used to acquire CSPR). Potential purchasers and holders of CSPR are urged to carefully review this Whitepaper and assess and understand the risk factors relating to the CSPR and the Casper blockchain before acquiring CSPR (when and if CSPR become available).
tr: **CSPR göreli değeriyle ilişkili riskler**: Alıcı, bir CSPR alıcısının itibari para birimi ve/veya diğer herhangi bir kripto para birimi (CSPR'yi almak için kullanılan herhangi bir kripto para birimi dahil) dahil olmak üzere diğer varlıklara göre mali kayıplar yaşayabileceğini anlar ve kabul eder. CSPR'nin potansiyel alıcıları ve sahiplerinin, CSPR'yi satın almadan önce (CSPR her ne zaman kullanılabilir olursa) bu Rapor'u dikkatlice incelemeleri ve CSPR ve Casper blok zinciriyle ilgili risk faktörlerini değerlendirmeleri ve anlamaları istenmektedir.

source: **Risks associated with (intellectual) property rights**: the Recipient understands and accepts that, due to a lack of originality of the software and to the immaterial character of the CSPR, there may be no title of ownership in and to the intellectual property rights relating to CSPR.
tr: **(Fikri) mülkiyet haklarıyla ilişkili riskler**: Alıcı, yazılımın orijinal olmaması ve CSPR'nin maddi olmayan karakteri nedeniyle, CSPR ile ilgili fikri mülkiyet haklarında ve bunlara ilişkin herhangi bir mülkiyet hakkının olamayacağını anlar ve kabul eder.

source: **Risks associated with blockchain**: the Recipient understands and accepts that the smart contract, the underlying software application and software platform (i.e. the Casper blockchain) is still in an early development stage and unproven. The Recipient understands and accepts that there is no warranty that the process for creating the CSPR and/or the Casper blockchain will be uninterrupted or error-free and acknowledges that there is an inherent risk that the software could contain weaknesses, vulnerabilities or bugs causing, inter alia, the complete loss of CSPR. The Recipient understands and accepts that, after launch of the Casper blockchain, the smart contract and/or underlying protocols and/or the Casper blockchain and/or any other software involved may either delay and/or not execute a contribution due to the overall contribution volume, mining attacks and/or similar events.
tr: **Blok zinciri ile ilişkili riskler**: Alıcı, akıllı kontratın, temeldeki yazılım uygulamasının ve yazılım platformunun (yani Casper blok zinciri) hala erken bir geliştirme aşamasında olduğunu ve kanıtlanmadığını anlar ve kabul eder. Alıcı, CSPR ve/veya Casper blok zinciri oluşturma sürecinin kesintisiz veya hatasız olacağına dair hiçbir garanti olmadığını anlar ve kabul eder ve yazılımın, zayıflıklar, güvenlik açıkları veya hatalara, ilaveten CSPR'nin tamamen kaybına neden olabilecek doğal bir risk olduğunu kabul eder. Alıcı, Casper blok zincirinin başlatılmasından sonra, akıllı kontratın ve/veya temel protokollerin ve/veya Casper blok zincirinin ve/veya ilgili diğer herhangi bir yazılımın, genel katkı hacmi, madencilik saldırıları ve/veya benzer olaylar nedeniyle bir katkıyı geciktirebileceğini ve/veya gerçekleştiremeyebileceğini anlar ve kabul eder.

source: **Risk of weaknesses in the field of cryptography**: the Recipient understands and accepts that cryptography is a technology that evolves relatively fast over time. At the same time, methods and tools to decrypt, access and/or manipulate data stored on a distributed ledger or blockchain are highly likely to progress in parallel and in addition, new technological developments such as quantum computers may pose as of now unpredictable risks to the CSPR and the Casper blockchain that could increase the risk of theft or loss of CSPR (if and when CSPR are created and/or issued).
tr: **Kriptografi alanındaki zayıflık riski**: Alıcı, kriptografinin zaman içinde nispeten hızlı gelişen bir teknoloji olduğunu anlar ve kabul eder. Aynı zamanda, dağıtılmış bir defter veya blok zincirinde depolanan verilerin şifresini çözmeye, bunlara erişmeye ve/veya işlemeye yönelik yöntemler ve araçların paralel olarak ilerleme olasılığı yüksektir ve buna ek olarak, kuantum bilgisayarlar gibi yeni teknolojik gelişmeler, şu andan itibaren, CSPR'nin çalınma veya kaybolma riskini artırabilecek, CSPR ve Casper blok zinciri (CSPR oluşturulduğunda ve/veya verildiğinde) için öngörülemeyen riskler oluşturabilir.

source: **Regulatory risks**: the Recipient understands and accepts that it is possible that certain jurisdictions will apply existing regulations on, or introduce new regulations addressing, distributed ledger technology and/or blockchain technology based applications, which may be contrary to the current setup of the smart contract or the CasperLabs Networks AG project and which may, inter alia, result in substantial modifications of the smart contract and/or the CasperLabs Networks AG project, including its termination and the loss of the CSPR, if and when created and/or issued, or entitlements to receive CSPR, for the Recipient.
tr: **Mevzuata ilişkin riskler**: Alıcı, belirli yargı bölgelerinin, akıllı kontratın veya CasperLabs Networks AG projesinin mevcut kurulumuna aykırı olabilecek, ilaveten akıllı kontratın ve/veya CasperLabs Networks AG projesinde, CSPR'nin veya CSPR almak için istihkakların kapatılması ve kaybını da içeren önemli modifikasyonları ile sonuçlanabilecek dağıtık defter teknolojisi ve/veya blok zinciri teknolojisi tabanlı uygulamalara yönelik mevcut düzenlemeleri uygulayacağını veya yeni düzenlemeler getirebileceğini anlar ve kabul eder.

source: **Risks associated with abandonment / lack of success**: the Recipient understands and accepts that the creation of the CSPR and the development of the Casper blockchain as well as the CasperLabs Networks AG project may be abandoned for a number of reasons, including lack of interest from the public, lack of funding, lack of prospects (e.g. caused by competing projects) and legal, tax or regulatory considerations. The Recipient therefore understands that there is no assurance that, even if the CSPR/CasperLabs blockchain project is partially or fully developed and launched, the Recipient will receive any benefits through the CSPR held by it (if and when created and/or issued).
tr: **Terketme/başarısızlıkla ilişkili riskler**: Alıcı, CSPR'nin oluşturulmasının ve Casper blok zincirinin yanı sıra CasperLabs Networks AG projesinin geliştirilmesinin, halkın ilgisini çekmemesi, finansman eksikliği, umut eksikliği (örneğin rakip projelerden kaynaklanan) ve yasal, vergisel veya düzenleyici hususlar gibi çeşitli nedenlerle terk edilebileceğini anlar ve kabul eder. Bu nedenle Alıcı, CSPR/CasperLabs blok zinciri projesi kısmen veya tamamen geliştirilmiş ve başlatılmış olsa bile, Alıcının sahip olduğu CSPR aracılığıyla (oluşturulduğunda ve/veya yayınlandığında) herhangi bir fayda elde edeceğine dair hiçbir güvence olmadığını anlar.
