Repository: casper-network/docs-archive
Catalog: locale/*/LC_MESSAGES/disclaimer.po
Languages: tr

source: **Risks associated with a loss of private key**: the Recipient understands and accepts that CSPR, if and when created and/or issued, will only be accessed by using a wallet technically compatible with CSPR and with a combination of the Recipient’s account information (address) and private key, seed or password. The Recipient understands and accepts that if its private key or password gets lost or stolen, the CSPR associated with the Recipient's account (address) will be unrecoverable and will be permanently lost.
tr: **Özel anahtarın kaybıyla ilişkili riskler**: Alıcı, CSPR'ye, oluşturulduğunda ve/veya piyasaya çıktığında, yalnızca CSPR ile teknik olarak uyumlu bir cüzdan kullanılarak ve Alıcının hesap bilgileri (adresi) ve özel anahtar, anahtar kelime veya şifrenin bir kombinasyonu ile erişileceğini anlar ve kabul eder. Alıcı, özel anahtarının veya parolasının kaybolması veya çalınması durumunda Alıcının hesabıyla (adresi) ilişkili CSPR'nin kurtarılamayacağını ve kalıcı olarak kaybedileceğini anlar ve kabul eder.

source: **Risks associated with wallets:** the Recipient understands and accepts that CasperLabs Networks AG or any of its affiliates, employees, partners or advisors are in no way responsible for the wallet to which any CSPR are transferred. The Recipient understands and agrees that it is solely responsible for the access and security of its wallet, for any security breach of its wallet and/or with any loss of CSPR resulting from its wallet service provider, including any termination of the service by the wallet provider and/or bankruptcy of the wallet provider.
tr: **Cüzdanlarla ilgili riskler:** Alıcı, CasperLabs Networks AG'nin veya bağlı kuruluşlarının, çalışanlarının, ortaklarının veya danışmanlarının herhangi bir CSPR'nin aktarıldığı cüzdandan hiçbir şekilde sorumlu olmadığını anlar ve kabul eder. Alıcı, cüzdanının erişim ve güvenliğinden, cüzdanının herhangi bir güvenlik ihlalinden ve/veya hizmetin cüzdan sağlayıcı tarafından sonlandırılması ve/veya cüzdan sağlayıcının iflası da dahil olmak üzere, cüzdan hizmet sağlayıcısından kaynaklanan herhangi bir CSPR kaybından yalnızca kendisinin sorumlu olduğunu anlar ve kabul eder.

source: **Risks associated with theft/hacks**: the Recipient understands and accepts that the smart contract, the website, the underlying software application and software platform (i.e. the Casper blockchain), during its development and after its launch, may be exposed to attacks by hackers or other individuals that could result in an inability to launch the Casper blockchain or the theft or loss of CSPR. Any such event could also result in the loss of financial and other support of the CasperLabs Networks AG project impacting the ability to develop the CasperLabs Networks AG project and Casper blockchain.
tr: **Hırsızlık/saldırılarla ilişkili riskler**: Alıcı, akıllı sözleşmenin, web sitesinin, temeldeki yazılım uygulamasının ve yazılım platformunun (yani Casper blok zinciri), geliştirme sırasında ve kullanıma sunulduktan sonra bilgisayar korsanları veya diğer kişiler tarafından ataklara maruz kalabileceğini ve bunun Casper blok zincirine erişememe veya CSPR'nin çalınması veya kaybı ile sonuçlanabileceğini anlar ve kabul eder. Bu tür herhangi bir olay, CasperLabs Networks AG projesinin ve Casper blok zincirinin geliştirilmesi yeteneğini etkileyen CasperLabs Networks AG projesinin mali ve diğer desteğinin kaybına da neden olabilir.

source: **Risks associated with mining attacks**: the Recipient understands and accepts that, as with other cryptocurrencies and tokens, if and when launched, the Casper blockchain is susceptible to attacks relating to validators. Any successful attack presents a risk to the smart contract, expected proper execution and sequencing of transactions, and expected proper execution and sequencing of contract computations.
tr: **Madencilik saldırılarıyla ilişkili riskler**: Alıcı, diğer kripto para birimleri ve token'lerde olduğu gibi, piyasaya sürüldüğünde Casper blokzincirinin doğrulayıcılarla ilgili saldırılara açık olduğunu anlar ve kabul eder. Başarılı herhangi bir saldırı, akıllı kontratta, beklenen düzgün yürütme ve işlemlerin sıralanması ve sözleşme hesaplamalarının beklenen düzgün yürütülmesi ve sıralanması için bir risk oluşturur.

source: **Risks associated with a lack of consensus**: the Recipient understands and accepts that the network of validators will be ultimately in control of the genesis block and future blocks and that there is no warranty or assurance that the network of validators will perform their functions and reach proper consensus and allocate the CSPR to the Recipient as proposed by any terms. The Recipient further understands that a majority of the validators could agree at any point to make changes to the software and/or smart contracts and to run the new version of the software and/or smart contracts. Such a scenario could lead to the CSPR losing intrinsic value.
tr: **Mutabakat eksikliği ile ilişkili riskler**: Alıcı, doğrulayıcılar ağının nihai olarak başlangıç bloğunun ve gelecekteki blokların kontrolünde olacağını ve doğrulayıcılar ağının işlevlerini yerine getireceğine ve uygun fikir birliğine varacağına ve CSPR'yi Alıcıya tahsis edeceğine dair hiçbir garanti veya güvence olmadığını anlar ve kabul eder. Alıcı ayrıca, doğrulayıcıların çoğunluğunun herhangi bir noktada yazılımda ve/veya akıllı kontratlarda değişiklik yapmak ve yazılımın ve/veya akıllı kontratların yeni sürümünü çalıştırmak için anlaşabileceğini anlar. Böyle bir senaryo, CSPR'nin içsel değerini kaybetmesine yol açabilir.

source: **Risks associated with liquidity of CSPR**: the Recipient understands and accepts that with regard to the CSPR, if and when created and/or issued, no market liquidity may be guaranteed and that the value of CSPR relative to other assets, including fiat currency and/or any other cryptocurrency (including any cryptocurrency used to acquire CSPR) over time may experience extreme volatility or depreciate in full (including to zero) resulting in loss that will be borne exclusively by the Recipient.
tr: **CSPR'nin likiditesiyle ilişkili riskler**: Alıcı, oluşturulduğunda ve/veya piyasaya sürüldüğünde, CSPR ile ilgili hiçbir market likiditesinin ve CSPR'nin itibar para birimi ve/veya diğer kripto para birimleri (CSPR alımında kullanılan para birimleri dahil) dahil diğer varlıklara nazaran değerinin garanti edilemeyeceğini, zamanla oldukça fazla dalgalanmaya maruz kalabileceğini, veya tamamen değerden düşebileceğini (sıfır dahil), özellikle Alıcı tarafında kayıplara sebep olabileceğini anlar ve kabul eder.

source: **Risks associated with forking**: the Recipient understands and accepts that hard and soft forks as well as similar events may, inter alia, lead to the creation of new or competing tokens to the CSPR, adversely affect the functionality, convertibility or transferability or result in a full or partial loss of units or reduction (including reduction to zero) of value of the Recipient's CSPR (if and when created and/or issued).
tr: **Çatallanmayla ilgili riskler**: Alıcı sert veya yumuşak çatallanmaların yeni veya CSPR ile yarışan token'ler oluşmasına, fonksiyonlarını, tahvil edilebilirliğini veya transfer edilebilirliğini aleyhinde etkilemesine veya Alıcı'nın CSPR'lerinin (oluşturulduğunda veya piyasaya sürüldüğünde) değerinin tamamen veya kısmen kaybına veya azalmasına (sıfıra düşmesi dahil) neden olabileceğini anlar ve kabul eder.
