Repository: casper-network/docs-archive
Catalog: locale/*/LC_MESSAGES/index.po
Languages: de, fr, vi

source: **Risks associated with theft/hacks**: the Recipient understands and accepts that the smart contract, the website, the underlying software application and software platform (i.e. the Casper blockchain), during its development and after its launch, may be exposed to attacks by hackers or other individuals that could result in an inability to launch the Casper blockchain or the theft or loss of CSPR. Any such event could also result in the loss of financial and other support of the CasperLabs Networks AG project impacting the ability to develop the CasperLabs Networks AG project and Casper blockchain.
de: **Risiken im Zusammenhang mit Diebstahl/Hacks**: Der Empfänger versteht und akzeptiert, dass der Smart Contract, die Website, die zugrunde liegende Softwareanwendung und Softwareplattform (d. h. die Casper-Blockchain) während ihrer Entwicklung und nach ihrer Einführung Angriffen durch Hacker oder andere Personen ausgesetzt sein können, die zu einer Unfähigkeit, die Casper-Blockchain zu starten, oder zum Diebstahl oder Verlust von CSPR führen könnten. Jedes derartige Ereignis könnte auch zum Verlust der finanziellen und sonstigen Unterstützung des Projekts der CasperLabs Networks AG führen und die Fähigkeit zur Entwicklung des Projekts der CasperLabs Networks AG und der Casper-Blockchain beeinträchtigen.
fr: **Risques liés au vol/hacks** : le Bénéficiaire comprend et accepte que le smart contract, le site web, l'application logicielle sous-jacente et la plateforme logicielle (c'est-à-dire la blockchain Casper), pendant son développement et après son lancement, peuvent être exposés à des attaques de hackers ou d'autres individus qui pourraient entraîner une incapacité à lancer la blockchain Casper et le vol ou la perte de jetons CSPR. Un tel événement pourrait également entraîner la perte du soutien financier et autre du projet CasperLabs Networks AG, ce qui aurait un impact sur la capacité à développer le projet CasperLabs Networks AG et la blockchain Casper.
vi: **Rủi ro liên quan đến trộm cắp/tin tặc**: Người nhận hiểu và chấp nhận rằng hợp đồng thông minh, trang web, ứng dụng phần mềm cơ bản và nền tảng phần mềm (tức chuỗi khối Casper), trong quá trình phát triển và sau khi ra mắt, có thể bị tin tặc hoặc các cá nhân khác tấn công và có thể dẫn đến việc không thể khởi chạy chuỗi khối Casper hoặc dẫn tới việc đánh cắp hoặc mất CSPR. Bất kỳ sự kiện nào nêu trên cũng có thể dẫn đến mất nguồn tài chính và các hỗ trợ khác của dự án CasperLabs Networks AG, ảnh hưởng đến khả năng phát triển dự án CasperLabs Networks AG và chuỗi khối Casper.

source: **Risks associated with mining attacks**: the Recipient understands and accepts that, as with other cryptocurrencies and tokens, if and when launched, the Casper blockchain is susceptible to attacks relating to validators. Any successful attack presents a risk to the smart contract, expected proper execution and sequencing of transactions, and expected proper execution and sequencing of contract computations.
de: **Risiken im Zusammenhang mit Mining-Angriffen**: Der Empfänger versteht und akzeptiert, dass die Casper-Blockchain, wie auch andere Kryptowährungen und Token, wenn und sobald sie eingeführt wird, anfällig für Angriffe in Bezug auf Validierer ist. Jeder erfolgreiche Angriff stellt ein Risiko für den Smart Contract, die erwartete ordnungsgemäße Ausführung und Abfolge von Transaktionen und die erwartete ordnungsgemäße Ausführung und Abfolge von Kontrakt Berechnungen dar.
fr: **Risques liés aux attaques de minage** : le Bénéficiaire comprend et accepte que, comme avec d'autres crypto-monnaies et jetons, quand elle est lancée, la blockchain Casper est susceptible de subir des attaques relatives aux validateurs. Toute attaque réussie présente un risque pour le contrat intelligent, pour le séquençage attendus des transactions, ainsi que pour la bonne exécution des calculs du contrat.
vi: **Rủi ro liên quan đến các cuộc tấn công khai thác**: Người nhận hiểu và chấp nhận rằng, cũng như với các loại tiền điện tử và token khác, khi được khởi chạy, chuỗi khối Casper cũng dễ bị tấn công liên quan đến người xác thực. Bất kỳ cuộc tấn công thành công nào đều có rủi ro đối với hợp đồng thông minh, cho dù các hợp đồng đó đã ​​thực hiện đúng và tuần tự các giao dịch.

source: **Risks associated with a lack of consensus**: the Recipient understands and accepts that the network of validators will be ultimately in control of the genesis block and future blocks and that there is no warranty or assurance that the network of validators will perform their functions and reach proper consensus and allocate the CSPR to the Recipient as proposed by any terms. The Recipient further understands that a majority of the validators could agree at any point to make changes to the software and/or smart contracts and to run the new version of the software and/or smart contracts. Such a scenario could lead to the CSPR losing intrinsic value.
de: **Risiken im Zusammenhang mit einem fehlenden Konsens**: Der Empfänger versteht und akzeptiert, dass das Netzwerk der Validierer letztendlich die Kontrolle über den Genesis-Block und zukünftige Blöcke hat und dass es keine Garantie oder Zusicherung gibt, dass das Netzwerk der Validierer seine Aufgaben erfüllt und einen ordnungsgemäßen Konsens erzielt und dem Empfänger CSPR wie in den Bedingungen vorgeschlagen zuweist. Der Empfänger nimmt ferner zur Kenntnis, dass eine Mehrheit der Validatoren zu jedem Zeitpunkt zustimmen könnte, Änderungen an der Software und/oder den Smart Contracts vorzunehmen und die neue Version der Software und/oder der Smart Contracts auszuführen. Ein solches Szenario könnte dazu führen, dass die CSPR ihren Wert verlieren.
fr: **Risques associés à l'absence de consensus** : le destinataire comprend et accepte que le réseau de validateurs aura le contrôle ultime du bloc genesis et des blocs futurs et qu'il n'y a aucune garantie ou assurance que le réseau de validateurs s'acquittera de ses fonctions et parviendra à un consensus approprié et attribuera le CSPR au destinataire comme proposé par les conditions. Le destinataire comprend en outre qu'une majorité des validateurs pourrait convenir à tout moment d'apporter des modifications au logiciel et/ou aux contrats intelligents et d'exécuter la nouvelle version du logiciel et/ou des contrats intelligents. Un tel scénario pourrait entraîner la perte de la valeur intrinsèque du CSPR.
vi: **Rủi ro liên quan đến việc thiếu đồng thuận**: Người nhận hiểu và chấp nhận rằng mạng lưới người xác thực sẽ kiểm soát khối đầu tiên và các khối trong tương lai và không có bảo đảm hoặc cam kết rằng mạng lưới người xác thực sẽ thực hiện các chức năng của mình để đạt được sự đồng thuận thích hợp và phân bổ CSPR cho Người nhận như được đề xuất bởi bất kỳ điều khoản nào. Bên nhận cũng hiểu rằng đa số người xác thực tại bất kỳ thời điểm nào có thể đồng ý thực hiện các thay đổi đối với phần mềm và/hoặc hợp đồng thông minh và chạy phiên bản mới của phần mềm và/hoặc hợp đồng thông minh. Kịch bản này có thể dẫn đến việc CSPR mất đi giá trị nội tại.

source: **Risks associated with liquidity of CSPR**: the Recipient understands and accepts that with regard to the CSPR, if and when created and/or issued, no market liquidity may be guaranteed and that the value of CSPR relative to other assets, including fiat currency and/or any other cryptocurrency (including any cryptocurrency used to acquire CSPR) over time may experience extreme volatility or depreciate in full (including to zero) resulting in loss that will be borne exclusively by the Recipient.
de: **Risiken im Zusammenhang mit der Liquidität der CSPR**: Der Empfänger versteht und akzeptiert, dass in Bezug auf die CSPR, falls und wenn sie erstellt und/oder ausgegeben werden, keine Marktliquidität garantiert werden kann und dass der Wert der CSPR im Verhältnis zu anderen Vermögenswerten, einschließlich Fiat-Währung und/oder anderen Kryptowährungen (einschließlich aller Kryptowährungen, die zum Erwerb von CSPR verwendet werden) im Laufe der Zeit extreme Volatilität erfahren oder vollständig abwerten kann (einschließlich auf Null), was zu Verlusten führt, die ausschließlich vom Empfänger getragen werden.
fr: **Risques liés à la liquidité des CSPR** : le Bénéficiaire comprend et accepte qu'en ce qui concerne les jetons CSPR, quand ils sont créés et/ou émis, aucune liquidité de marché ne peut être garantie et que la valeur des CSPR par rapport à d'autres actifs, y compris la monnaie fiduciaire et/ou toute autre crypto-monnaie (y compris toute crypto-monnaie utilisée pour acquérir des CSPR) au fil du temps peut connaître une volatilité extrême ou se déprécier entièrement (y compris jusqu'à zéro) entraînant une perte qui sera supportée exclusivement par le Bénéficiaire.
vi: **Rủi ro liên quan đến tính thanh khoản của CSPR**: Bên nhận hiểu và chấp nhận rằng đối với CSPR, nếu và khi được tạo ra và/ hoặc phát hành, không thể đảm bảo tính thanh khoản thị trường và không đảm bảo giá trị của CSPR quy đổi sang các tài sản khác, bao gồm cả tiền pháp định và/hoặc bất kỳ loại tiền điện tử nào khác (bao gồm bất kỳ loại tiền điện tử nào được sử dụng để mua CSPR) theo thời gian có thể bị biến động mạnh hoặc mất giá toàn bộ (kể cả bằng 0) dẫn đến tổn thất sẽ do Người nhận chịu.

source: **Risks associated with forking**: the Recipient understands and accepts that hard and soft forks as well as similar events may, inter alia, lead to the creation of new or competing tokens to the CSPR, adversely affect the functionality, convertibility or transferability or result in a full or partial loss of units or reduction (including reduction to zero) of value of the Recipient's CSPR (if and when created and/or issued).
de: **Risiken im Zusammenhang mit Forking**: Der Empfänger versteht und akzeptiert, dass Hard- und Soft-Forks sowie ähnliche Ereignisse unter anderem zur Schaffung neuer oder konkurrierender Token zu CSPR führen, die Funktionalität, Konvertierbarkeit oder Übertragbarkeit beeinträchtigen oder zu einem vollständigen oder teilweisen Verlust von Einheiten oder einer Verringerung (einschließlich einer Verringerung auf Null) des Wertes der CSPR des Empfängers führen können (falls und wenn sie geschaffen und/oder ausgestellt werden).
fr: **Risques associés à la bifurcation (forking)** : le bénéficiaire comprend et accepte que les bifurcations dures et douces ainsi que des événements similaires peuvent, entre autres, conduire à la création de nouveaux jetons ou de jetons concurrents aux CSPR, affecter négativement la fonctionnalité, la convertibilité ou la transmissibilité ou entraîner une perte totale ou partielle d'unités ou une réduction (y compris une réduction à zéro) de la valeur des CSPR du bénéficiaire (si et quand ils sont créés et/ou émis).
vi: **Rủi ro liên quan đến việc phân nhánh**: Bên nhận hiểu và chấp nhận rằng các phân nhánh mềm và cứng cũng như các sự kiện tương tự có thể dẫn đến việc tạo ra các token mới hoặc cạnh tranh với CSPR, ảnh hưởng xấu đến chức năng, khả năng chuyển đổi hoặc khả năng chuyển nhượng hoặc dẫn đến mất toàn bộ hoặc một phần hoặc giảm (kể cả giảm xuống 0) giá trị CSPR của Người nhận (nếu và khi CSPR được tạo ra và/hoặc phát hành).

source: Casper Documentation
de: Casper Dokumentation
fr: Documentation Casper

source: We present the Casper Network, a new Turing-complete smart-contract platform, backed by a Proof-of-Stake (PoS) consensus algorithm and WebAssembly (wasm). The network is a permissionless, decentralized, public blockchain. The consensus protocol is called Highway, and the complete paper is found in GitHub: https://github.com/CasperLabs/highway. The consensus protocol allows clients to use different confidence thresholds to convince themselves that a given block is *finalized*. This protocol is built on Vlad Zamfir's `correct-by-construction (CBC) Casper <https://github.com/cbc-casper/cbc-casper-paper>`_ research.
de: Wir stellen das Casper-Netzwerk vor, eine neue Turing-komplette Smart-Contract-Plattform, die durch einen Proof-of-Stake (PoS)-Konsensalgorithmus und WebAssembly (wasm) unterstützt wird. Das Netzwerk ist eine erlaubnisfreie, dezentralisierte, öffentliche Blockchain. Das Konsensprotokoll heißt Highway, und die vollständige Arbeit ist auf GitHub zu finden: https://github.com/CasperLabs/highway. Das Konsensprotokoll erlaubt es Clients, verschiedene Vertrauensschwellenwerte zu verwenden, um sich davon zu überzeugen, dass ein bestimmter Block *finalisiert* ist. Dieses Protokoll baut auf der Forschung von Vlad Zamfir's `correct-by-construction (CBC) Casper <https://github.com/cbc-casper/cbc-casper-paper>`_ auf.
fr: Nous présentons le réseau Casper, une nouvelle plateforme de contrats intelligents complète, soutenue par un algorithme de consensus Proof-of-Stake (PoS) et WebAssembly (wasm). Le réseau est une blockchain publique, décentralisée et sans permission (permissionless). Le protocole de consensus s'appelle Highway, et le document complet se trouve sur GitHub : https://github.com/CasperLabs/highway. Le protocole de consensus permet aux clients d'utiliser différents seuils de confiance pour se convaincre qu'un bloc donné est *finalisé*. Ce protocole s'appuie sur les recherches de Vlad Zamfir sur le système Casper `correct-by-construction (CBC) <https://github.com/cbc-casper/cbc-casper-paper>`_.

source: Rust is the primary programming language for smart contracts on the Casper blockchain because of its good support for compilation to wasm. However, the platform does not make assumptions about the source language and supports libraries facilitating contract development in other programming languages having wasm as a compile target. Other essential features include an account permissions model that allows the recovery of lost keys and a permissions model to securely share state between accounts and contracts (without expensive cryptographic checks). We also provide discussions of the economics of our proof-of-stake implementation and our token policies.
de: Rust ist die primäre Programmiersprache für Smart-Contracts auf der Casper-Blockchain, da sie eine gute Unterstützung für die Kompilierung als WebAssembly bietet. Die Plattform macht jedoch keine Annahmen über die Programmiersprache und unterstützt Bibliotheken, die die Entwicklung von Kontrakten als WebAssembly ermöglichen. Weitere wesentliche Funktionen sind ein Kontoberechtigungsmodell, das die Wiederherstellung verlorener Schlüssel ermöglicht, und ein Berechtigungsmodell zum sicheren Teilen des Zustands zwischen Konten und Kontrakten (ohne aufwendige kryptographische Prüfungen). Wir bieten auch Diskussionen über die Ökonomie unserer Proof-of-Stake-Implementierung und unsere Token-Politik.
fr: Rust est le principal langage de programmation des contrats intelligents sur la blockchain Casper en raison de sa bonne prise en charge de la compilation vers wasm. Cependant, la plateforme ne fait pas d'hypothèses sur le langage source et prend en charge des bibliothèques facilitant le développement de contrats dans d'autres langages de programmation ayant wasm comme cible de compilation. Parmi les autres caractéristiques essentielles, citons un modèle de permissions pour les comptes qui permet de récupérer les clés perdues et un modèle de permissions pour partager en toute sécurité l'état entre les comptes et les contrats (sans contrôles cryptographiques coûteux). Nous discutons également de l'économie de notre implémentation de preuve d'enjeu (POS) et de nos politiques de jetons.
