Repository: casper-network/docs-archive
Catalog: locale/*/LC_MESSAGES/index.po
Languages: de, fr, vi

source: Welcome to the Casper Network
vi: Chào mừng đến với Mạng Casper

source: This article provides an overview of the Casper project.
vi: Bài viết này cung cấp một cái nhìn tổng quan về dự án Casper.

source: What is Casper?
vi: Casper là gì?

source: Casper is a new Turing-complete smart-contracting platform, backed by a Proof-of-Stake (PoS) consensus algorithm and WebAssembly (WASM). The network is a permissionless, decentralized, public blockchain.
vi: Casper là một nền tảng hợp đồng thông minh mới, theo quy tắc Turing-complete, được hỗ trợ bởi thuật toán đồng thuận Proof-of-Stake (PoS) và WebAssembly (WASM). Mạng Casper (Casper Network) là một chuỗi khối blockchain công khai, phi tập trung và không cần cấp phép.

source: The network's consensus protocol is called `Highway <https://arxiv.org/pdf/2101.02159.pdf>`_, and it has several benefits over classic Byzantine Fault Tolerant (BFT) consensus protocols. First, Highway allows networks to reach higher thresholds of *finality*, meaning that more blocks are finalized, and validators agree to add them to the blockchain. Second, the protocol achieves flexibility by expressing block finality in ways not possible in BFT models. This protocol is built on Vlad Zamfir's `correct-by-construction (CBC) Casper <https://github.com/cbc-casper/cbc-casper-paper>`_ research.
vi: Giao thức đồng thuận của mạng Casper có tên là `Highway <https://arxiv.org/pdf/2101.02159.pdf>`_, đem lại một số lợi ích vượt trội so với giao thức đồng thuận cổ điển Byzantine Fault Tolerant (BFT). Thứ nhất, Highway cho phép các mạng đạt đến ngưỡng cuối cùng (*finality*) cao hơn, có nghĩa là giúp nhiều khối được hoàn thiện hơn và người xác thực đồng ý thêm các khối này vào chuỗi khối blockchain. Thứ hai, giao thức này rất linh hoạt nhờ việc giúp đạt được tính cuối cùng của khối mà các mô hình BFT không thể làm được. Giao thức này được xây dựng dựa trên nghiên cứu `correct-by-construction (CBC) Casper <https://github.com/cbc-casper/cbc-casper-paper>`_ của Vlad Zamfir.

source: Additionally, the Casper Network is optimized for enterprise and developer adoption. While leveraging blockchain technology, the network seeks to accelerate business operations via unique features like predictable network fees, upgradeable contracts, on-chain governance, privacy flexibility, and developer-friendly languages.
vi: Ngoài ra, Mạng Casper còn tối ưu hóa các tính năng cho các doanh nghiệp và nhà phát triển. Vừa tận dụng công nghệ blockchain, mạng Casper vừa tìm cách tăng tốc hoạt động kinh doanh thông qua các tính năng độc đáo như phí mạng có thể dự đoán được, hợp đồng có thể nâng cấp, quản trị trên chuỗi, quyền riêng tư linh hoạt và ngôn ngữ thân thiện với nhà phát triển.

source: Casper also solves the scalability trilemma. Notably, the network is optimized for security, decentralization, and high throughput. All this is achieved while evolving to provide leading solutions for open-source projects and enterprises.
vi: Casper cũng giải quyết một trong bộ ba bất khả thi là khả năng mở rộng. Đáng chú ý, mạng được tối ưu hóa để bảo mật, phân quyền và thông lượng cao. Tất cả các tiện ích này đều là mục tiêu của Casper, nhằm cung cấp các giải pháp hàng đầu cho các dự án và doanh nghiệp nguồn mở.

source: Why choose Casper?
vi: Vì sao nên chọn Casper?

source: Casper has core features and strengths that enable developers and enterprises to reap the benefits of blockchain technology.
vi: Casper có các tính năng và điểm mạnh cốt lõi cho phép các nhà phát triển và doanh nghiệp tận dụng tối đa những lợi ích của công nghệ chuỗi khối.

source: Upgradeable Contracts
vi: Hợp đồng có thể nâng cấp

source: Casper allows the direct upgrading of on-chain smart contracts, eliminating the need for complex migration processes and making it easy for developers to correct smart contract vulnerabilities.
vi: Casper cho phép nâng cấp các hợp đồng thông minh trực tiếp trên chuỗi, không cần đến các quy trình di chuyển dữ liệu phức tạp và giúp các nhà phát triển dễ dàng sửa chữa các lỗ hổng của hợp đồng thông minh.

source: Developer-Friendly Language
vi: Ngôn ngữ thân thiện với nhà phát triển

source: Casper Network’s development ecosystem is designed to support WebAssembly, rather than being written in proprietary languages like Solidity. This feature simplifies the development path for enterprises and development teams that want to build on the Casper Network.
vi: Hệ sinh thái của Mạng Casper được thiết kế để hỗ trợ WebAssembly, thay vì sử dụng các ngôn ngữ độc quyền như Solidity. Tính năng này đơn giản hóa lộ trình phát triển của các doanh nghiệp và nhóm phát triển muốn mở rộng kinh doanh trên Mạng Casper.

source: Note
vi: Lưu ý

source: Rust is the primary programming language for smart contracts on the Casper blockchain because of its good support for compilation to wasm. However, the platform does not make assumptions about the source language and supports libraries facilitating contract development in other programming languages having wasm as a compile target.
vi: Rust là ngôn ngữ lập trình chính cho các hợp đồng thông minh trên chuỗi khối Casper vì Rust hỗ trợ tốt cho việc biên dịch sang wasm. Tuy nhiên, nền tảng này không đưa ra giả định về ngôn ngữ nguồn, chỉ hỗ trợ các thư viện được dùng để phát triển hợp đồng bằng các ngôn ngữ lập trình khác có wasm là trình biên dịch đích.

source: Account Management
vi: Quản lý tài khoản

source: Other essential features include an account permissions model that allows the recovery of lost keys and a permissions model to securely share state between accounts and contracts (without expensive cryptographic checks).
vi: Các tính năng quan trọng khác bao gồm mô hình cấp phép tài khoản, cho phép khôi phục các khóa bị mất và một mô hình cấp phép để chia sẻ trạng thái giữa các tài khoản và hợp đồng một cách an toàn (mà không cần đến các kiểm tra mật mã tốn kém).

source: Predictable Network Fees
vi: Dự đoán phí mạng

source: Casper seeks to eliminate volatility and improve developer and enterprise experiences by establishing transparent, consistent, and predictable gas prices. This feature seeks to promote active and diverse network behaviour.
vi: Casper loại bỏ tính dễ biến động, cải thiện trải nghiệm của các nhà phát triển và doanh nghiệp thông qua cơ chế dự đoán chi phí minh bạch, nhất quán. Tính năng này giúp thúc đẩy các hành vi mạng đa dạng và tích cực hơn.

source: How does Casper work?
vi: Casper hoạt động như thế nào?

source: Casper relies on a group of validators to verify transactions and uphold the network. Unlike Proof-of-Work networks, which need to centralize validators for economies of scale, Casper allows for the geographical decentralization of validators. Casper validators verify transactions based on staked tokens and receive CSPR rewards for participating in the PoS consensus mechanism. CSPR is the native token on the Casper Network.
vi: Casper dựa vào một nhóm những trình xác thực (validator) để xác minh các giao dịch và duy trì mạng. Không giống như các mạng Proof-of-Work tập trung vào những trình xác thực theo quy mô kinh tế, Casper cho phép những trình xác thực phân cấp theo địa lý. Các trình xác thực của Casper xác minh các giao dịch dựa trên các token được đặt cọc và sẽ nhận phần thưởng CSPR khi tham gia vào cơ chế đồng thuận PoS. CSPR là đơn vị tiền tệ gốc (token) đại diện cho Mạng Casper.

source: Where can I learn more?
vi: Tôi có thể tìm thêm thông in ở đâu?

source: Follow the links below to learn more about the Casper Network.
vi: Xem các đường dẫn sau để hiểu thêm về Mạng Casper.

source: `How To's <workflow/index.html>`_
de: `Anleitungen <workflow/index.html>`_
fr: `Guide pratique <workflow/index.html>`_
vi: `Hướng dẫn sử dụng <workflow/index.html>`_

source: Guides for interacting with the Casper Network
de: Anleitungen für die Interaktion mit dem Casper Netzwerk
fr: Guides pour interagir avec le réseau Casper
vi: Hướng dẫn tương tác với Mạng Casper

source: `Developers <dapp-dev-guide/index.html>`_
de: `Entwickler <dapp-dev-guide/index.html>`_
fr: `Développeurs <dapp-dev-guide/index.html>`_
vi: `Dành cho nhà phát triển <dapp-dev-guide/index.html>`_

source: Get started with smart contract development on the Casper blockchain in AssemblyScript or Rust
de: Einstieg in die Smart-Contract-Entwicklung auf der Casper-Blockchain in AssemblyScript oder Rust
fr: Commencez à développer des contrats intelligents sur la blockchain Casper en AssemblyScript ou Rust.
vi: Bắt đầu phát triển hợp đồng thông minh trên chuỗi khối Casper với AssemblyScript hoặc Rust

source: `Node Operators <node-operator/index.html>`_
de: `Node Betreiber <node-operator/index.html>`_
fr: `Opérateurs de nœuds <node-operator/index.html>`_
vi: `Nhà điều hành nút <node-operator/index.html>`_

source: Run node infrastructure on the Casper Network
de: Ausführen der Node Infrastruktur im Casper-Netzwerk
fr: Mise en place d'une infrastructure de nœud sur le réseau Casper
vi: Chạy cơ sở hạ tầng nút trên Mạng Casper

source: `Design <implementation/index.html>`_
fr: `Conception <implementation/index.html>`_
vi: `Thiết kế <implementation/index.html>`_

source: Understand the architecture of the Casper Network, including network communication, execution semantics, account management, block structure, global state, serialization, unforgeable references, and tokens
de: Verstehen der Architektur des Casper-Netzwerks, einschließlich Netzwerkkommunikation, Ausführungssemantik, Kontoverwaltung, Blockstruktur, globaler Zustand, Serialisierung, fälschungssichere Referenzen und Token
fr: Comprendre l'architecture du réseau Casper, notamment la communication réseau, la sémantique d'exécution, la gestion des comptes, la structure des blocs, l'état global, la sérialisation, les références infalsifiables et les jetons.
vi: Hiểu kiến trúc của Mạng Casper, bao gồm giao tiếp mạng, ngữ nghĩa thực thi, quản lý tài khoản, cấu trúc khối, trạng thái toàn cục, tuần tự hóa, tham chiếu không thể giả mạo được và token

source: `Economics <economics/index.html>`_
de: `Ökonomie <economics/index.html>`_
fr: `Economie <economics/index.html>`_
vi: `Tính kinh tế <economics/index.html>`_

source: Conceptualize Casper's economic activity by understanding consensus, runtime, ecosystem, and the macroeconomy
de: Konzeptualisierung der ökonomischen Aktivität von Casper durch Verständnis von Konsens, Laufzeit, Ökosystem und Makroökonomie
fr: Conceptualiser l'activité économique de Casper en comprenant le consensus, l'environnement d'exécution (runtime), l'écosystème et la macroéconomie.
vi: Khái niệm hóa hoạt động kinh tế của Casper bằng cách hiểu sự đồng thuận, thời điểm chạy, hệ sinh thái và kinh tế vĩ mô của Casper

source: `Staking Guide <staking/index.html>`_
de: `Staking Anleitung <staking/index.html>`_
fr: `Guide du Staking <staking/index.html>`_
vi: `Hướng dẫn đặt cọc (staking) <staking/index.html>`_

source: Participate in the protocol by staking CSPR tokens with a validator in the Casper Network
de: Nehmen Sie am Protokoll teil, indem Sie CSPR-Tokens bei einem Validator im Casper-Netzwerk staken
fr: Participez au protocole en déléguant des jetons CSPR à un validateur du réseau Casper.
vi: Tham gia vào giao thức bằng cách đặt cọc token CSPR với trình xác thực trong Mạng Casper

source: `Glossary <glossary/index.html>`_
de: `Glossar <glossary/index.html>`_
fr: `Glossaire <glossary/index.html>`_
vi: `Thuật ngữ <glossary/index.html>`_

source: Explore key definitions in the context of the Casper Network
de: Erkunden Sie die wichtigsten Definitionen im Zusammenhang mit dem Casper Netzwerk
fr: Explorer les définitions clés dans le contexte du réseau Casper
vi: Khám phá các định nghĩa quan trọng trong ngữ cảnh của Mạng Casper

source: `FAQ <faq/index.html>`_
vi: `Câu hỏi thường gặp <faq/index.html>`_

source: Find answers regarding the Casper Network, CasperLabs, and the CSPR token sale
de: Finden Sie Antworten zum Casper Netzwerk, den CasperLabs und dem CSPR-Token-Verkauf
fr: Trouvez des réponses concernant le réseau Casper, CasperLabs et la vente de jetons CSPR.
vi: Tìm câu trả lời liên quan đến Mạng Casper, CasperLabs và việc bán token CSPR

source: `Changelog <changelog.html>`_
fr: `Historique des modifications <changelog.html>`_
vi: `Nhật ký thay đổi <changelog.html>`_

source: Review past technical releases and changelogs for the Casper Network
de: Überprüfen Sie frühere technische Versionen und Changelogs für das Casper Netzwerk
fr: Examiner les versions techniques antérieures et les journaux des modifications du réseau Casper.
vi: Xem lại các bản phát hành tài liệu kỹ thuật và nhật ký thay đổi trước đây của Mạng Casper

source: **Disclaimer**
de: **Haftungsausschluss**
fr: **Avertissement**
vi: **Tuyên bố từ chối trách nhiệm**

source: By accepting this CasperLabs Tech Spec (this "**Whitepaper**"), each recipient hereof acknowledges and agrees that is not authorised to, and may not, forward or deliver this Whitepaper, electronically or otherwise, to any other person or reproduce this Whitepaper in any manner whatsoever. Any forwarding, distribution or reproduction of this Whitepaper in whole or in part is unauthorised. Failure to comply with this directive may result in a violation of applicable laws of any affected or involved jurisdiction.
de: Durch die Annahme dieser CasperLabs Tech Spec (dieses "**Whitepaper**") erkennt jeder Empfänger an und erklärt sich damit einverstanden, dass er nicht befugt ist, dieses Whitepaper an andere Personen weiterzuleiten oder zu übermitteln, sei es elektronisch oder auf andere Weise, oder dieses Whitepaper auf irgendeine Weise zu reproduzieren. Jede Weiterleitung, Verteilung oder Vervielfältigung dieses Whitepapers im Ganzen oder in Teilen ist unzulässig. Die Nichteinhaltung dieser Richtlinie kann zu einem Verstoß gegen geltende Gesetze einer betroffenen oder beteiligten Gerichtsbarkeit führen.
fr: En acceptant le présent document CasperLabs Tech Spec (ce livre blanc 'Whitepaper"), chaque destinataire reconnaît et accepte qu'il n'est pas autorisé à, et ne peut pas, transmettre ou livrer ce livre blanc (Whitepaper), par voie électronique ou autre, à toute autre personne ou le reproduire de quelque manière que ce soit. Toute transmission, distribution ou reproduction de ce Livre blanc, en tout ou en partie, n'est pas autorisée. Le non-respect de cette directive peut entraîner une violation des lois applicables dans toute juridiction concernée ou impliquée.
vi: Bằng cách chấp nhận Bảng chỉ dẫn kỹ thuật của CasperLabs dưới đây (sau đây được gọi là "**Sách trắng**"), mỗi người nhận theo đó thừa nhận và đồng ý rằng không được phép và không chuyển tiếp hoặc gửi Sách Trắng này, qua phương thức điện tử hoặc bằng phương thức khác, cho bất kỳ người nào khác hoặc sao chép Sách Trắng này theo bất kỳ cách nào. Bất kỳ việc chuyển tiếp, phân phối hoặc sao chép toàn bộ hoặc một phần Sách Trắng này đều là trái phép. Việc không tuân thủ chỉ dẫn này có thể dẫn đến việc vi phạm pháp luật hiện hành tại bất kỳ khu vực tài phán nào có liên quan.

source: Nothing in this Whitepaper constitutes an offer to sell, or a solicitation to purchase, the tokens native to the Casper blockchain (“**CSPR**”). In any event, were this Whitepaper to be deemed to be such an offer or solicitation, no such offer or solicitation is intended or conveyed by this Whitepaper in any jurisdiction where it is unlawful to do so, where such an offer or solicitation would require a license or registration, or where such an offer or solicitation is subject to restrictions. In particular, any CSPR to be issued have not been, and, as of the date of issuance of this Whitepaper, are not intended to be, registered under the securities or similar laws of any jurisdiction, whether or not such jurisdiction considers the CSPR to be a security or similar instrument, and specifically, have not been, and, as of the date of issuance of this Whitepaper are not intended to be, registered under the U.S. Securities Act of 1933, as amended, or the securities laws of any state of the United States of America or any other jurisdiction and may not be offered or sold in any jurisdiction where to do so would constitute a violation of the relevant laws of such jurisdiction.
de: Nichts in diesem Whitepaper stellt ein Angebot zum Verkauf oder eine Aufforderung zum Kauf der auf der Casper-Blockchain ("**CSPR**") nativen Token dar. Sollte dieses Whitepaper als ein solches Angebot oder eine solche Aufforderung angesehen werden, ist ein solches Angebot oder eine solche Aufforderung in keiner Jurisdiktion beabsichtigt oder wird durch dieses Whitepaper in einer Jurisdiktion übermittelt, in der dies ungesetzlich ist, in der ein solches Angebot oder eine solche Aufforderung eine Lizenz oder Registrierung erfordern würde oder in der ein solches Angebot oder eine solche Aufforderung Einschränkungen unterliegt. Insbesondere sind alle auszugebenden CSPR nicht gemäß den Wertpapiergesetzen oder ähnlichen Gesetzen einer Rechtsordnung registriert worden und sind zum Zeitpunkt der Veröffentlichung dieses Whitepapers auch nicht dazu bestimmt, registriert zu werden, unabhängig davon, ob diese Rechtsordnung die CSPR als Wertpapier oder ähnliches Instrument ansieht oder nicht, und insbesondere sind sie nicht registriert worden und, zum Zeitpunkt der Veröffentlichung dieses Whitepapers nicht gemäß dem US Securities Act von 1933 in der jeweils gültigen Fassung oder den Wertpapiergesetzen eines Bundesstaates der Vereinigten Staaten von Amerika oder einer anderen Jurisdiktion registriert und dürfen nicht in einer Jurisdiktion angeboten oder verkauft werden, in der dies einen Verstoß gegen die entsprechenden Gesetze dieser Jurisdiktion darstellen würde.
fr: Rien dans le présent Livre blanc ne constitue une offre de vente ou une sollicitation d'achat des jetons natifs de la blockchain Casper (" **CSPR** "). En tout état de cause, si ce Livre blanc devait être considéré comme une telle offre ou sollicitation, aucune offre ou sollicitation de ce type n'est prévue ou transmise par ce Livre blanc dans toute juridiction où il est illégal de le faire, où une telle offre ou sollicitation nécessiterait une licence ou un enregistrement, ou où une telle offre ou sollicitation est soumise à des restrictions. En particulier, tous les CSPR à émettre n'ont pas encore été émis, et, à la date de publication du présent Livre blanc, ne sont pas destinés à être enregistrés en vertu des lois sur les valeurs mobilières ou des lois similaires de toute juridiction, que cette juridiction considère ou non les CSPR comme une valeur mobilière ou un instrument similaire, et plus précisément, n'ont pas été, et, à la date de publication du présent Livre blanc, ne sont pas destinés à être enregistrés en vertu de la loi américaine sur les valeurs mobilières de 1933, intitulée U. S. Securities Act of 1933, et de la loi américaine sur les valeurs mobilières de 1933, dite U. S. Securities Act. S. Securities Act of 1933, tel que modifié, ou les lois sur les valeurs mobilières de tout État des États-Unis d'Amérique ou de toute autre juridiction et ne peuvent être offerts ou vendus dans toute juridiction où cela constituerait une violation des lois pertinentes de cette juridiction.
vi: Không có nội dung nào trong Sách Trắng này cấu thành một lời đề nghị chào bán hoặc mời mua các token từ Chuỗi Khối Casper (“**CSPR**”). Trong trường hợp Sách Trắng này được coi là một lời đề nghị hoặc lời mời chào như vậy, thì không có lời đề nghị hoặc lời mời chào nào được Sách Trắng chủ định hoặc cố tình truyền đạt tại bất kỳ khu vực tài phán nào mà tại đó việc làm như vậy là bất hợp pháp cho dù trong khu vực tài phán đó yêu cầu cấp phép hoặc đăng ký hoặc hạn chế các lời đề nghị, mời chào đó. Đặc biệt, kể từ ngày phát hành Sách Trắng này, bất kỳ CSPR nào được phát hành nhưng chưa được đăng ký theo luật chứng khoán hoặc các luật tương tự của bất kỳ khu vực tài phán nào, cho dù khu vực tài phán đó, cho tới ngày phát hành Sách Trắng này, có coi CSPR là một công cụ bảo mật hoặc công cụ tương tự hay không, và bất kỳ CSPR nào chưa được đăng ký theo Đạo luật Chứng khoán Hoa Kỳ năm 1933 đã được sửa đổi, hoặc luật chứng khoán của bất kỳ tiểu bang nào của Hợp Chủng Quốc Hoa Kỳ hoặc bất kỳ khu vực pháp lý nào khác thì đều không được chào bán hoặc bán ở bất kỳ khu vực tài phán nào mà tại đó việc làm như vậy sẽ cấu thành hành vi vi phạm pháp luật của khu vực tài phán.

source: This Whitepaper constitutes neither a prospectus according to Art. 652a of the Swiss Code of Obligations (the "**CO**") or Art. 1156 CO nor a prospectus or basic information sheet according to the Swiss Financial Services Act (the "**FinSA**") nor a listing prospectus nor a simplified prospectus according to Art. 5 of the Swiss Collective Investment Schemes Act (the "**CISA**") nor any other prospectus according to CISA nor a prospectus under any other applicable laws.
de: Dieses Whitepaper stellt weder einen Prospekt im Sinne von Art. 652a des Schweizerischen Obligationenrechts (das "**CO**") oder Art. 1156 CO noch einen Prospekt oder ein Basisinformationsblatt gemäß dem Schweizerischen Finanzdienstleistungsgesetz (das "**FinSA**") noch einen Kotierungsprospekt noch einen vereinfachten Prospekt gemäß Art. 5 des Schweizerischen Kollektivanlagengesetzes (das "**KAG**") noch ein sonstiger Prospekt gemäss KAG noch ein Prospekt gemäss einem anderen anwendbaren Recht.
fr: Le présent livre blanc (Whitepaper) ne constitue ni un prospectus au sens de l'art. 652a du Code suisse des obligations (le "**CO**") ou l'art. 1156 CO, ni un prospectus ou une feuille d'information de base selon la loi suisse sur les services financiers (la "**FinSA**"), ni un prospectus de cotation, ni un prospectus simplifié selon l'art. 5 de la loi suisse sur les placements collectifs de capitaux (la "**LPC**") ni aucun autre prospectus selon la LPCC ni un prospectus selon toute autre loi applicable.
vi: Sách Trắng này không phải là một bản cáo bạch theo Điều 652a thuộc Bộ luật Nghĩa Vụ của Thụy Sĩ (Code of Obligations - "**CO**") hoặc Điều 1156 của bộ luật này, đồng thời không phải là bản cáo bạch hoặc tài liệu thông tin cơ bản theo Đạo luật Dịch Vụ Tài Chính của Thụy Sĩ ("**FinSA**"), không phải bản cáo bạch niêm yết hay bản cáo bạch đơn giản theo Điều 5 của Đạo Luật Kế Hoạch Đầu Tư Tập Thể của Thụy Sĩ ("**CISA**"), không phải là bản cáo bạch nào khác theo CISA cũng như theo bất kỳ luật hiện hành nào khác.
