Repository: casper-network/docs-archive
Catalog: locale/*/LC_MESSAGES/index.po
Languages: de, fr, vi

source: **Risks associated with CasperLabs Networks AG’s experience**: the Recipient is aware that CasperLabs Networks AG and its affiliates constitute a start-up group of companies. Inability of such companies to manage their affairs, including any failure to attract and retain appropriate personnel, could affect the completion and functionality of the Casper blockchain.
de: **Risiken im Zusammenhang mit der Erfahrung der CasperLabs Networks AG**: Dem Empfänger ist bekannt, dass die CasperLabs Networks AG und ihre verbundenen Unternehmen eine Start-up-Unternehmensgruppe darstellen. Die Unfähigkeit dieser Unternehmen, ihre Angelegenheiten zu regeln, einschließlich der Unfähigkeit, geeignetes Personal zu gewinnen und zu halten, könnte die Fertigstellung und Funktionalität der Casper-Blockchain beeinträchtigen.
fr: **Risques liés à l'expérience de CasperLabs Networks AG** : le Bénéficiaire est conscient que CasperLabs Networks AG et ses affiliés constituent un groupe de sociétés en phase de démarrage. L'incapacité de ces sociétés à gérer leurs affaires, y compris toute incapacité à attirer et à retenir le personnel approprié, pourrait affecter l'achèvement et la fonctionnalité de la blockchain Casper.
vi: **Rủi ro liên quan đến kinh nghiệm của CasperLabs Networks AG**: Người nhận hiểu rằng CasperLabs Networks AG và các chi nhánh của mình xây dựng nên một nhóm các công ty mới thành lập. Có khả năng các công ty này không thể quản lý công việc hiệu quả, bao gồm thất bại trong việc thu hút và giữ chân các nhân sự thích hợp, do đó có thể ảnh hưởng đến việc hoàn thiện và thực hiện chức năng của khối chuỗi Casper.

source: **Risks associated with CSPR relative value**: the Recipient understands and accepts that a purchaser of CSPR may experience financial losses relative to other assets, including fiat currency and/or any other cryptocurrency (including any cryptocurrency used to acquire CSPR). Potential purchasers and holders of CSPR are urged to carefully review this Whitepaper and assess and understand the risk factors relating to the CSPR and the Casper blockchain before acquiring CSPR (when and if CSPR become available).
de: **Risiken im Zusammenhang mit dem relativen Wert von CSPR**: Der Empfänger versteht und akzeptiert, dass ein Käufer von CSPR finanzielle Verluste im Vergleich zu anderen Vermögenswerten, einschließlich Fiat-Währung und/oder einer anderen Kryptowährung, erleiden kann (einschließlich aller Kryptowährungen, die zum Erwerb von CSPR verwendet werden). Potenziellen Käufern und Inhabern von CSPR wird dringend empfohlen, dieses Whitepaper sorgfältig zu lesen und die Risikofaktoren in Bezug auf die CSPR und die Casper-Blockchain zu bewerten und zu verstehen, bevor sie CSPR erwerben (wenn und falls CSPR verfügbar werden).
fr: **Risques associés à la valeur relative des CSPR** : le destinataire comprend et accepte qu'un acheteur de CSPR peut subir des pertes financières par rapport à d'autres actifs, y compris la monnaie fiduciaire et/ou toute autre crypto-monnaie (y compris toute crypto-monnaie utilisée pour acquérir des CSPR). Les acheteurs et détenteurs potentiels de CSPR sont instamment invités à examiner attentivement le présent Livre blanc et à évaluer et comprendre les facteurs de risque liés aux CSPR et à la blockchain Casper avant d'acquérir des CSPR (lorsque et si les CSPR deviennent disponibles).
vi: **Rủi ro liên quan đến giá trị tương đối của CSPR**: Người nhận hiểu và chấp nhận rằng người mua CSPR có thể gặp tổn thất tài chính liên quan đến các tài sản khác, bao gồm tiền tệ pháp định và/hoặc bất kỳ loại tiền điện tử nào khác (bao gồm bất kỳ loại tiền điện tử nào được sử dụng để mua CSPR). Những người mua và chủ sở hữu tiềm năng của CSPR được khuyến khích xem xét cẩn thận Sách Trắng này, đồng thời đánh giá và hiểu các yếu tố rủi ro liên quan đến CSPR và chuỗi khối Casper trước khi mua CSPR (nếu CSPR có sẵn).

source: **Risks associated with (intellectual) property rights**: the Recipient understands and accepts that, due to a lack of originality of the software and to the immaterial character of the CSPR, there may be no title of ownership in and to the intellectual property rights relating to CSPR.
de: **Risiken im Zusammenhang mit (geistigen) Eigentumsrechten**: Der Empfänger versteht und akzeptiert, dass aufgrund der mangelnden Originalität der Software und des immateriellen Charakters der CSPR möglicherweise kein Eigentumstitel an und auf den geistigen Eigentumsrechten in Bezug auf CSPR besteht.
fr: **Risques liés aux droits de propriété (intellectuelle)** : le bénéficiaire comprend et accepte qu'en raison d'un manque d'originalité du logiciel et du caractère immatériel du CSPR, il peut n'y avoir aucun titre de propriété dans et sur les droits de propriété intellectuelle relatifs au CSPR.
vi: **Rủi ro liên quan đến quyền sở hữu (trí tuệ)**: Bên nhận hiểu và chấp nhận rằng, do phần mềm thiếu tính nguyên bản và do đặc tính phi vật chất của CSPR, có thể không có quyền sở hữu đối với CSPR và các quyền sở hữu trí tuệ liên quan tới CSPR.

source: **Risks associated with blockchain**: the Recipient understands and accepts that the smart contract, the underlying software application and software platform (i.e. the Casper blockchain) is still in an early development stage and unproven. The Recipient understands and accepts that there is no warranty that the process for creating the CSPR and/or the Casper blockchain will be uninterrupted or error-free and acknowledges that there is an inherent risk that the software could contain weaknesses, vulnerabilities or bugs causing, inter alia, the complete loss of CSPR. The Recipient understands and accepts that, after launch of the Casper blockchain, the smart contract and/or underlying protocols and/or the Casper blockchain and/or any other software involved may either delay and/or not execute a contribution due to the overall contribution volume, mining attacks and/or similar events.
de: **Risiken im Zusammenhang mit der Blockchain**: Der Empfänger versteht und akzeptiert, dass sich der Smart Contract, die zugrundeliegende Softwareanwendung und Softwareplattform (d. h. die Casper-Blockchain) noch in einem frühen Entwicklungsstadium befinden und unerprobt sind. Der Empfänger versteht und akzeptiert, dass es keine Garantie dafür gibt, dass der Prozess zur Erstellung des CSPR und/oder der Casper-Blockchain ununterbrochen oder fehlerfrei abläuft, und erkennt an, dass ein inhärentes Risiko besteht, dass die Software Schwächen, Anfälligkeiten oder Fehler enthalten könnte, die unter anderem den vollständigen Verlust von CSPR verursachen. Der Empfänger versteht und akzeptiert, dass nach dem Start der Casper-Blockchain der Smart Contract und/oder die zugrundeliegenden Protokolle und/oder die Casper-Blockchain und/oder jede andere beteiligte Software einen Beitrag aufgrund des Gesamtbeitragsvolumens, Mining-Angriffen und/oder ähnlichen Ereignissen entweder verzögern und/oder nicht ausführen kann.
fr: **Risques associés à la blockchain** : le Bénéficiaire comprend et accepte que le contrat intelligent, l'application logicielle sous-jacente et la plateforme logicielle (c'est-à-dire la blockchain Casper) sont encore à un stade de développement précoce et non éprouvés. Le Bénéficiaire comprend et accepte qu'il n'y a aucune garantie que le processus de création du CSPR et/ou de la blockchain Casper sera ininterrompu ou sans erreur et reconnaît qu'il existe un risque inhérent que le logiciel puisse contenir des faiblesses, des vulnérabilités ou des bugs entraînant, entre autres, la perte complète du CSPR. Le Bénéficiaire comprend et accepte que, après le lancement de la blockchain Casper, le contrat intelligent et/ou les protocoles sous-jacents et/ou la blockchain Casper et/ou tout autre logiciel impliqué peuvent soit retarder et/ou ne pas exécuter une contribution en raison du volume global de contribution, d'attaques de minage et/ou d'événements similaires.
vi: **Rủi ro liên quan đến chuỗi khối**: Bên nhận hiểu và chấp nhận rằng hợp đồng thông minh, ứng dụng phần mềm cơ bản và nền tảng phần mềm (tức là chuỗi khối Casper) vẫn đang trong giai đoạn phát triển ban đầu và chưa được chứng minh. Người nhận hiểu và chấp nhận rằng không có bảo đảm rằng quá trình tạo CSPR và/hoặc chuỗi khối Casper sẽ không bị gián đoạn hoặc không có lỗi, và thừa nhận rằng có rủi ro cố hữu là phần mềm có thể chứa các điểm yếu, lỗ hổng hoặc lỗi hoặc mất hoàn toàn CSPR. Người nhận hiểu và chấp nhận rằng, sau khi khởi chạy chuỗi khối Casper, hợp đồng thông minh và/hoặc các giao thức cơ bản và/hoặc chuỗi khối Casper và/hoặc bất kỳ phần mềm nào khác có liên quan có thể trì hoãn và/hoặc không thực hiện đóng góp do khối lượng tổng thể, các cuộc tấn công khai thác và/hoặc các sự kiện tương tự.

source: **Risk of weaknesses in the field of cryptography**: the Recipient understands and accepts that cryptography is a technology that evolves relatively fast over time. At the same time, methods and tools to decrypt, access and/or manipulate data stored on a distributed ledger or blockchain are highly likely to progress in parallel and in addition, new technological developments such as quantum computers may pose as of now unpredictable risks to the CSPR and the Casper blockchain that could increase the risk of theft or loss of CSPR (if and when CSPR are created and/or issued).
de: **Risiko von Schwachstellen im Bereich der Kryptographie**: Der Empfänger versteht und akzeptiert, dass Kryptographie eine Technologie ist, die sich im Laufe der Zeit relativ schnell weiterentwickelt. Gleichzeitig ist es sehr wahrscheinlich, dass Methoden und Werkzeuge zur Entschlüsselung, zum Zugriff auf und/oder zur Manipulation von Daten, die auf einem verteilten Ledger oder einer Blockchain gespeichert sind, parallel dazu fortschreiten, und darüber hinaus können neue technologische Entwicklungen wie Quantencomputer zum jetzigen Zeitpunkt unvorhersehbare Risiken für CSPR und die Casper-Blockchain darstellen, die das Risiko des Diebstahls oder Verlusts von CSPR erhöhen könnten (falls und wenn CSPR erstellt und/oder ausgegeben werden).
fr: **Risque de faiblesses dans le domaine de la cryptographie** : le Bénéficiaire comprend et accepte que la cryptographie est une technologie qui évolue relativement vite dans le temps. Dans le même temps, les méthodes et les outils permettant de décrypter, d'accéder et/ou de manipuler les données stockées sur un registre distribué (distributed ledger) ou une blockchain sont très susceptibles de progresser en parallèle et, en outre, de nouveaux développements technologiques tels que les ordinateurs quantiques peuvent poser dès à présent des risques imprévisibles pour les CSPR et la blockchain Casper qui pourraient augmenter le risque de vol ou de perte de CSPR (si et quand les CSPR sont créés et/ou émis).
vi: **Rủi ro về điểm yếu trong lĩnh vực mật mã**: Bên nhận hiểu và chấp nhận rằng mật mã là một công nghệ phát triển tương đối nhanh theo thời gian. Đồng thời, các phương pháp và công cụ để giải mã, truy cập và/hoặc thao tác dữ liệu được lưu trữ trên sổ cái phân tán hoặc chuỗi khối blockchain có nhiều khả năng sẽ phát triển song song và ngoài ra, những phát triển công nghệ mới như máy tính lượng tử có thể gây ra những rủi ro không thể đoán trước cho CSPR và chuỗi khối Casper, có thể làm tăng nguy cơ bị trộm hoặc mất CSPR (nếu và khi CSPR được tạo ra và/hoặc phát hành).

source: **Regulatory risks**: the Recipient understands and accepts that it is possible that certain jurisdictions will apply existing regulations on, or introduce new regulations addressing, distributed ledger technology and/or blockchain technology based applications, which may be contrary to the current setup of the smart contract or the CasperLabs Networks AG project and which may, inter alia, result in substantial modifications of the smart contract and/or the CasperLabs Networks AG project, including its termination and the loss of the CSPR, if and when created and/or issued, or entitlements to receive CSPR, for the Recipient.
de: **Regulatorische Risiken**: Der Empfänger versteht und akzeptiert, dass es möglich ist, dass bestimmte Jurisdiktionen bestehende Vorschriften zu Distributed-Ledger-Technologien und/oder auf Blockchain-Technologie basierenden Anwendungen anwenden oder neue Vorschriften einführen, die der aktuellen Einrichtung des Smart Contracts oder des Projekts der CasperLabs Networks AG zuwiderlaufen und die unter anderem zu wesentlichen Änderungen des Smart Contracts und/oder des Projekts der CasperLabs Networks AG, einschließlich seiner Beendigung und des Verlusts der CSPR, falls und wenn sie erstellt und/oder ausgestellt wurden, oder der Berechtigungen zum Erhalt von CSPR für den Empfänger führen können.
fr: **Risques réglementaires** : le Bénéficiaire comprend et accepte qu'il est possible que certaines juridictions appliquent des réglementations existantes ou introduisent de nouvelles réglementations concernant la technologie des registres distribués (distributed ledger) et/ou les applications basées sur la technologie blockchain, qui peuvent être contraires à la configuration actuelle du contrat intelligent ou du projet CasperLabs Networks AG et qui peuvent, entre autres, entraîner des modifications substantielles du contrat intelligent et/ou du projet CasperLabs Networks AG, y compris sa résiliation et la perte des CSPR, s'ils sont créés et/ou émis, ou des droits à recevoir des CSPR, pour le Bénéficiaire.
vi: **Rủi ro về pháp lý**: Người nhận hiểu và chấp nhận rằng có thể một số khu vực pháp lý nhất định sẽ áp dụng các quy định hiện hành hoặc đưa ra các quy định mới liên quan tới công nghệ sổ cái phân tán và/hoặc các ứng dụng dựa trên công nghệ chuỗi khối, có thể trái với thiết lập hiện tại của hợp đồng thông minh hoặc dự án CasperLabs Networks AG và có thể dẫn đến những sửa đổi đáng kể đối với hợp đồng thông minh và/hoặc dự án CasperLabs Networks AG, bao gồm cả việc chấm dứt hợp đồng và mất CSPR, nếu và khi CSPR được tạo và/hoặc phát hành, hoặc quyền nhận CSPR.

source: **Risks associated with abandonment / lack of success**: the Recipient understands and accepts that the creation of the CSPR and the development of the Casper blockchain as well as the CasperLabs Networks AG project may be abandoned for a number of reasons, including lack of interest from the public, lack of funding, lack of prospects (e.g. caused by competing projects) and legal, tax or regulatory considerations. The Recipient therefore understands that there is no assurance that, even if the CSPR/CasperLabs blockchain project is partially or fully developed and launched, the Recipient will receive any benefits through the CSPR held by it (if and when created and/or issued).
de: **Risiken im Zusammenhang mit einem Abbruch / mangelndem Erfolg**: Der Empfänger versteht und akzeptiert, dass die Schaffung des CSPR und die Entwicklung der Casper-Blockchain sowie das Projekt der CasperLabs Networks AG aus einer Reihe von Gründen aufgegeben werden können, einschließlich mangelndem Interesse der Öffentlichkeit, mangelnder Finanzierung, mangelnder Aussichten (z. B. verursacht durch konkurrierende Projekte) und rechtlicher, steuerlicher oder regulatorischer Erwägungen. Der Empfänger nimmt daher zur Kenntnis, dass es keine Gewähr dafür gibt, dass der Empfänger, selbst wenn das CSPR/CasperLabs-Blockchain-Projekt teilweise oder vollständig entwickelt und gestartet wird, irgendwelche Vorteile durch die von ihm gehaltenen CSPR erhält (falls und wenn sie erstellt und/oder ausgegeben werden).
fr: **Risques liés à l'abandon / au manque de succès** : le Bénéficiaire comprend et accepte que la création du CSPR et le développement de la blockchain Casper ainsi que le projet CasperLabs Networks AG peuvent être abandonnés pour un certain nombre de raisons, notamment le manque d'intérêt du public, le manque de financement, le manque de perspectives (par exemple, causé par des projets concurrents) et des considérations juridiques, fiscales ou réglementaires. Le Bénéficiaire comprend donc qu'il n'y a aucune assurance que, même si le projet blockchain CSPR/CasperLabs est partiellement ou totalement développé et lancé, le Bénéficiaire recevra des avantages par le biais du CSPR qu'il détient (si et quand il est créé et/ou émis).
vi: **Rủi ro liên quan đến việc từ bỏ dự án/không thành công**: Người nhận hiểu và chấp nhận rằng việc tạo CSPR và phát triển chuỗi khối Casper cũng như dự án CasperLabs Networks AG có thể bị chấm dứt vì một số lý do, bao gồm cả việc thiếu quan tâm từ công chúng, thiếu kinh phí, thiếu triển vọng (ví dụ do các dự án cạnh tranh gây ra) và các lý do về pháp lý, thuế hoặc quy định. Do đó, Người nhận hiểu rằng không có gì đảm bảo rằng, ngay cả khi CSPR /dự án chuỗi khối CasperLabs được phát triển và khởi chạy một phần hoặc toàn bộ Người nhận sẽ nhận được bất kỳ lợi ích nào thông qua CSPR mà mình nắm giữ (nếu và khi CSPR được tạo ra và/hoặc phát hành).

source: **Risks associated with a loss of private key**: the Recipient understands and accepts that CSPR, if and when created and/or issued, will only be accessed by using a wallet technically compatible with CSPR and with a combination of the Recipient’s account information (address) and private key, seed or password. The Recipient understands and accepts that if its private key or password gets lost or stolen, the CSPR associated with the Recipient's account (address) will be unrecoverable and will be permanently lost.
de: **Risiken im Zusammenhang mit dem Verlust des privaten Schlüssels**: Der Empfänger versteht und akzeptiert, dass CSPR, wenn und sobald sie erstellt und/oder ausgegeben werden, nur unter Verwendung einer technisch mit CSPR kompatiblen Wallet und mit einer Kombination aus den Kontoinformationen (Adresse) des Empfängers und dem privaten Schlüssel, Seed oder Passwort zugänglich sind. Der Empfänger versteht und akzeptiert, dass, wenn sein privater Schlüssel oder sein Passwort verloren geht oder gestohlen wird, die mit dem Konto (der Adresse) des Empfängers verbundenen CSPR nicht wiederhergestellt werden können und dauerhaft verloren sind.
fr: **Risques associés à la perte de la clé privée** : le destinataire comprend et accepte que les tokens CSPR, quand ils sont créés et/ou émis, ne seront accessibles qu'en utilisant un portefeuille techniquement compatible avec CSPR et en utilisant une combinaison d'informations du compte du destinataire (adresse) et de la clé privée, du 'seed' ou du mot de passe. Le destinataire comprend et accepte que si sa clé privée ou son mot de passe est perdu ou volé, le CSPR associé au compte (adresse) du destinataire sera irrécupérable et définitivement perdu.
vi: **Rủi ro liên quan đến việc mất khóa cá nhân**: Người nhận hiểu và chấp nhận rằng CSPR, nếu và khi được tạo ra và/hoặc phát hành, sẽ chỉ truy cập được bằng cách sử dụng ví tương thích về mặt kỹ thuật với CSPR và kết hợp các thông tin tài khoản của Người nhận (địa chỉ), khóa cá nhân, cụm từ khôi phục (seed) hoặc mật khẩu. Người nhận hiểu và chấp nhận rằng nếu khóa cá nhân hoặc mật khẩu của mình bị mất hoặc bị đánh cắp, thì CSPR được liên kết với tài khoản (địa chỉ) của Người nhận sẽ không thể khôi phục được và sẽ bị mất vĩnh viễn.

source: **Risks associated with wallets:** the Recipient understands and accepts that CasperLabs Networks AG or any of its affiliates, employees, partners or advisors are in no way responsible for the wallet to which any CSPR are transferred. The Recipient understands and agrees that it is solely responsible for the access and security of its wallet, for any security breach of its wallet and/or with any loss of CSPR resulting from its wallet service provider, including any termination of the service by the wallet provider and/or bankruptcy of the wallet provider.
de: **Risiken im Zusammenhang mit Wallets:** Der Empfänger versteht und akzeptiert, dass CasperLabs Networks AG oder eines ihrer verbundenen Unternehmen, Mitarbeiter, Partner oder Berater in keiner Weise für das Wallet verantwortlich sind, auf das CSPR übertragen werden. Der Empfänger versteht und akzeptiert, dass er allein für den Zugang und die Sicherheit seiner Wallet, für jede Sicherheitsverletzung seiner Wallet und/oder für jeden Verlust von CSPR verantwortlich ist, der von seinem Wallet-Dienstleister verursacht wird, einschließlich der Beendigung des Dienstes durch den Wallet-Anbieter und/oder des Konkurses des Wallet-Anbieters.
fr: **Risques associés aux portefeuilles:** le Destinataire comprend et accepte que CasperLabs Networks AG ou l'un de ses affiliés, employés, partenaires ou conseillers ne sont en aucun cas responsables du portefeuille vers lequel les jetons CSPR sont transférés. Le Bénéficiaire comprend et accepte qu'il est seul responsable de l'accès et de la sécurité de son portefeuille, de toute défaillance de sécurité de son portefeuille et/ou de toute perte de jetons CSPR résultant de son fournisseur de services de portefeuille, y compris toute résiliation du service par ce fournisseur de portefeuille et/ou sa faillite.
vi: **Rủi ro liên quan đến ví**: Người nhận hiểu và chấp nhận rằng CasperLabs Networks AG hoặc bất kỳ chi nhánh, nhân viên, đối tác hoặc cố vấn nào của CasperLabs Networks AG không chịu trách nhiệm về ví mà bất kỳ CSPR nào được chuyển đến. Người nhận hiểu và đồng ý rằng người nhận hoàn toàn chịu trách nhiệm về việc truy cập và bảo mật ví của mình, về bất kỳ vi phạm bảo mật nào đối với ví của mình và/hoặc với bất kỳ tổn thất nào về CSPR gây ra bởi nhà cung cấp dịch vụ ví của họ, bao gồm bất kỳ việc chấm dứt dịch vụ bởi nhà cung cấp ví và/hoặc sự phá sản của nhà cung cấp ví.
