Repository: casper-network/docs-archive
Catalog: locale/*/LC_MESSAGES/index.po
Languages: de, fr, vi

source: The CSPR are not expected to be instruments in an offer and sale which are subject to the jurisdiction or oversight of the U.S. Securities Exchange Commission (the “**SEC**”). In any event, however, CSPR have not been approved or disapproved by, and are not expected to be approved or disapproved by, the SEC nor by the securities regulatory authority of any state of the United States of America or of any other jurisdiction, and neither the SEC nor any such securities regulatory authority has passed, or is expected to pass, upon the accuracy or adequacy of this Whitepaper.
de: Es wird nicht erwartet, dass die CSPR Instrumente in einem Angebot und Verkauf sind, die der Rechtsprechung oder Aufsicht der U.S. Securities Exchange Commission (die "**SEC**") unterliegen. In jedem Fall wurden die CSPR jedoch weder von der SEC noch von der Wertpapieraufsichtsbehörde eines Bundesstaates der Vereinigten Staaten von Amerika oder einer anderen Jurisdiktion genehmigt oder abgelehnt und es wird auch nicht erwartet, dass sie von dieser genehmigt oder abgelehnt werden, und weder die SEC noch eine solche Wertpapieraufsichtsbehörde hat die Richtigkeit oder Angemessenheit dieses Whitepapers beurteilt oder wird dies voraussichtlich tun.
fr: Les CSPR ne sont pas censés être des instruments d'une offre et d'une vente soumises à la juridiction ou à la surveillance de la U.S. Securities Exchange Commission (la "**SEC**"). En tout état de cause, cependant, les CSPR n'ont pas été approuvés ou désapprouvés, et ne sont pas censés être approuvés ou désapprouvés par la SEC ou par l'autorité de réglementation des valeurs mobilières de tout état des États-Unis d'Amérique ou de toute autre juridiction, et ni la SEC ni aucune de ces autorités de réglementation des valeurs mobilières n'ont statué, ou ne sont censés statuer, sur l'exactitude ou l'adéquation de ce Livre blanc.
vi: CSPR không phải là công cụ để chào bán và bán dưới sự quản lý hoặc giám sát của Ủy ban Giao Dịch Chứng Khoán Hoa Kỳ (“**SEC**”). Tuy nhiên, trong bất kỳ trường hợp nào, CSPR vẫn chưa được chấp thuận hoặc chưa bị từ chối và dự kiến ​​sẽ không được chấp thuận hoặc không bị từ chối bởi SEC và cơ quan quản lý chứng khoán của bất kỳ bang nào của Hoa Kỳ hoặc bất kỳ khu vực tài phán nào khác, thì SEC và bất kỳ cơ quan quản lý chứng khoán nào khác đều không thông qua hoặc dự kiến ​​sẽ không thông qua CSPR đó, dựa trên tính chính xác hoặc đầy đủ của Sách Trắng này.

source: The distribution of this Whitepaper and the purchase, holding, and/or disposal of CSPR may be restricted by law in certain jurisdictions. Persons reading this Whitepaper should inform themselves as to (i) the possible tax consequences, (ii) the legal and regulatory requirements, and (iii) any foreign exchange restrictions or exchange control requirements, which they might encounter under the laws of the countries of their citizenship, residence or domi-cile and which might be relevant to the purchase, holding or disposal of CSPR. No action has been taken to authorise the distribution of this Whitepaper in any jurisdiction in which such authorisation might be required.
de: Die Verteilung dieses Whitepapers und der Kauf, das Halten und/oder die Veräußerung von CSPR können in bestimmten Rechtsordnungen gesetzlich eingeschränkt sein. Personen, die dieses Whitepaper lesen, sollten sich selbst über (i) die möglichen steuerlichen Folgen, (ii) die gesetzlichen und aufsichtsrechtlichen Anforderungen und (iii) etwaige Devisenbeschränkungen oder Devisenkontrollanforderungen informieren, denen sie nach dem Recht des Landes ihrer Staatsangehörigkeit, ihres Wohnsitzes oder ihres Domizils unterliegen und die für den Kauf, den Besitz oder die Veräußerung von CSPR relevant sein könnten. Es wurden keine Maßnahmen ergriffen, um die Verteilung dieses Whitepapers in einer Rechtsordnung zu genehmigen, in der eine solche Genehmigung erforderlich sein könnte.
fr: La distribution de ce Livre Blanc et l'achat, la détention et/ou la cession de CSPR peuvent être restreints par la loi dans certaines juridictions. Les personnes qui lisent ce Livre Blanc doivent s'informer (i) des conséquences fiscales possibles, (ii) des exigences légales et réglementaires, et (iii) des restrictions de change ou des exigences en matière de contrôle des changes, qu'elles pourraient rencontrer en vertu des lois des pays dont elles sont citoyennes, résidentes ou domiciliées et qui pourraient être pertinentes pour l'achat, la détention ou la cession de CSPR. Aucune mesure n'a été prise pour autoriser la distribution de ce Livre Blanc dans toute juridiction où une telle autorisation pourrait être requise.
vi: Việc phân phối Sách Trắng này và việc mua, giữ và/hoặc hủy bỏ CSPR có thể bị hạn chế bởi luật pháp ở một số khu vực pháp lý nhất định. Khi đọc Sách Trắng này, bạn cần tìm hiểu về (i) những hậu quả có thể xảy ra liên quan đến thuế, (ii) các yêu cầu pháp lý và quy định có liên quan, và (iii) các quy định hạn chế ngoại hối hoặc yêu cầu kiểm soát hối đoái nào mà bạn có thể gặp phải theo luật quyền công dân tại nơi cư trú hoặc tạm trú của mình và các quy định khác liên quan đến việc mua, giữ hoặc hủy bỏ CSPR. Không một hành động nào có thể cho phép phân phối Sách Trắng này ở bất kỳ khu vực tài phán nào cho dù khu vực đó cho phép phân phối.

source: No action has been or is intended to be taken by CasperLabs Networks AG and/or any of its affiliates in any jurisdiction that would or is intended to, permit a public sale or offering of any CSPR, or possession or distribution of this Whitepaper (in preliminary, proof or final form) or any other sale, offering or publicity material relating to the CSPR, in any country or jurisdiction where action for that purpose is required. Each recipient of this Whitepaper is reminded that it has received this Whitepaper on the basis that it is a person into whose possession this Whitepaper may be lawfully delivered in accordance with the laws of the jurisdiction in which it is located and/or bound and it may not nor is it authorised to deliver this document, electronically or otherwise, to any other person. If the recipient receives this document by e-mail, then its use of this e-mail is at its own risk and it is the recipient’s responsibility to take precautions to ensure that such e-mail is free from viruses and other items of a destructive nature.
de: Die CasperLabs Networks AG und/oder eine ihrer Tochtergesellschaften hat keine Maßnahmen ergriffen oder beabsichtigt, Maßnahmen zu ergreifen, die einen öffentlichen Verkauf oder ein öffentliches Angebot von CSPR oder den Besitz oder die Verteilung dieses Whitepapers (in vorläufiger, vorläufiger oder endgültiger Form) oder sonstiger Verkaufs-, Angebots- oder Werbematerialien in Bezug auf die CSPR in einem Land oder einer Gerichtsbarkeit, in dem/der Maßnahmen zu diesem Zweck erforderlich sind, erlauben würden oder dies beabsichtigt ist. Jeder Empfänger dieses Whitepapers wird darauf hingewiesen, dass er dieses Whitepaper auf der Grundlage erhalten hat, dass er eine Person ist, in deren Besitz dieses Whitepaper gemäß den Gesetzen der Rechtsordnung, in der er sich befindet und/oder gebunden ist, rechtmäßig übergeben werden darf, und dass er dieses Dokument weder elektronisch noch auf andere Weise an eine andere Person übergeben darf. Wenn der Empfänger dieses Dokument per E-Mail erhält, erfolgt die Nutzung dieser E-Mail auf eigenes Risiko, und es liegt in der Verantwortung des Empfängers, Vorsichtsmaßnahmen zu ergreifen, um sicherzustellen, dass diese E-Mail frei von Viren und anderen Elementen zerstörerischer Natur ist.
fr: Aucune action n'a été entreprise ou n'est destinée à être entreprise par CasperLabs Networks AG et/ou l'une de ses filiales dans une quelconque juridiction qui autoriserait ou serait destinée à autoriser une vente ou une offre publique de tout CSPR, ou la possession ou la distribution de ce Livre Blanc (sous forme préliminaire ou finale) ou toute autre vente, offre ou matériel publicitaire relatif au CSPR, dans tout pays ou juridiction où une action à cette fin est requise. Il est rappelé à chaque destinataire de ce Livre Blanc qu'il a reçu ce Livre Blanc sur la base du fait qu'il est une personne en possession de laquelle ce Livre Blanc peut être légalement remis conformément aux lois de la juridiction dans laquelle il se trouve et/ou est lié et qu'il ne peut ni n'est autorisé à remettre ce document, électroniquement ou autrement, à toute autre personne. Si le destinataire reçoit ce document par e-mail, il l'utilise à ses propres risques et il lui incombe de prendre les précautions nécessaires pour s'assurer que cet e-mail est exempt de virus et d'autres éléments de nature destructive.
vi: Không một hành động nào được thực hiện hoặc dự định được thực hiện bởi CasperLabs Networks AG và/hoặc bất kỳ chi nhánh nào của CasperLabs Networks AG ở bất kỳ khu vực tài phán nào cho phép bán hoặc cung cấp công khai bất kỳ CSPR nào, hoặc sở hữu hoặc phân phối Sách Trắng này (ở dạng sơ bộ, bằng chứng hoặc bản cuối cùng) hoặc bất kỳ tài liệu bán, chào hàng hoặc tài liệu công khai nào khác liên quan đến CSPR, ở bất kỳ quốc gia hoặc khu vực tài phán nào. Nếu bạn nhận Sách Trắng này, bạn cần lưu ý rằng bạn nhận Sách Trắng này trên cơ sở phân phối hợp pháp theo luật của khu vực tài phán nơi cư trú và không được phép cung cấp tài liệu này, bằng hình thức điện tử hay bằng các hình thức khác, cho bất kỳ người nào khác. Nếu bạn nhận được tài liệu này qua e-mail, thì bạn tự chịu rủi ro và tự chịu trách nhiệm thực hiện các biện pháp phòng ngừa để đảm bảo rằng e-mail đó không có vi-rút và không bao gồm các phần mềm độc hại khác.

source: **Preliminary Nature of this Whitepaper**
de: **Vorläufiger Charakter dieses Whitepapers**
fr: **Nature préliminaire de ce livre blanc**
vi: **Bản chất sơ bộ của Sách Trắng**

source: This Whitepaper is a draft and the information set out herein is of a preliminary nature. Consequently, neither CasperLabs Networks AG nor any of its affiliates assumes any responsibility that the information set out herein is final or correct and each of the foregoing disclaims, to the fullest extent permitted by applicable law, any and all liability whether arising in tort, contract or otherwise in respect of this Whitepaper. Neither this Whitepaper nor anything contained herein shall form the basis of or be relied on in connection with or act as an inducement to enter into any contract or commitment whatsoever. Recipients should note that the final structuring of CSPR and the Casper blockchain is subject to ongoing technical, legal, regulatory and tax considerations and each is, therefore, subject to material changes. In particular, neither the applicability nor the non-applicability of Swiss financial market regulations on the CSPR sale has not been confirmed by the Swiss Financial Market Supervisory Authority ("**FINMA**"). CasperLabs Networks AG and all its affiliates reserve the right to not assist in the completion of the software underlying CSPR and the CasperLabs blockchain, to not participate in the issuance or creation of CSPR or to change the structure of CSPR and/or the Casper blockchain for any reason, each at its sole discretion.
de: Dieses Whitepaper ist ein Entwurf und die hierin enthaltenen Informationen sind vorläufiger Natur. Folglich übernehmen weder die CasperLabs Networks AG noch eines ihrer verbundenen Unternehmen die Verantwortung dafür, dass die hierin enthaltenen Informationen endgültig oder korrekt sind, und jeder der Vorgenannten lehnt, soweit dies nach geltendem Recht zulässig ist, jegliche Haftung in Bezug auf dieses Whitepaper ab, unabhängig davon, ob diese aus unerlaubter Handlung, Vertrag oder anderweitig entsteht. Weder dieses Whitepaper noch irgendetwas hierin darf die Grundlage für einen Vertrag oder eine Verpflichtung bilden oder als Veranlassung zum Abschluss eines Vertrages oder einer Verpflichtung dienen. Die Empfänger sollten beachten, dass die endgültige Strukturierung von CSPR und der Casper-Blockchain laufenden technischen, rechtlichen, regulatorischen und steuerlichen Überlegungen unterliegt und sich daher jeweils wesentlich ändern kann. Insbesondere ist weder die Anwendbarkeit noch die Nichtanwendbarkeit der Schweizer Finanzmarktvorschriften auf den CSPR-Verkauf von der Schweizer Finanzmarktaufsicht ("**FINMA**") bestätigt worden. CasperLabs Networks AG und alle mit ihr verbundenen Unternehmen behalten sich das Recht vor, die Fertigstellung der dem CSPR und der CasperLabs-Blockchain zugrunde liegenden Software nicht zu unterstützen, sich nicht an der Ausgabe oder Erstellung des CSPR zu beteiligen oder die Struktur des CSPR und/oder der Casper-Blockchain aus beliebigen Gründen zu ändern, jeweils nach eigenem Ermessen.
fr: Ce livre blanc est une ébauche et les informations qu'il contient sont de nature préliminaire. Par conséquent, ni CasperLabs Networks AG ni aucune de ses sociétés affiliées n'assument la responsabilité de la finalité ou de l'exactitude des informations contenues dans le présent document et chacune des parties susmentionnées décline, dans toute la mesure permise par la loi applicable, toute responsabilité, qu'elle soit délictuelle, contractuelle ou autre, concernant ce livre blanc. Ni le présent Livre blanc ni aucun élément qu'il contient ne doivent constituer la base d'un contrat ou d'un engagement quelconque, ni être invoqués en relation avec ce contrat ou cet engagement, ni servir d'incitation à le conclure. Les destinataires doivent noter que la structuration finale de CSPR et de la blockchain Casper est soumise à des considérations techniques, juridiques, réglementaires et fiscales en cours et chacune d'entre elles est, par conséquent, sujette à des changements importants. En particulier, ni l'applicabilité ni la non-applicabilité de la réglementation suisse des marchés financiers sur la vente de CSPR n'a été confirmée par l'Autorité fédérale de surveillance des marchés financiers (" **FINMA** "). CasperLabs Networks AG et toutes ses sociétés affiliées se réservent le droit de ne pas contribuer à l'achèvement du logiciel sous-jacent à CSPR et à la blockchain CasperLabs, de ne pas participer à l'émission ou à la création de CSPR ou de modifier la structure de CSPR et/ou de la blockchain Casper pour quelque raison que ce soit, chacun à sa seule discrétion.
vi: Sách Trắng này là một bản nháp và thông tin nêu ở đây chỉ mang tính chất sơ bộ. Do đó, CasperLabs Networks AG và bất kỳ chi nhánh nào của CasperLabs Networks AG đều không chịu bất kỳ trách nhiệm nào về việc thông tin nêu ở đây có phải là cuối cùng hoặc có chính xác hay không, mỗi tuyên bố từ chối trách nhiệm nêu trên đây, trong phạm vi tối đa được luật pháp hiện hành cho phép, cũng từ chối trách nhiệm cho bất kỳ và tất cả trách nhiệm pháp lý nếu có phát sinh trong hợp đồng hoặc liên quan đến Sách Trắng này. Sách trắng này cũng như bất kỳ nội dung gì có trong tài liệu này sẽ không phải là cơ sở hoặc được dựa vào để cấu kết hoặc đóng vai trò như một sự xúi giục tham gia vào bất kỳ hợp đồng hoặc cam kết nào. Người nhận Sách Trắng này cần lưu ý rằng cấu trúc cuối cùng của CSPR và chuỗi khối Casper cần phải tuân theo các cân nhắc liên tục về kỹ thuật, pháp lý, quy định và thuế, và do đó mỗi cấu trúc đều có thể thay đổi. Đáng lưu ý, việc áp dụng và không áp dụng các quy định thị trường tài chính Thụy Sĩ vào việc bán CSPR đều chưa được Cơ Quan Giám Sát Thị Trường Tài Chính Thụy Sĩ ("**FINMA**") xác nhận. CasperLabs Networks AG và tất cả các chi nhánh của mình có quyền không hỗ trợ việc hoàn thiện phần mềm dựa trên CSPR và chuỗi khối CasperLabs, không tham gia vào việc phát hành hoặc tạo CSPR hoặc thay đổi cấu trúc của CSPR và/hoặc chuỗi khối Casper vì bất kỳ lý do nào, nếu có lý do thì đó là quyết định riêng của CasperLabs Networks AG và các chi nhánh.

source: **Forward-Looking Statements**
de: **Zukunftsgerichtete Aussagen**
fr: **Déclarations prévisionnelles**
vi: **Các tuyên bố mang ý nghĩa tương lai**

source: This Whitepaper includes "forward-looking statements", which are all statements other than statements of historical facts included in this Whitepaper. Words like "believe", "anticipate", "expect", "project", "estimate", "predict", "intend", "target", "assume", "may", "might", "could", "should", "will" and similar expressions are intended to identify such forward-looking statements. Such forward-looking statements involve known and unknown risks, uncertainties and other factors, which may cause the actual functionality, performance or features of the Casper blockchain and/or CSPR to be materially different from any future functionality, performance or features expressed or implied by such forward-looking statements. Such forward-looking statements are based on numerous assumptions regarding the CasperLabs Networks AG’s and/or any of its affiliates’ present and future expectations regarding the development of the Casper blockchain and the associated software.
de: Dieses Whitepaper enthält "zukunftsgerichtete Aussagen", d. h. alle Aussagen, die nicht auf historischen Tatsachen beruhen und in diesem Whitepaper enthalten sind. Wörter wie "glauben", "antizipieren", "erwarten", "projizieren", "schätzen", "vorhersagen", "beabsichtigen", "anstreben", "annehmen", "können", "könnten", "sollten", "werden" und ähnliche Ausdrücke dienen dazu, solche zukunftsgerichteten Aussagen zu identifizieren. Solche zukunftsgerichteten Aussagen beinhalten bekannte und unbekannte Risiken, Ungewissheiten und andere Faktoren, die dazu führen können, dass die tatsächliche Funktionalität, Leistung oder Eigenschaften der Casper-Blockchain und/oder von CSPR wesentlich von der zukünftigen Funktionalität, Leistung oder Eigenschaften abweichen, die in solchen zukunftsgerichteten Aussagen ausgedrückt oder impliziert werden. Solche zukunftsgerichteten Aussagen beruhen auf zahlreichen Annahmen bezüglich der gegenwärtigen und zukünftigen Erwartungen der CasperLabs Networks AG und/oder ihrer verbundenen Unternehmen hinsichtlich der Entwicklung der Casper-Blockchain und der zugehörigen Software.
fr: Ce livre blanc contient des "déclarations de nature prévisionnelle", qui sont toutes les déclarations autres que les déclarations de faits historiques incluses dans ce livre blanc. Des mots tels que "croire", "anticiper", "s'attendre", "projeter", "estimer", "prédire", "avoir l'intention", "viser", "supposer", "peut", "pourrait", "devrait", "sera" et d'autres expressions similaires sont destinés à identifier de telles déclarations prospectives. Ces déclarations à caractère prévisionnel impliquent des risques connus et inconnus, des incertitudes et d'autres facteurs, qui peuvent faire en sorte que la fonctionnalité, la performance ou les caractéristiques réelles de la blockchain Casper et/ou de CSPR soient matériellement différentes de toute fonctionnalité, performance ou caractéristique future exprimée ou sous-entendue par ces déclarations à caractère prévisionnel. Ces déclarations prévisionnelles sont fondées sur de nombreuses hypothèses concernant les attentes actuelles et futures de CasperLabs Networks AG et/ou de l'une de ses sociétés affiliées concernant le développement de la blockchain Casper et du logiciel associé.
vi: Sách Trắng này bao gồm “các tuyên bố mang ý nghĩa tương lai”, tức tất cả các tuyên bố không nêu các sự kiện lịch sử có trong Sách Trắng này. Các từ như "tin tưởng", "dự đoán", "mong đợi", "dự án", "ước tính", "dự đoán", "dự định", "mục tiêu", "giả định", "có thể", "nên", “sẽ” và các cách diễn đạt tương tự nhằm xác định những tuyên bố mang ý nghĩa tương lai. Những tuyên bố mang ý nghĩa tương lai như vậy liên quan đến những rủi ro, sự không chắc chắn và các yếu tố khác đã biết và chưa biết, có thể khiến chức năng, hiệu suất hoặc tính năng thực tế của chuỗi khối Casper và/hoặc CSPR khác biệt đáng kể với bất kỳ chức năng, hiệu suất hoặc tính năng nào trong tương lai được thể hiện hoặc ngụ ý trong những tuyên bố mang ý nghĩa tương lai. Những tuyên bố mang ý nghĩa tương lai như vậy dựa trên nhiều giả định liên quan đến bất kỳ kỳ vọng hiện tại và tương lai nào của CasperLabs Networks AG và/hoặc các chi nhánh liên quan đến việc phát triển chuỗi khối Casper và phần mềm liên quan.

source: These forward-looking statements speak only as of the date of this Whitepaper. CasperLabs Networks AG and its affiliates expressly disclaim any obligation or undertaking to release any updates of or revisions to any forward-looking statement contained herein to reflect any change in CasperLabs Networks AG’s and/or any of its affiliates’ expectations with regard thereto or any change in events, conditions or circumstances on which any such statement is based.
de: Diese zukunftsgerichteten Aussagen beziehen sich nur auf das Datum dieses Whitepapers. Die CasperLabs Networks AG und ihre Tochtergesellschaften lehnen ausdrücklich jegliche Verpflichtung ab, Aktualisierungen oder Korrekturen der hierin enthaltenen zukunftsgerichteten Aussagen zu veröffentlichen, um etwaige Änderungen der diesbezüglichen Erwartungen der CasperLabs Networks AG und/oder ihrer Tochtergesellschaften oder Änderungen von Ereignissen, Bedingungen oder Umständen, auf denen eine solche Aussage beruht, widerzuspiegeln.
fr: Ces déclarations prévisionnelles ne sont valables qu'à la date du présent Livre blanc. CasperLabs Networks AG et ses affiliés déclinent expressément toute obligation ou tout engagement de publier des mises à jour ou des révisions de toute déclaration prévisionnelle contenue dans le présent document afin de refléter tout changement dans les attentes de CasperLabs Networks AG et/ou de ses affiliés à cet égard ou tout changement dans les événements, conditions ou circonstances sur lesquels une telle déclaration est basée.
vi: Những tuyên bố mang ý nghĩa tương lai này được đưa ra vào ngày phát hành Sách Trắng. CasperLabs Networks AG và các chi nhánh của mình từ chối mọi nghĩa vụ hoặc không cam kết đưa ra bất kỳ bản cập nhật hoặc sửa đổi nào cho bất kỳ tuyên bố mang ý nghĩa tương lai nào có trong tài liệu này để phản ánh bất kỳ thay đổi nào trong các kỳ vọng của CasperLabs Networks AG và/hoặc các chi nhánh của mình về bất kỳ thay đổi nào liên quan đến các sự kiện, điều kiện hoặc hoàn cảnh diễn ra tuyên bố.

source: **Risk Factors**
de: **Risikofaktoren**
fr: **Facteurs de risque**
vi: **Các yếu tố rủi ro**

source: Furthermore, by accepting this Whitepaper, the recipient of hereof (the “**Recipient**”) acknowledges and agrees that it understands the inherent risks associated with blockchain and distributed ledger technology, tokens and cryptocurrencies in general and the CSPR in particular, including, but not limited to, those outlined hereinafter.
de: Darüber hinaus erkennt der Empfänger dieses Whitepapers (der "**Empfänger**") durch die Annahme dieses Whitepapers an und stimmt zu, dass er die inhärenten Risiken versteht, die mit der Blockchain- und Distributed-Ledger-Technologie, Token und Kryptowährungen im Allgemeinen und den CSPR im Besonderen verbunden sind, einschließlich, aber nicht beschränkt auf die im Folgenden dargelegten Risiken.
fr: En outre, en acceptant ce livre blanc, le destinataire des présentes (le " **destinataire** ") reconnaît et accepte qu'il comprend les risques inhérents associés à la blockchain et à la technologie du registre distribué (distributed ledger), aux jetons et aux crypto-monnaies en général et au RSPC en particulier, y compris, mais sans s'y limiter, ceux décrits ci-après.
vi: Hơn nữa, bằng cách chấp nhận Sách Trắng này, bạn (“**Người nhận**”) thừa nhận và đồng ý rằng bạn đã hiểu những rủi ro cố hữu liên quan đến công nghệ chuỗi khối và sổ cái phân tán, token và tiền điện tử nói chung, cũng như CSPR nói riêng, bao gồm, nhưng không giới hạn, những điều được nêu dưới đây.
