Repository: casper-network/docs-archive
Catalog: locale/*/LC_MESSAGES/dapp-dev-guide/tutorials/index.po
Languages: fr, tr

source: Tutorials
fr: Tutoriels
tr: Dersler

source: The following tutorials present several Casper features in depth:
fr: Les tutoriels suivants présentent en profondeur plusieurs fonctionnalités de Casper :
tr: Aşağıdaki dersler, birçok Casper özelliğini derinlemesine sunar:

source: Title
fr: Titre
tr: Başlık

source: Description
tr: Açıklama

source: `ERC-20 implementation <erc20/index.html>`_
fr: `Implémentation ERC-20 <erc20/index.html>`_
tr: `ERC-20 uygulaması <erc20/index.html>`_

source: Implement the ERC-20 standard for Casper
fr: Implémente la norme ERC-20 pour Casper
tr: ERC-20 standardını Casper için uygulayın

source: `Key-value storage with Casper DSL <kv-storage-tutorial.html>`_
fr: `Stockage clé-valeur avec le DSL Casper <kv-storage-tutorial.html>`_
tr: `Casper DSL ile anahtar-değer depolama <kv-storage-tutorial.html>`_

source: Design a simple contract to store a value and use the Casper DSL
fr: Concevoir un contrat simple pour stocker une valeur et utiliser le DSL Casper
tr: Değer saklayan ve Casper DSL'i kullanan basit bir kontrat tasarlayın

source: `Multi-signatures and key recovery <multi-sig/index.html>`_
fr: `Multi-signatures et récupération de clés <multi-sig/index.html>`_.
tr: `Çoklu-imzalar ve anahtar kurtarma <multi-sig/index.html>`_

source: Learn to sign transactions with multiple keys
fr: Apprenez à signer des transactions avec des clés multiples
tr: Birden çok anahtar ile işlemleri imzalamayı öğrenin

source: `Smart contract upgrades <upgrade-tutorial.html>`_
fr: `Mises à jour des contrats intelligents <upgrade-tutorial.html>`_
tr: `Akıllı kontrat yükseltmeleri <upgrade-tutorial.html>`_

source: Learn how to upgrade smart contracts
fr: Apprenez à mettre à jour les contrats intelligents
tr: Akıllı kontratların nasıl yükseltileceğini öğrenin
