Repository: casper-network/docs-archive
Catalog: locale/*/LC_MESSAGES/dapp-dev-guide/tutorials/kv-storage-tutorial.po
Languages: tr, vi

source: Key Value Storage Tutorial
tr: Anahtar Değeri Depolama Eğitimi
vi: Hướng dẫn lưu trữ giá trị khoá

source: This tutorial covers a simple contract, which creates a key that stores a ``CLType`` value. This example will show you how to store a *u64*, *string*, *account hash*, or *U512* value.
tr: Bu eğitim, bir ``CLType`` değerini depolayan bir anahtar oluşturan basit bir kontratı kapsar. Bu örnek size bir *u64*, *string*, *account hash*, veya *U512* değerinin nasıl depolanacağını gösterecektir.
vi: Hướng dẫn này bao gồm một hợp đồng đơn giản, tạo ra một khóa lưu trữ giá trị ``CLType``. Ví dụ này sẽ chỉ cho bạn cách lưu trữ giá trị *u64*, *string*, *account hash*, hoặc *U512* value.

source: The code is available in the `Casper Ecosystem GitHub <https://github.com/casper-ecosystem/kv-storage-contract>`_. Or, you can get started in `GitPod <https://gitpod.io/#https://github.com/casper-ecosystem/kv-storage-contract>`_.
tr: Kod, `Casper Ecosystem GitHub <https://github.com/casper-ecosystem/kv-storage-contract>`_ içinde mevcuttur. Veya `GitPod <https://gitpod.io/#https://github.com/casper-ecosystem/kv-storage-contract>`_ içerisinde başlayabilirsiniz.
vi: Mã có sẵn trong `GitHub hệ sinh thái Casper <https://github.com/casper-ecosystem/kv-storage-contract>`_. Hoặc, bạn có thể bắt đầu trong `GitPod <https://gitpod.io/#https://github.com/casper-ecosystem/kv-storage-contract>`_.

source: The Contract
tr: Kontrat
vi: Hợp đồng

source: Let's start by understanding the structure of the contract itself. Here we create a contract and name it ``kvstorage_contract``. The contract package will be stored under this name on the blockchain. Since the key-value contract is slightly stateless, initialization is not required.
tr: Kontrat yapısını anlayarak başlayalım. Burada bir kontrat oluşturuyoruz ve onu ``kvstorage_contract`` olarak adlandırıyoruz. Kontrat paketi blokzincir üzerinde bu ad altında saklanacaktır. key-value kontratı biraz durumsuz olduğundan, başlatma gerekli değildir.
vi: Hãy bắt đầu bằng cách hiểu cấu trúc của chính hợp đồng. Ở đây chúng tôi tạo một hợp đồng và đặt tên là ``kvstorage_contract``. Gói hợp đồng sẽ được lưu trữ dưới tên này trên chuỗi khối. Vì hợp đồng khóa-giá trị không có trạng thái nên không bắt buộc phải khởi tạo.

source: Testing the Contract
tr: Kontratın Test Edilmesi
vi: Kiểm thử hợp đồng

source: The CasperLabs Contracts SDK supports local testing of smart contracts. This tutorial will cover how to test the u64 key-value function. This can be easily adapted it for other types also.
tr: CasperLabs Kontratlar SDK'sı, akıllı kontratların yerel olarak test edilmesini destekler. Bu eğitim, u64 key-value işlevinin nasıl test edileceğini kapsayacaktır. Bu, diğer türler için de kolayca uyarlanabilir.
vi: CasperLabs Contracts SDK hỗ trợ thử nghiệm cục bộ các hợp đồng thông minh. Hướng dẫn này sẽ trình bày cách kiểm thử chức năng khóa-giá trị u64. Nó có thể dễ dàng điều chỉnh cho các loại khác.

source: In order to test the contract, the value must be stored, and the contract has to be deployed. Here is some sample code for these steps:
tr: Kontratı test etmek için değer saklanmış ve kontrat dağıtılmış olmalıdır. İşte bu adımlar için bazı örnek kodlar:
vi: Để kiểm thử hợp đồng, cần lưu trữ giá trị và triển khai hợp đồng. Đây là một số mã mẫu cho các bước sau:

source: Write Unit Tests
tr: Birim Testleri Yazma
vi: Viết kiểm thử đơn vị

source: With these functions in place, it's possible to start writing tests for the contract.
tr: Bu işlevler yerine getirildiğinde, kontrat için testler yazmaya başlamak mümkündür.
vi: Với các hàm này, bạn có thể bắt đầu viết các bài kiểm thử cho hợp đồng.

source: Running Locally
tr: Yerel Olarak Çalıştırma
vi: Chạy cục bộ

source: It's possible to run the unit tests locally- if you have set up the contract using `cargo-casperlabs <https://crates.io/cargo-casperlabs>`_. The steps to set up the SDK are in the guide.
tr: Eğer kontratı `cargo-casperlabs <https://crates.io/cargo-casperlabs>`_ kullanarak ayarladıysanız, birim testlerini yerel olarak çalıştırmak mümkündür. SDK'yı kurma adımları rehber içindedir.
vi: Có thể chạy các bài kiểm thửu đơn vị cục bộ- nếu bạn đã thiết lập hợp đồng bằng cách sử dụng `cargo-casperlabs <https://crates.io/cargo-casperlabs>`_. Các bước để thiết lập SDK có trong hướng dẫn.

source: Deploying to the Testnet and Interacting with the Contract
tr: Testnet'e Dağıtım ve Kontrat ile Etkileşim
vi: Triển khai với Testnet và Tương tác với Hợp đồng

source: When working with the testnet, create an account in `CLarity <https://clarity.casperlabs.io>`_ and fund it using the faucet. Download the private key and use the key to sign the deployment. It's possible to create keys using the rust client as well.
tr: Testnet ile çalışırken, `CLarity <https://clarity.casperlabs.io>`_ içinde bir hesap oluşturun ve faucet kullanarak finanse edin. Özel anahtarı indirin ve dağıtımı imzalamak için anahtarı kullanın. Rust istemcisini kullanarak da anahtarlar oluşturmak mümkündür.
vi: Khi làm việc với testnet, hãy tạo một tài khoản trong `CLarity <https://clarity.casperlabs.io>`_ và nạp tiền cho nó qua chốt. Tải xuống khóa cá nhân và sử dụng khóa để ký triển khai. Cũng có thể tạo khóa bằng rust client

source: Deploy the Contract
tr: Kontratı Dağıtma
vi: Triển khai hợp đồng

source: After the contract has been compiled, it's time to deploy the compiled wasm to the network. This action installs the contract in the blockchain. Once the contract is deployed, the client can retrieve the contract session hash as well as the blockhash where the contract is deployed.
tr: Kontrat derlendikten sonra, derlenen wasm'yi ağa dağıtma zamanı. Bu eylem, kontratı blokzincir içerisinde yükler. Kontrat bir kez dağıtıldıktan sonra müşteri, kontratın dağıtıldığı blockhash'in yanı sıra kontrat oturum özeti de alabilir.
vi: Sau khi hợp đồng đã được biên dịch, đã đến lúc triển khai wasm đã biên dịch vào mạng. Hành động này cài đặt hợp đồng trong chuỗi khối. Sau khi hợp đồng được triển khai, khách hàng có thể truy xuất mã băm phiên hợp đồng cũng như blockhash nơi hợp đồng được triển khai.

source: If the deploy works, a response similar this will be returned:
tr: Eğer dağıtım çalışırsa, buna benzer bir yanıt döndürülecektir:
vi: Nếu triển khai hoạt động, một phản hồi tương tự phản hồi này sẽ được trả lại:

source: Query the Contract On Chain
tr: Zincir Üzerindeki Kontratı Sorgula
vi: Truy vấn Hợp đồng trên chuỗi

source: Contracts can be executed under different contexts. In this example, when the contract is deployed, it runs in the context of a ``Contract`` and not a ``Session``. This means that all stored keys are not stored under the account hash, but within the context of the contract. Therefore when we query to retrieve the value under a key, we are actually querying ``AccountHash/kvstorage_contract/<key-name>`` and not just ``AccountHash/<key-name>``.
tr: Kontratlar farklı bağlamlar altında yürütülebilir. Bu örnekte, kontrat dağıtıldığında, bir ``Session`` değil ``Contract`` bağlamında çalışır. Bu, saklanan tüm anahtarların account hash altında değil, contract bağlamı içerisinde depolandığı anlamına gelir. Bu nedenle, bir anahtarın altındaki değeri almak için sorgulama yaptığımızda, aslında sadece``AccountHash/<key-name>`` değil ``AccountHash/kvstorage_contract/<key-name>`` sorgusunu da yapıyoruz.
vi: Hợp đồng có thể được thực hiện trong các ngữ cảnh khác nhau. Trong ví dụ này, khi hợp đồng được triển khai, nó chạy trong ngữ cảnh của ``Contract``chứ không phải là ``Session``. Điều này có nghĩa là tất cả các khóa được lưu trữ không được lưu trữ dưới dạng băm tài khoản, mà trong ngữ cảnh của hợp đồng. Do đó, khi chúng ta truy vấn để truy xuất giá trị trong một khóa, chúng ta thực sự đang truy vấn ``AccountHash/kvstorage_contract/<key-name>`` chứ không chỉ ``AccountHash/<key-name>``.

source: You must first find the block hash for the block that contains your deploy. Once you have the requisite block hash, then you can use ``casper-client`` to retrieve the session hash
tr: İlk önce dağıtımınızı içeren blok için blok özeti bulmalısınız. Gerekli blok özetine sahip olduğunuzda, oturum özetini almak için``casper-client`` kullanabilirsiniz.
vi: Trước tiên, bạn phải tìm băm của khối chứa triển khai của bạn. Khi bạn có băm khối cần thiết, bạn có thể sử dụng ``casper-client`` để truy xuất phiên băm

source: Reading a value is simple enough, we obtain the block hash under which the value, is stored, and then\ :raw-html-m2r:`<br>` using that block hash, and the ``query-state`` command you can easily retrieve and value that was stored under a named key. Please reference the `Querying Section <https://docs.casperlabs.io/en/latest/dapp-dev-guide/querying.html>`_ for details. An example global state query looks like this:
tr: Bir değeri okumak yeterince basittir, değerin altında saklandığı blok özeti elde ederiz ve ardından bu blok özetini kullanarak\ :raw-html-m2r:`<br>` ve ``query-state`` komutunu kullanarak adlandırılmış bir anahtar altında depolanan değeri kolayca elde edebilirsiniz. Ayrıntılar için lütfen `Sorgulama Bölümüne <https://docs.casperlabs.io/en/latest/dapp-dev-guide/querying.html>`_ bakın. Örnek bir küresel durum sorgusu şöyle görünür:
vi: Đọc một giá trị đủ đơn giản, chúng tôi nhận được mã băm khối mà giá trị được lưu trữ, sau đó\ :raw-html-m2r:`<br>` bằng cách sử dụng hàm băm khối đó và lệnh ``query-state`` mà bạn có thể dễ dàng truy xuất và giá trị sẽ được lưu trữ dưới một khóa được đặt tên. Vui lòng tham khảo `Phần truy vấn <https://docs.casperlabs.io/en/latest/dapp-dev-guide/querying.html>`_ để biết chi tiết. Một mẫu truy vấn trạng thái toàn cục trông giống như sau:
