Repository: casper-network/docs-archive
Catalog: locale/*/LC_MESSAGES/dapp-dev-guide/tutorials/upgrade-tutorial.po
Languages: fr, tr, vi

source: Smart Contract Upgrade Tutorial
fr: Tutoriel sur la mise à jour d'un contrat intelligent
tr: Akıllı Kontrat Yükseltme Eğitimi
vi: Hướng dẫn nâng cấp Hợp đồng Thông minh

source: This tutorial shows you how to upgrade smart contracts. Casper contracts are upgradeable, making it easy for contract authors to add features and fix bugs in smart contracts.
fr: Ce tutoriel vous montre comment mettre à jour des contrats intelligents. Les contrats Casper peuvent être mis à jour, ce qui permet aux auteurs de contrats d'ajouter facilement des fonctionnalités et de corriger des bugs dans les contrats intelligents.
tr: Bu eğitim, akıllı kontratları nasıl yükselteceğinizi gösterir. Casper kontratları yükseltilebilirdir, bu da sözleşme yazarlarının akıllı kontratlara özellikler eklemesini ve hataları düzeltmesini kolaylaştırır.
vi: Hướng dẫn này chỉ cho bạn cách nâng cấp hợp đồng thông minh. Hợp đồng Casper có thể nâng cấp, giúp các tác giả hợp đồng dễ dàng thêm các tính năng và sửa lỗi trong hợp đồng thông minh.

source: The process of upgrading a smart contract is simple. All you need is to deploy a new version of the contract and overwrite the old functions with new ones.
fr: Le processus de mise à jour d'un contrat intelligent est simple. Il suffit de déployer une nouvelle version du contrat et de remplacer les anciennes fonctions par les nouvelles.
tr: Bir akıllı kontratı yükseltme süreci basittir. Tek ihtiyacınız olan, sözleşmenin yeni bir sürümünü dağıtmak ve eski işlevlerin üzerine yenilerini yazmaktır.
vi: Quá trình nâng cấp hợp đồng thông minh rất đơn giản. Tất cả những gì bạn cần là triển khai một phiên bản mới của hợp đồng và ghi đè các chức năng cũ bằng các chức năng mới.

source: These are the essential steps you need to follow:
fr: Voici les étapes essentielles que vous devez suivre :
tr: Bunlar, izlemeniz gereken temel adımlardır:
vi: Đây là những bước thiết yếu bạn cần làm theo:

source: Deploy the contract with an *upgrade* function
fr: Déployer le contrat avec une fonction *upgrade*
tr: Kontratı bir *upgrade* işleviyle dağıtın
vi: Triển khai hợp đồng với chức năng *upgrade*

source: Add an entry point in the *call* function for the *upgrade* function
fr: Ajouter un point d'entrée dans la fonction *call* pour la fonction *upgrade*
tr: *upgrade* işlevi için *call* işlevine bir giriş noktası ekleyin
vi: Thêm điểm vào trong hàm *call* cho hàm *upgrade*

source: Add the new features you desire
fr: Ajoutez les nouvelles fonctionnalités que vous souhaitez
tr: Arzu ettiğiniz yeni özellikleri ekleyin
vi: Thêm các tính năng mới mà bạn mong muốn

source: Here are specific examples of how to implement the upgrade functionality.
fr: Voici des exemples concrets de la manière de mettre en œuvre la fonctionnalité de mise à jour.
tr: Yükseltme işlevinin nasıl uygulanacağına ilişkin özel örnekler burada verilmiştir.
vi: Dưới đây là các ví dụ cụ thể về cách triển khai chức năng nâng cấp.

source: Step 1. Deploy the contract with an 'upgrade' function
fr: Étape 1. Déployez le contrat avec une fonction de 'upgrade'
tr: Adım 1. kontratı bir 'upgrade' işleviyle dağıtın
vi: Bước 1. Triển khai hợp đồng với hàm 'upgrade'

source: When you first deploy the contract, you must include an *upgrade* function. Since the contract is immutable, you cannot add the *upgrade* function after deployment. Without the this function, you cannot upgrade the contract. In other words, you must include the *upgrade* function when you first deploy the contract.
fr: Lorsque vous déployez le contrat pour la première fois, vous devez inclure une fonction *upgrade*. Le contrat étant immuable, vous ne pouvez pas ajouter la fonction *upgrade* après le déploiement. Sans cette fonction, vous ne pouvez pas mettre à jour le contrat. En d'autres termes, vous devez inclure la fonction *upgrade* lors du premier déploiement du contrat.
tr: kontratı ilk kez dağıttığınızda, bir *upgrade* işlevi eklemelisiniz. kontrat değişmez olduğundan, dağıtımdan sonra *upgrade* işlevini ekleyemezsiniz. Bu işlev olmadan kontratı yükseltemezsiniz. Diğer bir deyişle, kontratı ilk kez dağıttığınızda *upgrade* işlevini dahil etmeniz gerekir.
vi: Khi bạn triển khai hợp đồng lần đầu tiên, bạn phải đưa vào hàm *upgrade*. Vì hợp đồng là bất biến, bạn không thể thêm hàm *upgrade* sau khi triển khai. Nếu không có hàm này, bạn không thể nâng cấp hợp đồng. Nói cách khác, bạn phải đưa vào hàm *upgrade* khi bạn triển khai hợp đồng lần đầu tiên.

source: Start by creating an *upgrade* function in your contract similar to the following example.
fr: Commencez par créer une fonction *upgrade* dans votre contrat semblable à l'exemple suivant.
tr: Sözleşmenizde aşağıdaki örneğe benzer bir *upgrade* işlevi oluşturarak başlayın.
vi: Bắt đầu bằng cách tạo hàm *upgrade* trong hợp đồng của bạn tương tự như ví dụ sau.

source: Step 2. Add an entry point in the 'call' function
fr: Étape 2. Ajoutez un point d'entrée dans la fonction 'call'.
tr: Adım 2. 'call' işlevine bir giriş noktası ekleyin
vi: Bước 2. Thêm một điểm vào trong hàm 'gọi'

source: Next, you need to add an entry point to the *upgrade* function in the *call* function. This enables the contract execution to invoke the *upgrade* function in the future.
fr: Ensuite, vous devez ajouter un point d'entrée à la fonction *upgrade* dans la fonction *call*. Cela permet à l'exécution du contrat d'invoquer la fonction *upgrade* à l'avenir.
tr: Ardından, *call* işlevindeki *upgrade* işlevine bir giriş noktası eklemeniz gerekiyor. Bu, kontrat yürütmesinin gelecekte *upgrade* işlevini çağırmasını sağlar.
vi: Tiếp theo, bạn cần thêm điểm vào cho hàm *upgrade* trong hàm *call*. Điều này cho phép thực thi hợp đồng gọi hàm *upgrade* trong tương lai.

source: Step 3. Add new features
fr: Étape 3. Ajoutez de nouvelles fonctionnalités
tr: Adım 3. Yeni özellikler ekleyin
vi: Bước 3. Thêm các tính năng mới

source: Now you are ready to upgrade your contract and add the new features and functions you desire.
fr: Vous êtes maintenant prêt à mettre à jour votre contrat et à ajouter les nouvelles capacités et fonctions que vous souhaitez.
tr: Artık sözleşmenizi yükseltmeye ve istediğiniz yeni özellikleri ve işlevleri eklemeye hazırsınız.
vi: Bây giờ bạn đã sẵn sàng nâng cấp hợp đồng của mình và thêm các tính năng và chức năng mới mà bạn mong muốn.

source: The `add_contract_version <https://docs.rs/casperlabs-contract/0.6.1/casperlabs_contract/contract_api/storage/fn.add_contract_version.html>`_ API will allow you to deploy a new version of your contract.
fr: L'API `add_contract_version <https://docs.rs/casperlabs-contract/0.6.1/casperlabs_contract/contract_api/storage/fn.add_contract_version.html>`_ vous permettra de déployer une nouvelle version de votre contrat.
tr: `add_contract_version <https://docs.rs/casperlabs-contract/0.6.1/casperlabs_contract/contract_api/storage/fn.add_contract_version.html>`_ APIsi, sözleşmenizin yeni bir sürümünü dağıtmanıza olanak tanır.

source: Remember, it is essential to include the *upgrade* function and safeguard the access token when you first deploy the contract. You will need the access token for future upgrades.
fr: N'oubliez pas qu'il est essentiel d'inclure la fonction *upgrade* et de sauvegarder le jeton d'accès lors du premier déploiement du contrat. Vous aurez besoin du jeton d'accès pour les futures mises à niveau.
tr: Kontratı ilk kez dağıttığınızda *upgrade* işlevini eklemenin ve erişim tokenini korumanın çok önemli olduğunu unutmayın. Gelecek yükseltmeler için erişim tokenine ihtiyacınız olacak.
vi: Hãy nhớ rằng, điều cần thiết là phải đưa vào hàm *upgrade* và bảo vệ truy cập token khi bạn triển khai hợp đồng lần đầu tiên. Bạn sẽ cần truy cập token để nâng cấp trong tương lai.

source: External links
fr: Liens externes
tr: Harici bağlantılar
vi: Liên kết ngoài

source: `Sample upgrader <https://github.com/CasperLabs/casper-node/tree/master/smart_contracts/contracts/test/do-nothing-stored-upgrader>`_
tr: `Örnek yükseltici <https://github.com/CasperLabs/casper-node/tree/master/smart_contracts/contracts/test/do-nothing-stored-upgrader>`_

source: `API details for add_contract_version <https://docs.rs/casperlabs-contract/0.6.1/casperlabs_contract/contract_api/storage/fn.add_contract_version.html>`_
fr: `Détails de l'API pour add_contract_version <https://docs.rs/casperlabs-contract/0.6.1/casperlabs_contract/contract_api/storage/fn.add_contract_version.html>`_
tr: `add_contract_version için API ayrıntıları <https://docs.rs/casperlabs-contract/0.6.1/casperlabs_contract/contract_api/storage/fn.add_contract_version.html>`_

source: `Other examples of smart contracts <https://github.com/CasperLabs/casper-node/tree/master/smart_contracts>`_
fr: `Autres exemples de contrats intelligents <https://github.com/CasperLabs/casper-node/tree/master/smart_contracts>`_
tr: `Akıllı kontratların diğer örnekleri <https://github.com/CasperLabs/casper-node/tree/master/smart_contracts>`_

source: The `add_contract_version <https://docs.rs/casper-contract/latest/casper_contract/contract_api/storage/fn.add_contract_version.html>`_ API will allow you to deploy a new version of your contract.
vi: `add_contract_version <https://docs.rs/casper-contract/latest/casper_contract/contract_api/storage/fn.add_contract_version.html>`_ API sẽ cho phép bạn triển khai phiên bản hợp đồng mới của mình.

source: For more sample code, check out this `contract upgrade example <https://github.com/casper-ecosystem/contract-upgrade-example>`_
vi: Để biết thêm mã mẫu, hãy xem `contract upgrade example <https://github.com/casper-ecosystem/contract-upgrade-example>`_

source: The API details for adding a version are in `add_contract_version <https://docs.rs/casper-contract/latest/casper_contract/contract_api/storage/fn.add_contract_version.html>`_
vi: Chi tiết API để thêm phiên bản có trong `add_contract_version <https://docs.rs/casper-contract/latest/casper_contract/contract_api/storage/fn.add_contract_version.html>`_

source: Other examples of smart contracts can be found `here <https://github.com/casper-network/casper-node/tree/master/smart_contracts>`_
vi: Có thể tìm thấy các ví dụ khác về hợp đồng thông minh `tại đây <https://github.com/casper-network/casper-node/tree/master/smart_contracts>`_
