Repository: casper-network/docs-archive
Catalog: locale/*/LC_MESSAGES/node-operator/bonding.po
Languages: fr, tr, vi

source: Bonding
fr: Cautionnement (Bonding)
tr: Bağlanma
vi: Cổ phần

source: It is recommended that a bonding request be sent once the node has completed the synchronization process. Bonding in Casper takes place through the auction contract via the ``add_bid.wasm`` contract. The auction runs for a future era, every era. The Chainspec specifies the number of slots available, and the auction will take the top N slots and create the validator set for the future era. In the testnet, era durations are approx. 30 minutes. The entire process takes approximately 3 eras. Therefore, the time for bid submission to inclusion in the validator set is a minimum of 90 minutes.\ :raw-html-m2r:`<br>` Bonding requests (bids) are transactions like any other. Because they are generic transactions, they are more resistant to censorship.
fr: Il est recommandé d'envoyer une requête de cautionnement (bonding) une fois que le nœud a terminé le processus de synchronisation. Le bonding dans Casper se fait par le contrat d'enchères via le contrat ``add_bid.wasm`` . L'enchère se déroule pour une ère future, à chaque ère. Le Chainspec spécifie le nombre de slots disponibles, et l'enchère prendra les N meilleurs slots et créera le jeu de validateurs pour l'ère future. Dans le testnet, la durée des ères est d'environ 30 minutes. L'ensemble du processus prend environ 3 ères. Par conséquent, le délai entre la soumission de l'offre et l'inclusion dans le jeu de validateurs est d'au moins 90 minutes.\ :raw-html-m2r:`<br>` Les requêtes de cautionnement (bids) sont des transactions comme les autres. Comme il s'agit de transactions génériques, elles sont plus résistantes à la censure.
tr: Bağlanma talebinin, düğümün ağ ile eşlenme süreci tamamlandıktan sonra gönderilmesi önerilir. Casper'da bağlanma süreci, ``add_bid.wasm`` kontratı yoluyla, müzayede kontratı üzerinden gerçekleşir. Müzayede, her dönemde, bir sonraki dönem için gerçekleşir. Chainspec, kullanılabilir yuva sayısını belirtir ve müzayede, en yüksek N adet yuvayı alarak gelecek dönem için doğrulayıcı kümesini oluşturur. Test ağında (Testnet), dönem uzunlukları yaklaşık olarak 30 dakikadır. Tüm süreç yaklaşık olarak 3 dönemde tamamlanır. Dolayısıyla, doğrulayıcı kümesine dahil olmak için teklif gönderme süresi en az 90 dakikadır.\ :raw-html-m2r:`<br>` Bağlanma talepleri (teklifler), ağdaki diğer işlemlerden farksızdır. Genel işlemler oldukları için sansüre karşı daha dirençlidirler.
vi: Chúng tôi khuyến nghị rằng một yêu cầu cổ phần được gửi sau khi nút đã hoàn thành quá trình đồng bộ hóa. Cổ phần trong Casper diễn ra thông qua hợp đồng đấu giá ``add_bid.wasm``. Cuộc đấu giá diễn ra cho mọi kỷ nguyên tương lai. Chainspec chỉ định số lượng vị trí có sẵn và cuộc đấu giá sẽ lấy N vị trí hàng đầu và tạo nhóm người xác thực cho kỷ nguyên tương lai. Trong testnet, khoảng thời gian của thời đại là khoảng. 30 phút. Toàn bộ quá trình mất khoảng 3 kỷ nguyên. Do đó, thời gian gửi hồ sơ dự thầu để đưa vào nhóm nhà\ xác thực tối thiểu là 90 phút.\ :raw-html-m2r:`<br>` Yêu cầu cổ phần (giá thầu) là các giao dịch giống như bất kỳ giao dịch nào khác. Bởi vì chúng là các giao dịch chung, chúng có khả năng chống lại sự kiểm duyệt cao hơn.

source: Security and Bonding
fr: Sécurité et cautionnement (Bonding)
tr: Güvenlik ve Bağlanma
vi: Bảo mật và cổ phần

source: The most secure way to send a bonding transaction is to compile the contract and send the request to the network. Because the transaction authorizes the token to be locked into the auction contract, it's really important to compile the contract yourself. Here are the steps to do this:
fr: La façon la plus sûre d'envoyer une transaction de cautionnement est de compiler le contrat et d'envoyer la demande au réseau. Étant donné que la transaction autorise le jeton à être verrouillé dans le contrat d'enchères, il est très important de compiler le contrat vous-même. Voici les étapes à suivre pour ce faire :
tr: Bağlanma işlemini göndermenin en güvenli yolu, kontratı derlemek ve talebi ağa göndermektir. İşlem, tokenin müzayede kontratına kilitlenmesine izin verdiğinden, sözleşmeyi kendiniz derlemeniz gerçekten önemlidir. Bunu yapmak için adımlar şunlardır:
vi: Cách an toàn nhất để gửi giao dịch cổ phầnlà soạn hợp đồng và gửi yêu cầu tới mạng. Vì giao dịch cho phép mã thông báo bị khóa trong hợp đồng đấu giá nên việc tự biên dịch hợp đồng thực sự quan trọng. Dưới đây là các bước để thực hiện việc này:

source: Visit `Github <https://github.com/CasperLabs/casper-node>`_ and fork and clone the repository.
fr: Visiter `Github <https://github.com/CasperLabs/casper-node>`_ et dupliquer puis cloner le repository.
tr: `Github <https://github.com/CasperLabs/casper-node>`_ adresimizi ziyaret edin ve kod deposunu çatallayıp klonlayın.

source: Make sure that all dependencies are installed (documented on GitHub).
fr: Assurez-vous que toutes les dépendances sont installées (documentées sur GitHub).
tr: Tüm bağımlılıkların kurulu olduğundan emin olun (GitHub üzerinde belgelendirilmiştir).
vi: Đảm bảo rằng tất cả các phần phụ thuộc đã được cài đặt (tài liệu trên GitHub).

source: Follow the instructions to build the contracts.
fr: Suivez les instructions pour construire les contrats.
tr: Kontratları derlemek için yönergeleri takip edin.
vi: Thực hiện theo các hướng dẫn để xây dựng các hợp đồng.

source: Ensure that the keys you will use for bonding are available & have been funded.
fr: Assurez-vous que les clés que vous utiliserez pour le bonding sont disponibles et ont été provisionnées.
tr: Bağlanma işlemi için kullanacağınız anahtarların kullanılabilir durumda ve pozitif bakiyeli olduğundan emin olun.
vi: Đảm bảo rằng có thể cổ phần các khóa mà bạn sử dụng và đã được nạp tiền.

source: Create the bonding transaction & deploy it.
fr: Créez la transaction de bonding et déployez-la.
tr: Bağlanma işlemini oluşturun ve ağa dağıtın.
vi: Tạo giao dịch cổ phần và triển khai nó.

source: Query the system to verify that your bid was accepted.
fr: Interrogez le système pour vérifier que votre offre a été acceptée.
tr: Teklifinizin kabul edildiğinden emin olmak için sistemi sorgulayın.
vi: Truy vấn hệ thống để xác minh rằng giá thầu của bạn đã được chấp nhận.

source: Check the status of the auction to see if you have won a slot.
fr: Vérifiez le statut de l'enchère pour savoir si vous avez gagné un slot.
tr: Bir yuva kazanıp kazanmadığınızı görmek için müzayede durumunu kontrol edin.
vi: Kiểm tra trạng thái của cuộc đấu giá để xem liệu bạn có giành được vị trí hay không.

source: Build Add_Bid Contract
fr: Construire le contrat Add_Bid
tr: Add_Bid Kontratını Derleyin
vi: Dựng hợp đồng Add_Bid

source: Because bonding transactions are generic transactions, it's necessary to build the contract that submits a bid. Clone the casper-node repository and build the contracts. To build contracts, set up Rust & install all dependencies. Visit 'Setting up Rust' in the Developer Guide.
fr: Comme les transactions de bonding sont des transactions génériques, il est nécessaire de construire le contrat qui soumet une offre. Clonez le dépôt casper-node et construisez les contrats. Pour construire les contrats, configurez Rust et installez toutes les dépendances. Consultez la section 'Configuration de Rust' du Guide du développeur.
tr: Bağlanma işlemleri genel işlemler olduğundan, teklif veren kontratın oluşturulması gerekir. casper-node kod deposunu klonlayın ve kontratları derleyin. Kontratları derlemek için Rust'ı ve tüm bağımlılıkları kurun. Geliştirici Kılavuzunda 'Rust Kurulumu' bölümünü ziyaret edin.
vi: Vì các giao dịch cổ phần là các giao dịch chung, nên cần phải xây dựng hợp đồng gửi giá thầu. Sao chép kho lưu trữ nút casper và xây dựng các hợp đồng. Để xây dựng hợp đồng, hãy thiết lập Rust và cài đặt tất cả các phần phụ thuộc. Xem 'Thiết lập Rust' trong Hướng dẫn dành cho nhà phát triển.

source: Build the contracts in release mode.
fr: Construire les contrats en mode release.
tr: Kontratları yayım kipinde derleyin.
vi: Dựng hợp đồng ở chế độ phát hành.

source: Example Bonding Transaction
fr: Exemple de transaction de Bonding
tr: Örnek Bağlanma İşlemi
vi: Ví dụ về Giao dịch Cổ phần

source: Note the path to files and keys. Note: the session arguments need to be encased in double-quotes, with the parameter values in single quotes. Note the required payment amount. It must contain at least 10 zeros. The payment amount is specified in motes.
fr: Notez le chemin d'accès aux fichiers et aux clés. Remarque : les arguments de la session doivent être placés entre guillemets doubles, et les valeurs des paramètres entre guillemets simples. Notez le montant du paiement requis. Il doit contenir au moins 10 zéros. Le montant du paiement est indiqué en motes.
tr: Dosyaların ve anahtarların yolunu not edin. Not: oturum argümanlarının çift tırnak içine alınması ve parametre değerlerinin tek tırnak içine alınması gerekir. Gerekli ödeme tutarını not edin. Bu değer en az 10 sıfır içermelidir. Ödeme tutarı mote olarak belirtilir.
vi: Lưu ý đường dẫn đến tệp và khóa. Lưu ý: các đối số phiên cần được đặt trong dấu ngoặc kép, với các giá trị tham số trong dấu ngoặc đơn. Lưu ý số tiền thanh toán cần thiết. Nó phải chứa ít nhất 10 số không. Số tiền thanh toán được xác định bằng mote.

source: Contract Arguments
fr: Arguments de Contrat
tr: Kontrat Argümanları
vi: Đối số của hợp đồng

source: The add_bid contract accepts 3 arguments:
fr: Le contrat add_bid accepte 3 arguments:
tr: add_bid kontratı, 3 argüman kabul eder:
vi: Hợp đồng add_bid chấp nhận 3 đối số:

source: public key: The public key in hex of the account to bond. Note: This has to be the matching key to the validator's secret key that signs the deployment.
fr: public key: La clé publique en hexadécimal du compte à cautionner. Remarque : Il doit s'agir de la clé correspondant à la clé secrète du validateur qui signe le déploiement.
tr: public key: Bağlanma işlemini yapacak hesabın, hex biçiminde genel anahtarı (adresi). Not: Bu genel anahtar, dağıtımı imzalayacak doğrulayıcı gizli anahtarı ile eşleşmelidir.
vi: public key: Khóa công khai trong hex của tài khoản cổ phần. Lưu ý: Đây phải là khóa phù hợp với khóa bí mật của nhà xác thực đã ký vào triển khai.

source: amount: This is the amount that is being bid. If the bid wins, this will be the validator's initial bond amount.
fr: amount: Il s'agit du montant de l'offre. Si l'offre est retenue, ce sera le montant initial de la caution du validateur.
tr: amount: Teklif miktarını belirtir. Eğer teklif açık arttırmayı kazanırsa, bu miktar doğrulayıcının ilk bağ miktarı olacaktır.
vi: amount: Đây là số tiền đang được đặt giá thầu. Nếu giá thầu thắng, đây sẽ là số tiền cổ phần ban đầu của người xác thực.

source: delegation_rate: The percentage of rewards that the validator retains from delegators that delegate their tokens to the node.
fr: delegation_rate: Le pourcentage de récompenses que le validateur conserve des délégués qui délèguent leurs jetons au nœud.
tr: delegation_rate: Tokenleri için bu düğümü yetkilendiren kullanıcıların kazandığı ödüllerden, doğrulayıcının alacağı pay yüzdesidir.
vi: delegation_rate: Phần trăm phần thưởng mà người xác thực giữ lại từ những người ủy quyền ủy quyền token của họ cho nút.

source: Check the Status of the Transaction
fr: Vérifier l'état de la transaction
tr: İşlem Durumunu Kontrol Edin
vi: Kiểm tra Trạng thái của Giao dịch

source: Since this is a deployment like any other, it's possible to perform ``get-deploy`` using the client, which will return the execution status.
fr: Puisqu'il s'agit d'un déploiement comme un autre, il est possible d'exécuter ``get-deploy`` en utilisant le client, ce qui retournera le statut d'exécution.
tr: Bu da diğer dağıtımlardan farksız olduğu için, istemciyi kullanarak ``get-deploy`` çalıştırmak mümkündür; bu, yürütme durumunu döndürecektir.
vi: Vì đây là một triển khai giống như bất kỳ triển khai nào khác, nên có thể thực hiện ``get-deploy`` bằng cách sử dụng máy client, thao tác này sẽ trả về trạng thái thực thi.

source: Check the Status of the bid in the Auction
fr: Vérifier le statut de l'offre dans l'enchère
tr: Teklifin Müzayededeki Durumunu Kontrol Edin
vi: Kiểm tra Trạng thái của giá thầu trong Phiên đấu giá

source: If the bid wins the auction, the public key and associated bond amount (formerly bid amount) will appear in the auction contract as part of the validator set for a future era. To determine if the bid was accepted, query the auction contract via the rust ``casper-client``
fr: Si l'offre remporte l'enchère, la clé publique et le montant de la caution associée (anciennement le montant de l'offre) apparaîtront dans le contrat d'enchère comme faisant partie du jeu de validateurs pour une ère future. Pour déterminer si l'offre a été acceptée, interroger le contrat d'enchère via l'outil rust ``casper-client``.
tr: Teklif açık artırmayı kazanırsa, açık anahtar ve ilişkili bağ tutarı (önceki teklif tutarı), gelecekteki bir dönem için doğrulayıcının bir parçası olarak açık artırma kontratında görünecektir. Teklifin kabul edilip edilmediğini belirlemek için, açık artırma kontratını rust ``casper-client`` aracılığıyla sorgulayın.
vi: Nếu giá thầu thắng cuộc đấu giá, khóa công khai và số cổ phần được liên kết (trước đây là số tiền đặt giá thầu) sẽ xuất hiện trong hợp đồng đấu giá như một phần của nhà xác thực được đặt cho một kỷ nguyên trong tương lai. Để xác định xem giá thầu có được chấp nhận hay không, hãy truy vấn hợp đồng đấu giá qua rust ``casper-client``

source: The request returns a response that looks like this:
fr: La requête renvoie une réponse qui ressemble à ceci :
tr: Bu talep, şuna benzer bir yanıt döndürür:
vi: Yêu cầu trả về một phản hồi trông giống như sau:

source: Note the ``era_id`` and the ``validator_weights`` sections of the response. For a given ``era_id`` a set of validators is defined. To determine the current era, ping the ``/status`` endpoint of a validating node in the network. This will return the current ``era_id``. The current ``era_id`` will be listed in the auction info response. If the public key associated with a bid appears in the ``validator_weights`` structure for an era, then the account is bonded in that era.
fr: Notez les sections ``era_id`` et ``validator_weights`` de la réponse. Pour un ``era_id`` donné, un ensemble de validateurs est défini. Pour déterminer l'ère actuelle, envoyez un appel à la fonction ``/status`` d'un noeud validateur dans le réseau. Cela renverra le ``era_id`` actuel. Le ``era_id`` actuel sera listé dans la réponse de l'info sur l'enchère. Si la clé publique associée à une enchère apparaît dans la structure ``validator_weights`` pour une ère, alors le compte est bondé dans cette ère.
tr: Yanıtın ``era_id`` ve ``validator_weights`` kısımlarını not alın. Verilen herhangi bir ``era_id`` için, bir doğrulayıcılar kümesi tanımlanmıştır. Geçerli dönemi belirlemek için, ağdaki doğrulayıcı bir düğümün ``/status`` uç noktasını sorgulayın. Bu geçerli ``era_id`` değerini döndürecektir. ``era_id`` değeri, müzayede bilgileri yanıtında listelenmiş olacaktır. Eğer bir teklif ile ilişkili bir açık anahtar, bir dönemin ``validator_weights`` yapısında görülürse, bu hesap o dönemde bağlanmış demektir.
vi: Lưu ý phần ``era_id`` và ``validator_weights`` của phần trả về. Đối với một ``era_id`` nhất định, một nhóm người xác thực sẽ được xác định. Để xác định thời gian hiện tại, hãy ping điểm cuối ``/status`` của một nút xác thực trong mạng. Thao tác này sẽ trả về ``era_id`` hiện tại. ``era_id`` hiện tại sẽ được liệt kê trong phần trả về của thông tin đấu giá. Nếu khóa công khai được liên kết với giá thầu xuất hiện trong cấu trúc ``validator_weights`` cho một kỷ nguyên, thì tài khoản được cổ phần trong kỷ nguyên đó.

source: If the Bid doesn't win
fr: Si l'offre ne gagne pas
tr: Eğer Teklif Müzayedeyi Kazanamazsa
vi: Nếu không thắng Giá thầu

source: If your bid doesn't win a slot in the auction, it is because your bid is too low. The resolution for this problem is to increase your bid amount. It is possible to submit additional bids, to increase the odds of winning a slot. It is also possible to encourage token holders to delegate stake to you for bonding.
fr: Si votre offre ne permet pas de gagner un slot dans l'enchère, c'est que votre offre est trop basse. La solution à ce problème consiste à augmenter le montant de votre offre. Il est possible de soumettre des offres supplémentaires, afin d'augmenter les chances de remporter un slot. Il est également possible d'encourager les détenteurs de jetons à vous déléguer leur stake pour le bonding.
tr: Teklifiniz müzayedede bir yer kazanamazsa, bunun nedeni teklifinizin çok düşük olmasıdır. Bu sorunun çözümü, teklif tutarınızı artırmaktır. Bir yuva kazanma şansını artırmak için ek teklifler vermek mümkündür. Token sahiplerini, bağlanma için hisselerine sizi yetkilendirmeye teşvik etmek de mümkündür.
vi: Nếu giá thầu của bạn không giành được vị trí trong phiên đấu giá, thì đó là do giá thầu của bạn quá thấp. Giải pháp cho vấn đề này là tăng số tiền giá thầu của bạn. Có thể gửi thêm giá thầu để tăng tỷ lệ thắng một vị trí. Cũng có thể khuyến khích chủ sở hữu token ủy thác đặt cọc cho bạn cổ phần.

source: Withdrawing a Bid
fr: Retrait d'une offre
tr: Teklifi Geri Çekmek
vi: Rút Giá thầu

source: Follow the steps in `Unbonding <https://docs.casperlabs.io/en/latest/node-operator/unbonding.html>`_ to withdraw a bid.
fr: Suivre les étapes décrites dans `Unbonding <https://docs.casperlabs.io/fr/latest/node-operator/unbonding.html>`_ pour retirer une offre.
tr: Bir teklifi geri çekmek için, `Çözme <https://docs.casperlabs.io/en/latest/node-operator/unbonding.html>`_ adımlarını takip edin.
vi: Làm theo các bước trong phần `Unbonding <https://docs.casperlabs.io/en/latest/node-operator/unbonding.html>`_ để rút giá thầu.

source: Visit `Github <https://github.com/casper-network/casper-node>`_ and fork and clone the repository.
vi: Truy cập `Github <https://github.com/casper-network/casper-node>`_ để chia tách và sao chép kho chứa.
