Repository: casper-network/docs-archive
Catalog: locale/*/LC_MESSAGES/node-operator/joining.po
Languages: fr, tr, vi

source: Joining a Running Network
fr: Rejoindre un réseau en exécution
tr: Bir Ağa Katılmak
vi: Tham gia vào Mạng đang chạy

source: The Casper network is permissionless, enabling new validators to join the network and provide additional security to the system. This page will outline the sequence of recommended steps to spin up a validating node and successfully join an existing network.
fr: Le réseau Casper est sans permission, ce qui permet à de nouveaux validateurs de rejoindre le réseau et d'apporter une sécurité supplémentaire au système. Cette page présente la séquence des étapes recommandées pour créer un nœud de validation et rejoindre un réseau existant.
tr: Casper, izne tabi olmayan bir ağdır, bu da yeni doğrulayıcıların ağa katılarak sisteme ek güvenlik sağlamasına olanak tanır. Bu sayfa, doğrulayıcı bir düğüm kurmak ve var olan bir ağa başarıyla katılmak için önerilen adımlar dizisini ortaya koyar.
vi: Mạng Casper là không cần cấp phép, cho phép các nhà xác thực mới tham gia vào mạng và cung cấp bảo mật bổ sung cho hệ thống. Trang này sẽ trình bày trình tự các bước được đề xuất để tạo một nút xác thực và tham gia thành công vào mạng hiện có.

source: Step 1: Provision Hardware
fr: Étape 1 : Approvisionnement en matériel (Hardware)
tr: Adım 1: Donanım Tedarik Edin
vi: Bước 1: Cung cấp phần cứng

source: Visit the Hardware section and provision your node hardware.
fr: Visitez la section Hardware et approvisionnez le matériel de votre nœud.
tr: Donanım bölümünü ziyaret edin ve düğümünüz için donanım tedarik edin.
vi: Xem mục Phần cứng và cung cấp phần cứng cho nút của bạn.

source: Step 2: Build Contracts & Set Up the Node
fr: Étape 2 : Construire les contrats et configurer le noeud
tr: Adım 2: Kontratları Derleyin ve Düğümü Kurun
vi: Bước 2: Xây dựng hợp đồng và thiết lập nút

source: Visit the Setup section in this guide and configure the software on your node. Build all necessary contracts for bonding, retrieving rewards and unbonding.
fr: Consultez la section Installation de ce guide et configurez le logiciel sur votre nœud. Créez tous les contrats nécessaires pour le 'bonding', la récupération des récompenses (rewards) et le 'unbonding'.
tr: Bu kılavuzdaki Kurulum bölümünü ziyaret edin ve düğümünüz üzerindeki yazılımları yapılandırın. ağa bağlanma, ödülleri alma ve çözülme için gereken tüm kontratları derleyin.
vi: Xem mục Cài đặt trong hướng dẫn này và cấu hình phần mềm trên nút của bạn. Xây dựng tất cả các hợp đồng cần thiết để góp cổ phần, nhận phần thưởng và rút cổ phần.

source: Step 3: Create & Fund your Keys for Bonding
fr: Étape 3 : Créez et approvisionnez vos clés pour le bonding
tr: Adım 3: Bağlanma için Anahtarlarınızı Oluşturun ve Token Alın
vi: Bước 3: Tạo và nạp tiền cho các Chìa khóa của bạn để cổ phần

source: Obtain token to bond your node on to the network & to pay for the bonding transaction.
fr: Obtenez des jetons pour 'bonder' votre nœud au réseau et pour payer la transaction de 'bonding'.
tr: Düğümünüzü ağa bağlamak ve bağlanma işleminin masrafını karşılamak için token edinin.
vi: Nhận token để cổ phần nút của bạn với mạng và thanh toán cho giao dịch cổ phần.

source: Step 4: Update the Trusted Hash
fr: Étape 4 : Mettre à jour le Hash de confiance (Trusted Hash)
tr: Adım 4: Güvenilen Özet Değerini (Trusted Hash) Güncelleyin
vi: Bước 4: Cập nhật Hàm băm tin cậy (Trusted Hash)

source: The node's ``config.toml`` needs to be updated with a recent trusted hash. Visit a ``/status`` endpoint of a validating node to obtain a fresh trusted block hash.
fr: Le fichier ``config.toml`` du noeud doit être mis à jour avec un hash de confiance récent. Visitez le endpoint ``/status`` d'un noeud de validation pour obtenir un hash de bloc récent et fiable.
tr: Düğümün ``config.toml`` dosyasının, yakın tarihli bir güvenilir özet ile güncellenmesi gerekir. Taze bir güvenilir özet almak için, doğrulayıcı bir düğümün ``/status`` bağlantı noktasını ziyaret edin.
vi: ``config.toml`` của nút cần được cập nhật bằng một hàm băm đáng tin cậy gần nhất. Xem ``/status`` điểm cuối của một nút xác thực để có được một băm khối đáng tin cậy mới.

source: Default port is usually ``8888`` Retrieve the ``last_added_block_info:`` hash.
fr: Le port par défaut est généralement ``8888`` Renvoie le hash ``last_added_block_info:``.
tr: Öntanımlı bağlantı noktası (port) genellikle ``8888``dir. ``last_added_block_info:`` bilgisindeki özeti alın.
vi: Cổng mặc định thường là ``8888`` Truy xuất hàm băm ``last_added_block_info:``.

source: A good IP to use above are those listed in your ``config.toml`` as ``known_addresses``.
fr: Une bonne IP à utiliser ci-dessus est une de celles listée dans votre ``config.toml`` comme ``known_addresses``.
tr: Yukarıdaki işlem için kullanabileceğiniz iyi bir IP adresini ``config.toml`` dosyanızdaki ``known_addresses`` listesinden alabilirsiniz.
vi: IP tốt để sử dụng ở trên là những IP được liệt kê trong ``config.toml`` của bạn như là ``known_addresses``.

source: Step 5: Start the Node
fr: Étape 5 : Démarrer le nœud
tr: Adım 5: Düğümü Başlatın
vi: Bước 5: Khởi động nút

source: Once the node has been added to the list of validators for an upcoming era, it's time to start the node. The deb package installs a casper-node service for systemd. Start the node with:
fr: Une fois que le nœud a été ajouté à la liste des validateurs pour une ère à venir, il est temps de le démarrer. Le package deb installe un service casper-node pour *systemd*. Démarrez le nœud avec :
tr: Düğümünüz gelecek bir dönem (era) için doğrulayıcılar listesine eklendikten sonra, düğümünüzü başlatma zamanı gelmiş demektir. DEB paketi, systemd için bir casper-node hizmeti kurar. Düğümü şu komutla başlatın:
vi: Khi nút đã được thêm vào danh sách nhà xác thực cho một kỷ nguyên sắp tới, là đã đến lúc bắt đầu nút. Gói deb cài đặt một dịch vụ casper-node cho systemd. Bắt đầu nút bằng:

source: For more information visit `Github <https://github.com/CasperLabs/casper-node/tree/master/resources/production>`_
fr: Pour plus d'informations, visiter `Github <https://github.com/CasperLabs/casper-node/tree/master/resources/production>`_
tr: Daha fazla bilgi için `Github <https://github.com/CasperLabs/casper-node/tree/master/resources/production>`_ adresimizi ziyaret edebilirsiniz.

source: Step 6: Confirm the Node is Syncronized
fr: Étape 6 : Confirmer que le nœud est synchronisé
tr: Adım 6: Düğümün Ağ ile Eşlendiğinden Emin Olun
vi: Bước 6: Xác nhận Nút được Đồng bộ hóa

source: While the node is synchronizing, the ``/status`` endpoint is available. You will be able to compare this to other node's status endpoint ``era_id`` and ``height`` to determine if you are caught up. You will not be able to perform any ``casper-client`` calls to your ``7777`` RPC port until your node is fully caught up.
fr: Pendant que le noeud se synchronise, le endpoint ``/status`` est disponible. Vous serez en mesure de comparer les valeurs de ``era_id`` et ``height`` avec les endpoints `/status`` des autres noeuds pour déterminer si vous avez rattrapé votre retard. Vous ne serez pas en mesure d'effectuer des appels ``casper-client`` à votre port RPC ``7777`` jusqu'à ce que votre noeud soit complètement rattrapé.
tr: Düğümün ağ ile eşlenmesi sırasında ``/status`` uç noktası kullanılabilir durumdadır. Düğümünüzün ağı yakalayıp yakalamadığını belirlemek için, buradaki değerleri diğer düğümlerin durum uç noktasındaki ``era_id`` ve ``height`` değerleri ile karşılaştırabilirsiniz. ``7777`` RPC portunuza herhangi bir ``casper-client`` çağrısı yapabilmek için, öncelikle düğümünüzün ağı tamamen yakalamasını beklemelisiniz.
vi: Trong khi nút đang đồng bộ hóa, ``/status`` của điểm cuối sẽ khả dụng. Bạn sẽ có thể so sánh trạng thái này này với trạng thái điểm cuối của nút khác ``era_id`` và ``height`` để xác định xem bạn có đồng bộ kịp hay không. Bạn sẽ không thể thực hiện bất kỳ lệnh gọi ``casper-client`` nào tới cổng RPC ``7777`` của mình cho đến khi nút của bạn được đồng bộ hoàn toàn.

source: Step 7: Send the Bonding Request
fr: Étape 7 : Envoyer la requête de cautionnement (Bonding)
tr: Adım 7: Bağlanma Talebi Gönderin
vi: Bước 7: Gửi yêu cầu cổ phần

source: To avoid being ejected for liveness failures, it is critical that the bonding request be sent to the local node only after it has synchronized the protocol state and linear blockchain.
fr: Pour éviter d'être éjecté pour des défaillances de liveness, il est essentiel que la requête de bonding soit envoyée au nœud local seulement après qu'il ait synchronisé l'état du protocole et de la blockchain.
tr: Canlılıkta başarısızlık nedeniyle ağdan atılmaktan kaçınmak için, bağlanma talebini yalnızca yerel düğüm protokol durumu ve doğrusal blokzincir ile eşlendikten sonra göndermek çok önemlidir.
vi: Để tránh bị đẩy ra do lỗi liveness, điều quan trọng là yêu cầu cổ phần chỉ được gửi đến nút cục bộ sau khi nó đã đồng bộ hóa trạng thái giao thức và chuỗi khối tuyến tính.

source: For this reason it is recommended that you use ``casper-client`` with the default ``--node-address`` which will talk to localhost.
fr: Pour cette raison, il est recommandé d'utiliser ``casper-client`` avec l'adresse par défaut ``--node-address`` qui parlera à localhost.
tr: Bu nedenle, ``casper-client`` komutunu varsayılan ``--node-address`` ile kullanmanız önerilir. Bu, yerel makine (localhost) ile iletişim kuracaktır.
vi: Vì lý do này, bạn nên sử dụng ``casper-client`` với mặc định ``--node-address`` để nói chuyện với localhost.

source: Please see the bonding page to submit a bonding request to change from a synchronized node to a validating node.
fr: Veuillez consulter la page sur le 'bonding' pour soumettre une demande de bonding afin de passer d'un nœud synchronisé à un nœud validateur.
tr: Sadece ağ ile eşlenen bir düğümden, doğrulayıcı bir düğüme geçiş yapmak üzere bir bağlanma talebi göndermek için lütfen bağlanma sayfasına bakınız.
vi: Vui lòng xem trang Góp cổ phần để gửi yêu cầu cổ phần nhằm thay đổi nút được đồng bộ hóa thành nút xác thực.

source: For more information visit `Github <https://github.com/casper-network/casper-node/tree/master/resources/production>`_
vi: Để biết thêm thông tin, hãy truy cập `Github <https://github.com/casper-network/casper-node/tree/master/resources/production>`_
