Repository: casper-network/docs-archive
Catalog: locale/*/LC_MESSAGES/node-operator/setup.po
Languages: fr, tr, vi

source: At every block finalization, the ``casper-node`` looks for newly configured versions. When a new version is configured, the running node will look at future era_id in the ``chainspec.toml`` file. This will be the era before where the current casper-node will cleanly shut down.
fr: A chaque finalisation de bloc, ``casper-node`` recherche les nouvelles versions configurées. Quand une nouvelle version est configurée, le noeud en cours d'exécution regarde le futur era_id dans le fichier ``chainspec.toml``. Ce sera l'ère avant laquelle le casper-node actuel s'arrêtera proprement.
tr: Her blok kesinleştirmesinde, ``casper-node`` yeni yapılandırılmış sürümleri arar. Yeni bir sürüm yapılandırıldığında, çalışan düğüm ``chainspec.toml`` dosyasındaki gelecek era_id'ye bakacaktır. Bu, mevcut casper düğümünün temiz bir şekilde kapanmasından önceki dönem olacak.
vi: Tại mỗi lần hoàn thành khối, ``casper-node`` sẽ tìm kiếm các phiên bản mới được cấu hình. Khi một phiên bản mới được cấu hình, nút đang chạy sẽ nhìn vào era_id sắp tới trong tệp ``chainpec.toml``. Đây sẽ là kỷ nguyên trước khi nút casper hiện tại sẽ tắt hoàn toàn.

source: The ``casper-node-launcher`` will detect a clean exit 0 condition and start the next version ``casper-node``.
fr: Le ``casper-node-launcher`` détectera une condition de sortie propre 0 et démarrera la prochaine version ``casper-node``.
tr: ``casper-node-launcher`` temiz çıkış 0 koşulu algılayacak ve bir sonraki ``casper-node`` sürümünü başlatacaktır.
vi: ``casper-node-launcher`` sẽ phát hiện điều kiện thoát hoàn toàn 0 và bắt đầu phiên bản tiếp theo ``casper-node``.

source: You can choose to build from source. If you opt to do this, please ensure that the correct software version (tag) is used.
fr: Vous pouvez choisir de construire à partir des sources. Si vous optez pour cette solution, veuillez vous assurer que la version correcte du logiciel (tag) est utilisée.
tr: Kaynaktan oluşturmayı seçebilirsiniz. Bunu yapmayı seçerseniz, lütfen doğru yazılım sürümünün (etiket) kullanıldığından emin olun.
vi: Bạn có thể chọn xây dựng từ nguồn (source). Nếu bạn chọn làm điều này, hãy đảm bảo rằng đang sử dụng chính xác phiên bản phần mềm (tag).

source: Node Version Installation
fr: Installation de la version du nœud
tr: Düğüm Sürümü Kurulumu
vi: Cài đặt phiên bản nút

source: Included with ``casper-node-launcher`` debian package are two scripts to help with installing ``casper-node`` versions.
fr: Le package debian ``casper-node-launcher`` contient deux scripts pour aider à l'installation des versions ``casper-node``.
tr: ``casper-node-launcher`` debian paketinde ``casper-node`` sürümlerinin yüklenmesine yardımcı olacak iki komut dosyası bulunur.
vi: Đi kèm với gói debian ``casper-node-launcher`` là hai script để giúp cài đặt các phiên bản ``casper-node``.

source: ``/etc/casper/pull_casper_node_version.sh`` will pull ``bin.tar.gz`` and ``config.tar.gz`` from genesis.casperlabs.io.
fr: ``/etc/casper/pull_casper_node_version.sh`` va extraire ``bin.tar.gz`` et ``config.tar.gz`` de genesis.casperlabs.io.
tr: ``/etc/casper/pull_casper_node_version.sh``, genesis.casperlabs.io'dan ``bin.tar.gz`` ve ``config.tar.gz`` dosyalarını çeker.
vi: ``/etc/casper/pull_casper_node_version.sh`` sẽ kéo về ``bin.tar.gz`` và ``config.tar.gz`` từ genesis.casperlabs.io.

source: This is invoked with the release version in underscore format such as:
fr: Cette fonction est invoquée avec la version de la release au format underscore, comme par exemple :
tr: Bu, yayın sürümüyle aşağıdaki gibi alt çizgi biçiminde çağrılır:
vi: Thao tác này được gọi với phiên bản phát hành ở định dạng gạch dưới như đây:

source: This will create ``/var/lib/casper/bin/1_0_2/`` and expand the ``bin.tar.gz`` containing at a minimun ``casper-node``.
fr: Cela va créer ``/var/lib/casper/bin/1_0_2/`` et étendre le fichier ``bin.tar.gz`` contenant au minimum ``casper-node``.
tr: Bu, ``/var/lib/casper/bin/1_0_2/`` oluşturacak ve minimum ``casper-node`` içeren ``bin.tar.gz`` dosyasını genişletecektir.
vi: Thao tác sẽ tạo ra ``/var/lib/casper/bin/1_0_2/`` và giải nén ``bin.tar.gz`` tại ``casper-node``.

source: This will create ``/etc/casper/1_0_2/`` and expand the ``config.tar.gz`` containing ``chainspec.toml``, ``config-example.toml``, and possibly ``accounts.csv`` and other files.
fr: Cela créera le fichier ``/etc/casper/1_0_2/`` et étendra le fichier ``config.tar.gz`` contenant ``chainspec.toml``, ``config-example.toml``, et éventuellement ``accounts.csv`` et d'autres fichiers.
tr: Bu, ``/etc/casper/1_0_2/`` oluşturacak ve ``chainspec.toml``, ``config-example.toml`` ve muhtemelen ``accounts.csv`` içeren ``config.tar.gz`` dosyasını genişletecektir.
vi: Lệnh sẽ tạo ra ``/etc/casper/1_0_2/`` và giải nén ``config.tar.gz`` chứa ``chainspec.toml``, ``config-example.toml``, và có thể ``accounts.csv`` và những tệp khác.

source: This will remove the arcive files and run ``/etc/casper/config_from_example.sh 1_0_2`` to create a ``config.toml`` from the ``config-example.toml``.
fr: Cela supprimera les fichiers d'archive et lancera ``/etc/casper/config_from_example.sh 1_0_2`` pour créer un ``config.toml`` à partir du ``config-example.toml``.
tr: Bu, arşiv dosyalarını kaldıracak ve ``config-example.toml`` içinden bir ``config.toml`` oluşturmak için ``/etc/casper/config_from_example.sh 1_0_2`` çalıştıracaktır.
vi: Thao tác sẽ gỡ các tệp lưu trữ và chạy ``/etc/casper/config_from_example.sh 1_0_2`` để tạo ``config.toml`` từ ``config-example.toml``.

source: Client Installation
fr: Installation du Client
tr: İstemci Kurulumu
vi: Cài đặt Client

source: The ``casper-client`` can be installed from https://crates.io/crates/casper-client.
fr: Le ``casper-client`` peut être installé depuis https://crates.io/crates/casper-client.
vi: Có thể cài đặt ``casper-client`` từ https://crates.io/crates/casper-client.

source: Run the commands below to install the Casper client on most flavors of Linux and macOS. You will need the nightly version of the compiler.
fr: Exécutez les commandes ci-dessous pour installer le client Casper sur la plupart des versions de Linux et macOS. Vous aurez besoin de la version nocturne (nightly) du compilateur.
vi: Chạy các lệnh bên dưới để cài đặt ứng dụng client Casper trên hầu hết các phiên bản Linux và macOS. Bạn sẽ cần phiên bản nightly của trình biên dịch.

source: Doing this, you'll see a warning, which you can ignore for now.
vi: Thực hiện điều này, bạn sẽ thấy một cảnh báo mà bạn có thể bỏ qua ngay bây giờ.

source: The Casper client can print out `help` information, which provides an up-to-date list of supported commands.
fr: Le client Casper propose une commande `help`, qui fournit une liste à jour des commandes supportées.
vi: Ứng dụng client Casper có thể đưa ra thông tin `help`, cung cấp danh sách cập nhật các lệnh được hỗ trợ.

source: For each command, you can use `help` to get the up-to-date arguments and descriptions:
fr: Pour chaque commande, vous pouvez utiliser `help` pour obtenir les arguments et les descriptions à jour :
vi: Đối với mỗi lệnh, bạn có thể sử dụng `help` để nhận các đối số và mô tả cập nhật:

source: Create Keys
fr: Création des clés
tr: Anahtar Oluşturma
vi: Tạo mới Khoá

source: The Rust client generates keys via the ``keygen`` command. The process generates 2 *pem* files and 1 *text* file. To learn about options for generating keys, include ``--help`` when running the ``keygen`` command.
fr: Le client Rust génère des clés via la commande ``keygen``. Le processus génère 2 fichiers *pem* et 1 fichier *text*. Pour en savoir plus sur les options de génération de clés, incluez ``--help`` lorsque vous exécutez la commande ``keygen``.
tr: Rust istemcisi, ``keygen`` komutu aracılığıyla anahtarlar üretir. İşlem 2 *pem* dosyası ve 1 *metin* dosyası oluşturur. Anahtar oluşturma seçeneklerini öğrenmek için, ``keygen`` komutunu çalıştırırken ``--help`` ifadesini ekleyin.
vi: Client Rust tạo khóa thông qua lệnh ``keygen``. Quá trình này tạo ra 2 tệp *pem* và 1 tệp *text*. Để tìm hiểu về các tùy chọn tạo khóa, hãy thêm vào ``--help`` khi chạy lệnh ``keygen``.

source: More about keys and key generation can be found in ``/etc/casper/validator_keys/README.md`` if ``casper-node-lancher`` was installed from the Debian package.
fr: Plus d'informations sur les clés et la génération de clés peuvent être trouvées dans ``/etc/casper/validator_keys/README.md`` si ``casper-node-lancher`` a été installé à partir du package Debian.
tr: Debian paketinden ``casper-node-lancher`` yüklenmişse, anahtarlar ve anahtar oluşturma hakkında daha fazla bilgiyi "/etc/casper/validator_keys/README.md" içinde bulabilirsiniz.
vi: Bạn có thể tìm thêm thông tin về khóa và cách tạo khóa trong ``/etc/casper/validator_keys/README.md`` nếu ``casper-node-lancher`` được cài đặt từ gói Debian.

source: Config File
fr: Fichier Config
tr: Yapılandırma Dosyası
vi: Tệp cấu hình

source: One ``config.toml`` file will need to exist for each ``casper-node`` version installed. It should be located in the ``/etc/casper/[m_n_p]/`` directory where ``m_n_p`` is the current semantic version. This can be created from ``config-example.toml`` by using ``/etc/casper/config_from_example.sh [m_n_p]`` where ``[m_n_p]`` is replaced current version with underscores.
fr: Un fichier ``config.toml`` devra exister pour chaque version de ``casper-node`` installée. Il doit être situé dans le répertoire ``/etc/casper/[m_n_p]/`` où ``m_n_p`` est la version sémantique courante. Il peut être créé à partir de ``config-example.toml`` en utilisant ``/etc/casper/config_from_example.sh [m_n_p]`` où ``[m_n_p]`` est la version courante remplacée par des underscores.
tr: Yüklenen her bir ``casper-node`` sürümü için bir ``config.toml`` dosyasının bulunması gerekir. ``/etc/casper/[m_n_p]/`` dizininde bulunmalıdır, burada ``m_n_p`` geçerli anlamsal sürümdür. Bu, ``/etc/casper/config_from_example.sh [m_n_p]`` kullanılarak ``config-example.toml`` 'den oluşturulabilir, burada``[m_n_p]`` geçerli sürümü alt çizgilerle değiştirir.
vi: Một tệp ``config.toml`` sẽ cần tồn tại cho mỗi phiên bản ``casper-node`` được cài đặt. Nó phải được đặt trong thư mục ``/etc/casper/[m_n_p]/`` trong đó ``m_n_p`` là phiên bản hiện tại. Điều này có thể được tạo từ ``config-example.toml`` bằng cách sử dụng ``/etc/casper/config_from_example.sh [m_n_p]`` trong đó ``[m_n_p]`` thay thế phiên bản hiện tại bằng dấu gạch dưới.

source: Below are some fields you may find in the ``config.toml`` that you may want or need to adjust.
fr: Voici quelques champs que vous pouvez trouver dans le fichier ``config.toml`` et que vous pouvez vouloir ou devoir ajuster.
tr: Aşağıda, ``config.toml`` içinde bulabileceğiniz, isteyebileceğiniz veya ayarlamanız gerekebilecek bazı alanlar bulunmaktadır.
vi: Dưới đây là một số trường bạn có thể tìm thấy trong ``config.toml`` mà bạn có thể muốn hoặc cần điều chỉnh.

source: Trusted Hash for Synchronizing
fr: Hash de confiance pour la synchronisation (Trusted Hash for Synchronizing)
tr: Senkronizasyon için Güvenilir Özet (Trusted Hash)
vi: Hàm băm tin cậy để đồng bộ hoá

source: The Casper network is a permissionless, proof of stake network - which implies that validators can come and go from the network. The implication is that, after a point in time, historical data could have less security if it is retrieved from ‘any node’ on the network. Therefore, joining the network has to be from a trusted source, a bonded validator. The system will start from the hash from a recent block and then work backward from that block to obtain the deploys and finalized blocks from the linear block store. Here is the process to get the trusted hash:
fr: Le réseau Casper est un réseau sans permission et à preuve d'enjeu, ce qui implique que les validateurs peuvent aller et venir sur le réseau. Cela signifie qu'après un certain temps, les données historiques pourraient être moins sûres si elles sont récupérées à partir de 'n'importe quel nœud' du réseau. Par conséquent, l'adhésion au réseau doit provenir d'une source de confiance, un validateur cautionné. Le système commencera par le hachage d'un bloc récent et travaillera ensuite à rebours à partir de ce bloc pour obtenir les déploiements et les blocs finalisés à partir du store de blocs linéaire. Voici le processus pour obtenir le hash de confiance :
tr: Casper ağı, izinsiz, hisse kanıtı ağıdır - bu, doğrulayıcıların ağdan gelip gidebileceği anlamına gelir. Bunun anlamı, belirli bir noktadan sonra geçmiş verilerin ağdaki ‘herhangi bir düğümden’ alınması durumunda daha az güvenliğe sahip olabileceğidir. Bu nedenle, ağa katılmanın güvenilir bir kaynaktan, bağlı bir doğrulayıcıdan olması gerekir. Sistem, son bir bloktan gelen özetten başlayacak ve daha sonra, doğrusal blok deposundan dağıtımları ve kesinleştirilmiş blokları elde etmek için o bloktan geriye doğru çalışacaktır. İşte güvenilir özet elde etme süreci:
vi: Mạng Casper là một mạng bằng chứng cổ phần, không cần cấp phép - có nghĩa là trình xác thực có thể đến và đi từ mạng. Ngụ ý là, sau một thời gian, dữ liệu lịch sử có thể kém bảo mật hơn nếu nó được truy xuất từ 'bất kỳ nút nào' trên mạng. Do đó, việc tham gia mạng phải từ một nguồn đáng tin cậy, một trình xác thực đã cổ phần. Hệ thống sẽ bắt đầu từ băm từ một khối gần đây và sau đó làm việc ngược lại từ khối đó để lấy các khối triển khai và hoàn thành từ kho lưu trữ khối tuyến tính. Đây là quy trình để lấy băm đáng tin cậy:

source: Find a list of trusted validators.
fr: Trouvez une liste de validateurs de confiance.
tr: Güvenilir doğrulayıcıların bir listesini bul.
vi: Tìm danh sách các trình xác thực đáng tin cậy.

source: Query the status endpoint of a trusted validator ( http://[validator_id]:8888/status )
fr: Interroger le point la fonction statut d'un validateur de confiance ( http://[validator_id]:8888/status )
tr: Güvenilir bir doğrulayıcının durum uç noktasını sorgula ( http://[validator_id]:8888/status )
vi: Truy vấn trạng thái cuối của trình xác thực đáng tin cậy ( http://[validator_id]:8888/status )

source: Obtain the hash of a block from the status endpoint.
fr: Obtenir le hash d'un bloc à partir de l'endpoint status.
tr: Durum uç noktasından bir bloğun özetini al.
vi: Lấy băm của một khối từ trạng thái cuối.

source: Update the ``config.toml`` for the node to include the trusted hash. There is a field dedicated to this near the top of the file.
fr: Mettez à jour le fichier ``config.toml`` du nœud pour inclure le hash de confiance. Il y a un champ dédié à cela près du haut du fichier.
tr: Düğümün güvenilen özeti içermesi için ``config.toml`` dosyasını güncelle. Dosyanın üst kısmına yakın bir yerde buna ayrılmış bir alan var.
vi: Cập nhật ``config.toml`` cho nút để đưa vào hàm băm đáng tin cậy. Có một trường dành riêng để đưa vào gần đầu tệp.

source: Secret Keys
fr: Clés secrètes
tr: Gizli Anahtarlar
vi: Khoá bí mật

source: Provide the path to the secret keys for the node. This is set to ``etc/casper/validator_keys/`` by default.
fr: Indiquez le chemin d'accès aux clés secrètes pour le nœud. Par défaut, il s'agit de ``etc/casper/validator_keys/``.
tr: Düğüm için gizli anahtarların yolunu sağlayın. Bu, varsayılan olarak ``etc/casper/validator_keys/`` olarak ayarlanmıştır.
vi: Cung cấp đường dẫn đến các khóa bí mật cho nút. Mặc định là ``etc/casper/validator_keys/``.

source: Networking & Gossiping
fr: Réseautage et Gossiping (Networking & Gossiping)
tr: Ağ Oluşturma ve Dedikoduculuk
vi: Mạng & Gossiping

source: The node requires a publicly accessible IP address. We do not recommend NAT at this time. Specify the public IP address of the node. If you use the ``config_from_example.sh`` external services are called to find your IP and this is inserted into the created ``config.toml``.
fr: Le nœud nécessite une adresse IP accessible au public. Nous ne recommandons pas de NAT (Network address translation) pour le moment. Spécifiez l'adresse IP publique du noeud. Si vous utilisez le fichier ``config_from_example.sh`` les services externes sont appelés pour trouver votre IP et celle-ci est insérée dans le fichier ``config.toml`` créé.
tr: Düğüm, genel olarak erişilebilir bir IP adresi gerektirir. Şu anda NAT önermiyoruz. Düğümün genel IP adresini belirtin. ``config_from_example.sh`` kullanırsanız, IP'nizi bulmak için harici hizmetler çağrılır ve bu, oluşturulan ``config.toml`` dosyasına eklenir.
vi: Nút yêu cầu một địa chỉ IP có thể truy cập công khai. Chúng tôi không khuyến nghị NAT vào lúc này. Chỉ định địa chỉ IP công cộng của nút. Nếu bạn sử dụng các dịch vụ bên ngoài, ``config_from_example.sh`` sẽ được gọi để tìm IP của bạn và việc này được chèn vào ``config.toml`` đã tạo.

source: Default values are specified in the file if you want to change them:
fr: Les valeurs par défaut sont spécifiées dans le fichier si vous souhaitez les modifier :
tr: Değiştirmek isterseniz, dosyada varsayılan değerler belirtilir:
vi: Các giá trị mặc định được chỉ định trong tệp nếu bạn muốn thay đổi chúng:

source: Specify the port that will be used for status & deploys
fr: Spécifiez le port qui sera utilisé pour les statuts et les déploiements.
tr: Durum ve dağıtımlar için kullanılacak portu belirtin
vi: Chỉ định cổng sẽ được sử dụng cho trạng thái và triển khai

source: Specify the port used for networking
fr: Indiquez le port utilisé pour le réseautage
tr: Ağ için kullanılan portu belirtin
vi: Chỉ định cổng được sử dụng để kết nối mạng

source: Known_addresses - these are the bootstrap nodes. No need to change these.
fr: Known_addresses - ce sont les noeuds bootstrap. Il n'est pas nécessaire de les modifier.
tr: Known_addresses - bunlar önyükleme düğümleridir. Bunları değiştirmek gerekmez.
vi: Known_addresses - đây là các nút bootstrap. Không cần phải thay đổi chúng.

source: The casper-node-launcher Debian package can be obtained from https://bintray.com/casperlabs/debian/casper-node-launcher.
tr: casper-node-launcher Debian paketi https://bintray.com/casperlabs/debian/casper-node-launcher adresinden edinilebilir.

source: You can also build from source: https://github.com/CasperLabs/casper-node-launcher. However, all of the setup and pull of casper-node releases will be manual.
tr: Ayrıca kaynaktan da oluşturabilirsiniz: https://github.com/CasperLabs/casper-node-launcher. Ancak, casper-node sürümlerinin tüm kurulumu ve çekilmesi manuel olacaktır.

source: The ``casper-client`` can be installed from https://bintray.com/casperlabs/debian/casper-client. Download and install the correct version using ``sudo apt install``.
tr: "casper-client" https://bintray.com/casperlabs/debian/casper-client adresinden yüklenebilir. ``sudo apt install`` kullanarak doğru sürümü indirin ve kurun.
