Repository: casper-network/docs-archive
Catalog: locale/*/LC_MESSAGES/node-operator/setup.po
Languages: fr, tr, vi

source: Basic Node Setup
fr: Configuration de base du nœud
tr: Temel Düğüm Kurulumu
vi: Thiết lập nút cơ bản

source: Casper Node Launcher
tr: Casper Düğüm Başlatıcı
vi: Trình khởi chạy nút Casper

source: The node software is run from the ``casper-node-launcher`` package. This can be installed with a Debian package which also creates the Casper user, creates directory structures and sets up a *systemd* unit and *logrotate*.
fr: Le logiciel de nœud est exécuté à partir du package ``casper-node-launcher``. Celui-ci peut être installé avec un package Debian qui crée également l'utilisateur Casper, crée les structures de répertoire et met en place une unité de service *systemd* et un *logrotate*.
tr: Düğüm yazılımı ``casper-node-launcher`` paketinden çalıştırılır. Bu, aynı zamanda Casper kullanıcısını oluşturan, dizin yapıları oluşturan ve bir *systemd* birimi ve *logrotate* kuran bir Debian paketi ile kurulabilir.
vi: Phần mềm nút được chạy từ gói ``casper-node-launcher``. Điều này có thể được cài đặt với một gói Debian, và cũng dùng để tạo người dùng Casper, tạo cấu trúc thư mục và thiết lập đơn vị *systemd* và *logrotate*.

source: The casper-node-launcher Debian package can be obtained from https://repo.casperlabs.io/. You only need to run these steps once.
fr: Le paquet Debian casper-node-launcher peut être obtenu à partir de https://repo.casperlabs.io/. Vous n'avez besoin d'exécuter ces étapes qu'une seule fois.
vi: Có thể lấy gói Debian casper-node-launcher từ https://repo.casperlabs.io/. Bạn chỉ cần chạy các bước này một lần.

source: Then, proceed to install the casper-node-launcher by running these commands:
fr: Ensuite, procédez à l'installation de casper-node-launcher en exécutant ces commandes :
vi: Sau đó, tiến hành cài đặt casper-node-launcher bằng cách chạy các lệnh sau:

source: You can also build from source: https://github.com/casper-network/casper-node-launcher. However, all of the setup and pull of casper-node releases will be manual.
fr: Vous pouvez également construire à partir des sources : https://github.com/casper-network/casper-node-launcher. Cependant, toute la configuration et le tirage des versions de casper-node seront manuels.
vi: Bạn cũng có thể xây dựng từ nguồn: https://github.com/casper-network/casper-node-launcher. Tuy nhiên, tất cả việc thiết lập và kéo các bản phát hành casper-node sẽ là thủ công.

source: File Locations
fr: Emplacement des fichiers
tr: Dosya Konumları
vi: Vị trí tệp

source: This section describes the directories and files the ``casper-node-launcher`` Debian install creates, needed for running ``casper-node`` versions and performing upgrades.
fr: Cette section décrit les répertoires et les fichiers créés par l'installation Debian de ``casper-node-launcher`` , nécessaires pour exécuter les versions de ``casper-node`` et effectuer les mises à jour.
tr: Bu bölüm, "casper-node-launcher" Debian kurulumunun oluşturduğu, "casper-node" sürümlerini çalıştırmak ve yükseltmeleri gerçekleştirmek için gerekli olan dizinleri ve dosyaları açıklar.
vi: Phần này mô tả các thư mục và tệp mà bản cài đặt Debian ``casper-node-launcher`` tạo ra, cần thiết để chạy các phiên bản ``casper-node`` và thực hiện nâng cấp.

source: A *casper* user and *casper* group is created during install and used to run the software.
fr: Un utilisateur *casper* et un groupe *casper* sont créés lors de l'installation et utilisés pour exécuter le logiciel.
tr: Yükleme sırasında bir *casper* kullanıcısı ve *casper* grubu oluşturulur ve yazılımı çalıştırmak için kullanılır.
vi: Người dùng *casper* và nhóm *casper* được tạo ra trong quá trình cài đặt và được sử dụng để chạy phần mềm.

source: Each version of the ``casper-node`` install is located based on the semantic version with underscores. For example, version *1.0.3* would be represented by a directory named ``1_0_3``. This convention applies to both binary and configuration file locations. We will represent versioning with ``[m_n_p]`` below, representing the major, minor, patch of a semantic version.
fr: Chaque version de l'installation ``casper-node`` est localisée en fonction de la version sémantique comportant des underscores. Par exemple, la version *1.0.3* sera représentée par un répertoire nommé ``1_0_3``. Cette convention s'applique à la fois aux emplacements des fichiers binaires et des fichiers de configuration. Nous représenterons le versioning avec ``[m_n_p]`` ci-dessous, représentant le major, minor, et patch d'une version sémantique.
tr: "Casper-node" kurulumunun her sürümü, alt çizgili anlamsal sürüme göre bulunur. Örneğin, *1.0.3* sürümü, ``1_0_3`` adlı bir dizinle temsil edilir. Bu kural hem ikili kod hem de yapılandırma dosyası konumları için geçerlidir. Aşağıda ``[m_n_p]`` ile sürüm oluşumunu gösteriyoruz, anlamsal olarak sürümün büyük, küçük, yamasını temsil ediyor.
vi: Mỗi phiên bản của cài đặt ``casper-node`` đặt tại thư mục với tên phiên bản có dấu gạch dưới. Ví dụ: phiên bản *1.0.3* sẽ được thể hiện bởi một thư mục có tên là ``1_0_3``. Quy ước này áp dụng cho cả vị trí tệp nhị phân và tệp cấu hình. Chúng tôi sẽ trình bày cách lập phiên bản với ``[m_n_p]`` bên dưới, thể hiện phiên bản của bản chính, bản phụ, bản vá.

source: **Note**: multiple versioned folders will exist on a system when upgrades are setup.
fr: **Note** : plusieurs dossiers versionnés existeront sur un système lorsque les mises à jour seront configurées.
tr: **Not**: Yükseltmeler kurulduğunda bir sistemde birden çok sürümlü klasör bulunacaktır.
vi: **Lưu ý**: khi thiết lập nâng cấp hệ thống sẽ tồn tại nhiều thư mục tương ứng với các phiên bản.

source: The installation of ``casper-node-launcher``, ``casper-node``, and ``casper-client`` software is relatively simple, but the process accomplishes many things behind the scenes. This section describes the installation process and where the files are stored.
fr: L'installation des logiciels ``casper-node-launcher``, ``casper-node``, et ``casper-client`` est relativement simple, mais le processus accomplit beaucoup de choses en arrière plan. Cette section décrit le processus d'installation et l'endroit où les fichiers sont stockés.
tr: "casper-node-launcher", "casper-node" ve "casper-client" yazılımının kurulumu nispeten basittir, ancak süreç, perde arkasında birçok şeyi başarır. Bu bölüm, yükleme işlemini ve dosyaların nerede depolandığını açıklar.
vi: Việc cài đặt phần mềm ``casper-node-launcher``, ``casper-node``, và ``casper-client`` tương đối đơn giản, nhưng quá trình này hoàn thành nhiều thứ phía sau. Phần này mô tả quá trình cài đặt và nơi các tệp được lưu trữ.

source: Two main folders are relevant for our software: ``/etc/casper`` and ``/var/lib/casper``.
fr: Deux dossiers principaux sont pertinents pour notre logiciel : ``/etc/casper`` et ``/var/lib/casper``.
tr: Yazılımımızla ilgili iki ana klasör vardır: ``/etc/casper`` ve ``/var/lib/casper``.
vi: Hai thư mục chính có liên quan đến phần mềm của chúng ta: ``/etc/casper`` and ``/var/lib/casper``.

source: The following is the state of the filesystem after installing the ``casper-client`` and ``casper-node-launcher`` Debian packages, and also after running the script */etc/casper/pull_casper_node_version.sh*.
fr: Voici l'état du système de fichiers après l'installation des packages Debian ``casper-client`` et ``casper-node-launcher``, et aussi après l'exécution du script */etc/casper/pull_casper_node_version.sh*.
tr: "casper-client" ve "casper-node-launcher" Debian paketlerini kurduktan ve ayrıca */etc/casper/pull_casper_node_version.sh* betiğini çalıştırdıktan sonra dosya sisteminin durumu aşağıdadır.
vi: Sau đây là trạng thái của hệ thống tệp sau khi cài đặt gói Debian ``casper-client`` và ``casper-node-launcher``, và cả sau khi chạy script */etc/casper/pull_casper_node_version.sh*.

source: The default location for executables from the Debian package install is ``/usr/bin``.
fr: L'emplacement par défaut des exécutables de l'installation du package Debian est ``/usr/bin``.
tr: Debian paketi kurulumundaki yürütülebilir dosyalar için varsayılan konum ``/usr/bin``dir.
vi: Vị trí mặc định cho các tệp thực thi từ cài đặt gói Debian là ``/usr/bin``.

source: ``casper-client`` - A client for interacting with the Casper network
fr: ``casper-client`` - Un client pour interagir avec le réseau Casper
tr: ``casper-client`` - Casper ağıyla etkileşim için bir istemci
vi: ``casper-client`` - client để tương tác với mạng Casper

source: ``casper-node-launcher`` - The launcher application which starts the ``casper-node`` as a child process
fr: ``casper-node-launcher`` - L'application de lancement qui démarre le ``casper-node`` en tant que processus.
tr: ``casper-node-launcher`` - ``casper-node``u alt süreç olarak başlatan başlatıcı uygulaması
vi: ``casper-node-launcher`` - Ứng dụng launcher khởi động ``casper-node`` dưới dạng một quá trình con

source: This is the default location for configuration files. It can be overwritten with the ``CASPER_CONFIG_DIR`` environment variable. The paths in this document assume the default configuration file location of ``/etc/casper``. The data is organized as follows:
fr: C'est l'emplacement par défaut des fichiers de configuration. Il peut être remplacé par la variable d'environnement ``CASPER_CONFIG_DIR``. Les chemins d'accès dans ce document supposent que l'emplacement par défaut des fichiers de configuration est ``/etc/casper``. Les données sont organisées comme suit :
tr: Bu, yapılandırma dosyaları için varsayılan konumdur. ``CASPER_CONFIG_DIR`` ortam değişkeni ile üzerine yazılabilir. Bu belgedeki yollar, ``/etc/casper`` varsayılan yapılandırma dosyası konumunu alır. Veriler şu şekilde düzenlenmiştir:
vi: Đây là vị trí mặc định cho các tệp cấu hình. Nó có thể được ghi đè bằng biến môi trường ``CASPER_CONFIG_DIR``. Các đường dẫn trong tài liệu này giả định vị trí tệp cấu hình mặc định là ``/etc/casper``. Dữ liệu được sắp xếp như sau:

source: **delete_local_db.sh** - Removes `*.lmdb*` from ``/var/lib/casper/casper-node``
fr: **delete_local_db.sh** - Supprime `*.lmdb*` de ``/var/lib/casper/casper-node``
tr: **delete_local_db.sh** - "/var/lib/casper/casper-node" dizininden `*.lmdb*` dosyasını kaldırır
vi: **delete_local_db.sh** - Xóa `*.lmdb*` khỏi ``/var/lib/casper/casper-node``

source: **pull_casper_node_version.sh** <protocol_version> <network_name> - Pulls ``bin.tar.gz`` and ``config.tar.gz`` from `genesis.casperlabs.io <http://genesis.casperlabs.io/>`_ for a protocol package; decompresses them into ``/var/lib/bin/<protocol_version>`` and ``/etc/casper/<protocol_version>``, and removes the *\*.tar.gz* files
fr: **pull_casper_node_version.sh** <protocol_version> <network_name> - Extrait (pulls) ``bin.tar.gz`` et ``config.tar.gz`` de `genesis.casperlabs.io <http://genesis.casperlabs.io/>`_ pour un package de protocole ; les décompresse dans ``/var/lib/bin/<protocol_version>`` et ``/etc/casper/<protocol_version>``, et supprime les fichiers *\*.tar.gz*
tr: **pull_casper_node_version.sh** <protocol_version><network_name> - "genesis.casperlabs.io <http://genesis.casperlabs.io/>" adresinden "bin.tar.gz" ve "config.tar.gz" dosyalarını çeker bir protokol paketi; onları ``/var/lib/bin/<protocol_version>`` ve ``/etc/casper/<protocol_version>`` içine açar ve *\*.tar.gz* dosyalarını kaldırır
vi: **pull_casper_node_version.sh** <protocol_version> <network_name> - Kéo về ``bin.tar.gz`` và ``config.tar.gz`` từ `genesis.casperlabs.io <http://genesis.casperlabs.io/>`_ cho gói giao thức; giải nén chúng thành ``/var/lib/bin/<protocol_version>`` và ``/etc/casper/<protocol_version>``, và xoá các tệp *\*.tar.gz*

source: **config_from_example.sh** <protocol_version> - Gets external an IP to replace and create the *config.toml* from *config-example.toml*
fr: **config_from_example.sh** <protocol_version> - Obtient une IP externe pour remplacer et crée le *config.toml* de *config-example.toml*.
tr: **config_from_example.sh** <protocol_version> - *config-example.toml* içindeki *config.toml* dosyasını değiştirmek ve oluşturmak için harici bir IP alır
vi: **config_from_example.sh** <protocol_version> - Nhận IP bên ngoài để thay thế và tạo *config.toml* từ *config-example.toml*

source: **casper-node-launcher-state.toml** - This is the local state for the ``casper-node-launcher`` and it is created during the first run
fr: **casper-node-launcher-state.toml** - C'est l'état local du "casper-node-launcher" et il est créé lors de la première exécution.
tr: **casper-node-launcher-state.toml** - Bu, ``casper-node-launcher``ın yerel durumudur ve ilk çalıştırma sırasında oluşturulur
vi: **casper-node-launcher-state.toml** - Đây là trạng thái cục bộ cho ``casper-node-launcher`` và nó được tạo trong lần chạy đầu tiên

source: ``validator_keys`` - The default location for node keys.
fr: ``validator_keys`` - L'emplacement par défaut des clés de nœuds.
tr: ``validator_keys`` - Düğüm anahtarları için varsayılan konum.
vi: ``validator_keys`` - Vị trí mặc định cho các khóa nút.

source: **README.md** - Instructions on how to create validator keys using the ``casper-client``
fr: **README.md** - Instructions pour créer des clés de validation en utilisant le ``casper-client``
tr: **README.md** - ``casper-client`` kullanarak doğrulayıcı anahtarların nasıl oluşturulacağına ilişkin talimatlar
vi: **README.md** - Hướng dẫn về cách tạo khóa của trình xác thực bằng cách sử dụng ``casper-client``

source: **secret_key.pem** - ``casper-client keygen`` creates this file or it is manually copied here
fr: **secret_key.pem** - ``casper-client keygen`` crée ce fichier ou bien il est copié manuellement ici
tr: **secret_key.pem** - ``casper-client keygen`` bu dosyayı oluşturur veya buraya manuel olarak kopyalanır
vi: **secret_key.pem** - ``casper-client keygen`` tạo tệp này hoặc nó được sao chép thủ công tại đây

source: **public_key.pem** - ``casper-client keygen`` creates this file or it is manually copied here
fr: **public_key.pem** - ``casper-client keygen`` crée ce fichier ou bien il est copié manuellement ici
tr: **public_key.pem** - ``casper-client keygen`` bu dosyayı oluşturur veya buraya manuel olarak kopyalanır
vi: **public_key.pem** - ``casper-client keygen`` tạo tệp này hoặc nó được sao chép thủ công tại đây

source: **public_key_hex** - ``casper-client keygen`` creates this file or it is manually copied here
fr: **public_key_hex** - ``casper-client keygen`` crée ce fichier ou bien il est copié manuellement ici
tr: **public_key_hex** - ``casper-client keygen`` bu dosyayı oluşturur veya buraya manuel olarak kopyalanır
vi: **public_key_hex** - ``casper-client keygen`` tạo tệp này hoặc nó được sao chép thủ công tại đây

source: ``1_0_0`` - created with *pull_casper_node_version.sh 1_0_0 <network_name>* for genesis files
fr: ``1_0_0`` - créé avec *pull_casper_node_version.sh 1_0_0 <network_name>* pour les fichiers genesis
tr: ``1_0_0`` - Genesis dosyaları için *pull_casper_node_version.sh 1_0_0 <network_name>* ile oluşturulur
vi: ``1_0_0`` - tạo mới với *pull_casper_node_version.sh 1_0_0 <network_name>* cho các tệp ban đầu

source: **accounts.toml** - Contains the genesis validators and delegators
fr: **accounts.toml** - Contient les validateurs et délégués de genesis
tr: **accounts.toml** - Genesis doğrulayıcıları ve yetki verenleri içerir
vi: **accounts.toml** - Chứa các trình xác thực và ủy quyền gốc

source: **chainspec.toml** - Contains the genesis state with the *activation_point* as a timestamp
fr: **chainspec.toml** - Contient l'état de genesis avec le *activation_point* en tant que timestamp
tr: **chainspec.toml** - Bir zaman damgası olarak *activation_point* ile birlikte doğuş (genesis) durumunu içerir
vi: **chainspec.toml** - Chứa trạng thái ban đầu với *activation_point* làm dấu thời gian

source: **config-example.toml** - Example for creating a *config.toml* file
fr: **config-example.toml** - Exemple de création d'un fichier *config.toml*.
tr: **config-example.toml** - Bir *config.toml* dosyası oluşturma örneği
vi: **config-example.toml** - Ví dụ để tạo tệp *config.toml*

source: **config.toml** - Created by a node operator manually or by running *config_from_example.sh 1_0_0*
fr: **config.toml** - Créé par un opérateur de nœud manuellement ou en exécutant *config_from_example.sh 1_0_0*.
tr: **config.toml** - Bir düğüm operatörü tarafından manuel olarak veya *config_from_example.sh 1_0_0* çalıştırılarak oluşturulur
vi: **config.toml** - Được tạo bởi một nhà điều hành nút theo cách thủ công hoặc bằng cách chạy *config_from_example.sh 1_0_0*

source: ``m_n_p`` - *0* to *N* upgrade packages
fr: ``m_n_p`` - *0* à *N* packages de mise à niveau
tr: ``m_n_p`` - *0* dan *N* e yükseltme paketleri
vi: ``m_n_p`` - *0* tới *N* gói nâng cấp

source: **chainspec.toml** - Contains the *activation_point* as the Era ID int
fr: **chainspec.toml** - Contient l' *activation_point* comme l'Era ID int
tr: **chainspec.toml** - Era ID int olarak *activation_point* içerir
vi: **chainspec.toml** - Chứa *activation_point* như int ID của Era

source: **config.toml** - Created by a node operator manually or by running *config_from_example.sh <protocol_version>*
fr: **config.toml** - Créé par un opérateur de nœud manuellement ou en exécutant *config_from_example.sh <protocol_version>*
tr: **config.toml** - Bir düğüm operatörü tarafından manuel olarak veya *config_from_example.sh <protocol_version>* çalıştırılarak oluşturulur
vi: **config.toml** - Được tạo bởi một nhà điều hành nút theo cách thủ công hoặc bằng cách chạy *config_from_example.sh <protocol_version>*

source: This is the location for larger and variable data for the ``casper-node``, organized in the following directories and files:
fr: C'est l'endroit où se trouvent les données les plus importantes et les plus variables de ``casper-node``, organisées dans les répertoires et fichiers suivants :
tr: Bu, aşağıdaki dizinlerde ve dosyalarda düzenlenen ``casper-node`` için daha büyük ve değişken verilerin konumudur:
vi: Đây là vị trí cho dữ liệu lớn hơn và biến số cho ``casper-node``, được tổ chức trong các thư mục và tệp sau:

source: ``bin`` - The location for storing the versions of ``casper-node`` executables. This location can be overwritten with the ``CASPER_BIN_DIR`` environment variable. The paths in this document assume the default of ``/var/lib/casper/bin``.
fr: ``bin`` - L'emplacement pour stocker les versions des exécutables de ``casper-node``. Cet emplacement peut être écrasé par la variable d'environnement ``CASPER_BIN_DIR``. Les chemins dans ce document supposent la valeur par défaut de ``/var/lib/casper/bin``.
tr: ``bin`` - ``casper-node`` yürütülebilir dosyalarının sürümlerinin depolandığı konum. Bu konumun üzerine ``CASPER_BIN_DIR`` ortam değişkeni yazılabilir. Bu belgedeki yollar, ``/var/lib/casper/bin`` varsayılanını kabul eder.
vi: ``bin`` - Vị trí lưu trữ các phiên bản của tệp thực thi ``casper-node``. Vị trí này có thể được ghi đè bằng biến môi trường ``CASPER_BIN_DIR``. Giả định các đường dẫn trong tài liệu này mặc định là ``/var/lib/casper/bin``.

source: ``1_0_0`` - Created with *pull_casper_node_version.sh 1_0_0 <network_name>* for binaries
fr: ``1_0_0`` - Créé avec *pull_casper_node_version.sh 1_0_0 <network_name>* pour les binaires
tr: ``1_0_0`` - İkili dosyalar için *pull_casper_node_version.sh 1_0_0 <network_name>* ile oluşturuldu
vi: ``1_0_0`` - Tạo mới với *pull_casper_node_version.sh 1_0_0 <network_name>* cho mã nhị phân

source: ``casper-node`` - Defaults to the Ubuntu 18.04 compatible binary
fr: ``casper-node`` - Par défaut, il s'agit du binaire compatible avec Ubuntu 18.04.
tr: ``casper-node`` - Ubuntu 18.04 uyumlu ikili dosyanın varsayılanları
vi: ``casper-node`` - Mặc định là bản nhị phân tương thích Ubuntu 18.04

source: **README.md** - Information about the repository location and the Git hash used for compilation to allow a rebuild on other platforms
fr: **README.md** - Informations sur l'emplacement du dépôt et le hash Git utilisé pour la compilation afin de permettre une reconstruction sur d'autres plateformes.
tr: **README.md** - Depo konumu ve diğer platformlarda yeniden oluşturmaya izin vermek için derleme için kullanılan Git özeti hakkında bilgi
vi: **README.md** - Thông tin về vị trí kho lưu trữ và hàm băm Git được sử dụng để biên dịch để cho phép xây dựng lại trên các nền tảng khác

source: ``m_n_p`` - *0* to *N* upgrade packages for binaries using *pull_casper_node_version.sh 1_0_0 <network_name>*
fr: ``m_n_p`` - *0* à *N* packages de mise à jour pour les binaires utilisant *pull_casper_node_version.sh 1_0_0 <network_name>*
tr: ``m_n_p`` - *pull_casper_node_version.sh 1_0_0 * kullanan ikili dosyalar için *0*'dan *N*'ye yükseltme paketleri
vi: ``m_n_p`` - *0* tới *N* gói nâng cấp cho các mã nhị phân bằng cách sử dụng *pull_casper_node_version.sh 1_0_0 <network_name>*

source: ``casper-node`` - This is where the given version of the ``casper-node`` executable lives and is run from the ``casper-node-launcher``.
fr: ``casper-node`` - C'est l'endroit où la version donnée de l'exécutable ``casper-node`` vit et est lancée depuis le ``casper-node-launcher``.
tr: ``casper-node`` - ``casper-node`` yürütülebilir dosyasının verilen sürümünün burada bulunduğu ve "casper-node-launcher"dan çalıştırıldığı yerdir.
vi: ``casper-node`` - Đây là nơi phiên bản cho trước của thực thi đang hoạt động ``casper-node`` và được chạy từ ``casper-node-launcher``.

source: ``casper-node`` - Local data store and the largest user of disc space
fr: ``casper-node`` - Le store de données local et le plus grand utilisateur d'espace disque
tr: ``casper-node`` - Yerel veri deposu ve en büyük disk alanı kullanıcısı
vi: ``casper-node`` - Kho lưu trữ dữ liệu cục bộ và sử dụng dung lượng đĩa lớn nhất

source: **data.lmdb** - Global state of the chain
fr: **data.lmdb** - Etat global de la chaîne
tr: **data.lmdb** - Zincirin genel durumu
vi: **data.lmdb** - Trạng thái toàn cục của chuỗi

source: **storage.lmdb** - Blocks, deploys, and everything else
fr: **storage.lmdb** - Blocs, déploiements, et tout le reste
tr: **storage.lmdb** - Bloklar, dağıtımlar ve diğer her şey
vi: **storage.lmdb** - Khối, triển khai và mọi thứ khác

source: **unit_\*** - The node creates one of these files per era
fr: **unit_\*** - Le nœud crée un de ces fichiers par ère
tr: **unit_\*** - Düğüm, her dönem için bu dosyalardan birini oluşturur
vi: **unit_\*** - Nút tạo ra một trong những tệp này mỗi kỷ nguyên

source: Upgrade Operation
fr: Opération de mise à jour
tr: Yükseltme İşlemi
vi: Nâng cấp hoạt động

source: The ``chainspec.toml`` contains a section to indicate what era the given ``casper-node`` version should start running.
fr: Le fichier ``chainspec.toml`` contient une section pour indiquer à quelle ère la version donnée de ``casper-node`` doit commencer à fonctionner.
tr: ``chainspec.toml``, verilen ``casper-node`` sürümünün hangi dönemde çalışmaya başlaması gerektiğini gösteren bir bölüm içerir.
vi: ``chainspec.toml`` chứa một phần để cho biết phiên bản ``casper-node`` đã cho sẽ bắt đầu chạy từ kỷ nguyên nào.
