Repository: casper-network/docs-archive
Catalog: locale/*/LC_MESSAGES/node-operator/unbonding.po
Languages: fr, tr, vi

source: Unbonding
fr: Désengagement (Unbonding)
tr: Çözülme
vi: Rút cổ phần

source: Once a bid is placed, it will remain in the state of the auction contract. Even if the bid does not win a slot right away. The reason for this is that new slots may become available if bonded validators leave the network, or reduce their bond amounts. Therefore, a bid must be explicitly withdrawn in order to remove the bid from the auction. Bonded validators also have a bid in the auction, to unbond stake, this bid must be reduced. Since tokens will be transferred out of the bid purse, it's important to compile the contract to withdraw the bid yourself, so there is confidence in the correctness of the contract. The process is essentially the same as bonding, but uses a different contract, ``withdraw_bid.wasm``.
fr: Une fois qu'une offre est placée, elle reste dans l'état du contrat d'enchères. Même si l'offre ne permet pas de gagner un slot immédiatement. La raison en est que de nouveaux créneaux peuvent se libérer si des validateurs cautionnés quittent le réseau, ou réduisent le montant de leur caution. Par conséquent, une offre doit être explicitement retirée afin de la retirer de l'enchère. Les validateurs cautionnés ont également une offre dans l'enchère, pour libérer la caution, cette offre doit être réduite. Puisque les jetons seront transférés du porte-monnaie de l'offre, il est important de compiler le contrat pour retirer l'offre vous-même, afin d'avoir confiance en l'exactitude du contrat. Le processus est essentiellement le même que pour le cautionnement (bonding), mais utilise un contrat différent, ``withdraw_bid.wasm``.
tr: Bir teklif verildikten sonra, teklif müzayedeyi hemen kazanmasa bile, müzayede kontratının durumu içinde tutulmaya devam eder. Bunun sebebi, bağlanmış doğrulayıcıların ağı terk etmesi ya da teklif miktarlarını azaltması durumunda, yeni yuvaların açılma ihtimalidir. Dolayısıyla, bir teklifin müzayededen çıkarılması için, açıkça geri çekilmesi gerekir. Bağlı doğrulayıcıların da müzayedede teklifi bulunur ve payın çözülmesi için bu teklifin azaltılması gerekir. Tokenler teklif cüzdanının dışına aktarılacağı için, teklifi geri çekecek kontratı bizzat derlemeniz önemlidir; böylece, kontratın doğruluğundan emin olabilirsiniz. Esasen bu süreç, bağlanma ile aynıdır fakat ``withdraw_bid.wasm`` adlı başka bir kontratı kullanır.
vi: Sau khi đặt giá, nó sẽ vẫn ở trạng thái của hợp đồng đấu giá. Ngay cả khi giá thầu không giành được một vị trí ngay lập tức. Lý do cho điều này là các vị trí mới có thể khả dụng nếu người xác thực đã góp cổ phần nhưng rời khỏi mạng hoặc giảm số lượng cổ phần của họ. Do đó, một giá thầu phải được rút lại một cách rõ ràng để loại bỏ giá thầu đó khỏi cuộc đấu giá. Người xác thực góp cổ phần cũng có một giá thầu trong cuộc đấu giá, để hủy bỏ cổ phần, giá thầu này phải được giảm xuống. Vì token sẽ được chuyển ra khỏi ví đấu thầu, điều quan trọng là bạn phải tự soạn hợp đồng để rút giá thầu, vì vậy hãy tin tưởng vào tính đúng đắn của hợp đồng. Quá trình này về cơ bản giống như góp cổ phần, nhưng sử dụng một hợp đồng khác là ``withdraw_bid.wasm``.

source: Withdrawal Request
fr: Requête de retrait
tr: Geri Çekme Talebi
vi: Rút yêu cầu

source: Note the path to files and keys. Note: the session arguments need to be encased in double quotes, with the parameter values in single quotes. Note the required payment amount. It must contain at least 12 zeros. Payment amount is specified in motes.
fr: Notez le chemin d'accès aux fichiers et aux clés. Remarque : les arguments de la session doivent être placés entre guillemets doubles, et les valeurs des paramètres entre guillemets simples. Notez le montant du paiement requis. Il doit contenir au moins 12 zéros. Le montant du paiement est indiqué en motes.
tr: Dosyaların ve anahtarların konumlarını not alın. Not: oturum argümanlarının, parametre değerleri tek tırnak içinde olacak şekilde, çift tırnak içine alınması gerekir. Gereken ödeme miktarını not alın. Ödeme miktarında en az 12 sıfır olmalıdır. Ödeme miktarı, MOTE cinsinden belirtilir.
vi: Lưu ý đường dẫn đến tệp và khóa. Lưu ý: các đối số phiên cần được đặt trong dấu ngoặc kép, với các giá trị tham số trong dấu nháy đơn. Lưu ý số tiền thanh toán bắt buộc. Nó phải chứa ít nhất 12 số không. Số tiền thanh toán được xác định bằng motes.

source: To withdraw a bid, compile the contract & submit a deploy:
fr: Pour retirer une offre, compiler le contrat et soumettre un déploiement :
tr: Bir teklifi geri çekmek için, kontratı derleyin ve bir dağıtım gönderin:
vi: Để rút lại giá thầu, hãy soạn hợp đồng và gửi bản triển khai:

source: Contract Arguments
fr: Arguments de Contrat
tr: Kontrat Argümanları
vi: Đối số của hợp đồng

source: The withdraw_bid contract accepts 3 arguments:
fr: Le contrat withdraw_bid accepte 3 arguments:
tr: withdraw_bid kontratı, 3 argüman kabul eder:
vi: Hợp đồng withdraw_bid chấp nhận 3 đối số:

source: public key: The public key in hex of the account to withhdraw. Note: This has to be the matching key to the validator secret key that signs the deploy, and has to match the public key of a bid in the auction contract.
fr: public key (clé publique) : La clé publique en hexadécimal du compte à retirer. Remarque : Il doit s'agir de la clé correspondant à la clé secrète du validateur qui signe le déploiement, et doit correspondre à la clé publique d'une offre dans le contrat d'enchères.
tr: public key: Geri çekme işlemini yapacak hesabın, hex biçiminde genel anahtarı (adresi). Not: Bu genel anahtar, dağıtımı imzalayacak doğrulayıcı gizli anahtarı ile ve ayrıca müzayede kontratındaki bir teklifin genel anahtarı ile eşleşmelidir.
vi: public key: Khóa công khai trong hex của tài khoản để rút tiền. Lưu ý: Đây phải là khóa khớp với khóa bí mật của nhà xác thực ký triển khai và phải khớp với khóa công khai của một giá thầu trong hợp đồng đấu giá.

source: amount: This is the amount that is being withdrawn.
fr: amount: (montant) Il s'agit du montant qui sera retiré.
tr: amount: Geri çekilecek miktarı ifade eder.
vi: amount: Đây là số tiền đang được rút.

source: unbond_purse (optional): The purse to which the withdrawal will be remitted. Defaults to the main purse for the account if not provided.
fr: unbond_purse (facultatif): Le porte-monnaie auquel le retrait sera remis. Par défaut, il s'agit du porte-monnaie principal du compte s'il n'est pas indiqué.
tr: unbond_purse (isteğe bağlı): Geri çekilen miktarın yatırılacağı cüzdan. Eğer bu argüman verilmezse, varsayılan olarak ilgili hesabın ana cüzdanı geçerlidir.
vi: unbond_purse (tuỳ chọn): Ví mà tiền rút sẽ được chuyển đến. Mặc định là ví chính của tài khoản, nếu để trống thông tin.

source: Similar to bonding (bidding) - check the auction contract for updates to the bid amounts.
fr: Comme pour le cautionnement (bonding) - vérifier le contrat d'enchère pour les mises à jour des montants de l'enchère.
tr: Bağlanmaya (teklif vemeye) benzer - teklif miktarlarındaki güncellemeler için müzayede kontratını kontrol ediniz.
vi: Tương tự như việc cổ phần (đấu thầu) - cần kiểm tra hợp đồng đấu giá để cập nhật về số tiền đấu thầu.

source: Unbonding Wait Period
fr: Période de désolidarisation (désengagement)
tr: Çözülme Bekleme Süresi
vi: Khoảng thời gian chờ rút cổ phần

source: In order to prevent 'long range attacks', requests to unbond must go through a mandatory wait period. This wait period is presently set to 15 eras.
fr: Afin d'éviter les 'long range attacks', les requêtes de désolidarisation doivent passer par une période d'attente obligatoire. Cette période d'attente est actuellement fixée à 15 ères.
tr: 'Uzun mesafe saldırılar'ı önlemek için, çözülme talepleri zorunlu bir bekleme süresinden geçmek zorundadır. Bu bekleme süresi, şu anda 15 dönem olarak belirlenmiştir.
vi: Để ngăn chặn 'các cuộc tấn công tầm xa', các yêu cầu rút cổ phần phải trải qua một khoảng thời gian chờ bắt buộc. Khoảng thời gian chờ này hiện được đặt là 15 kỷ nguyên.
