Repository: casper-network/docs-archive
Catalog: locale/*/LC_MESSAGES/workflow/delegate.po
Languages: fr, tr, vi

source: Below is a sample output:
fr: Vous trouverez ci-dessous un exemple de sortie :
tr: Aşağıda örnek bir çıktı verilmiştir:
vi: Dưới đây là đầu ra mẫu:

source: If your public key and associated amount appear in the ``bid`` data structure, this means that the delegation request has been processed successfully. However, this does not mean the associated validator is part of the validator set, so you need to check the validator status.
fr: Si votre clé publique et le montant associé apparaissent dans la structure de données ``bid``, cela signifie que la demande de délégation a été traitée avec succès. Cependant, cela ne signifie pas que le validateur associé fasse partie de l'ensemble des validateurs, vous devez donc vérifier le statut du validateur.
tr: Açık anahtarınız ve ilgili miktar ``bid`` veri yapısında görünüyorsa, bu, delegasyon talebinin başarıyla işlendiği anlamına gelir. Ancak bu, ilgili doğrulayıcının doğrulayıcı kümesinin bir parçası olduğu anlamına gelmez, bu nedenle doğrulayıcı durumunu kontrol etmeniz gerekir.
vi: Nếu khóa công khai và số tiền liên quan của bạn xuất hiện trong cấu trúc dữ liệu ``bid``, điều này có nghĩa là yêu cầu ủy quyền đã được xử lý thành công. Tuy nhiên, điều này không có nghĩa là nhà xác thực được liên kết là một phần của nhóm nhà xác thực, vì vậy bạn cần kiểm tra trạng thái của nhà xác thực.

source: Checking Validator Status
fr: Vérification de l'état du validateur
tr: Doğrulayıcı Durumunu Kontrol Etmek
vi: Kiểm tra Trạng thái nhà xác thực

source: The auction maintains a field called ``era_validators``, which contains the validator information for 4 future eras from the current era. An entry for a specific era lists the ``PublicKeys`` of the active validators for that era along with their stake in the network.
fr: L'enchère possède un champ appelé ``era_validators``, qui contient les informations sur les validateurs pour 4 ères futures à partir de l'ère actuelle. Une entrée pour une ère spécifique liste les ``PublicKeys`` des validateurs actifs pour cette ère ainsi que leur participation dans le réseau.
tr: Açık arttırma, mevcut dönemden 4 gelecek dönem için doğrulayıcı bilgilerini içeren ``era_validators`` adlı bir alanı korur. Belirli bir döneme ilişkin bir girdi, o dönem için etkin doğrulayıcıların ağdaki paylarıyla birlikte ``PublicKeys``i listeler.
vi: Phiên đấu giá duy trì một trường có tên là ``era_validators``,, chứa thông tin về nhà xác thực cho 4 kỷ nguyên trong tương lai từ kỷ nguyên hiện tại. Mục nhập cho một kỷ nguyên cụ thể liệt kê ``PublicKeys`` của các nhà xác thực đang hoạt động cho kỷ nguyên đó cùng với cổ phần của họ trong mạng.

source: If a validator is part of the set, its public key will be present in the ``era_validators`` field as part of the ``Auction`` data structure. We can use the Casper command-line client to create an RPC request to obtain auction information and assert that the selected validator is part of the active validator set.
fr: Si un validateur fait partie de l'ensemble, sa clé publique sera présente dans le champ ``era_validators`` faisant partie de la structure de données ``Auction``. Nous pouvons utiliser le client en ligne de commande Casper pour créer une requête RPC afin d'obtenir des informations sur les enchères et affirmer que le validateur sélectionné fait partie de l'ensemble de validateurs actifs.
tr: Doğrulayıcı, kümenin parçasıysa, açık anahtarı, ``Auction`` veri yapısının bir parçası olarak ``era_validators`` alanında bulunacaktır. Açık arttırma bilgilerini almak ve seçilen doğrulayıcının etkin doğrulayıcı kümesinin bir parçası olduğunu iddia etmek için bir RPC isteği oluşturmak için Casper komut satırı istemcisini kullanabiliriz.
vi: Nếu nhà xác thực là một phần của nhóm, khóa công khai của nó sẽ xuất hiện trong trường ``era_validators`` như một phần của cấu trúc dữ liệu ``Auction`` Chúng ta có thể sử dụng dòng lệnh trên Casper client để tạo một yêu cầu RPC nhằm lấy thông tin đấu giá và khẳng định rằng nhà xác thực đã chọn là một phần của nhóm nhà xác thực đang hoạt động.

source: **Important Response fields**:
fr: **Paramètres importants de la réponse:**
tr: **Önemli Yanıt alanları**:
vi: **Các trường phản hồi quan trọng**:

source: In the response, check the ``"auction_state"."era_validators"`` structure, which should contain the public key of the selected validator for the era in which the validator will be active.
fr: Dans la réponse, vérifiez la structure ``"auction_state". "era_validators"``, qui devrait contenir la clé publique du validateur sélectionné pour l'ère dans laquelle le validateur sera actif.
tr: Yanıtta, doğrulayıcının etkin olacağı dönem için seçilen doğrulayıcının açık anahtarını içermesi gereken ``"auction_state"."era_validators"`` yapısını kontrol edin.
vi: Trong phần trả về, hãy kiểm tra cấu trúc ``"auction_state"."era_validators"``, cấu trúc này phải chứa khóa công khai của nhà xác thực đã chọn cho thời đại mà nhà xác thực sẽ hoạt động.

source: Below is an example of the ``era_validators`` structure:
fr: Voici un exemple de la structure ``era_validators`` :
tr: Aşağıda ``era_validators`` yapısının bir örneği verilmiştir:
vi: Dưới đây là ví dụ về cấu trúc ``era_validators``:

source: In the above example, we see the public keys of the active validators in Era ``9``.
fr: Dans l'exemple ci-dessus, nous voyons les clés publiques des validateurs actifs dans l'ère ``9``.
tr: Yukarıdaki örnekte, Dönem ``9`daki aktif doğrulayıcıların açık anahtarlarını görüyoruz.
vi: Trong ví dụ trên, chúng ta thấy các khóa công khai của nhà xác thực đang hoạt động trong Kỷ nguyên ``9``.

source: **Note**: Validators earn delegation rewards only when they are part of the active set. This information is time-sensitive; therefore, a validator selected today may not be part of the set tomorrow. Keep this in mind when creating a delegation request.
fr: **Note** : Les validateurs ne gagnent des récompenses de délégation que lorsqu'ils font partie de l'ensemble actif. Par conséquent, un validateur sélectionné aujourd'hui peut ne pas faire partie du jeu demain. Gardez cela à l'esprit lorsque vous créez une demande de délégation.
tr: **Not**: Doğrulayıcılar, yalnızca etkin kümenin parçası olduklarında delegasyon ödülleri kazanırlar. Bu bilgiler zamana duyarlıdır; bu nedenle, bugün seçilen bir doğrulayıcı yarın kümenin parçası olmayabilir. Bir delegasyon isteği oluştururken bunu aklınızda bulundurun.
vi: **Lưu ý**: Người xác thực chỉ kiếm được phần thưởng ủy quyền khi họ là một phần của nhóm hoạt động. Thông tin này nhạy cảm về thời gian; do đó, một trình xác thực được chọn hôm nay có thể không phải là một phần của nhóm vào ngày mai. Hãy ghi nhớ điều này khi tạo một yêu cầu ủy quyền.

source: Delegating with the Command-line
vi: Ủy quyền bằng dòng lệnh

source: Obtain the ``delegate.wasm`` by cloning the `casper-node <https://github.com/casper-network/casper-node>`_ repository and building the contracts.
vi: Lấy ``Delegate.wasm`` bằng cách sao chép kho chứa `casper-node <https://github.com/casper-network/casper-node>`_ và xây dựng các hợp đồng.
