Repository: casper-network/docs-archive
Catalog: locale/*/LC_MESSAGES/workflow/delegate.po
Languages: fr, tr, vi

source: Delegating Tokens
fr: Délégation de jetons
tr: Tokenlerin Delegasyonu

source: This document details a workflow where an account holder on the Casper Network can delegate their tokens to a validator on a Casper Network.
fr: Ce document détaille un workflow par lequel un titulaire de compte sur le réseau Casper peut déléguer ses jetons à un validateur sur un réseau Casper.
tr: Bu belge, Casper Network'teki bir hesap sahibinin tokenlerinin oylama yetkisini Casper Network'teki bir doğrulayıcıya devredebileceği bir iş akışını detaylandırır.
vi: Tài liệu này trình bày chi tiết quy trình làm việc trong đó chủ tài khoản trên Mạng Casper có thể ủy quyền mã thông báo của họ cho nhà xác thực trên Mạng Casper.

source: This workflow assumes:
fr: Ce workflow suppose :
tr: Bu iş akışı şunları varsayar:
vi: Giả định luồng công việc này:

source: You meet the `prerequisites <setup.html>`_
fr: Vous remplissez les `pré-requis <setup.html>`_
tr: `Önkoşulları <setup.html>`_ karşılıyorsunuz
vi: Bạn đáp ứng các `điều kiện cần <setup.html>`_

source: You are using the Casper command-line client
fr: Vous utilisez le client de ligne de commande Casper
tr: Casper komut satırı istemcisini kullanıyorsunuz
vi: Bạn đang sử dụng dòng lệnh trên Casper client

source: You have the public key of a validator on a Casper Network
fr: Vous avez la clé publique d'un validateur sur un réseau Casper.
tr: Casper Network'te bir doğrulayıcının açık anahtarına sahipsiniz
vi: Bạn có khóa công khai của nhà xác thực trên Mạng Casper

source: You have the delegation contract or WASM to execute on the network
fr: Vous avez le contrat de délégation ou un WASM à exécuter sur le réseau
tr: Ağ üzerinde yürütmek için delegasyon kontratı veya WASM'ınız var
vi: Bạn có hợp đồng ủy quyền hoặc WASM để thực thi trên mạng

source: You have a valid ``node-address``
fr: Vous avez une ``node-address`` valide.
tr: Elinizde geçeli bir ``node-address`` (düğüm adresi) var
vi: Bạn có một ``node-address``hợp lệ

source: You have previously `deployed a smart contract <https://docs.casperlabs.io/en/latest/dapp-dev-guide/deploying-contracts.html>`_ to a Casper Network
fr: Vous avez précédemment `déployé un contrat intelligent <https://docs.casperlabs.io/fr/latest/dapp-dev-guide/deploying-contracts.html>`_ sur un Réseau Casper
tr: Daha önce bir Casper Network'e `akıllı kontrat dağıttınız <https://docs.casperlabs.io/en/latest/dapp-dev-guide/deploying-contracts.html>`_
vi: Trước đây bạn đã `triển khai hợp đồng thông minh <https://docs.casperlabs.io/en/latest/dapp-dev-guide/deploying-contracts.html>`_ trên Mạng Casper

source: Building The Delegation WASM
fr: Construire le WASM de délégation
tr: Delegasyon WASM'ını Derlemek
vi: Xây dựng WASM Ủy quyền

source: Obtain the ``delegate.wasm`` by cloning the `casper-node <https://github.com/CasperLabs/casper-node>`_ repository and building the contracts.
fr: Obtenez le ``undelegate.wasm`` en clonant le dépôt `casper-node <https://github.com/CasperLabs/casper-node>`_ et en construisant les contrats.
tr: `casper-node <https://github.com/CasperLabs/casper-node>`_ kod deposunu klonlayarak ve kontratları derleyerek ``delegate.wasm`` edinin.

source: To build contracts, set up Rust, and install all dependencies. Visit `Setting up Rust <https://docs.casperlabs.io/en/latest/dapp-dev-guide/setup-of-rust-contract-sdk.html>`_ in the Developer Guide for step-by-step instructions.
fr: Pour construire (build) des contrats, configurez Rust, et installez toutes les dépendances. Consultez `Setting up Rust <https://docs.casperlabs.io/fr/latest/dapp-dev-guide/setup-of-rust-contract-sdk.html>`_ dans le Guide du développeur pour les instructions détaillées.
tr: Kontratlar oluşturmak için Rust'ı ve tüm bağımlılıkları kurun. Adım adım talimatlar için Geliştirici Kılavuzunda `Rust Kurulumu <https://docs.casperlabs.io/en/latest/dapp-dev-guide/setup-of-rust-contract-sdk.html>`_ sayfasını ziyaret edin.
vi: Để xây dựng hợp đồng, hãy thiết lập Rust và cài đặt tất cả các phần phụ thuộc. Truy cập vào ``Cài đặt Rust <https://docs.casperlabs.io/en/latest/dapp-dev-guide/setup-of-rust-contract-sdk.html>`_ trong Hướng dẫn dành cho nhà phát triển để biết từng bước hướng dẫn.

source: Once you build the contracts, you can use the ``delegate.wasm`` to create a deploy that will initiate the delegation process. The WASM can be found in:
fr: Une fois que vous avez construit les contrats, vous pouvez utiliser le ``delegate.wasm`` pour créer un déploiement qui lancera le processus de délégation des jetons. Le WASM peut être trouvé dans :
tr: Kontratları oluşturduktan sonra, delegasyon sürecini başlatacak bir dağıtım oluşturmak için ``delegate.wasm``'ı kullanabilirsiniz. WASM şurada bulunabilir:
vi: Khi bạn xây dựng các hợp đồng, bạn có thể sử dụng ``delegate.wasm`` để tạo một triển khai sẽ bắt đầu quá trình ủy quyền. WASM có thể được tìm thấy tại:

source: Acquiring a Validator's Public Key
fr: Acquérir la clé publique d'un validateur
tr: Bir Doğrulayıcının Genel Anahtarını Edinme
vi: Có được Khóa công khai của Nhà xác thực

source: The official Testnet and Mainnet provide a browser-based block explorer to look up the list of validators within their respective networks:
fr: Les réseaux officiels Testnet et Mainnet offrent un explorateur de blocs basé sur un navigateur pour consulter la liste des validateurs dans leurs réseaux respectifs :
tr: Resmi Testnet ve Mainnet, kendi ağlarındaki doğrulayıcıların listesinde arama yapabilmek için tarayıcı tabanlı bir blok gezgini sağlar:
vi: Testnet chính thức và Mainnet cung cấp trình khám phá khối dựa trên trình duyệt để tra cứu danh sách nhà xác thực trong các mạng tương ứng của chúng:

source: `Validators on Mainnet <https://cspr.live/validators>`_
fr: `Validateurs sur le Mainnet <https://cspr.live/validators>`_
tr: `Mainnetteki Doğrulayıcılar <https://cspr.live/validators>`_
vi: `Nhà xác thực trên Mainnet <https://cspr.live/validators>`_

source: `Validators on Testnet <https://testnet.cspr.live/validators>`_
fr: `Validateurs sur le Testnet <https://testnet.cspr.live/validators>`_
tr: `Testnetteki Doğrulayıcılar <https://testnet.cspr.live/validators>`_
vi: `Nhà xác thực trên Testnet <https://testnet.cspr.live/validators>`_

source: You will see a list of validators present on the network and their total stake (including tokens from other delegators).
fr: Vous verrez une liste des validateurs présents sur le réseau et leur mise totale (y compris les jetons des autres délégataires).
tr: Ağda bulunan doğrulayıcıların bir listesini ve bunların toplam payını (diğer temsilcilerden oy yetkisi alınan tokenler dahil) göreceksiniz.
vi: Bạn sẽ thấy danh sách những người xác thực có mặt trên mạng và tổng số đặt cọc của họ (bao gồm cả token từ những người ủy quyền khác).

source: You can click on any validator listed to see more information about the validator, including the validator's personal stake.
fr: Vous pouvez cliquer sur n'importe quel validateur listé pour voir plus d'informations sur le validateur, y compris sa participation personnelle.
tr: Doğrulayıcının kişisel payı da dahil olmak üzere doğrulayıcı hakkında daha fazla bilgi görmek için listelenen herhangi bir doğrulayıcıya tıklayabilirsiniz.
vi: Bạn có thể nhấp vào bất kỳ nhà xác thực nào được liệt kê để xem thêm thông tin về nhà xác thực, bao gồm cả số đặt cọc của người xác thực.

source: Each validator will show the delegation rate (commission); this represents the percentage of **your** reward share that the validator will retain. Thus, a 10% rate implies that the validator will retain 10% of your reward share. As a prospective delegator, selecting a validating node that you can trust and offers a favorable delegation rate is essential. Please do your due diligence before you stake your tokens with a validator.
fr: Chaque validateur affiche le taux de délégation (commission) ; celui-ci représente le pourcentage de **votre** part de récompense que le validateur conservera. Ainsi, un taux de 10% implique que le validateur conservera 10% de vos récompenses. En tant que délégataire potentiel, il est essentiel de sélectionner un nœud de validation en qui vous avez confiance et qui offre un taux de délégation favorable. Veuillez faire preuve de diligence raisonnable avant de miser vos jetons sur un validateur.
tr: Her doğrulayıcı, delegasyon oranını (komisyon) gösterecektir; bu, doğrulayıcının elinde tutacağı **sizin** ödül payınızın yüzdesini temsil eder. Bu nedenle %10'luk bir oran, doğrulayıcının ödül payınızın %10'unu elinde tutacağı anlamına gelir. Potansiyel bir temsilci olarak, güvenebileceğiniz ve uygun bir delegasyon oranı sunan bir doğrulama düğümü seçmek çok önemlidir. Tokenlerinizi bir doğrulayıcıya yatırmadan önce lütfen gerekli özeni gösterin.
vi: Mỗi nhà xác thực sẽ hiển thị tỷ lệ ủy quyền (hoa hồng); điều này thể hiện phần trăm **phần thưởng** của bạn mà người xác thực sẽ giữ lại. Do đó, tỷ lệ 10% ngụ ý rằng người xác thực sẽ giữ lại 10% phần thưởng của bạn. Là một người ủy quyền tiềm năng, việc chọn một nút xác thực mà bạn có thể tin tưởng và cung cấp tỷ lệ ủy quyền thuận lợi là điều cần thiết. Vui lòng thực hiện thẩm định của bạn trước khi bạn đặt cọc token của mình cho nhà xác thực.

source: Note the ``PublicKey`` of the validator you have selected to delegate your tokens.
fr: Notez la ``PublicKey`` du validateur que vous avez choisi pour déléguer vos jetons.
tr: Tokenlerinizi devretmek için seçtiğiniz doğrulayıcının ``PublicKey``ini not edin.
vi: Lưu ý ```PublicKey`` của nhà xác thực mà bạn đã chọn để ủy quyền token của mình.

source: If you observe your delegation request in the bid structure but do not see the associated validator key in the ``era_validators`` structure, the validator you selected is not part of the current validator set. In this event, your tokens will not be earning rewards unless you un-delegate, wait through the unbonding period, and re-delegate to another validator.
fr: Si vous observez votre demande de délégation dans la structure d'enchères mais ne voyez pas la clé de validateur associée dans la structure ``era_validators``, le validateur que vous avez sélectionné ne fait pas partie de l'ensemble des validateurs actuels. Dans ce cas, vos jetons ne gagneront pas de récompenses à moins que vous ne débloquiez, attendiez la période de déblocage et re-déléguiez à un autre validateur.
tr: Teklif yapısında yetkilendirme isteğinizi gözlemler ancak ``era_validators`` yapısında ilişkili doğrulayıcı anahtarını görmezseniz, seçtiğiniz doğrulayıcı geçerli doğrulayıcı kümesinin parçası değildir. Bu durumda, yetki vermediğiniz, bağın kaldırılması süresini beklemediğiniz ve başka bir doğrulayıcıya yeniden yetki vermediğiniz sürece tokenleriniz ödül kazanmayacaktır.
vi: Nếu bạn quan sát yêu cầu ủy quyền của mình trong cấu trúc giá thầu nhưng không thấy khóa nhà xác thực được liên kết trong cấu trúc ``era_validators``, thì nhà xác thực bạn đã chọn không phải là một phần của nhóm nhà xác thực hiện tại. Trong trường hợp này, các token của bạn sẽ không kiếm được phần thưởng trừ khi bạn hủy ủy quyền, đợi qua khoảng thời gian hủy kết thúc và ủy quyền lại cho một nhà xác thực khác.

source: Additionally, any rewards earned are re-delegated by default to the validator from the initial delegation request. Therefore at the time of un-delegation, you may want to un-delegate the initial amount plus any additional rewards earned through the delegation process.
fr: En outre, toutes les récompenses obtenues sont re-déléguées par défaut au validateur via la requête de délégation initiale. Par conséquent, au moment du déblocage, vous pouvez retirer le montant initial ainsi que les récompenses supplémentaires obtenues au cours du processus de délégation
tr: Ek olarak, kazanılan tüm ödüller varsayılan olarak ilk yetkilendirme isteğinden doğrulayıcıya yeniden devredilir. Bu nedenle, delegasyonun iptali sırasında, ilk miktarın yanı sıra delegasyon sürecinde kazanılan ek ödüllerin delegasyonunu iptal etmek isteyebilirsiniz.
vi: Ngoài ra, mọi phần thưởng kiếm được đều được ủy quyền lại theo mặc định cho người xác thực từ yêu cầu ủy quyền ban đầu. Do đó, tại thời điểm hủy ủy quyền, bạn có thể muốn hủy ủy quyền số đặt cọc ban đầu cộng với bất kỳ phần thưởng bổ sung nào kiếm được thông qua quá trình ủy quyền.

source: The active validator set is constantly rotating; therefore, when delegating to a validator, remember that the validator you selected may have been rotated out of the set.
fr: L'ensemble des validateurs actifs change constamment ; par conséquent, lorsque vous déléguez à un validateur, n'oubliez pas que le validateur que vous avez sélectionné peut avoir été retiré de de cet ensemble.
tr: Etkin doğrulayıcı kümesi sürekli değişir; bu nedenle, bir doğrulayıcıya yetki verirken, seçtiğiniz doğrulayıcının kümeden çıkarılmış olabileceğini unutmayın.
vi: Nhóm nhà xác thực đang hoạt động liên tục thay đổi; do đó, khi ủy quyền cho nhà xác thực, hãy nhớ rằng nhà xác thực bạn đã chọn có thể đã bị chuyển ra khỏi nhóm.

source: Executing the Delegation Request
fr: Exécution de la requête de délégation
tr: Yetkilendirme İsteğinin Yürütülmesi
vi: Thực hiện Yêu cầu Ủy quyền

source: We recommend first testing the following steps on our official Testnet before performing these steps in a live environment like the Casper Mainnet.
fr: Nous vous recommandons de d'abord tester les étapes suivantes sur notre Testnet officiel avant de les exécuter dans un environnement réel comme le Mainnet de Casper.
tr: Bu adımları Casper Mainnet gibi canlı bir ortamda gerçekleştirmeden önce resmi Testnet'imizde aşağıdaki adımları test etmenizi öneririz.
vi: Trước tiên, chúng tôi khuyên bạn nên thử nghiệm các bước sau trên Testnet chính thức của chúng tôi trước khi thực hiện các bước này trong môi trường trực tiếp như Casper Mainnet.

source: Sending the Delegation Deploy
fr: Envoi du déploiement de délégation
tr: Delegasyon Dağıtımını Göndermek
vi: Gửi triển khai Ủy quyền

source: Send a deploy containing the ``delegate.wasm`` to the network to initiate the delegation process. Here is an example deployment of the delegation request:
fr: Envoyer un déploiement contenant le ``delegate.wasm`` au réseau pour initier le processus de délégation.
tr: Delegasyon sürecini başlatmak için ağa ``delegate.wasm`` içeren bir dağıtım gönderin. Delegasyon isteğinin örnek bir dağıtımı aşağıdadır:
vi: Gửi một triển khai có chứa ``delegate.wasm`` đến mạng để bắt đầu quá trình ủy quyền. Dưới đây là một ví dụ về triển khai yêu cầu ủy quyền:

source: **Note** The delegator's public key and the secret key that signs the deploy must be part of the same key pair.
fr: **Note** La clé publique du délégant et la clé secrète qui signe le déploiement doivent faire partie de la même paire de clés.
tr: **Not** Yetki verenin genel anahtarı ve dağıtımı imzalayan gizli anahtar, aynı anahtar çiftinin parçası olmalıdır.
vi: **Lưu ý** Khóa công khai của người ủy quyền và khóa bí mật đã ký vào triển khai phải là một phần của cùng một cặp khóa.

source: **Request fields:**
fr: **Paramètres de la requête:**
tr: **Talep alanları:**
vi: **Các trường yêu cầu:**

source: ``node-address`` - <HOST:PORT> Hostname or IP and port of node on which HTTP service is running [default:http://localhost:7777]
fr: ``node-address`` - <HOST:PORT> Hostname ou IP et port du nœud sur lequel le service HTTP tourne [default:http://localhost:7777]
tr: ``node-address`` - <HOST:PORT> Ana bilgisayar adı veya IP ve HTTP hizmetinin çalıştığı düğümün bağlantı noktası [varsayılan:http://localhost:7777]
vi: ``node-address`` - <HOST:PORT> Tên máy chủ hoặc IP và cổng của nút mà dịch vụ HTTP đang chạy [default:http://localhost:7777]

source: ``secret-key`` - Path to secret key file
fr: ``secret-key`` - Chemin du fichier de la clé secrète
tr: ``secret-key`` - Gizli anahtar dosyasının yolu
vi: ``secret-key`` - Đường dẫn đến tệp khóa bí mật

source: ``chain-name`` - Name of the chain, to avoid the deploy from being accidentally or maliciously included in a different chain
fr: ``chain-name`` - Nom de la chaîne, pour éviter que le déploiement ne soit accidentellement ou malicieusement fait dans une autre chaîne.
tr: ``chain-name`` - Dağıtımın yanlışlıkla veya kötü niyetli olarak farklı bir zincire dahil edilmesini önlemek için zincirin adı
vi: ``chain-name`` - Tên của chuỗi, để tránh việc triển khai bị đưa vào một chuỗi khác một cách vô tình hoặc có hại

source: The *chain-name* for testnet is **casper-test**
fr: La valeur de *chain-name* pour testnet est **casper-test**.
tr: Testnet için *chain-name* değeri **casper-test**'tir
vi: *chain-name* cho mạng thử nghiệm là **casper-test**

source: The *chain-name* for mainnet is **casper**
fr: La valeur de *chain-name* pour mainnet est **casper**.
tr: Mainnet için *chain-name* değeri **casper**dır
vi: *chain-name* cho mạng chính là **casper**

source: ``session-path`` - The path to where the ``delegate.wasm`` is located
fr: ``session-path`` - Le chemin vers l'endroit où se trouve le ``delegate.wasm``.
tr: ``session-path`` - ``delegate.wasm`` dosyasının bulunduğu yol
vi: ``session-path`` - Đường dẫn đến vị trí của ``delegate.wasm``

source: ``session-arg`` - The arguments to the ``delegate`` execution
fr: ``session-arg`` - Les arguments pour l'exécution du ``delegate``
tr: ``session-arg`` - ``delegate`` yürütmesi argümanları
vi: ``session-arg`` - Các đối số để thực thi ``delegate``

source: The argument ``validator`` is the public key of the validator to whom the tokens will be delegated
fr: L'argument ``validator`` est la clé publique du validateur à qui les jetons seront délégués.
tr: ``validator`` argümanı, tokenlerin oylama yetkisinin devredileceği doğrulayıcının genel anahtarıdır
vi: Đối số ``validator`` là khóa công khai của nhà xác thực mà token sẽ được ủy quyền

source: The argument ``amount`` is the number of tokens to be delegated
fr: L'argument ``amount`` est le nombre de jetons à déléguer
tr: ``amount`` argümanı, yetkisi devredilecek tokenlerin sayısıdır
vi: Đối số ``amount`` là số lượng token được ủy quyền

source: The argument ``delegator`` is the public key of the account delegating tokens to a validator
fr: L'argument ``delegator`` est la clé publique du compte qui délègue les jetons d'un validateur.
tr: ``delegator`` argümanı, bir doğrulayıcıya tokenlerin oylama yetkisi devrini gerçekleştiren hesabın genel anahtarıdır
vi: Đối số ``delegator`` là khóa công khai của tài khoản ủy quyền token cho người xác thực

source: **Important response fields:**
fr: **Paramètres importants de la réponse:**
tr: **Önemli yanıt alanları:**
vi: **Các trường phản hồi quan trọng:**

source: ``"result"."deploy_hash"`` - the address of the executed delegation request.
fr: ``"result"."deploy_hash"`` - l'adresse de la requête de délégation qu'on vient d'exécuter.
tr: ``"result"."deploy_hash"`` - yürütülen delegasyon isteğinin adresi.
vi: ``"result"."deploy_hash"`` - địa chỉ của yêu cầu ủy quyền đã thực hiện.

source: Save the returned `deploy_hash` from the output to query information about the delegation deploy later.
fr: Sauvegardez le `deploy_hash` retourné pour demander des informations sur le déploiement de la délégation plus tard.
tr: Daha sonra delegasyon dağıtımıyla ilgili bilgileri sorgulamak için döndürülen `deploy_hash` değerini çıktıdan kaydedin.
vi: Lưu `deploy_hash` trả về từ đầu ra để truy vấn thông tin về triển khai ủy quyền sau này.

source: Refer to the `Deploy Status <querying.html#deploy-status>`_ section to learn how to confirm that your deploy was executed successfully.
fr: Reportez-vous à la section `Statut du déploiement <querying.html#deploy-status>`_ pour savoir comment confirmer que votre déploiement a été exécuté avec succès.
tr: Dağıtımınızın başarıyla yürütüldüğünü nasıl onaylayacağınızı öğrenmek için `Dağıtım Durumu <querying.html#deploy-status>`_ bölümüne bakın.
vi: Tham khảo phần `Trạng thái triển khai <querying.html#deploy-status>`_ để tìm hiểu cách xác nhận rằng triển khai của bạn đã được thực hiện thành công.

source: Confirming the Delegation
fr: Confirmation de la délégation
tr: Delegasyonu Onaylanmak
vi: Xác nhận Uỷ quyền

source: A Casper Network maintains an `auction` where validators `bid` on slots to become part of the active validator set. Delegation rewards are only earned for a validator who has won the auction and is part of the active set. Thus to ensure the delegated tokens can earn rewards, we must first check that:
fr: Un réseau Casper maintient une `enchère` (auction) où les validateurs `enchérissent` (bid) pour faire partie de l'ensemble actif de validateurs. Les récompenses de la délégation ne sont acquises que pour un validateur qui a remporté l'enchère et qui fait partie de cet ensemble actif. Ainsi, pour s'assurer que les jetons délégués peuvent gagner des récompenses, nous devons d'abord vérifier que :
tr: Bir Casper Ağı, doğrulayıcıların etkin doğrulayıcı kümesinin bir parçası olmak amacıyla yuvalara `teklif verdiği` bir `açık arttırma` düzenler. Delegasyon ödülleri, yalnızca açık arttırmayı kazanan ve etkin kümenin bir parçası olan bir doğrulayıcı için kazanılır. Bu nedenle, devredilen tokenlerin ödül kazanabilmesini sağlamak için önce şunları kontrol etmeliyiz:
vi: Mạng Casper duy trì một phiên đấu giá (`auction`) trong đó nhà xác thực đặt giá thầu (`bid`) trên các vị trí để trở thành một phần của nhóm nhà xác thực đang hoạt động. Phần thưởng ủy quyền chỉ kiếm được cho người xác thực đã thắng cuộc đấu giá và là một phần của nhóm hoạt động. Do đó, để đảm bảo các token được ủy quyền có thể kiếm được phần thưởng, trước tiên chúng ta phải kiểm tra rằng:

source: Our delegation is part of the `bid` to the `auction`
fr: Notre délégation fait partie du `bid` de l'enchère `auction`.
tr: Bizim delegasyonumuz `açık arttırma` için `teklif`in bir parçasıdır
vi: Uỷ quyền của chúng ta là một phần của giá thầu (`bid`) cho phiên đấu giá (`aution`)

source: The validator is part of the `active` validator set
fr: Le validateur fait partie de l'ensemble des validateurs `actifs`
tr: Doğrulayıcı `aktif` doğrulayıcı kümesinin bir parçasıdır
vi: Nhà xác thực là một phần của nhóm nhà xác thực hoạt động (`active``)

source: Once the deploy has been executed, we can query the auction for information to confirm our delegation. We can use the Casper command-line client to create an RPC request with the following query:
fr: Une fois le déploiement exécuté, nous pouvons interroger l'enchère (auction) pour obtenir des informations et confirmer notre délégation. Nous pouvons utiliser le client en ligne de commande Casper pour créer une appel RPC avec la requête suivante :
tr: Dağıtım yürütüldükten sonra, delegasyonumuzu onaylamak için açık arttırmayı sorgulayabiliriz. Aşağıdaki sorguyla bir RPC isteği oluşturmak için Casper komut satırı istemcisini kullanabiliriz:
vi: Khi việc triển khai đã được thực hiện, chúng ta có thể truy vấn phiên đấu giá để biết thông tin nhằm xác nhận ủy quyền của chúng ta. Chúng ta có thể sử dụng dòng lệnh trên Casper client để tạo một yêu cầu RPC với truy vấn sau:

source: **Request fields**:
fr: **Paramètres de la requête:**
tr: **Talep alanları**:
vi: **Các trường yêu cầu**:

source: The ``get-auction-info`` call will return all the bids currently in the auction contract and the list of active validators for ``4`` future eras from the present era.
fr: L'appel ``get-auction-info`` renverra toutes les offres actuellement dans le contrat d'enchère et la liste des validateurs actifs pour les ``4`` ères à venir à partir de l'ère actuelle.
tr: ``get-auction-info`` çağrısı, açık arttırma kontratında mevcut tüm teklifleri ve mevcut dönemden ``4`` gelecek dönem için aktif doğrulayıcıların listesini döndürür.
vi: Lệnh gọi ``get-auction-info`` sẽ trả về tất cả các giá thầu hiện có trong hợp đồng đấu giá và danh sách các nhà xác thực đang hoạt động cho kỷ nguyên tương lai ``4`` từ hiện tại.
