Repository: casper-network/docs-archive
Catalog: locale/*/LC_MESSAGES/workflow/index.po
Languages: fr, tr, vi

source: How To's
fr: Guide pratique
tr: Nasıl Yapılır
vi: Hướng dẫn

source: This section contains guides that highlight key features and capabilities of the Casper system.
fr: Cette section contient des guides qui mettent en évidence les principales caractéristiques et capacités du système Casper.
tr: Bu bölüm, Casper sisteminin anahtar özelliklerini ve yeteneklerini öne çıkaran rehberler içerir.
vi: Phần này có các hướng dẫn nêu bật các tính năng và khả năng chính của hệ thống Casper.

source: Title
fr: Titre
tr: Başlık
vi: Tiêu đề

source: Description
tr: Açıklama
vi: Mô tả

source: `Prerequisites <setup.html>`_
fr: `Prérequis <setup.html>`_
tr: `Önkoşullar <setup.html>`_
vi: `Điều kiện cần <setup.html>`_

source: A guide to fulfilling prerequisites needed for various workflows
fr: Un guide pour remplir les prérequis nécessaires à divers workflows
tr: Çeşitli iş akışları için gereken önkoşulları sağlama rehberi
vi: Hướng dẫn để hoàn thành các điều kiện cần thiết cho các luồng công việc khác nhau

source: `Querying the Casper Network <querying.html>`_
fr: `Interroger le réseau Casper <querying.html>`_
tr: `Casper Network'ü Sorgulamak <querying.html>`_
vi: `Truy vấn mạng Casper <querying.html>`_

source: A guide to querying for information on a Casper blockchain
fr: Guide pour la recherche d'informations sur la blockchain Casper
tr: Bir Casper blokzinciri üzerindeki bilgileri sorgulama rehberi
vi: Hướng dẫn truy vấn thông tin trên chuỗi khối Casper

source: `Direct Native Token Transfer <transfer-workflow.html>`_
fr: `Transfert direct de jetons natifs <transfer-workflow.html>`_
tr: `Doğrudan Yerel Token Aktarımı <transfer-workflow.html>`_
vi: `Chuyển token gốc trực tiếp <transfer-workflow.html>`_

source: A guide to performing a direct transfer of CSPR tokens from one account to another
fr: Guide pour effectuer un transfert direct de jetons CSPR d'un compte à un autre
tr: Bir hesaptan diğerine doğrudan CSPR token transferi gerçekleştirme rehberi
vi: Hướng dẫn thực hiện chuyển trực tiếp token CSPR từ tài khoản này sang tài khoản khác

source: `Two-Party Multi-Signatures for Deployment <two-party-multi-sig.html>`_
fr: `Multi-signatures bi-parties pour le déploiement <two-party-multi-sig.html>`_
tr: `Dağıtım için İki-Taraflı Çoklu-İmzalar <two-party-multi-sig.html>`_
vi: `Đa chữ ký song phương để Triển khai <two-party-multi-sig.html>`_

source: A guide to setting up an account for two-party signature deploys
fr: Guide pour la configuration d'un compte pour les déploiements de signature bi-partie
tr: İki-taraflı imza dağıtımları için hesap ayarlama rehberi
vi: Hướng dẫn thiết lập tài khoản triển khai chữ ký song phương

source: `Delegating Tokens <delegate.html>`_
fr: `Délégation de jetons <delegate.html>`_
tr: `Token Delegasyonu <delegate.html>`_
vi: `Uỷ quyền token <delegate.html>`_

source: A guide to delegating tokens to a Validator on a Casper Network
fr: Guide pour la délégation de jetons à un validateur sur le réseau Casper
tr: Casper Network üzerindeki bir Doğrulayıcıya token delegasyonu rehberi
vi: Hướng dẫn ủy quyền token cho Trình xác thực trên Mạng Casper

source: `Un-delegating Tokens <undelegate.html>`_
fr: `Retrait des jetons délégués <undelegate.html>`_
tr: `Token Delegasyonu İptali <undelegate.html>`_
vi: `Huỷ uỷ quyền Tokens <undelegate.html>`_

source: A guide to un-delegating tokens from a Validator on a Casper Network
fr: Un guide pour retirer les jetons délégués à un validateur sur le réseau Casper.
tr: Casper Network üzerindeki bir Doğrulayıcıdaki token delegasyonu iptali rehberi
vi: Hướng dẫn hủy ủy quyền mã thông báo từ Trình xác thực trên Mạng Casper

source: **Table of Contents**
fr: **Table des matières**
tr: **İçindekiler Tablosu**
vi: **Mục lục**
