Repository: casper-network/docs-archive
Catalog: locale/*/LC_MESSAGES/workflow/querying.po
Languages: fr, tr, vi

source: Querying the Network
fr: Interrogation du réseau
tr: Ağı Sorgulamak
vi: Truy vấn mạng

source: The Casper node supports queries for users and developers to obtain information stored on the blockchain.
fr: Le nœud Casper prend en charge les requêtes des utilisateurs et des développeurs pour obtenir des informations stockées sur la blockchain.
tr: Casper düğümü, kullanıcıların ve geliştiricilerin blokzincirde depolanan bilgileri elde etmeleri için sorguları destekler.
vi: Nút Casper hỗ trợ các truy vấn cho người dùng và nhà phát triển để lấy thông tin được lưu trữ trên chuỗi khối.

source: This document assumes:
fr: Ce document suppose :
tr: Bu belge şunları varsaymaktadır:
vi: Tài liệu này giả định:

source: You have met the `prerequisites <setup.html>`_
fr: Vous remplissez les `pré-requis <setup.html>`_
tr: `Önkoşulları <setup.html>`_ karşıladınız
vi: Bạn đáp ứng các `điều kiện cần <setup.html>`_

source: You are familiar with the structure of the `Global State and the Blockchain Design <https://docs.casperlabs.io/en/latest/implementation/index.html>`_ to query data from the network
fr: Vous connaissez la structure de `l'Etat Global et la Conception de la Blockchain <https://docs.casperlabs.io/fr/latest/implementation/index.html>`_ pour interroger les données du réseau.
tr: Ağdan veri sorgulamak için `Küresel Durum ve Blokzincir Tasarımının <https://docs.casperlabs.io/en/latest/implementation/index.html>`_ yapısına aşinasınız.
vi: Bạn đã quen thuộc với cấu trúc của `Ngữ cảnh toàn cục và Thiết kế chuỗi khối <https://docs.casperlabs.io/en/latest/implementation/index.html>`_ để truy vấn dữ liệu từ mạng

source: When sending a query, it is important to note that the request will be routed to a single node in the network. You can request several types of data from a node:
fr: Lorsque vous envoyez une requête, il est important de noter que celle-ci sera acheminée vers un seul nœud du réseau. Vous pouvez demander plusieurs types de données à un nœud :
tr: Bir sorgu gönderirken, isteğin ağdaki tek bir düğüme yönlendirileceğini unutmamak önemlidir. Bir düğümden birkaç tür veri talep edebilirsiniz:
vi: Khi gửi một truy vấn, điều quan trọng cần lưu ý là yêu cầu sẽ được chuyển đến một nút duy nhất trong mạng. Bạn có thể yêu cầu một số loại dữ liệu từ một nút:

source: Account details
fr: Détails du compte
tr: Hesap detayları
vi: Chi tiết tài khoản

source: Block information
fr: Informations sur les blocs
tr: Blok bilgileri
vi: Thông tin khối

source: Deploy information
fr: Informations sur les déploiements
tr: Dağıtım bilgileri
vi: Thông tin triển khai

source: Obtaining the Global State Root Hash
fr: Obtention du 'Global State Root Hash'
tr: Küresel Durum Kök Özetini (Hash) Elde Etmek
vi: Lấy Global State Root Hash

source: Since the system state changes with each block created, obtaining the latest global state hash is essential before querying information from a node.
fr: Comme l'état du système change avec chaque bloc créé, il est essentiel d'obtenir le dernier hash de l'état global (Global State Root Hash) avant de demander des informations à un nœud.
tr: Oluşturulan her blok ile sistem durumu değiştiği için, bir düğümden bilgi sorgulamadan önce en son global durum özetini (hash) elde etmek önemlidir.
vi: Vì trạng thái hệ thống thay đổi với mỗi khối được tạo ra nên việc lấy mã băm trạng thái toàn cục mới nhất là điều cần thiết trước khi truy vấn thông tin từ một nút.

source: All queries made to global state require the ``state-root-hash``, which you can obtain with this command:
fr: Toutes les requêtes faites sur l'état global (global state) nécessitent le ``state-root-hash``, que vous pouvez obtenir avec cette commande :
tr: Küresel duruma yapılan tüm sorgular, bu komutla elde edebileceğiniz ``state-root-hash`` gerektirir:
vi: Tất cả các truy vấn được thực hiện cho trạng thái toàn cục yêu cầu `state-root-hash``, bạn có thể nhận được bằng lệnh này:

source: **Request fields:**
fr: **Paramètres de la requête:**
tr: **Talep alanları:**
vi: **Các trường yêu cầu:**

source: ``id`` - <STRING OR INTEGER> Optional JSON-RPC identifier applied to the request and returned in the response. If not provided, a random integer will be assigned
fr: ``id`` - <STRING OR INTEGER> Identifiant JSON-RPC facultatif appliqué à la requête et renvoyé dans la réponse. S'il n'est pas fourni, un nombre entier aléatoire sera attribué.
tr: ``id`` - <STRING OR INTEGER> İsteğe uygulanan ve yanıtta döndürülen isteğe bağlı JSON-RPC tanımlayıcısı. Sağlanmazsa, rastgele bir tam sayı atanır
vi: ``id`` - <STRING OR INTEGER> Định danh tuỳ chọn JSON-RPC được áp dụng cho yêu cầu và được trả lại trong phản hồi. Nếu không được cung cấp, một số nguyên ngẫu nhiên sẽ được chỉ định

source: ``node-address`` - <HOST:PORT> Hostname or IP and port of node on which HTTP service is running [default:http://localhost:7777]
fr: ``node-address`` - <HOST:PORT> Hostname ou IP et port du nœud sur lequel le service HTTP tourne [default:http://localhost:7777]
tr: ``node-address`` - <HOST:PORT> Ana makine adı veya IP ve HTTP hizmetinin çalıştığı düğümün bağlantı noktası [varsayılan:http://localhost:7777]
vi: ``node-address`` - <HOST:PORT> Tên máy chủ hoặc IP và cổng của nút mà dịch vụ HTTP đang chạy [default:http://localhost:7777]

source: **JSON-RPC Request**:
tr: **JSON-RPC İsteği**:
vi: **Yêu cầu JSON-RPC**:

source: **JSON-RPC Response**:
tr: **JSON-RPC Cevabı**:
vi: **Phản hồi JSON-RPC**:

source: Querying an Account
fr: Interroger un Compte
tr: Hesap Sorgulamak
vi: Truy vấn tài khoản

source: `Accounts <https://docs.casperlabs.io/en/latest/implementation/accounts.html>`_ are stored in the global state and can be queried using the ``query-state`` command:
fr: `Les comptes <https://docs.casperlabs.io/fr/latest/implementation/accounts.html>`_ sont stockés dans l'état global et peuvent être interrogés à l'aide de la commande ``query-state`` :
tr: `Hesaplar <https://docs.casperlabs.io/en/latest/implementation/accounts.html>`_ küresel durumda saklanır ve ``query-state`` komutu kullanılarak sorgulanabilir:
vi: `Tài khoản <https://docs.casperlabs.io/en/latest/implementation/accounts.html>`_ được lưu trữ ở trạng thái toàn cục và có thể được truy vấn bằng lệnh ``query-state``:

source: ``state-root-hash`` - <HEX STRING> Hex-encoded hash of the state root
fr: ``state-root-hash`` - <HEX STRING> Hash codé en hexadécimal de la racine de l'état.
tr: ``state-root-hash`` - <HEX STRING> Durum kökünün hex kodlu özeti (hash)
vi: ``state-root-hash`` - <HEX STRING> Hàm băm mã hóa hex của trạng thái gốc

source: ``key`` - <FORMATTED STRING or PATH> The base key for the query. This must be a properly formatted public key, account hash, contract address hash, URef, transfer hash or deploy-info hash.
fr: ``key`` - <FORMATTED STRING or PATH> La clé de base pour la requête. Il doit s'agir d'une clé publique correctement formatée, d'un hash de compte, d'un hash d'adresse de contrat, d'un URef, d'un hash de transfert ou d'un hash de deploy-info.
tr: ``key`` - <FORMATTED STRING or PATH> Sorgu için temel anahtar. Bu, uygun şekilde biçimlendirilmiş bir genel anahtar, hesap özeti (hash), kontrat adresi özeti (hash), URef, aktarım özeti (hash) veya dağıtım bilgisi özeti (hash) olmalıdır.
vi: ``key`` - <FORMATTED STRING or PATH> Khóa cơ sở cho truy vấn. Đây phải là khóa công khai được định dạng đúng, băm tài khoản, băm địa chỉ hợp đồng, URef, băm chuyển hoặc băm thông tin triển khai.

source: **Important response fields:**
fr: **Paramètres importants de la réponse:**
tr: **Önemli yanıt alanları:**
vi: **Các trường phản hồi quan trọng:**

source: ``"result"."stored_value"."Account"."main_purse"`` - the address of the main purse containing the sender’s tokens. This purse is the source of the tokens transferred in this example
fr: ``"result"."stored_value"."Account"."main_purse"`` - l'adresse du porte-monnaie principal contenant les jetons de l'expéditeur. Ce porte-monnaie est la source des jetons transférés dans cet exemple.
tr: ``"result"."stored_value"."Account"."main_purse"`` - gönderenin tokenlerini içeren ana cüzdanın adresi. Bu cüzdan, bu örnekte aktarılan tokenlerin kaynağıdır.
vi: ``"result"."stored_value"."Account"."main_purse"`` - địa chỉ của ví chính chứa token của người gửi. Ví này là nguồn của các token được chuyển trong ví dụ này

source: You can use the URef of the ``main_purse`` to query the account balance. The balance returned is in motes (the unit that makes up the Casper token).
fr: Vous pouvez utiliser l'URef du ``main_purse`` (porte-monnaie principal) pour demander le solde du compte. Le solde retourné est en motes.
tr: Hesap bakiyesini sorgulamak için ``main_purse`` URef'ini kullanabilirsiniz. Döndürülen bakiye, mote cinsindendir (Casper tokenini oluşturan birim).
vi: Bạn có thể sử dụng URef của ``main_purse`` để truy vấn số dư tài khoản. Số dư được trả lại tính bằng motes (đơn vị tạo nên token Casper).

source: ``purse-uref`` - <FORMATTED STRING> The URef under which the purse is stored. This must be a properly formatted URef "uref-<HEX STRING>-<THREE DIGIT INTEGER>"
fr: ``purse-uref`` - <FORMATTED STRING> L'URef sous lequel le porte-monnaie est stocké. Il doit s'agir d'un URef correctement formaté "uref-<HEX STRING>-<THREE DIGIT INTEGER>"
tr: ``purse-uref`` - <FORMATTED STRING> Cüzdanın altında saklandığı URef. Bu, düzgün biçimlendirilmiş bir URef "uref-<HEX STRING>-<THREE DIGIT INTEGER>" olmalıdır
vi: ``purse-uref`` - <FORMATTED STRING> URef mà theo đó ví được lưu trữ. Đây phải là URef được định dạng đúng "uref-<HEX STRING>-<THREE DIGIT INTEGER>"

source: Querying Blocks
fr: Interrogation des blocs
tr: Blokları Sorgulamak
vi: Truy vấn khối

source: It is possible to obtain detailed block information from the system. To do this, obtain the hash of the block of interest and send this query to a node in the network. Here is an example:
fr: Il est possible d'obtenir du système des informations détaillées sur les blocs. Pour ce faire, il faut obtenir le hash du bloc qui nous intéresse et envoyer cette requête à un nœud du réseau. Voici un exemple :
tr: Sistemden detaylı blok bilgisi almak mümkündür. Bunu yapmak için, ilgilenilen blokun özetini (hash) alın ve bu sorguyu ağdaki bir düğüme gönderin. İşte bir örnek:
vi: Có thể lấy thông tin khối chi tiết từ hệ thống. Để thực hiện việc này, hãy lấy mã băm của khối quan bạn tâm và gửi truy vấn này đến một nút trong mạng. Đây là một ví dụ:

source: ``node-address`` <HOST:PORT> Hostname or IP and port of node on which HTTP service is running [default:http://localhost:7777]
fr: ``node-address`` - <HOST:PORT> Hostname ou IP et port du nœud sur lequel le service HTTP tourne [default:http://localhost:7777]
tr: ``node-address`` <HOST:PORT> Ana makine adı veya IP ve HTTP hizmetinin çalıştığı düğümün bağlantı noktası [varsayılan:http://localhost:7777]
vi: ``node-address`` <HOST:PORT> Tên máy chủ hoặc IP và cổng của nút mà dịch vụ HTTP đang chạy [default:http://localhost:7777]

source: ``block-identifier`` - <HEX STRING OR INTEGER> Hex-encoded block hash or height of the block. If not given, the last block added to the chain as known at the given node will be used
fr: ``block-identifier`` - <HEX STRING OR INTEGER> Hash de bloc codé en hexadécimal ou hauteur du bloc. S'il n'est pas donné, le dernier bloc ajouté à la chaîne tel que connu au nœud donné sera utilisé.
tr: ``block-identifier`` - <HEX STRING OR INTEGER> Hex kodlu blok özeti (hash) veya bloğun yüksekliği. Verilmezse, verilen düğümde bilinen zincire eklenen son blok kullanılacaktır.
vi: ``block-identifier`` - <HEX STRING OR INTEGER> Băm khối được mã hóa hex hoặc chiều cao của khối. Nếu không được cung cấp, sẽ sử dụng khối cuối cùng được thêm vào chuỗi như đã biết tại nút

source: ``"result"."block"."header"."state_root_hash"`` - contains the ``state-root-hash`` for this block
fr: ``"result"."block"."header"."state_root_hash"`` - contient le ``state-root-hash`` pour ce bloc
tr: ``"result"."block"."header"."state_root_hash"`` - bu blok için ``state-root-hash``ı içerir
vi: ``"result"."block"."header"."state_root_hash"`` - chứa ``state-root-hash`` cho khối này

source: Querying Deploys
fr: Interrogation des déploiements
tr: Dağıtımları Sorgulamak
vi: Truy vấn triển khai

source: Once you submit a deploy to the network, you can check its execution status using ``get-deploy``. If the ``execution_results`` in the output are null, the transaction has not run yet. Note that transactions are finalized upon execution.
fr: Une fois que vous avez soumis un déploiement au réseau, vous pouvez vérifier son état d'exécution en utilisant ``get-deploy``. Si les ``execution_results`` dans la sortie sont 'null', la transaction n'a pas encore été exécutée. Notez que les transactions sont finalisées lors de leur exécution.
tr: Ağa bir dağıtım gönderdikten sonra, ``get-deploy`` kullanarak yürütme durumunu kontrol edebilirsiniz. Çıktıdaki ``execution_results`` boşsa, işlem henüz çalışmamıştır. İşlemlerin yürütüldükten sonra sonlandırıldığını unutmayın.
vi: Khi bạn gửi một triển khai đến mạng, bạn có thể kiểm tra trạng thái thực thi của nó bằng cách sử dụng ``get-deploy``. Nếu ``execution_results`` trong đầu ra là rỗng, thì giao dịch vẫn chưa chạy. Lưu ý rằng các giao dịch được hoàn tất khi thực hiện.

source: ``id`` - <STRING OR INTEGER> JSON-RPC identifier, applied to the request and returned in the response. If not provided, a random integer will be assigned
fr: ``id`` - <STRING OR INTEGER> Identifiant JSON-RPC facultatif appliqué à la requête et renvoyé dans la réponse. S'il n'est pas fourni, un nombre entier aléatoire sera attribué.
tr: ``id`` - <STRING OR INTEGER> İsteğe uygulanan ve yanıtta döndürülen JSON-RPC tanımlayıcısı. Sağlanmazsa, rastgele bir tam sayı atanır
vi: ``id`` - <STRING OR INTEGER> Định danh JSON-RPC, được dùng khi yêu cầu và được phản hồi trả lại. Nếu không được cung cấp, một số nguyên ngẫu nhiên sẽ được chỉ định

source: ``node-address`` - <HOST:PORT>Hostname or IP and port of node on which HTTP service is running [default:http://localhost:7777]
fr: ``node-address`` - <HOST:PORT> Hostname ou IP et port du nœud sur lequel le service HTTP tourne [default:http://localhost:7777]
tr: ``node-address`` - <HOST:PORT> Ana makine adı veya IP ve HTTP hizmetinin çalıştığı düğümün bağlantı noktası [varsayılan:http://localhost:7777]
vi: ``node-address`` - <HOST:PORT>Tên máy chủ hoặc IP và cổng của nút mà dịch vụ HTTP đang chạy [default:http://localhost:7777]

source: ``deploy-hash`` - <HEX STRING OR INTEGER> Hex-encoded hash of the deploy
fr: ``deploy-hash`` - <HEX STRING OR INTEGER> Hash codé en hexadécimal du déploiement
tr: ``deploy-hash`` - <HEX STRING OR INTEGER> Dağıtımın onaltılı kodlu özet (hash) değeri
vi: ``deploy-hash`` - <HEX STRING OR INTEGER> Băm mã hóa hex của triển khai
