Repository: casper-network/docs-archive
Catalog: locale/*/LC_MESSAGES/workflow/setup.po
Languages: fr, tr, vi

source: Prerequisites
fr: Prérequis
tr: Önkoşullar
vi: Điều kiện cần

source: This section explains how to fulfill the prerequisites needed to interact with a Casper Network.
fr: Cette section explique comment remplir les conditions préalables nécessaires pour interagir avec un réseau Casper.
tr: Bu bölüm, Casper Network ile etkileşim kurmak için gereken ön koşulların nasıl yerine getirileceğini açıklar.
vi: Phần này giải thích cách đáp ứng các điều kiện cần thiết để tương tác với Mạng Casper.

source: This section covers:
fr: Cette section couvre
tr: Bu bölüm şunları kapsar:
vi: Phần này bao gồm:

source: Installing the official Casper command-line client
fr: Installation du client officiel en ligne de commande de Casper
tr: Resmi Casper komut satırı istemcisini yüklemek
vi: Cài đặt chính thức dòng lệnh Casper client

source: Setting up an account on a Casper Network
fr: Création d'un compte sur un réseau Casper
tr: Casper Network'te hesap oluşturmak
vi: Thiết lập tài khoản trên Mạng Casper

source: Acquiring the IP address of a peer on the official Testnet or Mainnet
fr: Obtention de l'adresse IP d'un pair sur le Testnet ou Mainnet
tr: Resmi Testnet veya Mainnet'te bir eşin IP adresini edinmek
vi: Nhận địa chỉ IP của một máy ngang hàng trên Testnet hoặc Mainnet chính thức

source: The Casper command-line client
fr: Le client en ligne de commande (CLI) Casper
tr: Casper komut satırı istemcisi
vi: Dòng lệnh của Casper client

source: You can find the client on `crates.io <https://crates.io/crates/casper-client>`_.
fr: Vous pouvez trouver le client sur `crates.io <https://crates.io/crates/casper-client>`_.
tr: İstemciyi `crates.io <https://crates.io/crates/casper-client>`_ adresinde bulabilirsiniz.
vi: Bạn có thể tìm thấy client trên `crates.io <https://crates.io/crates/casper-client>`_.

source: Run the commands below to install the Casper client on most flavors of Linux and macOS. You will need the nightly version of the compiler.
fr: Exécutez les commandes ci-dessous pour installer le client Casper sur la plupart des versions de Linux et macOS. Vous aurez besoin de la version 'nightly' du compilateur
tr: Casper istemcisini Linux ve macOS'un çoğu çeşidine kurmak için aşağıdaki komutları çalıştırın. Derleyicinin gece sürümüne ihtiyacınız olacak.
vi: Chạy các lệnh bên dưới để cài đặt Casper client trên hầu hết các phiên bản Linux và macOS. Bạn sẽ cần phiên bản nightly của trình biên dịch.

source: The Casper client can print out `help` information, which provides an up-to-date list of supported commands.
fr: Le client Casper peut fournir des informations d'aide (`help`), qui fournissent une liste à jour des commandes prises en charge.
tr: Casper istemcisi, desteklenen komutların güncel bir listesini sağlayan `help` bilgilerini yazdırabilir.
vi: Casper client có thể đưa ra `help`, cung cấp danh sách cập nhật các lệnh được hỗ trợ.

source: **Important**: For each command, you can use `help` to get the up-to-date arguments and descriptions:
fr: **Important** : Pour chaque commande, vous pouvez utiliser `help` pour obtenir les arguments et des descriptions à jour :
tr: **Önemli**: Her komut için, güncel argümanları ve açıklamaları almak için `help`i kullanabilirsiniz:
vi: **Quan trọng**: Đối với mỗi lệnh, bạn có thể sử dụng `help` để nhận các đối số và mô tả cập nhật:

source: Setting up an Account
fr: Création d'un compte
tr: Hesap Oluşturmak
vi: Thiết lập Tài khoản

source: The process of creating an `Account <https://docs.casperlabs.io/en/latest/implementation/accounts.html>`_ can be divided into two steps:
fr: Le processus de création d'un `Compte <https://docs.casperlabs.io/fr/latest/implementation/accounts.html>`_ peut être divisé en deux étapes :
tr: `Hesap <https://docs.casperlabs.io/en/latest/implementation/accounts.html>`_ oluşturma süreci iki adıma ayrılabilir:
vi: Quá trình tạo `Tài khoản <https://docs.casperlabs.io/en/latest/implementation/accounts.html>`_ có thể được chia thành hai bước:

source: Cryptographic key generation for the account
fr: Génération de la clé cryptographique pour le compte
tr: Hesap için şifreleme anahtarı oluşturma
vi: Tạo khóa mật mã cho tài khoản

source: Funding the account
fr: Approvisionnement du compte
tr: Hesabı finanse etmek
vi: Nạp tiền vào tài khoản

source: The Casper blockchain uses an on-chain account-based model, uniquely identified by an ``AccountHash`` derived from a specific ``PublicKey``.
fr: La blockchain Casper utilise un modèle basé sur les comptes on-chain, identifiés de manière unique par un ``AccountHash`` dérivé d'une `PublicKey`` spécifique.
tr: Casper blokzinciri, belirli bir ``PublicKey``den türetilen ``AccountHash`` ile benzersiz bir şekilde tanımlanan zincir içi hesap tabanlı bir model kullanır.
vi: Chuỗi khối Casper sử dụng mô hình dựa trên tài khoản trên chuỗi, được xác định duy nhất bởi một ``AccountHash`` bắt nguồn từ một ``PublicKey`` cụ thể.

source: By default, a transactional interaction with the blockchain takes the form of a ``Deploy`` cryptographically signed by the key-pair corresponding to the ``PublicKey`` used to create the account.
fr: Par défaut, une interaction transactionnelle avec la blockchain prend la forme d'un ``Deploy`` signé cryptographiquement par la paire de clés correspondant à la ``PublicKey`` utilisée pour créer le compte.
tr: Varsayılan olarak, blokzincir ile bir işlem etkileşimi, hesabı oluşturmak için kullanılan ``PublicKey``e karşılık gelen anahtar çifti tarafından kriptografik olarak imzalanmış bir ``Dağıtım`` şeklini alır.
vi: Theo mặc định, một tương tác giao dịch với chuỗi khối có dạng ``Deploy`` được ký mã bằng cặp khóa tương ứng với ``PublicKey``, sẽ được sử dụng để tạo tài khoản.

source: Accounts can be created using the Casper command-line client. Alternatively, some Casper networks such as the official Testnet and Mainnet provide a browser-based block explorer that allows account creation.
fr: Casper. Par ailleurs, certains réseaux Casper, tels que les réseaux officiels Testnet et Mainnet, proposent un explorateur de blocs basé sur un navigateur qui permet de créer des comptes.
tr: Hesaplar, Casper komut satırı istemcisi kullanılarak oluşturulabilir. Alternatif olarak, resmi Testnet ve Mainnet gibi bazı Casper ağları, hesap oluşturmaya izin veren tarayıcı tabanlı bir blok gezgini sunar.
vi: Có thể tạo tài khoản bằng dòng lệnh trên Casper client. Ngoài ra, một số mạng Casper như Testnet chính thức và Mainnet cung cấp trình khám phá khối dựa trên trình duyệt cho phép tạo tài khoản.

source: A cryptographic key-pair will be created when using either the Casper command-line client or a block explorer to create an account on the blockchain. This process generates three files for each account:
fr: Une paire de clés cryptographiques sera créée lorsque vous utiliserez le client en ligne de commande Casper ou un explorateur de blocs pour créer un compte sur la blockchain. Ce processus génère trois fichiers pour chaque compte :
tr: Blokzincirde bir hesap oluşturmak için Casper komut satırı istemcisi veya bir blok gezgini kullanıldığında bir kriptografik anahtar çifti oluşturulacaktır. Bu işlem, her hesap için üç dosya oluşturur:
vi: Một cặp khóa mật mã sẽ được tạo khi sử dụng dòng lệnh trên Casper client hoặc trình khám phá khối để tạo tài khoản trên chuỗi khối. Quá trình này tạo ba tệp cho mỗi tài khoản:

source: A PEM encoded secret key
fr: Une clé secrète encodée au format PEM
tr: PEM kodlu bir gizli anahtar
vi: Khóa bí mật được mã hóa PEM

source: A PEM encoded public key
fr: Une clé publique encodée au format PEM
tr: PEM kodlu bir açık anahtar
vi: Khóa công khai được mã hóa PEM

source: A hexadecimal-encoded string representation of the public key
fr: Une représentation de la clé publique sous forme de chaîne codée en hexadécimal.
tr: Açık anahtarın onaltılık olarak kodlanmış halini temsil eden bir dizge
vi: Biểu diễn chuỗi được mã hóa hexadecimal của khóa công khai

source: We recommend saving these files securely.
fr: Nous vous recommandons de sauvegarder ces fichiers en toute sécurité.
tr: Bu dosyaları güvenli bir şekilde kaydetmenizi öneririz.
vi: Chúng tôi khuyên bạn nên lưu các tệp này một cách an toàn.

source: The command-line client provides a command that will give you the account hash for a given public key.
fr: Le client en ligne de commande fournit une commande qui vous donnera le hash du compte pour une clé publique donnée.
tr: Komut satırı istemcisi, size belirli bir açık anahtar için hesap özetini verecek bir komut sağlar.
vi: Dòng lệnh trên client cung cấp một lệnh sẽ cho bạn hàm băm tài khoản của một khóa công khai nhất định.

source: Option 1: Key generation using the Casper client
fr: Option 1 : Génération de clés à l'aide du client Casper
tr: Seçenek 1: Casper istemcisini kullanarak anahtar oluşturma
vi: Tùy chọn 1: Tạo khóa bằng Casper client

source: This option describes how you can use the Casper command-line client to set up your accounts.
fr: Cette option décrit comment vous pouvez utiliser le client en ligne de commande Casper pour configurer vos comptes.
tr: Bu seçenek, hesaplarınızı ayarlamak için Casper komut satırı istemcisini nasıl kullanabileceğinizi açıklar.
vi: Tùy chọn này mô tả cách bạn có thể sử dòng lệnh trên Casper client để thiết lập tài khoản của mình.

source: Execute the following command to generate your keys:
fr: Exécutez la commande suivante pour générer vos clés :
tr: Anahtarlarınızı oluşturmak için aşağıdaki komutu çalıştırın:
vi: Thực thi lệnh sau để tạo khóa của bạn:

source: The above command will create three files in the current working directory:
fr: La commande ci-dessus va créer trois fichiers dans le répertoire de travail actuel :
tr: Yukarıdaki komut, geçerli çalışma dizininde üç dosya oluşturacaktır:
vi: Lệnh trên sẽ tạo ba tệp trong thư mục làm việc hiện tại:

source: ``secret_key.pem`` - PEM encoded secret key
fr: ``secret_key.pem`` - Clé secrète encodée au format PEM
tr: ``secret_key.pem`` - PEM kodlu gizli anahtar
vi: ``secret_key.pem`` - Khóa bí mật được mã hóa PEM

source: ``public_key.pem`` - PEM encoded public key
fr: ``public_key.pem`` - Clé publique encodée au format PEM
tr: ``public_key.pem`` - PEM kodlu açık anahtar
vi: ``public_key.pem`` - Khóa công khai được mã hóa PEM

source: ``public_key_hex`` - Hexadecimal-encoded string of the public key
fr: ``public_key_hex`` - Chaîne codée en hexadécimal de la clé publique
tr: ``public_key_hex`` - Açık anahtarın onaltılık olarak kodlanmış dizgesi
vi: ``public_key_hex`` - Chuỗi mã hóa Hexadecimal của khóa công khai

source: **Note**: SAVE your keys to a safe place, preferably offline.
fr: **Note** : SAUVEGARDEZ vos clés dans un endroit sûr, de préférence hors ligne.
tr: **Not**: Anahtarlarınızı tercihen çevrimdışı olmak üzere güvenli bir yere SAKLAYIN.
vi: **Lưu ý**: LƯU chìa khóa của bạn vào một nơi an toàn, tốt nhất là ngoại tuyến.

source: Once the keys for the account have been generated, the accounts can be funded to finish the process of creating an account.
fr: Une fois que les clés du compte ont été générées, les comptes peuvent être approvisionnés pour terminer le processus de création d'un compte.
tr: Hesabın anahtarları oluşturulduktan sonra, hesap oluşturma sürecini tamamlamak için hesaplara para yatırılabilir.
vi: Khi các khóa cho tài khoản đã được tạo ra, các tài khoản có thể được nạp tiền để kết thúc quá trình tạo tài khoản.

source: **Note**: Responses from the node contain ``AccountHashes`` instead of the direct hexadecimal-encoded public key. For traceability, it is important to generate the account hash and store this value locally. The account hash is a ``Blake2B`` hash of the public hexadecimal-encoded string.
fr: **Note** : Les réponses du nœud contiennent des ``AccountHashes`` au lieu de la clé publique directe codée en hexadécimal. Pour la traçabilité, il est important de générer le hash du compte et de stocker cette valeur localement. Le hash du compte est un hash ``Blake2B`` de la chaîne publique encodée en hexadécimal.
tr: **Not**: Düğümden gelen yanıtlar, doğrudan onaltılık kodlu açık anahtar yerine ``AccountHashes`` içerir. İzlenebilirlik için hesap özetini (hash) oluşturmak ve bu değeri yerel olarak depolamak önemlidir. Hesap özeti (hash), genel onaltılık kodlu dizgenin "Blake2B" özet (hash) değeridir.
vi: **Lưu ý**: Các phản hồi từ nút chứa ``AccountHashes`` thay vì khóa công khai được mã hóa hệ hexadecimal trực tiếp. Để truy xuất nguồn gốc, điều quan trọng là phải tạo băm tài khoản và lưu trữ giá trị này tại nơi cục bộ. Băm tài khoản là hàm băm ``Blake2B`` của chuỗi được mã hóa hệ hexadecimal công khai.

source: Option 2: Key generation using a Block Explorer
fr: Option 2 : Génération de clés à l'aide d'un Block Explorer
tr: Seçenek 2: Blok Gezgini kullanarak anahtar oluşturma
vi: Tùy chọn 2: Tạo khóa bằng Block Explorer

source: This option is also available on networks that have a block explorer.
fr: Cette option est également disponible sur les réseaux qui disposent d'un explorateur de bloc.
tr: Blok gezgini olan ağlarda bu seçenek de mevcuttur.
vi: Tùy chọn này cũng có sẵn trên các mạng có trình khám phá khối.

source: For instance, on the official Testnet network the `CSPR.live <https://testnet.cspr.live/>`_ block explorer is available, and the following instructions assume you are using it.
fr: Par exemple, sur le réseau officiel Testnet, l'explorateur de blocs `CSPR.live <https://testnet.cspr.live/>`_ est disponible, et les instructions suivantes supposent que vous l'utilisez.
tr: Örneğin, resmi Testnet ağında `CSPR.live <https://testnet.cspr.live/>`_ blok tarayıcısı mevcuttur ve aşağıdaki talimatlar onu kullandığınızı varsayar.
vi: Ví dụ: trên mạng Testnet chính thức có sẵn trình khám phá khối `CSPR.live <https://testnet.cspr.live/>`_ và các hướng dẫn sau giả sử bạn đang sử dụng nó.

source: Start by creating an account using the `Create Account <https://clarity-testnet-old.make.services/#/accounts>`_ link. You will be asked to provide a unique name for your account; this is for your convenience and is not stored on chain.
fr: Commencez par créer un compte en utilisant le lien `Create Account <https://clarity-testnet-old.make.services/#/accounts>`_. Il vous sera demandé de fournir un nom unique pour votre compte ; ceci est pour votre commodité et n'est pas stocké sur la chaîne.
tr: `Hesap Oluştur <https://clarity-testnet-old.make.services/#/accounts>`_ bağlantısını kullanarak bir hesap oluşturarak başlayın. Hesabınız için benzersiz bir ad vermeniz istenecektir; bu size kolaylık sağlamak içindir ve zincirde saklanmaz.

source: You will be prompted to save three files for your new account; carefully choose where you store them. We recommend storing your keys in a secure manner.
fr: Vous serez invité à enregistrer trois fichiers pour votre nouveau compte ; choisissez soigneusement l'endroit où vous les stockez. Nous vous recommandons de les stocker de manière sécurisée.
tr: Yeni hesabınız için üç dosya kaydetmeniz istenecektir; onları nerede saklayacağınızı dikkatlice seçin. Anahtarlarınızı güvenli bir şekilde saklamanızı öneririz.

source: ``<Account-Name>_secret_key.pem`` - PEM encoded secret key
fr: ``<Account-Name>_secret_key.pem`` - Clé secrète encodée au format PEM
tr: ``<Account-Name>_secret_key.pem`` - PEM kodlu gizli anahtar

source: ``<Account-Name>_public_key.pem`` - PEM encoded public key
fr: ``<Account-Name>_public_key.pem`` - Clé publique encodée au format PEM
tr: ``<Account-Name>_public_key.pem`` - PEM kodlu açık anahtar

source: ``<Account-Name>_public_key_hex`` - Hexadecimal-encoded string of the public key
fr: ``<Account-Name>_public_key_hex`` - Chaîne codée en hexadécimal de la clé publique
tr: ``<Account-Name>_public_key_hex`` - Açık anahtarın onaltılık olarak kodlanmış dizgesi

source: Fund your Account
fr: Approvisionnez votre compte
tr: Hesabınıza Para Yatırın
vi: Nạp tiền vào tài khoản của bạn

source: Once the cryptographic key-pair for the account has been generated, the account must be funded so it can be created on chain.
fr: Une fois que la paire de clés cryptographiques du compte a été générée, le compte doit être approvisionné afin qu'il puisse être créé sur la chaîne.
tr: Hesap için kriptografik anahtar çifti üretildikten sonra, zincir üzerinde oluşturulabilmesi için hesabın finanse edilmesi gerekir.
vi: Khi cặp khóa mật mã cho tài khoản đã được tạo, tài khoản phải được nạp tiền để có thể tạo trên chuỗi.

source: In Testnet, you can fund the account by using the *Request tokens* button on the `Faucet Page <https://clarity-testnet-old.make.services/#/faucet>`_ to receive tokens.
fr: Dans Testnet, vous pouvez approvisionner le compte en utilisant le bouton *Demander des jetons* sur la `Page Faucet <https://testnet.cspr.live/tools/faucet>`_ pour recevoir des jetons.
tr: Testnet'te, token almak için `Faucet Sayfasındaki <https://clarity-testnet-old.make.services/#/faucet>`_ *Token iste* düğmesini kullanarak hesaba para yatırabilirsiniz.

source: In Mainnet, a pre-existing account will have to transfer CSPR tokens to finalize the process of setting up an account. The *Source* account needs to transfer CSPR tokens to the hexadecimal-encoded public key of the *Target* account. This transfer will automatically create the *Target* account if it does not exist. Currently, this is the only way an account can be created on Mainnet.
fr: Dans le Mainnet, un compte préexistant devra transférer des jetons CSPR pour finaliser le processus de création d'un compte. Le compte *Source* doit transférer des jetons CSPR vers la clé publique codée en hexadécimal du compte *Cible*. Ce transfert créera automatiquement le compte *Cible* s'il n'existe pas. Actuellement, c'est la seule façon de créer un compte sur Mainnet.
tr: Mainnet'te, bir hesap oluşturma sürecini tamamlamak için önceden var olan bir hesabın CSPR tokeni aktarması gerekecektir. *Kaynak* hesabın, CSPR tokenlerini *Hedef* hesabın onaltılı olarak kodlanmış açık anahtarına aktarması gerekir. Bu transfer, mevcut değilse, *Hedef* hesabı otomatik olarak oluşturacaktır. Şu anda, Mainnet'te bir hesap oluşturulabilmesinin tek yolu budur.
vi: Trong Mainnet, một tài khoản tồn tại từ trước sẽ phải chuyển token CSPR để hoàn tất quá trình thiết lập tài khoản. Tài khoản *Nguồn* cần chuyển token CSPR sang khóa công khai được mã hóa hệ thập lục phân của tài khoản *Đích*. Việc chuyển khoản này sẽ tự động tạo tài khoản *Đích* nếu nó không tồn tại. Hiện tại, đây là cách duy nhất có thể tạo tài khoản trên Mạng chính.

source: Acquire Node Address from network peers
fr: Acquérir l'adresse d'un noeud du réseau.
tr: Ağ eşlerinden Düğüm Adresi alın
vi: Nhận địa chỉ nút từ mạng ngang hàng

source: Clients can interact with a node on the blockchain via requests sent to that node's JSON-RPC endpoint, ``http://<node-ip-address>:7777`` by default.
fr: Les clients peuvent interagir avec un nœud de la blockchain via des requêtes envoyées à l'endpoint JSON-RPC de ce nœud, ``http://<node-ip-address>:7777`` par defaut.
tr: İstemciler, varsayılan olarak bu düğümün JSON-RPC uç noktasına, ``http://<node-ip-address>:7777`` gönderilen istekler aracılığıyla blokzincirdeki bir düğümle etkileşim kurabilir.
vi: Khách hàng có thể tương tác với một nút trên chuỗi khối thông qua các yêu cầu được gửi đến điểm cuối JSON-RPC của nút đó, theo mặc định là ``http://<node-ip-address>:7777``.

source: The node address is the IP of a peer node.
fr: L'adresse du nœud est son adresse IP.
tr: Düğüm adresi, bir eş düğümün IP'sidir.
vi: Địa chỉ nút là IP của một nút ngang hàng.

source: Both the official testnet and Mainnet provide block explorers that provide a list of IP addresses of nodes on their respective networks.
fr: Le testnetet le Mainnet proposent tous deux des explorateurs de blocs qui fournissent une liste des adresses IP des nœuds de leurs réseaux respectifs.
tr: Hem resmi test ağı hem de Mainnet, kendi ağlarındaki düğümlerin IP adreslerinin bir listesini sağlayan blok gezgini sunar.
vi: Cả Mạng thử nghiệm chính thức và Mạng chính thức đều cung cấp trình khám phá khối cung cấp danh sách địa chỉ IP của các nút trên mạng tương ứng của chúng.

source: You can get the ``node-ip-address`` of a node on the network by visiting the following block explorers:
fr: Vous pouvez obtenir le ``node-ip-address`` d'un noeud du réseau en visitant les explorateurs de blocs suivants :
tr: Aşağıdaki blok gezginlerini ziyaret ederek ağdaki bir düğümün ``node-ip-address``ini alabilirsiniz:
vi: Bạn có thể lấy ``node-ip-address`` của một nút trên mạng bằng cách truy cập các trình khám phá khối sau:

source: `Peers <https://testnet.cspr.live/tools/peers>`_ on Testnet
fr: `Peers <https://testnet.cspr.live/tools/peers>`_ sur Testnet
tr: Testnet'te `Eşler <https://testnet.cspr.live/tools/peers>`_
vi: `Nút ngang hàng <https://testnet.cspr.live/tools/peers>`_ trên Mạng thử nghiệm

source: `Peers <https://cspr.live/tools/peers>`_ on Mainnet
fr: `Peers <https://cspr.live/tools/peers>`_ sur Mainnet
tr: Mainnet'te `Eşler <https://cspr.live/tools/peers>`_
vi: `Nút ngang hàng <https://cspr.live/tools/peers>`_ trên Mạng chính

source: You will see a list of peers, and you can select the IP of any peer on the list.
fr: Vous verrez une liste de pairs, et vous pouvez sélectionner l'IP de n'importe quel pair de la liste.
tr: Eşlerin bir listesini göreceksiniz ve listedeki herhangi bir eşin IP'sini seçebilirsiniz.
vi: Bạn sẽ thấy một danh sách các ứng ngang hàng và bạn có thể chọn IP của bất kỳ ứng dụng ngang hàng nào trong danh sách.

source: **Note**: If the selected peer is unresponsive, pick a different peer and try again.
fr: **Note** : Si le pair sélectionné ne répond pas, choisissez en un et réessayez.
tr: **Not**: Seçilen eş yanıt vermiyorsa farklı bir eş seçip tekrar deneyin.
vi: **Lưu ý**: Nếu ứng dụng ngang hàng đã chọn không phản hồi, hãy chọn một ứng dụng ngang hàng khác và thử lại.

source: Doing this, you'll see a warning, which you can ignore for now.
vi: Thực hiện điều này, bạn sẽ thấy một cảnh báo mà bạn có thể bỏ qua ngay bây giờ.

source: Start by creating an account using the `Create Account <https://testnet.cspr.live/create-account>`_ link. You will need to download the keys of your new account by clicking on the ``Download Keys`` button. Note that the account is not stored on chain.
vi: Bắt đầu bằng cách tạo tài khoản bằng liên kết `Tạo tài khoản <https://testnet.cspr.live/create-account>`_. Bạn sẽ cần tải xuống các khóa của tài khoản mới của mình bằng cách nhấp vào nút ``Tải xuống khóa``. Lưu ý rằng tài khoản không được lưu trữ trên chuỗi.

source: You will be prompted to save the following three files for your new account. These are your keys, so we recommend securely storing them:
vi: Bạn sẽ được nhắc lưu ba tệp sau cho tài khoản mới của mình. Đây là các khóa của bạn, vì vậy chúng tôi khuyên bạn nên lưu trữ chúng một cách an toàn:

source: In Testnet, you can fund the account by using the *Request tokens* button on the `Faucet Page <https://testnet.cspr.live/tools/faucet>`_ to receive tokens.
vi: Trong Testnet, bạn có thể nạp tiền vào tài khoản bằng cách sử dụng nút *Yêu cầu mã thông báo* trên `Faucet Page <https://testnet.cspr.live/tools/faucet>`_ để nhận token.
