Repository: casper-network/docs-archive
Catalog: locale/*/LC_MESSAGES/workflow/transfer-workflow.po
Languages: fr, tr, vi

source: Now that we have the source purse address, we can get its balance using the ``get-balance`` command:
fr: Maintenant que nous avons l'adresse du porte-monnaie source, nous pouvons obtenir son solde en utilisant la commande ``get-balance`` :
tr: Artık kaynak cüzdan adresine sahip olduğumuza göre, ``get-balance`` komutunu kullanarak bakiyesini alabiliriz:
vi: Bây giờ chúng ta đã có địa chỉ ví nguồn, chúng ta có thể lấy số dư của nó bằng cách sử dụng lệnh ``get-balance``:

source: ``purse-uref`` - <FORMATTED STRING> The URef under which the purse is stored. This must be a properly formatted URef "uref-<HEX STRING>-<THREE DIGIT INTEGER>"
fr: ``purse-uref`` - <FORMATTED STRING> L'URef sous lequel le porte-monnaie est stocké. Il doit s'agir d'un URef correctement formaté "uref-<HEX STRING>-<THREE DIGIT INTEGER>"
tr: ``purse-uref`` - <FORMATTED STRING> Cüzdanın altında saklandığı URef. Bu, düzgün biçimlendirilmiş bir URef "uref-<HEX STRING>-<THREE DIGIT INTEGER>" olmalıdır
vi: ``purse-uref`` - <FORMATTED STRING> URef mà theo đó ví được lưu trữ. Đây phải là URef được định dạng đúng "uref-<HEX STRING>-<THREE DIGIT INTEGER>"

source: Get Target Account Balance
fr: Obtenir le solde du compte cible
tr: Hedef Hesap Bakiyesini Alın
vi: Lấy số dư Tài khoản đích

source: Similarly, now that we have the address of the target purse, we can get its balance.
fr: De même, maintenant que nous avons l'adresse du porte-monnaie cible, nous pouvons obtenir son solde.
tr: Benzer şekilde artık hedef cüzdanın adresini de aldığımıza göre bakiyesini alabiliriz.
vi: Tương tự, bây giờ chúng ta có địa chỉ của ví đích, chúng ta có thể lấy số dư của nó.

source: Query Transfer Details
fr: Demande de détails sur le transfert
tr: Transfer Detaylarını Sorgulayın
vi: Chi tiết Truy vấn chuyển giao

source: Deploys in a Casper Network can contain multiple transfers. When such a deploy is executed, the information about each individual transfer is written to the global state. Each transfer can be uniquely identified by a hash known as the ``transfer-address``, a formatted string with a ``transfer-`` prefix.
fr: Les déploiements dans un réseau Casper peuvent contenir plusieurs transferts. Lorsqu'un tel déploiement est exécuté, les informations relatives à chaque transfert individuel sont écrites dans l'état global. Chaque transfert peut être identifié de manière unique par un hash appelé ``transfer-address``, une chaîne formatée avec un préfixe ``transfer-``.
tr: Casper Network'teki dağıtımlar birden fazla transfer içerebilir. Böyle bir dağıtım yürütüldüğünde, her bir transferle ilgili bilgi küresel duruma yazılır. Her aktarım, ``transfer-address`` olarak bilinen, ``transfer-`` öneki ile biçimlendirilmiş bir dizge olarak tanınabilen bir özet (hash) ile benzersiz bir şekilde tanımlanabilir.
vi: Triển khai trong Mạng Casper có thể chứa nhiều lần chuyển giao. Khi một triển khai như vậy được thực thi, thông tin về mỗi chuyển giao riêng lẻ được ghi vào trạng thái toàn cục. Mỗi lần chuyển có thể được xác định duy nhất bằng một hàm băm được gọi là ``transfer-address``, một chuỗi được định dạng với tiền tố ``transfer-``.

source: We will use the ``transfer-<address>`` to query more details about the transfer.
fr: Nous utiliserons le ``transfer-<address>`` pour demander plus de détails sur le transfert.
tr: Transfer hakkında daha fazla ayrıntı sorgulamak için ``transfer-<address>`` kullanacağız.
vi: Chúng ta sẽ sử dụng ``transfer-<address>`` để truy vấn chi tiết hơn về chuyển giao.

source: ``key`` - <FORMATTED STRING or PATH> The base key for the query. This must be a properly formatted transfer address; "transfer-<address>"
fr: ``key`` - <FORMATTED STRING or PATH> La clé de base pour la requête. Il doit s'agir d'une adresse de transfert correctement formatée ; "transfer-<address>"
tr: ``key`` - <FORMATTED STRING or PATH> Sorgu için temel anahtardır. Bu, düzgün biçimlendirilmiş bir transfer adresi olmalıdır; "transfer-<address>"
vi: ``key`` - <FORMATTED STRING or PATH> Khóa cơ sở cho truy vấn. Đây phải là một địa chỉ chuyển được định dạng đúng; "transfer-<address>"

source: The query responds with more information about the transfer we conducted: its deploy hash, the account which executed the transfer, the source, and target purses, and the target account. Using this additional information, we can verify that our transfer was executed successfully.
fr: La requête répond avec plus d'informations sur le transfert que nous avons effectué : son hash de déploiement, le compte qui a exécuté le transfert, les porte-monnaie source et cible, et le compte cible. Grâce à ces informations supplémentaires, nous pouvons vérifier que notre transfert a été exécuté avec succès.
tr: Sorgu, gerçekleştirdiğimiz transfer hakkında daha fazla bilgi ile yanıt verir: dağıtım özeti (hash), aktarımı gerçekleştiren hesap, kaynak ve hedef cüzdanlar ve hedef hesap. Bu ek bilgiyi kullanarak transferimizin başarıyla yürütüldüğünü doğrulayabiliriz.
vi: Truy vấn phản hồi với nhiều thông tin hơn về quá trình chuyển mà chúng tôi đã tiến hành: băm triển khai của nó, tài khoản thực hiện chuyển, ví nguồn và đích cũng như tài khoản đích. Sử dụng thông tin bổ sung này, chúng tôi có thể xác minh rằng quá trình chuyển của chúng tôi đã được thực hiện thành công.
