Repository: casper-network/docs-archive
Catalog: locale/*/LC_MESSAGES/workflow/transfer-workflow.po
Languages: fr, tr, vi

source: Direct Token Transfer
fr: Transfert direct de jetons
tr: Doğrudan Token Aktarımı
vi: Chuyển Token Trực tiếp

source: This workflow describes how to use the Casper command-line client to transfer tokens between accounts on a Casper Network.
fr: Ce workflow décrit comment utiliser le client en ligne de commande Casper pour transférer des jetons entre des comptes sur un réseau Casper.
tr: Bu iş akışı, Casper Network'teki hesaplar arasında tokenleri aktarmak için Casper komut satırı istemcisinin nasıl kullanılacağını açıklar.
vi: Quy trình làm việc này mô tả cách sử dụng dòng lệnh trên Casper client để chuyển token giữa các tài khoản trên Mạng Casper.

source: This workflow assumes:
fr: Ce workflow suppose :
tr: Bu iş akışı şunları varsayar:
vi: Luồng công việc giả định:

source: You meet the `prerequisites <setup.html>`_
fr: Vous remplissez les `pré-requis <setup.html>`_
tr: `Önkoşulları <setup.html>`_ karşılıyorsunuz
vi: Bạn đáp ứng các `điều kiện tiên quyết <setup.html>`_

source: You are using the Casper command-line client
fr: Vous utilisez le client en ligne de commande Casper
tr: Casper komut satırı istemcisini kullanıyorsunuz
vi: Bạn sử dụng dòng lệnh trên Casper client

source: You have a source ``PublicKey`` hex and a target ``PublicKey`` hex
fr: Vous avez un hex de la "PublicKey" source et un hex de la "PublicKey" cible.
tr: "PublicKey" onaltılı kaynağınız ve "PublicKey" onaltılı hedefiniz var
vi: Bạn có một nguồn ``PublicKey`` hex và ``PublicKey`` hex đích

source: You have a valid ``node-address``
fr: Vous avez une ``node-address`` valide.
tr: Geçerli bir ``node-address``iniz var
vi: Bạn có một ``node-address`` hợp lệ

source: You must be able to sign a deploy for the source account
fr: Vous devez être en mesure de signer un déploiement pour le compte source.
tr: Kaynak hesap için bir dağıtım imzalayabilmeniz gerekir
vi: Bạn phải có thể ký một triển khai cho tài khoản nguồn

source: Transfer
fr: Transfert
vi: Chuyển giao

source: The ``transfer`` command allows you to move CSPR from one account to another as denominated in `Motes <https://docs.casperlabs.io/en/latest/implementation/tokens.html?highlight=motes#divisibility-of-tokens>`_. A `Mote` is a denomination of the cryptocurrency CSPR, where 1 CSPR = 1,000,000,000 Motes.
fr: La commande ``transfer`` vous permet de déplacer des CSPR d'un compte à un autre, libellés en `Motes <https://docs.casperlabs.io/fr/latest/implementation/tokens.html?highlight=motes#divisibility-of-tokens>`_. Un `Mote` est une dénomination de la crypto-monnaie CSPR, où 1 CSPR = 1.000.000.000 Motes.
tr: ``transfer`` komutu, CSPR'yi `Motes <https://docs.casperlabs.io/en/latest/implementation/tokens.html?highlight=motes#divisibility-of-tokens>`_ cinsinden belirtilmiş halde bir hesaptan diğerine taşımanıza olanak tanır. `Mote` , 1 CSPR = 1.000.000.000 Mote olan kripto para birimi CSPR'nin bir birimidir.
vi: Lệnh ``transfer`` cho phép bạn di chuyển CSPR từ tài khoản này sang tài khoản khác là `Motes <https://docs.casperlabs.io/en/latest/implementation/tokens.html?highlight=motes#divisibility-of-tokens>`_. `Mote` là một giá trị của tiền điện tử CSPR, trong đó 1 CSPR = 1.000.000.000 Motes.

source: For transfers of at least 2.5 CSPR (2,500,000,000 Motes) from a single sender to a single recipient on a Casper network, the most efficient option is to use the direct transfer capability.
fr: Pour les transferts d'au moins 2,5 CSPR (2 500 000 000 Motes) d'un expéditeur unique à un destinataire unique sur un réseau Casper, l'option la plus efficace est d'utiliser la fonction de transfert direct.
tr: Casper ağında tek bir göndericiden tek bir alıcıya en az 2.5 CSPR (2.500.000.000 Mote) transferler için en verimli seçenek doğrudan transfer özelliğini kullanmaktır.
vi: Để chuyển ít nhất 2,5 CSPR (2.500.000.000 Motes) từ một người gửi đến một người nhận duy nhất trên mạng Casper, tùy chọn hiệu quả nhất là sử dụng khả năng truyền trực tiếp.

source: **Direct transfer example**:
fr: **Exemple de transfert direct** :
tr: **Doğrudan transfer örneği**:
vi: **Ví dụ chuyển trực tiếp**:

source: **Request fields:**
fr: **Paramètres de la requête:**
tr: **Talep alanları:**
vi: **Các trường yêu cầu:**

source: ``id`` - <STRING OR INTEGER> Optional JSON-RPC identifier applied to the request and returned in the response. If not provided, a random integer will be assigned
fr: ``id`` - <STRING OR INTEGER> Identifiant JSON-RPC facultatif appliqué à la requête et renvoyé dans la réponse. S'il n'est pas fourni, un nombre entier aléatoire sera attribué.
tr: ``id`` - <STRING OR INTEGER> İsteğe uygulanan ve yanıtta döndürülen isteğe bağlı JSON-RPC tanımlayıcısı. Sağlanmazsa, rastgele bir tam sayı atanır
vi: ``id`` - <STRING OR INTEGER> định danh tuỳ chọn JSON-RPC được áp dụng cho yêu cầu và được trả lại trong phản hồi. Nếu không được cung cấp, một số nguyên ngẫu nhiên sẽ được chỉ định

source: ``transfer-id`` - <64-BIT INTEGER> The ``transfer-id`` is a memo field, providing additional information about the recipient, which is necessary when transferring tokens to some recipients. For example, if depositing tokens into an account where off-chain management keeps track of individual sub-balances, it is necessary to provide a memo id uniquely identifying the actual recipient. If this is not necessary for a given recipient, you may pass ``0`` or some ``u64`` value that is meaningful to you
fr: ``transfer-id`` - <64-BIT INTEGER> Le "transfer-id" est un champ mémo, fournissant des informations supplémentaires sur le destinataire, qui est nécessaire lors du transfert de jetons à certains destinataires. Par exemple, si vous déposez des jetons sur un compte où la gestion hors-chaîne garde la trace des sous-balances individuelles, il est nécessaire de fournir un memo id identifiant de manière unique le destinataire réel. Si cela n'est pas nécessaire pour un destinataire donné, vous pouvez passer ``0`` ou une valeur ``u64`` qui est significative pour vous.
tr: ``transfer-id`` - <64-BIT INTEGER> ``transfer-id``, alıcı hakkında bazı alıcılara token aktarırken gerekli olan ek bilgileri sağlayan bir not alanıdır. Örneğin, zincir dışı yönetimin bireysel alt bakiyeleri takip ettiği bir hesaba token yatırılıyorsa, gerçek alıcıyı benzersiz şekilde tanımlayan bir not sağlamak gerekir. Belirli bir alıcı için bu gerekli değilse, sizin için anlamlı olan "0" veya "u64" değerini iletebilirsiniz.
vi: ``transfer-id`` - <64-BIT INTEGER> ``transfer-id`` là trường ghi nhớ, cung cấp thông tin bổ sung về người nhận, cần thiết khi chuyển token cho một số người nhận. Ví dụ: nếu gửi token vào một tài khoản mà quản lý ngoài chuỗi theo dõi các số dư phụ, thì cần phải cung cấp id bản ghi nhớ xác định duy nhất người nhận thực tế. Nếu điều này không cần thiết đối với một người nhận nhất định, bạn có thể chuyển giá trị ``0`` hoặc vài giá trị ``u64`` có ý nghĩa đối với bạn

source: ``node-address`` - <HOST:PORT> Hostname or IP and port of a node on a network bound to a JSON-RPC endpoint [default:http://localhost:7777]
fr: ``node-address`` - <HOST:PORT> Hostname IP et port d'un nœud sur un réseau lié à un endpoint JSON-RPC [default:http://localhost:7777]
tr: ``node-address`` - <HOST:PORT> JSON-RPC uç noktasına [varsayılan:http://localhost:7777] bağlı bir ağdaki düğümün ana bilgisayar adı veya IP'si ve bağlantı noktası
vi: ``node-address`` - <HOST:PORT> Tên máy chủ hoặc IP và cổng của một nút trên mạng được liên kết với điểm cuối JSON-RPC [default:http://localhost:7777]

source: ``amount`` - <512-BIT INTEGER> The number of motes to transfer (1 CSPR = 1,000,000,000 ``Motes``)
fr: ``amount`` - <512-BIT INTEGER> Le nombre de motes à transférer (1 CSPR = 1.000.000.000 ``Motes``)
tr: ``amount`` - <512-BIT INTEGER> Aktarılacak mote sayısı (1 CSPR = 1.000.000.000 ``Motes``)
vi: ``amount`` - <512-BIT INTEGER> Số lượng moes cần chuyển (1 CSPR = 1,000,000,000 ``Motes``)

source: ``secret-key`` - Path to secret key file
fr: ``secret-key`` - Chemin du fichier de la clé secrète
tr: ``secret-key`` - Gizli anahtar dosyasının yolu
vi: ``secret-key`` - Đường dẫn đến tệp khóa bí mật

source: ``chain-name`` - Name of the chain, to avoid the deploy from being accidentally or maliciously included in a different chain
fr: ``chain-name`` - Nom de la chaîne, pour éviter que le déploiement ne soit accidentellement ou malicieusement fait dans une autre chaîne.
tr: ``chain-name`` - Zincirin Adı, dağıtımın yanlışlıkla veya kötü niyetli olarak farklı bir zincire dahil edilmesini önlemek için
vi: ``chain-name`` - Tên của chuỗi, để tránh việc triển khai bị đưa vào một chuỗi khác một cách vô tình hoặc có hại

source: The *chain-name* for testnet is **casper-test**
fr: La valeur de *chain-name* pour testnet est **casper-test**.
tr: Testnet için *chain-name* değeri **casper-test**'tir
vi: *chain-name* cho mạng thử nghiệm là **casper-test**

source: The *chain-name* for mainnet is **casper**
fr: La valeur de *chain-name* pour mainnet est **casper**.
tr: Mainnet için *chain-name* değeri **casper**dır
vi: *chain-name* cho mạng chính là **casper**

source: ``target-account`` - <HEX STRING> Hex-encoded public key of the account from which the main purse will be used as the target
fr: ``target-account`` - <HEX STRING> Clé publique codée en hexadécimal du compte à partir duquel le porte-monnaie principal sera utilisé comme cible.
tr: ``target-account`` - <HEX STRING> Ana cüzdanın hedef olarak kullanılacağı hesabın onaltılı kodlu açık anahtarı
vi: ``target-account`` - <HEX STRING> Khóa công khai được mã hóa hex của tài khoản mà từ đó ví chính sẽ được sử dụng như đích

source: **Important response fields:**
fr: **Paramètres importants de la réponse:**
tr: **Önemli yanıt alanları:**
vi: **Các trường phản hồi quan trọng:**

source: ``"result"."deploy_hash"`` - the address of the executed transfer, needed to look up additional information about the transfer
fr: ``"result"."deploy_hash"`` - l'adresse du déploiement exécuté, nécessaire pour rechercher des informations supplémentaires sur le transfert
tr: ``"result"."deploy_hash"`` - yürütülen transferin adresi, transfer hakkında ek bilgi aramak için gerekli
vi: ``"result"."deploy_hash"`` - địa chỉ của quá trình chuyển đã thực hiện, cần thiết để tra cứu thêm thông tin về quá trình chuyển

source: **Note**: Save the returned `deploy_hash` from the output to query information about the transfer deploy later.
fr: **Note** : Enregistrer le `deploy_hash` retourné pour pouvoir demander des informations sur le déploiement du transfert plus tard.
tr: **Not**: Daha sonra transfer dağıtımıyla ilgili bilgileri sorgulamak için döndürülen `deploy_hash` değerini çıktıdan kaydedin.
vi: **Lưu ý**: Lưu `deploy_hash` trả về từ đầu ra để truy vấn thông tin về việc chuyển sau này.

source: **JSON-RPC Request**:
tr: **JSON-RPC İsteği**:
vi: **Yêu cầu JSON-RPC**:

source: **JSON-RPC Response**:
tr: **JSON-RPC Cevabı**:
vi: **Phản hồi JSON-RPC**:

source: Deploy Status
fr: État du déploiement (Deploy Status)
tr: Dağıtım Durumu
vi: Trạng thái triển khai

source: A transfer on a Casper Network is only executed after it has been included in a finalized block.
fr: Un transfert sur un réseau Casper n'est exécuté qu'après avoir été inclus dans un bloc finalisé.
tr: Casper Network'teki bir transfer, yalnızca kesinleştirilmiş bir bloka dahil edildikten sonra yürütülür.
vi: Việc chuyển trên Mạng Casper chỉ được thực hiện sau khi nó đã được đưa vào một khối đã hoàn thành.

source: Refer to the Section on `querying deploys <querying.html#deploy-status>`_ within the network to check the execution status of the transfer.
fr: Se reporter à la section sur `l'interrogation des déploiements <querying.html#deploy-status>`_ au sein du réseau pour vérifier l'état d'exécution du transfert.
tr: Transferin yürütme durumunu kontrol etmek için ağ içindeki `dağıtımları sorgulamak <querying.html#deploy-status>`_ ile ilgili Bölüme bakın.
vi: Tham khảo Phần `truy vấn triển khai <querying.html#deploy-status>`_ trong mạng để kiểm tra trạng thái thực thi của quá trình chuyển.

source: ``"result"."execution_results"[0]."transfers[0]"`` - the address of the executed transfer that the source account initiated. We will use it to look up additional information about the transfer
fr: ``"result". "execution_results"[0]. "transfers[0]"`` - l'adresse du transfert exécuté que le compte source a initié. Nous l'utiliserons pour rechercher des informations complémentaires sur le transfert
tr: ``"result"."execution_results"[0]."transfers[0]"`` - kaynak hesabın başlattığı yürütülen transferin adresi. Transfer hakkında ek bilgi aramak için kullanacağız
vi: ``"result"."execution_results"[0]."transfers[0]"`` - địa chỉ của chuyển giao mà tài khoản nguồn đã bắt đầu thực hiện. Chúng ta sẽ sử dụng nó để tra cứu thông tin bổ sung về việc chuyển giao

source: ``"result"."execution_results"[0]."block_hash"`` - contains the block hash of the block that included our transfer. We will require the `state_root_hash` of this block to look up information about the accounts and their balances
fr: ``"result". "execution_results"[0]. "block_hash"`` - contient le hash du bloc qui a inclus notre transfert. Nous aurons besoin du `state_root_hash` de ce bloc pour rechercher des informations sur les comptes et leurs soldes.
tr: ``"result"."execution_results"[0]."block_hash"`` - transferimizi içeren bloğun blok özetini (hash) içerir. Hesaplar ve bakiyeleri hakkında bilgi aramak için bu bloğun `state_root_hash`ına ihtiyacımız olacak.
vi: ``"result"."execution_results"[0]."block_hash"`` - chứa hàm băm khối của khối có quá trình chuyển giao. Chúng ta sẽ yêu cầu `state_root_hash` của khối này để tra cứu thông tin về các tài khoản và số dư của chúng

source: **Note**: Transfer addresses use a ``transfer-`` string prefix.
fr: **Note** : Les adresses de transfert utilisent un préfixe de chaîne de caractères ``transfer-``.
tr: **Not**: Transfer adresleri bir ``transfer-`` dizge öneki kullanır.
vi: **Lưu ý**: Địa chỉ chuyển sử dụng tiền tố chuỗi ``transfer-``.

source: State Root Hash
tr: Durum Kök Özeti (Hash)
vi: Trạng thái Root Hash

source: State information like the balance of an account on a Casper blockchain is stored in the `Global State <https://docs.casperlabs.io/en/latest/implementation/global-state.html>`_.
fr: Les informations relatives à l'état, comme le solde d'un compte sur une blockchain Casper, sont stockées dans le `Global State <https://docs.casperlabs.io/fr/latest/implementation/global-state.html>`_.
tr: Casper blokzincirindeki bir hesabın bakiyesi gibi durum bilgileri, `Küresel Durum <https://docs.casperlabs.io/en/latest/implementation/global-state.html>`_'da saklanır.
vi: Thông tin trạng thái như số dư của tài khoản trên chuỗi khối Casper được lưu trữ trong `Global State <https://docs.casperlabs.io/en/latest/implementation/global-state.html>`_.

source: We will use the ``get-block`` command and the ``block_hash`` to query and retrieve the block that contains our deploy. We will use the ``state_root_hash`` from the response to look up various values, like the source and destination account and their balances.
fr: Nous utiliserons la commande ``get-block`` et le ``block_hash`` pour interroger et récupérer le bloc qui contient notre déploiement. Nous utiliserons le ``state_root_hash`` de la réponse pour rechercher diverses valeurs, comme le compte source et le compte destination et leurs soldes.
tr: Dağıtımımızı içeren bloğu sorgulamak ve almak için ``get-block`` komutunu ve ``block_hash`` komutunu kullanacağız. Kaynak ve hedef hesap ve bunların bakiyeleri gibi çeşitli değerleri aramak için yanıttaki ``state_root_hash`` değerini kullanacağız.
vi: Chúng ta sẽ sử dụng lệnh ``get-block`` và ``block_hash`` để truy vấn và nhận lại khối chứa triển khai. Chúng ta sẽ sử dụng ``state_root_hash`` từ phản hồi để tra cứu các giá trị khác nhau, như tài khoản nguồn và tài khoản đích cũng như số dư của chúng.

source: ``node-address`` <HOST:PORT> Hostname or IP and port of node on which HTTP service is running [default:http://localhost:7777]
fr: ``node-address`` - <HOST:PORT> Hostname ou IP et port du nœud sur lequel le service HTTP tourne [default:http://localhost:7777]
tr: ``node-address`` <HOST:PORT> Ana makine adı veya IP ve HTTP hizmetinin çalıştığı düğümün bağlantı noktası [varsayılan:http://localhost:7777]
vi: ``node-address`` <HOST:PORT> Tên máy chủ hoặc IP và cổng của nút mà dịch vụ HTTP đang chạy [default:http://localhost:7777]

source: ``block-identifier`` - <HEX STRING OR INTEGER> Hex-encoded block hash or height of the block. If not given, the last block added to the chain as known at the given node will be used
fr: ``block-identifier`` - <HEX STRING OR INTEGER> Hash de bloc codé en hexadécimal ou hauteur du bloc. S'il n'est pas donné, le dernier bloc ajouté à la chaîne tel que connu au nœud donné sera utilisé.
tr: ``block-identifier`` - <HEX STRING OR INTEGER> Hex kodlu blok özeti (hash) veya bloğun yüksekliği. Verilmezse, verilen düğümde bilinen zincire eklenen son blok kullanılacaktır.
vi: ``block-identifier`` - <HEX STRING OR INTEGER> Hex-encode hàm băm của khối hoặc độ cao của khối. Nếu không được cung cấp, sẽ sử dụng khối cuối cùng được thêm vào chuỗi như đã biết tại nút đã cho

source: ``"result"."block"."header"."state_root_hash"`` - contains the ``state-root-hash`` for this block
fr: ``"result"."block"."header"."state_root_hash"`` - contient le ``state-root-hash`` pour ce bloc
tr: ``"result"."block"."header"."state_root_hash"`` - bu blok için ``state-root-hash``ı içerir
vi: ``"result"."block"."header"."state_root_hash"`` - chứa ``state-root-hash`` cho khối này

source: Query the Source Account
fr: Interroger le Compte Source
tr: Kaynak Hesabı Sorgulayın
vi: Truy vấn Tài khoản nguồn

source: Next, we will query for information about the `Source` account, using the ``state-root-hash`` of the block containing our transfer and the public key of the `Target` account.
fr: Ensuite, nous allons demander des informations sur le compte `Source`, en utilisant le ``state-root-hash`` du bloc contenant notre transfert et la clé publique du compte `Target``.
tr: Daha sonra, transferimizi içeren bloğun ``state-root-hash``ini ve `Target` hesabının açık anahtarını kullanarak `Source` hesabı hakkında bilgi sorgulayacağız.
vi: Tiếp theo, chúng ta sẽ truy vấn thông tin về tài khoản `Nguồn`, bằng cách sử dụng ``state-root-hash`` của khối chứa chuyển giao của chúng ta và khóa công khai của tài khoản `Đích`.

source: ``node-address`` - <HOST:PORT> Hostname or IP and port of node on which HTTP service is running [default:http://localhost:7777]
fr: ``node-address`` - <HOST:PORT> Hostname ou IP et port du nœud sur lequel le service HTTP tourne [default:http://localhost:7777]
tr: ``node-address`` - <HOST:PORT> Ana makine adı veya IP ve HTTP hizmetinin çalıştığı düğümün bağlantı noktası [varsayılan:http://localhost:7777]
vi: ``node-address`` - <HOST:PORT> Tên máy chủ hoặc IP và cổng của nút mà dịch vụ HTTP đang chạy [default:http://localhost:7777]

source: ``state-root-hash`` - <HEX STRING> Hex-encoded hash of the state root
fr: ``state-root-hash`` - <HEX STRING> Hash codé en hexadécimal de la racine de l'état.
tr: ``state-root-hash`` - <HEX STRING> Durum kökünün hex kodlu özeti (hash)
vi: ``state-root-hash`` - <HEX STRING> Hex-encode hàm băm của trạng thái gốc

source: ``key`` - <FORMATTED STRING or PATH> The base key for the query. This must be a properly formatted public key, account hash, contract address hash, URef, transfer hash or deploy-info hash.
fr: ``key`` - <FORMATTED STRING or PATH> La clé de base pour la requête. Il doit s'agir d'une clé publique correctement formatée, d'un hash de compte, d'un hash d'adresse de contrat, d'un URef, d'un hash de transfert ou d'un hash de deploy-info.
tr: ``key`` - <FORMATTED STRING or PATH> Sorgu için temel anahtar. Bu, uygun şekilde biçimlendirilmiş bir genel anahtar, hesap özeti (hash), kontrat adresi özeti (hash), URef, aktarım özeti (hash) veya dağıtım bilgisi özeti (hash) olmalıdır.
vi: ``key`` - <FORMATTED STRING or PATH> Khóa cơ sở cho truy vấn. Đây phải là khóa công khai được định dạng đúng, băm tài khoản, băm địa chỉ hợp đồng, URef, băm chuyển giao hoặc băm thông tin triển khai.

source: ``"result"."stored_value"."Account"."main_purse"`` - the address of the main purse containing the sender’s tokens. This purse is the source of the tokens transferred in this example
fr: ``"result"."stored_value"."Account"."main_purse"`` - l'adresse du porte-monnaie principal contenant les jetons de l'expéditeur. Ce porte-monnaie est la source des jetons transférés dans cet exemple.
tr: ``"result"."stored_value"."Account"."main_purse"`` - gönderenin tokenlerini içeren ana cüzdanın adresi. Bu cüzdan, bu örnekte aktarılan tokenlerin kaynağıdır.
vi: ``"result"."stored_value"."Account"."main_purse"`` - địa chỉ của ví chính chứa token của người gửi. Ví này là nguồn của các token được chuyển trong ví dụ này

source: Query the Target Account
fr: Interroger le Compte Cible
tr: Hedef Hesabı Sorgulayın
vi: Truy vấn Tài khoản đích

source: We will repeat the previous step to query information about the `Target` account.
fr: Nous allons répéter l'étape précédente pour demander des informations sur le compte `Target`.
tr: `Target` (hedef) hesabıyla ilgili bilgileri sorgulamak için önceki adımı tekrarlayacağız.
vi: Chúng ta sẽ lặp lại bước trước để truy vấn thông tin về tài khoản `Đích`.

source: ``key`` - <FORMATTED STRING or PATH> The base key for the query. This must be a properly formatted public key, account hash, contract address hash, URef, transfer hash, or deploy-info hash.
fr: ``key`` - <FORMATTED STRING or PATH> La clé de base pour la requête. Il doit s'agir d'une clé publique correctement formatée, d'un hash de compte, d'un hash d'adresse de contrat, d'un URef, d'un hash de transfert ou d'un hash de deploy-info.
tr: ``key`` - <FORMATTED STRING or PATH> Sorgu için temel anahtar. Bu, uygun şekilde biçimlendirilmiş bir açık anahtar, hesap özeti (hash), kontrat adresi özeti (hash), URef, transfer özeti (hash) veya dağıtım bilgisi özeti (hash) olmalıdır.
vi: ``key`` - <FORMATTED STRING or PATH> Khóa cơ sở cho truy vấn. Đây phải là khóa công khai được định dạng đúng, băm tài khoản, băm địa chỉ hợp đồng, URef, băm chuyển giao hoặc băm thông tin triển khai.

source: Get Source Account Balance
fr: Obtenir le solde du compte source
tr: Kaynak Hesap Bakiyesini Alın
vi: Lấy số dư Tài khoản nguồn

source: All accounts on a Casper system have a purse associated with the Casper system mint, which we call the `main purse`. The balance associated with a given purse is recorded in the global state, and the value can be queried using the ``URef`` associated with the purse.
fr: Tous les comptes d'un système Casper ont un porte-monnaie associé à la monnaie (mint) du système Casper, que nous appelons le "porte-monnaie principal". Le solde associé à un porte-monnaie donné est enregistré dans l'état global, et la valeur peut être interrogée en utilisant le ``URef`` associé au porte-monnaie.
tr: Casper sistemindeki tüm hesapların, `ana cüzdan` olarak adlandırdığımız Casper sistemi darphanesi ile ilişkili bir cüzdanı vardır. Belirli bir cüzdanla ilişkili bakiye, global durumda kaydedilir ve değer, cüzdanla ilişkili "URef" kullanılarak sorgulanabilir.
vi: Tất cả các tài khoản trên hệ thống Casper đều có một ví được liên kết với hệ thống Casper, chúng tôi gọi là `` ví chính ''. Số dư được liên kết với một ví nhất định được ghi lại ở trạng thái toàn cục và giá trị có thể được truy vấn bằng cách sử dụng ``URef`` được liên kết với ví.
