Repository: casper-network/docs-archive
Catalog: locale/*/LC_MESSAGES/workflow/two-party-multi-sig.po
Languages: fr, tr, vi

source: Two-Party Multi-Signature Deploys
fr: Déploiements de multi-signatures à deux parties
tr: İki Taraflı Çoklu İmza Dağıtımı
vi: Triển khai đa chữ ký hai bên

source: `Accounts <https://docs.casperlabs.io/en/latest/implementation/accounts.html>`_ on a Casper Network can associate other accounts to allow or require a multiple signature scheme for deploys.
fr: `Les Comptes <https://docs.casperlabs.io/fr/latest/implementation/accounts.html>`_ sur un réseau Casper peuvent associer d'autres comptes pour autoriser ou exiger un schéma de signature multiple pour les déploiements.
tr: Casper Network'teki `hesaplar <https://docs.casperlabs.io/en/latest/implementation/accounts.html>`_, dağıtımlar için çoklu imza şemasına izin vermek veya bunu zorunlu kılmak için diğer hesapları ilişkilendirebilir.
vi: `Các tài khoản <https://docs.casperlabs.io/en/latest/implementation/accounts.html>` trên Mạng Casper có thể liên kết các tài khoản khác để cho phép hoặc yêu cầu chương trình nhiều chữ ký cho các đợt triển khai.

source: This workflow describes how a trivial two-party multi-signature scheme for signing and sending deploys can be enforced for an account on a Casper Network.
fr: Ce workflow décrit comment un schéma trivial de multi-signatures à deux parties pour la signature et l'envoi de déploiements peut être mis en œuvre pour un compte sur un réseau Casper.
tr: Bu iş akışı, Casper Network'teki bir hesap için dağıtımları imzalamak ve göndermek için küçük bir iki taraflı çoklu imza şemasının nasıl uygulanabileceğini açıklar.
vi: Luồng công việc này mô tả cách có thể thực thi chương trình đa chữ ký hai bên thường dùng để ký và gửi triển khai cho một tài khoản trên Mạng Casper.

source: This workflow assumes:
fr: Ce workflow suppose :
tr: Bu iş akışı şunları varsayar:
vi: Giả định luồng công việc này:

source: You meet the `prerequisites <setup.html>`_
fr: Vous remplissez les `pré-requis <setup.html>`_
tr: `Önkoşulları <setup.html>`_ karşılıyorsunuz
vi: Bạn đáp ứng các `điều kiện cần <setup.html>`_

source: You are using the Casper command-line client
fr: Vous utilisez le client en ligne de commande Casper
tr: Casper komut satırı istemcisini kullanıyorsunuz
vi: Bạn đang sử dụng dòng lệnh trên Casper client

source: You have a main ``PublicKey`` hex (**MA**) and a ``PublicKey`` hex to associate (**AA**)
fr: Vous avez un hex de ``PublicKey`` principal (**MA**) et un hex de ``PublicKey`` à associer (**AA**)
tr: (**AA**) lişkilendirilecek bir ana `PublicKey` onaltılı (**MA**) ve bir `PublicKey` onaltılı var
vi: Bạn có một ``PublicKey`` hex (**MA**) chính và một ``PublicKey`` hex để liên kết (**AA**)

source: You have a valid ``node-address``
fr: Vous avez une ``node-address`` valide.
tr: Geçerli bir ``node-address``iniz var
vi: Bạn có một ``node-address`` hợp lệ

source: You have previously `deployed a smart contract <https://docs.casperlabs.io/en/latest/dapp-dev-guide/deploying-contracts.html>`_ to a Casper Network
fr: Vous avez précédemment `déployé un contrat intelligent <https://docs.casperlabs.io/fr/latest/dapp-dev-guide/deploying-contracts.html>`_ sur un Réseau Casper
tr: Daha önce bir Casper Network'e `akıllı kontrat dağıttınız <https://docs.casperlabs.io/en/latest/dapp-dev-guide/deploying-contracts.html>`_
vi: Trước đây bạn đã `triển khai hợp đồng thông minh <https://docs.casperlabs.io/en/latest/dapp-dev-guide/deploying-contracts.html>`_ cho Mạng Casper

source: Configuring the Main Account
fr: Configurer le compte principal
tr: Ana Hesabı Yapılandırmak
vi: Cấu hình Tài khoản chính

source: **CAUTION**: Incorrect account configurations could render accounts defunct and unusable. It is highly recommended to first execute any changes to an account in a test environment like Testnet, before performing them in a live environment like Mainnet.
fr: **CAUTION** : Des configurations de compte incorrectes peuvent rendre les comptes défectueux et inutilisables. Il est fortement recommandé d'exécuter toute modification d'un compte dans un environnement de test comme Testnet, avant de l'exécuter dans un environnement réel comme Mainnet.
tr: **DİKKAT**: Yanlış hesap yapılandırmaları, hesapları geçersiz ve kullanılamaz hale getirebilir. Bir hesaptaki değişiklikleri Mainnet gibi canlı bir ortamda gerçekleştirmeden önce Testnet gibi bir test ortamında gerçekleştirmeniz önemle tavsiye edilir.
vi: **THẬN TRỌNG**: Cấu hình tài khoản không chính xác có thể khiến tài khoản hỏng và không thể sử dụng được. Trước tiên, bạn nên thực hiện bất kỳ thay đổi nào đối với tài khoản trong môi trường thử nghiệm như Testnet, trước khi thực hiện chúng trong môi trường trực tiếp như Mainnet.

source: Each account has an ``associated_keys`` field which is a list containing the account address and its weight for every associated account. Accounts can be associated by adding the account address to the ``associated_keys`` field.
fr: Chaque compte a un champ ``associated_keys`` qui est une liste contenant l'adresse du compte et son poids pour chaque compte associé. Les comptes peuvent être associés en ajoutant l'adresse du compte au champ ``associated_keys``.
tr: Her hesabın, hesap adresini ve ilişkili her hesap için ağırlığını içeren bir liste olan bir `associated_keys`` alanı vardır. Hesaplar, ``associated_keys`` alanına hesap adresi eklenerek ilişkilendirilebilir.
vi: Mỗi tài khoản có một trường ``associated_keys``, đây là một danh sách có chứa địa chỉ tài khoản và trọng số của nó cho mọi tài khoản được liên kết. Các tài khoản có thể được liên kết bằng cách thêm địa chỉ tài khoản vào trường ``associated_keys``.

source: An account on a Casper Network assigns weights to keys associated with it. For a single key to sign a deploy or edit the state of the account, its weight must be greater than or equal to a set threshold. The thresholds are labeled as the ``action_thresholds`` for the account.
fr: Un compte sur un réseau Casper attribue des poids aux clés qui lui sont associées. Pour qu'une clé unique puisse signer un déploiement ou modifier l'état du compte, son poids doit être supérieur ou égal à un seuil défini. Les seuils sont appelés ``action_thresholds`` pour le compte.
tr: Casper Network'teki bir hesap, kendisiyle ilişkili anahtarlara ağırlıklar atar. Tek bir anahtarın bir dağıtımı imzalaması veya hesabın durumunu düzenlemesi için, ağırlığının belirlenen bir eşikten büyük veya ona eşit olması gerekir. Eşikler, hesap için ``action_thresholds`` olarak etiketlenir.
vi: Tài khoản trên Mạng Casper được chỉ định trọng số cho các khóa được liên kết với nó. Đối với một khóa đơn để ký triển khai hoặc chỉnh sửa trạng thái của tài khoản, trọng số của khóa đó phải lớn hơn hoặc bằng một ngưỡng đã đặt. Các ngưỡng được gắn nhãn ``action_thresholds`` cho tài khoản.

source: Each account within a Casper Network has two action thresholds that manage the permissions to send deploys or manage the account. Each threshold defines the minimum weight that a single key or a combination of keys must have, to either:
fr: Chaque compte au sein d'un réseau Casper possède deux seuils d'action qui gèrent les autorisations d'envoyer des déploiements ou de gérer le compte. Chaque seuil définit le poids minimum qu'une clé unique ou une combinaison de clés doit avoir, pour soit :
tr: Casper Network'teki her hesabın, dağıtım gönderme veya hesabı yönetme izinlerini yöneten iki eylem eşiği vardır. Her eşik, tek bir anahtarın veya bir anahtar kombinasyonunun sahip olması gereken minimum ağırlığı tanımlar:
vi: Mỗi tài khoản trong Mạng Casper có hai ngưỡng hành động để quản lý quyền gửi triển khai hoặc quản lý tài khoản. Mỗi ngưỡng xác định trọng số tối thiểu mà một khóa đơn hoặc một tổ hợp các khóa phải có, để:

source: Send a deploy to the network; determined by the ``deployment`` threshold
fr: Envoyer un déploiement sur le réseau ; déterminé par le seuil de ``deployment``
tr: Ağa bir dağıtım gönderin; ``dağıtım`` eşiği tarafından belirlenir
vi: Gửi triển khai đến mạng; được xác định bởi ngưỡng ``deployment``

source: Edit the ``associated keys`` and the ``action_thresholds``; determined by the ``key_management`` threshold
fr: Modifier les ``associated keys`` et les ``action_thresholds``; déterminés par le seuil ``key_management``
tr: ``associated keys`` ve ``action_thresholds`` alanlarını düzenleyin; ``key_management`` eşiği tarafından belirlenir
vi: Chỉnh sửa ``associated keys`` và ``action_thresholds``; được xác định bởi ngưỡng ``action_thresholds``

source: To enforce the multi-signature (multi-sig) feature for an account on a Casper Network, the *main key* and *associated key*'s combined weight must be greater than or equal to the ``deployment`` threshold. This can be achieved by having each key's weight equal to half of the ``deployment`` threshold.
fr: Pour appliquer la fonction de signature multiple (multi-sig) à un compte sur un réseau Casper, le poids combiné de la *clé principale* et de la *clé associée* doit être supérieur ou égal au seuil de ``deployment``. Pour ce faire, le poids de chaque clé doit être égal à la moitié du seuil de ``deployment``
tr: Casper Network'teki bir hesap için çoklu imza (çoklu imz) özelliğini uygulamak için, *ana anahtar* ve *associated key*in birleşik ağırlığı, ``dağıtım`` eşiğinden büyük veya ona eşit olmalıdır. Bu, her bir anahtarın ağırlığının ``dağıtım`` eşiğinin yarısına eşit olmasıyla başarılabilir.
vi: Để thực thi tính năng đa chữ ký (multi-sig) cho tài khoản trên Mạng Casper, trọng số kết hợp của *main key* và *associated key* phải lớn hơn hoặc bằng ngưỡng ``deployment`` . Điều này có thể đạt được bằng cách đặt trọng số của mỗi khóa bằng một nửa ngưỡng ``deployment``.

source: Code Description
fr: Description du Code
tr: Kod Açıklama
vi: Mô tả mã

source: You can run session code that will execute within the context of your main account. Below is the code that will be compiled to WASM and then sent to the network as part of a deploy.
fr: Vous pouvez faire tourner un code de session qui s'exécutera dans le contexte de votre compte principal. Vous trouverez ci-dessous le code qui sera compilé en WASM, puis envoyé au réseau dans le cadre d'un déploiement.
tr: Ana hesabınız bağlamında yürütülecek oturum kodunu çalıştırabilirsiniz. Aşağıda, WASM'ye derlenecek ve daha sonra bir dağıtımın parçası olarak ağa gönderilecek olan kod yer almaktadır.
vi: Bạn có thể chạy mã code phiên sẽ thực thi trong ngữ cảnh tài khoản chính của bạn. Dưới đây là mã sẽ được biên dịch thành WASM và sau đó được gửi đến mạng như một phần của quá trình triển khai.

source: **Note**: The following contract example will set up a specific account configuration and is not a general-purpose contract.
fr: **Note** : L'exemple de contrat suivant met en place une configuration de compte spécifique et n'est pas un contrat à usage général.
tr: **Not**: Aşağıdaki kontrat örneği, belirli bir hesap yapılandırması oluşturacaktır ve genel amaçlı bir kontrat değildir.
vi: **Lưu ý**: Ví dụ hợp đồng sau sẽ thiết lập cấu hình tài khoản cụ thể và đó không phải là hợp đồng có mục đích chung.

source: The contract will execute **2 crucial steps** to enforce the multi-sig scheme for your main account:
fr: Le contrat exécutera **2 étapes cruciales** pour appliquer le schéma multi-sig pour votre compte principal :
tr: Kontrat, ana hesabınız için çoklu imza şemasını uygulamak amacıyla **2 önemli adımı** yürütecektir:
vi: Hợp đồng sẽ thực hiện **2 bước quan trọng** để thực thi chương trình multi-sig cho tài khoản chính của bạn:

source: Add the associated key **AA** to the account
fr: Ajouter la clé associée **AA** au compte
tr: İlgili **AA** anahtarını hesaba ekleyin
vi: Thêm khóa được liên kết **AA** vào tài khoản

source: Raise the ``deployment`` threshold to ``2``, such that the weight required to send a deploy is split equally between the keys associated with the account
fr: Augmenter le seuil de ``deployment`` à ``2``, de sorte que le poids requis pour envoyer un déploiement soit réparti de manière égale entre les clés associées au compte.
tr: Dağıtım göndermek için gereken ağırlık, hesapla ilişkili anahtarlar arasında eşit olarak bölünecek şekilde ``dağıtım`` eşiğini ``2``ye yükseltin
vi: Tăng ngưỡng ``deployment`` lên ``2``, sao cho trọng số cần thiết để gửi một triển khai được chia đều giữa các khóa được liên kết với tài khoản

source: The action thresholds for deploys cannot be greater than the action threshold for key management. By default, action thresholds are set to ``1``.
fr: Les seuils d'action pour les déploiements ne peuvent pas être supérieurs au seuil d'action pour la gestion des clés. Par défaut, les seuils d'action sont fixés à ``1``.
tr: Dağıtımlar için eylem eşikleri, anahtar yönetimi için eylem eşiğinden büyük olamaz. Varsayılan olarak, eylem eşikleri ``1`` olarak ayarlanmıştır.
vi: Ngưỡng hành động để triển khai không được lớn hơn ngưỡng hành động để quản lý khóa. Theo mặc định, ngưỡng hành động được đặt là ``1``.

source: Code Execution
fr: L'exécution du Code
tr: Kod Çalıştırma
vi: Thực thi mã

source: The state of the account can be altered by sending a deploy which executes the WASM that will associate the **AA** account address.
fr: L'état du compte peut être modifié en envoyant un deploy qui exécute le WASM qui associera l'adresse du compte **AA**.
tr: Hesabın durumu, **AA** hesap adresini ilişkilendirecek WASM'yi yürüten bir dağıtım gönderilerek değiştirilebilir.
vi: Trạng thái của tài khoản có thể được thay đổi bằng cách gửi một triển khai thực thi WASM sẽ liên kết địa chỉ tài khoản **AA**.

source: For this guide, a smart contract has been written and is stored in its `Github Repository <https://github.com/casper-ecosystem/two-party-multi-sig>`_. The repository contains a `Makefile` with the build commands necessary to compile the contract to generate the necessary WASM.
fr: Pour ce guide, un contrat intelligent a été écrit et est stocké dans son `Dépôt Github <https://github.com/casper-ecosystem/two-party-multi-sig>`_. Le dépôt contient un `Makefile` avec les commandes de build nécessaires pour compiler le contrat afin de générer le WASM nécessaire.
tr: Bu kılavuz için akıllı bir kontrat yazılmıştır ve `Github Deposunda <https://github.com/casper-ecosystem/two-party-multi-sig>`_ saklanmaktadır. Depo, gerekli WASM'yi oluşturmak üzere sözleşmeyi derlemek için gerekli derleme komutlarını içeren bir `Makefile` dosyası içerir.
vi: Đối với hướng dẫn này, một hợp đồng thông minh đã được viết và được lưu trữ trong `Github Repository <https://github.com/casper-ecosystem/two-party-multi-sig>`_. Kho chứa một `Makefile` với các lệnh xây dựng cần thiết để biên dịch hợp đồng nhằm tạo ra WASM cần thiết.

source: To build the contract, run the following command:
fr: Pour construire le contrat, exécutez la commande suivante :
tr: Kontratı derlemek için aşağıdaki kodu çalıştırın:
vi: Để xây dựng hợp đồng, hãy chạy lệnh sau:

source: The compiled WASM will be saved on this path:
fr: Le WASM compilé sera sauvegardé dans :
tr: Derlenmiş WASM bu yola kaydedilecektir:
vi: WASM đã biên dịch sẽ được lưu trên đường dẫn này:

source: The Casper command-line client can be used to send the compiled WASM to the network for execution.
fr: Le client en ligne de commande Casper peut être utilisé pour envoyer le WASM compilé au réseau pour exécution.
tr: Casper komut satırı istemcisi, derlenmiş WASM'yi yürütülmek üzere ağa göndermek için kullanılabilir.
vi: Dòng lệnh của Casper client có thể được sử dụng để gửi WASM đã biên dịch đến mạng để thực thi.

source: ``node-address`` - An IP address of a node on the network
fr: ``node-address`` - An IP address of a node on the networkAdresse IP d'un nœud du réseau
tr: ``node-address`` - Ağdaki bir düğümün IP adresi
vi: ``node-address`` - Địa chỉ IP của nút trên mạng

source: ``secret-key`` - The file name containing the secret key of the Main Account
fr: ``secret-key`` - Le nom du fichier contenant la clé secrète du compte principal
tr: ``secret-key`` - Ana Hesabın gizli anahtarını içeren dosya adı
vi: ``secret-key`` - Tên tệp chứa khóa bí mật của Tài khoản chính

source: ``chain-name`` - The chain-name to the network where you wish to send the deploy (this example uses the Testnet)
fr: ``chain-name`` - Le nom de la chaîne du réseau où vous souhaitez envoyer le déploiement (cet exemple utilise le Testnet).
tr: ``chain-name`` - Dağıtımı göndermek istediğiniz ağın zincir adı (bu örnek Testnet'i kullanır)
vi: ``chain-name`` - Tên chuỗi của mạng mà bạn muốn gửi triển khai (ví dụ này sử dụng Testnet)

source: ``payment-amount`` - The cost of the deploy
fr: ``payment-amount`` - Le coût du déploiement
tr: ``payment-amount`` - Dağıtımın maliyeti
vi: ``payment-amount`` - Chi phí triển khai

source: ``session-path`` - The path to the contract WASM
fr: ``session-path`` - Le chemin vers le contrat WASM
tr: ``session-path`` - WASM kontratına giden yol
vi: ``session-path`` - Đường dẫn đến hợp đồng WASM

source: ``session-arg`` - The contract takes the account hash of the Associated account as an argument labeled ``deployment-account``. You can pass this argument using the ``--session-arg`` flag in the command line client
fr: ``session-arg`` - Le contrat prend le hash du compte associé comme argument intitulé ``deployment-account``. Vous pouvez passer cet argument en utilisant le flag ``--session-arg`` dans le client de la ligne de commande
tr: ``session-arg`` - Kontrat, İlişkili hesabın hesap özetini (hash) ``deployment-account`` etiketli bir bağımsız değişken olarak alır. Bu argümanı komut satırı istemcisindeki ``--session-arg`` bayrağını kullanarak iletebilirsiniz.
vi: ``session-arg`` - Hợp đồng lấy hàm băm tài khoản của Tài khoản được liên kết làm đối số có nhãn ``deployment-account``. Bạn có thể chuyển đối số này bằng cách sử dụng cờ ``--session-arg`` trong dòng lệnh trên client

source: **Important response fields:**
fr: **Paramètres importants de la réponse:**
tr: **Önemli yanıt alanları:**
vi: **Các trường phản hồi quan trọng:**

source: ``"result"."deploy_hash"`` - the address of the executed deploy, needed to look up additional information about the transfer
fr: ``"result"."deploy_hash"`` - l'adresse du déploiement exécuté, nécessaire pour rechercher des informations supplémentaires sur le transfert
tr: ``"result"."deploy_hash"`` - yürütülen dağıtımın adresi, transferle ilgili ek bilgileri aramak için gerekli
vi: ``"result"."deploy_hash"`` - địa chỉ của triển khai đã thực thi, cần để tra cứu thông tin bổ sung về quá trình chuyển

source: **Note**: Save the returned ``deploy_hash`` from the output to query information about execution status.
fr: **Note** : Enregistrer le ``deploy_hash`` retourné pour demander des informations sur le statut d'exécution.
tr: **Not**: Yürütme durumuyla ilgili sorgu bilgilerine çıktıdan döndürülen ``deploy_hash`` dosyasını kaydedin.
vi: **Lưu ý**: Lưu ``deploy_hash`` trả về từ đầu ra để truy vấn thông tin về trạng thái thực thi.

source: Confirming Execution and Account Status
fr: Confirmation de l'exécution et du statut du compte
tr: Yürütme ve Hesap Durumunun Onaylanması
vi: Xác nhận Thực thi và Trạng thái Tài khoản

source: Account configuration on a Casper blockchain is stored in a `Merkle Tree <https://docs.casperlabs.io/en/latest/glossary/M.html#merkle-tree>`_ and is a snapshot of the blockchain's `Global State <https://docs.casperlabs.io/en/latest/implementation/global-state.html>`_. The representation of global state for a given block can be computed by executing the deploys (including transfers) within the block and its ancestors. The root node of the Merkle Tree identifying a particular state is called the ``state-root-hash`` and is stored in every executed block.
fr: La configuration du compte sur une blockchain Casper est stockée dans un `Arbre Merkle <https://docs.casperlabs.io/fr/latest/glossary/M.html#merkle-tree>`_ et constitue un snapshot de `l'Etat global <https://docs.casperlabs.io/en/latest/implementation/global-state.html>`_ de la blockchain. La représentation de l'état global pour un bloc donné peut être calculée en exécutant les déploiements (y compris les transferts) dans le bloc et ses ancêtres. Le nœud racine de l'arbre de Merkle identifiant un état particulier est appelé le ``state-root-hash`` et est stocké dans chaque bloc exécuté.
tr: Casper blokzincirdeki hesap yapılandırması, bir `Merkle Ağacında saklanır <https://docs.casperlabs.io/en/latest/glossary/M.html#merkle-tree>`_ ve blokzincirin `Küresel Durumunun <https://docs.casperlabs.io/en/latest/implementation/global-state.html>`_. bir anlık görüntüsüdür. Belirli bir blok için global durumun temsili, blok ve ataları içindeki dağıtımlar (transferler dahil) yürütülerek hesaplanabilir. Belirli bir durumu tanımlayan Merkle Ağacının kök düğümüne ``state-root-hash`` denir ve yürütülen her blokta saklanır.
vi: Cấu hình tài khoản trên blockchain Casper được lưu trữ trong `Merkle Tree <https://docs.casperlabs.io/en/latest/glossary/M.html#merkle-tree>`_ và là ảnh chụp nhanh về trạng thái toàn cục của chuỗi khối `Global State <https://docs.casperlabs.io/en/latest/implementation/global-state.html>`_. Việc biểu diễn trạng thái toàn cục cho một khối nhất định có thể được tính toán bằng cách thực thi các lần triển khai (bao gồm cả chuyển giao) trong khối và nguồn cội của nó. Nút gốc của Cây Merkle xác định một trạng thái cụ thể được gọi là ``state-root-hash`` và được lưu trữ trong mọi khối được thực thi.

source: To check that your account was configured correctly, you need the ``state-root-hash`` corresponding to the block that contains your deploy. To obtain the ``state-root-hash``, you need to:
fr: Pour vérifier que votre compte a été configuré correctement, vous avez besoin du ``state-root-hash`` correspondant au bloc qui contient votre déploiement. Pour obtenir le ``state-root-hash``, vous devez :
tr: Hesabınızın doğru yapılandırıldığını kontrol etmek için, dağıtımınızı içeren bloğa karşılık gelen``state-root-hash``a ihtiyacınız var. ``state-root-hash`` elde etmek için yapmanız gerekenler:
vi: Để kiểm tra tài khoản của bạn đã được định cấu hình đúng chưa, bạn cần có ``state-root-hash`` tương ứng với khối chứa triển khai của bạn. Để có được ``state-root-hash``, bạn cần:

source: `Confirm the execution status of the deploy <querying.html#querying-deploys>`_ and obtain the hash of the block containing it
fr: `Confirmer l'état d'exécution du déploiement <querying.html#querying-deploys>`_ et obtenir le hash du bloc qui le contient.
tr: `Dağıtımın yürütme durumunu onaylayın <querying.html#querying-deploys>`_ ve onu içeren bloğun özetini (hash) alın
vi: `Xác nhận trạng thái thực thi của triển khai <querying.html#querying-deploys>`_ và lấy hàm băm của khối chứa nó

source: `Query the block containing the deploy <querying.html#querying-blocks>`_ to obtain the corresponding ``state_root_hash``
fr: `Interroger le bloc contenant le déploiement <querying.html#querying-blocks>`_ pour obtenir le ``state_root_hash`` correspondant.
tr: Karşılık gelen ``state_root_hash`` elde etmek için `dağıtımı içeren bloğu sorgulayın <querying.html#querying-blocks>`_
vi: `Truy vấn khối chứa triển khai <querying.html#querying-blocks>`_ để lấy ``state_root_hash`` tương ứng

source: Use the ``state_root_hash`` and the ``hex-encoded-public-key`` of the main account to query the network for the account and check its configuration.
fr: Utiliser le ``state_root_hash`` et le ``hex-encoded-public-key`` du compte principal pour rechercher le compte sur le réseau et vérifier sa configuration.
tr: Hesap için ağı sorgulamak ve yapılandırmasını kontrol etmek için ana hesabın ``state_root_hash`` ve ``hex-encoding-public-key`` ögelerini kullanın.
vi: Sử dụng ``state_root_hash`` và ``hex-encoded-public-key`` của tài khoản chính để truy vấn mạng cho tài khoản và kiểm tra cấu hình của nó.

source: **Example Output**
fr: **Exemple de sortie**:
tr: **Örnek Çıktı**
vi: **Kết quả mẫu**
