Repository: casper-network/docs-archive
Catalog: locale/*/LC_MESSAGES/workflow/two-party-multi-sig.po
Languages: fr, tr, vi

source: In the above example, you can see the account addresses listed within the ``associated_keys`` section. Each key has a weight of ``1``, since the action threshold for ``deployment`` is set to ``2``, neither account is able to sign and send a deploy individually. Thus to send the deploy from the Main account, the deploy needs to be signed by the secret keys of each account to reach the required threshold.
fr: Dans l'exemple ci-dessus, vous pouvez voir les adresses des comptes listées dans la section ``associated_keys``. Chaque clé a un poids de ``1``, puisque le seuil d'action pour ``deployment`` est fixé à ``2``, aucun des comptes n'est capable de signer et d'envoyer un deploy individuellement. Ainsi, pour envoyer le déploiement depuis le compte principal, le déploiement doit être signé par les clés secrètes de chaque compte pour atteindre le seuil requis.
tr: Yukarıdaki örnekte, ``associated_keys`` bölümünde listelenen hesap adreslerini görebilirsiniz. ``Dağıtım`` için eylem eşiği ``2`` olarak ayarlandığından, her anahtarın ağırlığı ``1``dir, her iki hesap da bir dağıtımı tek tek imzalayamaz ve gönderemez. Bu nedenle, dağıtımı Ana hesaptan göndermek için, dağıtımın gerekli eşiğe ulaşması için her hesabın gizli anahtarları tarafından imzalanması gerekir.
vi: Trong ví dụ trên, bạn có thể thấy các địa chỉ tài khoản được liệt kê trong phần ``associated_keys``. Mỗi khóa có trọng số là `` 1 '', vì ngưỡng hành động cho ``deployment`` được đặt là `` 2 '', không tài khoản nào có thể ký và gửi triển khai riêng lẻ. Do đó, để gửi triển khai từ Tài khoản chính, triển khai cần được ký bằng khóa bí mật của mỗi tài khoản để đạt đến ngưỡng yêu cầu.

source: Details about various scenarios in which multiple associated keys can be setup is discussed in `the examples section of the Multi-Signature Tutorial <https://docs.casperlabs.io/en/latest/dapp-dev-guide/tutorials/multi-sig/examples.html>`_.
fr: Les détails sur les différents scénarios dans lesquels plusieurs clés associées peuvent être configurées sont discutés dans la section `exemples du Tutoriel Multi-Signatures <https://docs.casperlabs.io/fr/latest/dapp-dev-guide/tutorials/multi-sig/examples.html>`_.
tr: Birden çok ilişkili anahtarın ayarlanabileceği çeşitli senaryolarla ilgili ayrıntılar, `Çoklu İmza Eğitiminin örnekler bölümünde <https://docs.casperlabs.io/en/latest/dapp-dev-guide/tutorials/multi-sig/examples.html>`_ tartışılmaktadır.
vi: Xem thông tin chi tiết về các tình huống khác nhau để có thể thiết lập nhiều khóa được liên kết trong ``phần ví dụ Hướng dẫn về Đa chữ ký <https://docs.casperlabs.io/en/latest/dapp-dev-guide/tutorials/multi-sig/examples.html>`_.
