Repository: casper-network/docs-archive
Catalog: locale/*/LC_MESSAGES/workflow/undelegate.po
Languages: fr, vi

source: Undelegating Tokens
fr: Déblocage des Jetons (Undelegating)
vi: Huỷ uỷ quyền Token

source: This document details a workflow where tokens delegated to a validator on a Casper network can be undelegated.
fr: Ce document détaille un workflow où les jetons délégués à un validateur sur un réseau Casper peuvent être débloqués.
vi: Tài liệu này nêu chi tiết quy trình làm việc trong đó các mã thông báo được ủy quyền cho nhà xác thực trên mạng Casper có thể được huỷ uỷ quyền.

source: This workflow assumes:
fr: Ce workflow suppose :
vi: Luồng công việc giả định:

source: You meet the `prerequisites <setup.html>`_
fr: Vous remplissez les `pré-requis <setup.html>`_
vi: Bạn đáp ứng các `điều kiện cần <setup.html>`_

source: You are using the Casper command-line client
fr: Vous utilisez le client de ligne de commande Casper
vi: Bạn đang sử dụng dòng lệnh trên Casper client

source: You have an undelegation contract or WASM to execute on the network
fr: Vous avez un contrat de déblocage (undelegation) ou un WASM à exécuter sur le réseau.
vi: Bạn có hợp đồng huỷ uỷ quyền hoặc WASM để thực thi trên mạng

source: You have a valid ``node-address``
fr: Vous avez une ``node-address`` valide.
vi: Bạn có một ``node-address`` hợp lệ

source: You have previously `deployed a smart contract <https://docs.casperlabs.io/en/latest/dapp-dev-guide/deploying-contracts.html>`_ to a Casper Network
fr: Vous avez précédemment `déployé un contrat intelligent <https://docs.casperlabs.io/en/latest/dapp-dev-guide/deploying-contracts.html>`_ sur un Réseau Casper
vi: Trước đây bạn đã `triển khai hợp đồng thông minh <https://docs.casperlabs.io/en/latest/dapp-dev-guide/deploying-contracts.html>`_ cho Mạng Casper

source: You have delegated tokens to a validator
fr: Vous avez délégué des jetons à un validateur.
vi: Bạn đã ủy quyền token cho nhà xác thực

source: Building The Undelegation WASM
fr: Construire le WASM de déblocage (undelegation)
vi: Xây dựng Huỷ uỷ quyền WASM

source: Obtain the ``undelegate.wasm`` by cloning the `casper-node <https://github.com/CasperLabs/casper-node>`_ repository and building the contracts.
fr: Obtenez le ``undelegate.wasm`` en clonant le dépôt `casper-node <https://github.com/CasperLabs/casper-node>`_ et en construisant les contrats.

source: To build contracts, set up Rust, and install all dependencies. Visit `Setting up Rust <https://docs.casperlabs.io/en/latest/dapp-dev-guide/setup-of-rust-contract-sdk.html>`_ in the Developer Guide for step-by-step instructions.
fr: Pour construire (build) des contrats, configurez Rust, et installez toutes les dépendances. Consultez `Setting up Rust <https://docs.casperlabs.io/en/latest/dapp-dev-guide/setup-of-rust-contract-sdk.html>`_ dans le Guide du développeur pour les instructions détaillées.
vi: Để xây dựng hợp đồng, hãy thiết lập Rust và cài đặt tất cả các phần phụ thuộc. Truy cập vào `Cài đặt Rust <https://docs.casperlabs.io/en/latest/dapp-dev-guide/setup-of-rust-contract-sdk.html>`_ trong Hướng dẫn dành cho nhà phát triển để biết từng bước hướng dẫn.

source: Once you build the contracts, you can use the ``undelegate.wasm`` to create a deploy that will initiate the undelegation process. The WASM can be found in:
fr: Une fois que vous avez construit les contrats, vous pouvez utiliser le ``undelegate.wasm`` pour créer un déploiement qui lancera le processus de désengagement (undelegation) des jetons. Le WASM peut être trouvé dans :
vi: Khi bạn xây dựng các hợp đồng, bạn có thể sử dụng ``undelegate.wasm``để tạo một triển khai bắt đầu quá trình huỷ uỷ quyền. Có thể thấy WASM trong:

source: Sending the Undelegation Deploy
fr: Envoi du déploiement de déblocage
vi: Gửi triển khai Huỷ uỷ quyền

source: Send a deploy containing the ``undelegate.wasm`` to the network to initiate the undelegation process.
fr: Envoyer un déploiement contenant le ``undelegate.wasm`` au réseau pour initier le processus de déblocage.
vi: Gửi một triển khai có chứa ``undelegate.wasm`` đến mạng để bắt đầu quá trình huỷ uỷ quyền.

source: Below is an example of an undelegation request using the Casper command-line client:
fr: Vous trouverez ci-dessous un exemple de requête de déblocage utilisant le client en ligne de commande Casper :
vi: Dưới đây là ví dụ về yêu cầu huỷ uỷ quyền bằng dòng lệnh trên Casper client:

source: **Note** The delegator's public key and the secret key that signs the deploy must be part of the same key pair.
fr: **Note** La clé publique du délégant et la clé secrète qui signe le déploiement doivent faire partie de la même paire de clés.
vi: **Lưu ý** Khóa công khai của người ủy quyền và khóa bí mật ký tên vào triển khai phải là một phần của cùng một cặp khóa.

source: **Request fields:**
fr: **Paramètres de la requête:**
vi: **Các trường yêu cầu:**

source: ``id`` - <STRING OR INTEGER> Optional JSON-RPC identifier applied to the request and returned in the response. If not provided, a random integer will be assigned
fr: ``id`` - <STRING OR INTEGER> Identifiant JSON-RPC facultatif appliqué à la requête et renvoyé dans la réponse. S'il n'est pas fourni, un nombre entier aléatoire sera attribué.
vi: ``id`` - <STRING OR INTEGER> định danh tuỳ chọn JSON-RPC được áp dụng cho yêu cầu và được trả lại trong phản hồi. Nếu không được cung cấp, một số nguyên ngẫu nhiên sẽ được chỉ định

source: ``node-address`` - <HOST:PORT> Hostname or IP and port of node on which HTTP service is running [default:http://localhost:7777]
fr: ``node-address`` - <HOST:PORT> Hostname ou IP et port du nœud sur lequel le service HTTP tourne [default:http://localhost:7777]
vi: ``node-address`` - <HOST:PORT> Tên máy chủ hoặc IP và cổng của nút mà dịch vụ HTTP đang chạy [default:http://localhost:7777]

source: ``secret-key`` - Path to secret key file
fr: ``secret-key`` - Chemin du fichier de la clé secrète
vi: ``secret-key`` - Đường dẫn đến tệp khóa bí mật

source: ``chain-name`` - Name of the chain, to avoid the deploy from being accidentally or maliciously included in a different chain
fr: ``chain-name`` - Nom de la chaîne, pour éviter que le déploiement ne soit accidentellement ou malicieusement fait dans une autre chaîne.
vi: ``chain-name`` - Tên của chuỗi, để tránh việc triển khai bị đưa vào một chuỗi khác một cách vô tình hoặc có hại

source: The *chain-name* for testnet is **casper-test**
fr: La valeur de *chain-name* pour testnet est **casper-test**.
vi: *chain-name* cho mạng thử nghiệm là **casper-test**

source: The *chain-name* for mainnet is **casper**
fr: La valeur de *chain-name* pour mainnet est **casper**.
vi: *chain-name* cho mạng chính là **casper**

source: ``session-path`` - The path to where the ``delegate.wasm`` is located
fr: ``session-path`` - Le chemin vers l'endroit où se trouve le ``delegate.wasm``.
vi: ``session-path`` - Đường dẫn tới vị trí ``delegate.wasm``

source: ``session-arg`` - The arguments to the ``delegate`` execution
fr: ``session-arg`` - Les arguments pour l'exécution du ``delegate``
vi: ``session-arg`` - Các đối số để thực thi ``delegate``

source: The argument ``validator`` is the public key of the validator from whom the tokens will be undelegated
fr: L'argument ``validator`` est la clé publique du validateur à qui les jetons seront retirés.
vi: Đối số ``validator` là khóa công khai của nhà xác thực mà từ đó các mã thông báo sẽ huỷ uỷ quyền

source: The argument ``amount`` is the number of tokens to be undelegated
fr: L'argument ``amount`` est le nombre de jetons à débloquer.
vi: Đối số ```amount`` là số lượng token sẽ được huỷ uỷ quyền

source: The argument ``delegator`` is the public key of the account undelegating tokens from a validator
fr: L'argument ``delegator`` est la clé publique du compte qui délègue les jetons d'un validateur.
vi: Đối số ``delegator`` là khóa công khai của tài khoản huỷ uỷ quyền token từ nhà xác thực

source: Asserting the Undelegation
fr: Vérifier le débloquage
vi: Xác nhận Huỷ uỷ quyền

source: You can use the Casper command-line client to generate an RPC request to query the auction state. The subsequent RPC response will confirm that the undelegation request was successfully executed.
fr: Vous pouvez utiliser le client en ligne de commande Casper pour générer une requête RPC afin d'interroger l'état des enchères. La réponse RPC subséquente confirmera que la demande de déblocage a été exécutée avec succès.
vi: Bạn có thể sử dụng dòng lệnh trên Casper client để tạo một yêu cầu RPC để truy vấn trạng thái đấu giá. Phản hồi RPC tiếp theo sẽ xác nhận rằng yêu cầu huỷ uỷ quyền đã được thực hiện thành công.

source: Here is how you can check the status of the auction to confirm that your bid was withdrawn:
fr: Voici comment vous pouvez vérifier le statut de l'enchère (auction) pour confirmer que votre offre (bid) a été retirée :
vi: Đây là cách bạn có thể kiểm tra trạng thái của phiên đấu giá để xác nhận rằng giá thầu của bạn đã được rút lại:

source: **Request fields**:
fr: **Paramètres de la requête:**
vi: **Các trường yêu cầu**:

source: If the public key and the amount are absent from the ``bids`` structure, we can safely assert that we have indeed undelegated from the validator.
fr: Si la clé publique et le montant sont absents de la structure ``bids'', nous pouvons affirmer sans risque que nous avons effectivement procédé à un déblocage (undelagate) sur le validateur.
vi: Nếu khóa công khai và tổng số không có trong cấu trúc ``bids``, chúng ta có thể khẳng định một cách an toàn rằng chúng ta thực sự đã không bị nhà xác thực huỷ uỷ quyền.

source: If your account is on the official Testnet or Mainnet, you can use the block explorer to look up your account balance and see that the tokens have been added to your balance:
fr: Si votre compte est sur le Testnet ou le Mainnet officiel, vous pouvez utiliser l'explorateur de blocs pour consulter le solde de votre compte et voir que les jetons ont été ajoutés à votre solde :
vi: Nếu tài khoản của bạn nằm trên Testnet hoặc Mainnet chính thức, bạn có thể sử dụng trình khám phá khối để tra cứu số dư tài khoản của mình và xem các token đã được thêm vào tài khoản của bạn:

source: **Important Note**: After undelegating tokens from a validator, you must wait for the unbonding period to lapse before re-delegating tokens to either the same validator or a different validator.
fr: **Note importante** : Après avoir débloqué les jetons auprès d'un validateur, vous devez attendre la fin de la période de déblocage avant de redéléguer les jetons au même validateur ou à un validateur différent.
vi: **Lưu ý quan trọng**: Sau khi huỷ uỷ quyền token từ nhà xác thực, bạn phải đợi khoảng thời gian hủy kết thúc, trước khi ủy quyền lại mã thông báo cho cùng một nhà xác thực hoặc một nhà xác thực khác.

source: Obtain the ``undelegate.wasm`` by cloning the `casper-node <https://github.com/casper-network/casper-node>`_ repository and building the contracts.
vi: Lấy ra ``undelegate.wasm`` bằng cách sao chép kho chứa `casper-node <https://github.com/casper-network/casper-node>`_ và xây dựng các hợp đồng.
