Repository: casper-network/docs-archive
Catalog: locale/*/LC_MESSAGES/staking/index.po
Languages: fr, tr, vi

source: Staking
tr: Paydaşlık (Staking)
vi: Đặt cọc (Staking)

source: A feature of Proof-of-Stake protocols is that token holders can actively participate in the protocol through a mechanism known as **staking**.
fr: Une caractéristique des protocoles Proof-of-Stake est que les détenteurs de jetons peuvent participer activement au protocole par le biais d'un mécanisme appelé **staking**.
tr: Hisse Kanıtı (PoS) protokollerinin bir özelliği, token sahiplerinin **paydaşlık** olarak bilinen bir mekanizma aracılığıyla protokole aktif olarak katılabilmeleridir.
vi: Một tính năng của giao thức Proof-of-Stake là chủ sở hữu token có thể tích cực tham gia vào giao thức thông qua một cơ chế được gọi là đặt cọc (**staking**).

source: Persons that hold their private keys can choose to stake their tokens with any validator in the Casper network. Alternatively, it is possible to stake tokens via an exchange or custody provider as well.
fr: Les personnes qui détiennent leurs clés privées peuvent choisir de staker leurs jetons auprès de n'importe quel validateur du réseau Casper. Il est également possible de staker des jetons au sein d'un marché d'échange ou chez d'un prestataire de services (custody provider ).
tr: Özel anahtarlarına sahip olan kişiler, tokenlerini Casper ağındaki herhangi bir doğrulayıcı ile stake etmeyi seçebilirler. Alternatif olarak, tokenleri bir borsa veya saklama sağlayıcısı aracılığıyla da stake etmek mümkündür.
vi: Những người nắm giữ khóa cá nhân của họ có thể chọn đặt cọc mã thông báo của họ với bất kỳ nhà xác thực nào trong mạng Casper. Ngoài ra, bạn cũng có thể đặt cọc token thông qua một sàn giao dịch hoặc nhà cung cấp dịch vụ lưu ký.

source: This guide will outline the steps required to stake the CSPR token on the Casper network.
fr: Ce guide présente les étapes nécessaires pour staker les jeton CSPR sur le réseau Casper.
tr: Bu kılavuz, CSPR tokenini Casper ağında stake etmek için gereken adımları özetleyecektir.
vi: Hướng dẫn này sẽ phác thảo các bước cần thiết để đặt cọc mã thông báo CSPR trên mạng Casper.

source: What you need to know before staking
fr: Ce que vous devez savoir avant de staker
tr: Stake etmeden önce bilmeniz gerekenler
vi: Những điều bạn cần biết trước khi đặt cọc

source: Please read the following sections carefully before staking tokens on the Casper network.
fr: Veuillez lire attentivement les sections suivantes avant de staker des jetons sur le réseau Casper.
tr: Casper ağında tokenleri stake etmeden önce lütfen aşağıdaki bölümleri dikkatlice okuyun.
vi: Vui lòng đọc kỹ các phần sau trước khi đặt cọc token trên mạng Casper.

source: Slashing
tr: Kesme (Slashing)
vi: Cắt hoa hồng (Slashing)

source: Presently Casper does not slash for equivocations. If a node equivocates, its' messages are ignored by the rest of the validators for the balance of the era and made inactive. A node running the software provided by the Casper Association will terminate once it detects that it has equivocated. Future work includes locking an equivocating validator's stake for an extended duration of time, effectively penalizing the validator.
fr: À l'heure actuelle, Casper ne 'slashe' pas en cas d'éjection. Si un noeud est éjecté, ses messages sont ignorés par le reste des validateurs pour le reste de l'ère et il est rendu inactif. Un nœud qui exécute le logiciel fourni par l'association Casper s'arrête dès qu'il détecte son éjection. Les travaux futurs comprennent le verrouillage de l'enjeu d'un validateur éjecté pour une durée prolongée, ce qui pénalise efficacement le validateur.
tr: Şu anda Casper, çelişkili davranışlar için kesme kullanmıyor. Bir düğüm çelişkili davranırsa; mesajları, dönemin dengesi için diğer doğrulayıcılar tarafından göz ardı edilir ve devre dışı bırakılır. Casper Association tarafından sağlanan yazılımı çalıştıran bir düğüm, çelişkili davrandığını algıladığında sonlanacaktır. Gelecekteki çalışmalar, çelişkili davranan bir doğrulayıcının hissesini uzun bir süre için kilitlemeyi ve doğrulayıcıyı etkin bir şekilde cezalandırmayı içerir.
vi: Hiện tại Casper không bị cắt hoa hồng cho sự không minh bạch. Nếu một nút không minh bạch, các thông báo của nó sẽ bị phần còn lại của người xác thực bỏ qua cho sự cân bằng của thời đại và làm nó không hiện hoạt. Một nút đang chạy phần mềm được cung cấp bởi Hiệp hội Casper sẽ bị dừng khi nó phát hiện ra rằng nó không minh bạch. Công việc tiếp theo bao gồm khóa phần đặt cọc của nhà xác thực không minh bạch trong một khoảng thời gian, xử phạt hiệu quả nhà xác thực.

source: Casper does not treat validator stake differently than delegator stake for security reasons.
fr: Pour des raisons de sécurité, Casper ne traite pas la mise (stake) du validateur différemment de la mise du délégant.
tr: Casper, güvenlik nedenleriyle doğrulayıcı payını yetki veren payından farklı şekilde ele almaz.
vi: Casper không xử lý phần đặt cọc của người xác thực khác với phần đặt cọc của người ủy quyền vì lý do bảo mật.

source: Delegation Rate
fr: Taux de délégation
tr: Delegasyon Oranı
vi: Tỷ lệ uỷ quyền

source: Node operators (Validators) define a commission that they take in exchange for providing staking services. This commission is represented as a percentage of the rewards that the node operator retains for their services.
fr: Les opérateurs de nœuds (validateurs) définissent une commission qu'ils prennent en échange de la fourniture du service de staking. Cette commission est représentée par un pourcentage des récompenses que l'opérateur de nœud conserve pour ce service.
tr: Düğüm operatörleri (Doğrulayıcılar), paydaşlık hizmetleri sağlama karşılığında aldıkları bir komisyon tanımlarlar. Bu komisyon, düğüm operatörünün hizmetleri için elinde tuttuğu ödüllerin yüzdesi olarak temsil edilir.
vi: Các nhà khai thác nút (Nhà xác thực) xác định một khoản hoa hồng mà họ nhận để đổi lấy việc cung cấp dịch vụ đặt cọc. Hoa hồng này được thể hiện dưới dạng phần trăm phần thưởng mà nhà điều hành nút giữ lại cho các dịch vụ của họ.

source: Rewards
fr: Récompenses
tr: Ödüller
vi: Phần thưởng

source: Validators receive rewards for participating in consensus by voting on blocks sending finality signatures (finalizing blocks). There is no precise *per-block* reward. Rewards are split proportionally among stakes within an era. If a validator is offline or cannot vote on many blocks, the rewards earned are also reduced. Delegators can only receive a proportional amount of the validator's rewards minus the validator’s commission (Delegation Rate).
fr: Les validateurs reçoivent des récompenses pour leur participation au consensus et la finalisation des blocs. Il n'y a pas de récompense précise par bloc. Les récompenses sont réparties proportionnellement entre les enjeux d'une ère. Si un validateur est hors ligne ou ne peut pas voter sur de nombreux blocs, les récompenses gagnées sont réduites. Les déléguants ne peuvent recevoir qu'un montant proportionnel des récompenses du validateur moins la commission du validateur (taux de délégation). Les récompenses sont distribuées à la fin de chaque ère.
tr: Doğrulayıcılar, kesinlik imzaları gönderen bloklara oy vererek mutabakata katılmak için ödül alırlar (kesinleştirme blokları). Kesin bir *blok başına* ödül yoktur. Ödüller, bir dönem içindeki paylar arasında orantılı olarak bölünür. Bir doğrulayıcı çevrimdışıysa veya birçok blokta oy kullanamıyorsa, kazanılan ödüller de azalır. Yetki verenler, yalnızca doğrulayıcının ödüllerinden doğrulayıcının komisyonu (Delegasyon Oranı) çıkarılarak orantılı bir miktarda alabilir.
vi: Người xác thực nhận được phần thưởng khi tham gia đồng thuận bằng cách bỏ phiếu trên các khối gửi chữ ký đã hoàn thành (khối hoàn thành). Không chắc chắn là có phần thưởng *cho mỗi khối*. Phần thưởng được chia theo tỷ lệ giữa các phần đặt cọc trong một thời đại. Nếu người xác thực ngoại tuyến hoặc không thể bỏ phiếu cho nhiều khối, phần thưởng kiếm được cũng bị giảm. Người ủy quyền chỉ có thể nhận được một lượng tương ứng với phần thưởng của người xác thực sau khi trừ đi hoa hồng của người xác thực (Tỷ lệ ủy quyền).

source: Rewards are distributed at the end of each era.
fr: Les récompenses sont distribuées à la fin de chaque ère.
tr: Ödüller her dönemin sonunda dağıtılır.
vi: Phần thưởng được phân phối vào cuối mỗi kỷ nguyên.

source: Selecting a node for Staking
fr: Sélection d'un nœud pour le staking
tr: Paydaşlık için bir düğüm seçmek
vi: Chọn nút để đặt cọc

source: As a prospective delegator, it is important to select a validating node that you can trust. Please do your due diligence before you stake your tokens with a validator.
fr: En tant que délégataire potentiel, il est important de choisir un nœud de validation en qui vous pouvez avoir confiance. Veuillez faire preuve de diligence avant de placer vos jetons auprès d'un validateur.
tr: Potansiyel bir yetki veren olarak, güvenebileceğiniz bir doğrulama düğümü seçmeniz önemlidir. Tokenlerinizi bir doğrulayıcı ile stake etmeden önce lütfen gerekli özeni gösterin.
vi: Là một người ủy quyền tiềm năng, điều quan trọng là phải chọn một nút xác thực mà bạn có thể tin tưởng. Vui lòng thực hiện thẩm định trước khi bạn đặt cọc token của mình với nhà xác thực.

source: Check in on your Stake
fr: Vérifiez votre Stake.
tr: Hissenizi kontrol edin
vi: Đăng ký phần bạn Đặt cọc

source: It’s recommended that you check in on how your stake is performing from time to time. If the validator you staked with decides to unbond, your stake will also be unbonded. Make sure that the validator you have selected is performing as per your expectations.
fr: Il est recommandé de vérifier de temps en temps la performance de votre stake. Si le validateur avec lequel vous avez misé décide de se désengager, votre mise sera également désengagée. Assurez-vous que le validateur que vous avez choisi fonctionne conformément à vos attentes.
tr: Hissenizin nasıl performans gösterdiğini zaman zaman kontrol etmeniz önerilir. Stake yaptığınız doğrulayıcı, çözülme kararı verirse, hisse tutarınız da çözülmüş olacaktır. Seçtiğiniz doğrulayıcının beklentilerinize göre performans gösterdiğinden emin olun.
vi: Bạn nên kiểm tra xem phần đặt cọc của mình đang hoạt động như thế nào theo thời gian. Nếu người xác thực mà bạn đã đặt cọc quyết định rút cổ phần, tiền đặt cọc của bạn cũng sẽ bị rút. Hãy đảm bảo rằng nhà xác thực bạn đã chọn đang hoạt động như mong đợi của bạn.

source: Validators have to win a staking auction by competing with prospective and current validators for a slot. This process is permissionless, meaning validators can join and leave the auction without restrictions, except the unbonding wait period.
fr: Les validateurs doivent remporter une enchère de staking en concourant avec les validateurs actuels et potentiels pour un faire partie des validateurs. Ce processus est sans permission, ce qui signifie que les validateurs peuvent rejoindre et quitter l'enchère sans restriction, à l'exception de la période d'attente de désolidarisation.
tr: Doğrulayıcılar, bir slot için potansiyel ve mevcut doğrulayıcılarla rekabet ederek bir paydaşlık açık arttırmasını kazanmak zorundadır. Bu işlem izinsizdir, yani doğrulayıcılar, çözülme bekleme süresi dışında herhangi bir kısıtlama olmaksızın açık arttırmaya katılabilir ve açık arttırmadan ayrılabilir.
vi: Người xác thực phải thắng một cuộc đấu giá đặt cọc bằng cách cạnh tranh với những người xác thực tiềm năng và hiện tại khác để có một vị trí. Quá trình này không cần cấp phép, có nghĩa là người xác thực có thể tham gia và rời khỏi phiên đấu giá mà không bị hạn chế, ngoại trừ khoảng thời gian chờ rút cổ phần.

source: Unbonding Period
fr: Période de désolidarisation (désengagement)
tr: Çözülme Dönemi
vi: Thời gian rút cổ phần

source: For security purposes, whenever a token is un-staked or un-delegated, the protocol will continue to keep the token locked for 14 hours.
fr: Pour des raisons de sécurité, chaque fois qu'un jeton n'est plus staké ou n'est plus délégué, le protocole continuera à le maintenir verrouillé pendant 14 heures.
tr: Güvenlik amacıyla, bir token stake işlemi geri alındığında veya delegasyon işlemi geri alındığında, protokol tokeni 14 saat boyunca kilitli tutmaya devam edecektir.
vi: Vì mục đích bảo mật, bất cứ khi nào token được bỏ đặt cọc hoặc không được ủy quyền, giao thức sẽ tiếp tục giữ token bị khóa trong 14 giờ.

source: Next Steps
fr: Étapes suivantes
tr: Sonraki Adımlar
vi: Các bước tiếp theo
