Repository: casper-network/docs-archive
Catalog: locale/*/LC_MESSAGES/economics/archived/issuance.po
Languages: fr, ru, tr, vi

source: Issuance
fr: Émission
ru: Выпуск токенов
tr: Emisyon
vi: Phát hành

source: Issuance provides a base level of payments for validators, so that they are compensated for their work even if there is not a lot of demand for using the network. By issuing new CSPR for validators, we ensure that the network is secured by sufficient stake, even without the transaction fees.
fr: L'émission fournit un niveau de base des paiements pour les validateurs, de sorte qu'ils sont rémunérés pour leur travail même s'il n'y a pas beaucoup de demande pour utiliser le réseau. En émettant de nouveaux jetons CSPR pour les validateurs, nous nous assurons que le réseau est sécurisé par des fonds (stake) suffisants, même sans les frais de transaction (fees).
ru: Выпуск токенов обеспечивает базовый уровень платежей для валидаторов, так что они получают компенсацию за свою работу, даже если нет большого спроса на использование сети. Выпуская новый CSPR для валидаторов, мы гарантируем, что сеть защищена достаточной долей участия, даже без комиссий за транзакции.
tr: İhraç, doğrulayıcılar için bir temel ödeme düzeyi sağlar, böylece ağı kullanmak için çok fazla talep olmasa bile çalışmalarının karşılığını alırlar. Doğrulayıcılar için yeni CSPR yayınlayarak, ağın işlem ücretleri olmadan bile yeterli payla güvence altına alınmasını sağlıyoruz.
vi: Việc cung cấp mức thanh toán cơ bản cho người xác thực để họ được thưởng cho công việc của mình ngay cả khi nhu cầu sử dụng mạng không nhiều. Bằng cách phát hành CSPR mới cho người xác thực, chúng tôi đảm bảo rằng mạng được bảo đảm bằng đủ cổ phần, ngay cả khi không có phí giao dịch.

source: CSPR is issued at a fixed rate and distributed to validators in proportion to their stake. This is analogous to block rewards in Proof of Work blockchains, except for a couple of differences:
fr: Les jetons CSPR sont émis à un taux fixe et distribués aux validateurs en proportion de leur mise. Ceci est analogue aux récompenses de bloc dans les blockchains Proof of Work, à quelques différences près :
ru: Токены CSPR выпускаются по фиксированной ставке и распределяются между валидаторами пропорционально их доле. Это аналогично вознаграждениям за блок в блокчейнах Proof of Work, за исключением нескольких отличий:
tr: CSPR sabit bir oranda verilir ve doğrulayıcılara paylarıyla orantılı olarak dağıtılır. Bu, birkaç farklılık dışında İş Kanıtı blokzincirlerdeki ödülleri engellemeye benzer:
vi: CSPR được phát hành với tỷ lệ cố định và được phân phối cho người xác thực theo tỷ lệ sở hữu của họ. Điều này tương tự để chặn phần thưởng trong blockchain Proof of Work, ngoại trừ một vài điểm khác biệt:

source: The growth of CSPR supply is exponential instead of linear.
fr: La croissance de l'offre de CSPR est exponentielle et non linéaire.
ru: Рост предложения CSPR не линейный, а экспоненциальный.
tr: CSPR arzının büyümesi doğrusal yerine üsteldir.
vi: Sự tăng trưởng của nguồn cung CSPR theo cấp số nhân thay vì tuyến tính.

source: Issuance takes into account slashed CSPR.
fr: L'émission tient compte de la réduction des jetons CSPR due au 'slashing'
ru: При выдаче количество токенов CSPR сокращается.
tr: Emisyon, kesik CSPR'yi dikkate alır.
vi: Việc phát hành có tính đến CSPR bị cắt giảm.

source: If there were no slashing, we would have computed block rewards according to the following formula
fr: S'il n'y avait pas eu de 'slashing', nous aurions calculé les récompenses par blocs selon la formule suivante
ru: Если бы количество токенов не сокращалось, мы бы вычислили вознаграждение за блок по следующей формуле
tr: Kesme (slashing) olmasaydı, blok ödüllerini aşağıdaki formüle göre hesaplardık
vi: Nếu không có phần cắt giảm, chúng tôi sẽ tính toán phần thưởng khối theo công thức sau

source: where :code:`i = 1, 2, ...` and so on is the era's index, :code:`initial_supply` is the number of CSPR at the Mainnet launch, :code:`issuance_rate` is the annual rate at which new CSPR is minted, and :code:`ticks_per_year = 365*24*60*60*1000 = 31_536_000_000`.
fr: où :code:`i = 1, 2, ...` etc est l'indice de l'ère (era), :code:`initial_supply` est le nombre de jetons CSPR au lancement du Mainnet, :code:`issuance_rate` est le taux annuel auquel les nouveaux CSPR sont émis (minted), et :code:`ticks_per_year = 365*24*60*60*1000 = 31_536_000_000`.
ru: где :code:`i = 1, 2, ...` и т.д. индекс эпохи, :code:`initial_supply` это количество CSPR при запуске, :code:`issuance_rate` это годовая ставка при которой новый CSPR выпущен, и :code:`ticks_per_year = 365*24*60*60*1000 = 31_536_000_000`.
tr: :code:`i = 1, 2, ...` vb. dönemin indeksi olduğunda, i:code:`initial_supply`, Mainnet başlangıcındaki CSPR sayısıdır, :code:`issuance_rate`, yeni CSPR'nin basıldığı yıllık orandır ve :code:`ticks_per_year = 365*24*60* 60*1000 = 31_536_000_000.
vi: trong đó :code:`i = 1, 2, ...` là chỉ mục của thời đại, :code:`initial_supply` là số CSPR tại lúc khởi chạy Mainnet, :code:`issuance_rate` là tỷ lệ hàng năm mà tại đó CSPR mới được tạo ra, và :code:`ticks_per_year = 365*24*60*60*1000 = 31_536_000_000`.

source: However, we have to factor in slashed tokens too when we issue new CSPR. To this end, we keep track of minted and slashed CSPR at the end of each era:
fr: Cependant, nous devons également prendre en compte la réduction des jetons due au slashing lorsque nous émettons de nouveaux jetons CSPR. À cette fin, nous gardons la trace des jetons CSPR émis et détruits à la fin de chaque ère (era) :
ru: Однако мы также должны учитывать сокращенные токены при выпуске новых CSPR. С этой целью мы отслеживаем выпущенные и сокращенные CSPR в конце каждой эры:
tr: Ancak, yeni CSPR yayınladığımızda kesik tokenleri de hesaba katmalıyız. Bu amaçla, her dönemin sonunda basılmış ve bölünmüş CSPR'yi takip ediyoruz:
vi: Tuy nhiên, chúng tôi cũng phải tính đến các mã thông báo bị cắt giảm khi chúng tôi phát hành CSPR mới. Để đạt được mục tiêu này, chúng tôi theo dõi CSPR được đào và cắt giảm vào cuối mỗi kỷ nguyên:

source: where :code:`rewards(i)` is the total CSPR minted per issuance during era :code:`i`, and :code:`slashings(i)` is the total CSPR slashed during era :code:`i`. All of these quantities can be derived objectively from the history of the global state.
fr: où :code:`rewards(i)` est le total des jetons CSPR émis(minted) pendant l'ère :code:`i`, et :code:`slashings(i)` est le total des jetons CSPR perdus à cause du slashing pendant l'ère :code:`i`. Toutes ces quantités peuvent être dérivées objectivement de l'histoire de l'état global.
ru: где :code:`rewards(i)` это общее количество CSPR, выпущенное в течение эры :code:`i`, and :code:`slashings(i)` это общее количество CSPR сокращенное за эру :code:`i`. Все эти величины могут быть объективно выведены из истории глобального состояния..
tr: burada :code:`rewards(i)`, dönem :code:`i` sırasında emisyon başına basılan toplam CSPR'dir ve :code:`slashings(i)`, dönem code:`i` sırasında kesilen toplam CSPR'dir. Bu niceliklerin tümü, küresel durumun tarihinden nesnel olarak türetilebilir.
vi: trong đó: :code:`rewards(i)` là tổng số CSPR được tạo ra cho mỗi lần phát hành trong kỷ nguyên :code:`i` và :code:`slashings(i)` là tổng số CSPR bị cắt giảm trong kỷ nguyên :code:`i`. Tất cả những đại lượng này có thể được suy ra một cách khách quan từ lịch sử của trạng thái tổng quát.

source: We introduce *round issuance rate*
fr: Nous introduisons le *taux d'émission rond*. (round issuance rate)
ru: Мы вводим *round issuance rate*
tr: *Tur emisyon oranı*nı tanıtıyoruz
vi: Chúng tôi giới thiệu *tỷ lệ phát hành theo vòng*

source: which is the yearly issuance rate adjusted to a single round, whose length is defined by the protocol parameter :code:`minimum_round_exponent = 14`. This gives us a round length of roughly 16 seconds.
fr: qui est le taux d'émission annuel ajusté à un seul tour, dont la longueur est définie par le paramètre de protocole :code:`minimum_round_exponent = 14`. Cela nous donne une longueur de tour d'environ 16 secondes.
ru: который является годовой скоростью выдачи, скорректированной до одного раунда, длина которого определяется параметром протокола :code:`minimum_round_exponent = 14`. Это дает нам длину раунда примерно 16 секунд.
tr: bu, uzunluğu code:`minimum_round_exponent = 14` protokol parametresi ile tanımlanan tek bir tura ayarlanan yıllık düzenleme oranıdır. Bu bize yaklaşık 16 saniyelik bir tur uzunluğu verir.
vi: là tỷ lệ phát hành hàng năm được điều chỉnh thành từng vòng một, có độ dài được xác định bởi tham số giao thức :code:`minimum_round_exponent = 14``. Điều này cung cấp cho chúng tôi độ dài vòng khoảng 16 giây.

source: Finally, the base round reward is computed as
fr: Enfin, la récompense du tour de base est calculée comme suit
ru: Наконец, базовая награда за раунд рассчитывается как
tr: Son olarak, temel tur ödülü şu şekilde hesaplanır:
vi: Cuối cùng, phần thưởng của vòng cơ sở được tính là

source: This value gives us the maximum amount of CSPR that the validators can receive from a proposed block.
fr: Cette valeur nous donne la quantité maximale de jetons CSPR que les validateurs peuvent recevoir d'un bloc proposé.
ru: Это значение дает нам максимальное количество CSPR, которое валидаторы могут получить от предложенного блока.
tr: Bu değer bize doğrulayıcıların önerilen bir bloktan alabileceği maksimum CSPR miktarını verir.
vi: Giá trị này cung cấp cho chúng tôi số lượng CSPR tối đa mà người xác thực có thể nhận được từ một khối được đề xuất.

source: Reward Distribution
fr: Distribution des récompenses (rewards)
ru: Распределение вознаграждений
tr: Ödül Dağıtımı
vi: Phân phối phần thưởng

source: Validators are rewarded for proposing and finalizing blocks, according to their performance. The concept of weight is crucial for understanding reward distribution:
fr: Les validateurs sont récompensés pour avoir proposé et finalisé des blocs, en fonction de leurs performances. Le concept de ''poids'' est crucial pour comprendre la distribution des récompenses :
ru: Валидаторы награждаются за предложение и финализирование в соответствии с их эффективностью. Концепция веса имеет решающее значение для понимания распределения вознаграждения:
tr: Doğrulayıcılar, performanslarına göre blok önermek ve sonuçlandırmak için ödüllendirilir. Ağırlık kavramı, ödül dağılımını anlamak için çok önemlidir:
vi: Người xác thực được thưởng cho việc đề xuất và hoàn thiện các khối, tùy theo hiệu suất của họ. Khái niệm khối lượng là rất quan trọng để hiểu việc phân phối phần thưởng:

source: **Weight:** A validator's bonded stake, used in consensus.
fr: **Poids:** Un enjeu (stake) lié au validateur, utilisé dans le consensus.
ru: **Weight:** Связанная ставка валидатора, используемая для достижения консенсуса.
tr: **Ağırlık:** Mutabakatta kullanılan bir doğrulayıcının bağlı hissesi.
vi: **Khối lượng:** Số lượng đã đặt cược (stake) của người xác thực, được sử dụng cho việc đồng thuận.

source: **Assigned weight of a block/round:** The total stake of validators that are scheduled to participate on a block.
fr: **Poids assigné d'un bloc/tour:** La mise totale des validateurs qui sont programmés pour participer à un bloc.
ru: Общая ставка валидаторов, запланированная для участия в блоке.
tr: **Bir blok/turun atanan ağırlığı:** Bir bloğa katılması planlanan doğrulayıcıların toplam hissesi.
vi: **Số lượng đã đăng ký của một khối/vòng:** Tổng số tiền đặt cọc của các nhà xác nhận được lên kế hoạch tham gia vào một khối.

source: **Participated weight of a block/round:** The total stake of validators that actually end up participating. Here, *participating* means sending messages to finalize a block before their respective rounds end.
fr: **Poids des participants d'un bloc/ronde:** La participation totale des validateurs qui finissent par participer. Ici, *participer* signifie envoyer des messages pour finaliser un bloc avant la fin de leurs tours (rounds) respectifs.
ru: **Participated weight of a block/round:** Общая ставка валидаторов, которые фактически участвуют. Здесь * участие * означает отправку сообщений для завершения блока до завершения соответствующих раундов.
tr: **Bir blok/turun katılan ağırlığı:** Gerçekte katılan doğrulayıcıların toplam hissesi. Burada *katılmak*, ilgili turlar bitmeden bir bloğu kesinleştirmek için mesajlar göndermek anlamına gelir.
vi: **Khối lượng tham gia của một khối/vòng:** Tổng số tiền đặt cọc của những người xác thực mà thực sự tham gia. Ở đây, *tham gia* có nghĩa là gửi tin để hoàn thành một khối trước khi các vòng tương ứng kết thúc.

source: To determine the validators' eligibility to receive rewards from a proposed block, we look at **on-time finalization (OTF)**. Validators should finalize blocks on time, by sending required messages before their respective rounds end.
fr: Pour déterminer l'éligibilité des validateurs à recevoir des récompenses d'un bloc proposé, nous examinons la **finalisation à temps (on-time finalization =OTF)**. Les validateurs doivent finaliser les blocs à temps, en envoyant les messages requis avant la fin de leurs tours respectifs.
ru: Чтобы определить право валидаторов на получение вознаграждения от предложенного блока, мы смотрим на **on-time finalization (OTF)**. Валидаторы должны завершить блоки вовремя, отправив необходимые сообщения до завершения соответствующих раундов.
tr: Doğrulayıcıların önerilen bir bloktan ödül almaya uygun olup olmadığını belirlemek için **zamanında kesinleştirmeye (OTF)** bakarız. Doğrulayıcılar, ilgili turları bitmeden gerekli mesajları göndererek blokları zamanında kesinleştirmelidir.
vi: Để xác định tính đủ điều kiện của người xác thực để nhận phần thưởng từ khối được đề xuất, chúng tôi xem xét **tổng kết đúng hạn (OTF)**. Người xác thực nên hoàn thành các khối đúng thời gian, bằng cách gửi các tin được yêu cầu trước khi các vòng tương ứng của họ kết thúc.

source: Participation Schedule
fr: Calendrier de participation
ru: График участия
tr: Katılım Takvimi
vi: Kế hoạch tham gia

source: The schedule with which validators send messages are determined by the validators' rounds, which are in turn determined by their round exponents. A validator with the round exponent :code:`n` has to participate in rounds that repeat every :code:`2^n` ticks.
fr: La fréquence à laquelle les validateurs envoient des messages est déterminée par les tours (rounds) des validateurs, qui sont à leur tour déterminés par leurs exposants de tour. Un validateur avec l'exposant de tour :code:`n` doit participer à des tours qui se répètent tous les :code:`2^n` ticks.
ru: График отправки сообщений валидаторами определяется раундами валидаторов, которые, в свою очередь, определяются их экспонентой. Валидатор с округленной экспонентой :code:`n` должен участвовать в раундах, которые повторяются каждые :code:`2^n` тика.
tr: Doğrulayıcıların mesaj gönderdiği program, doğrulayıcıların turları tarafından belirlenir ve bunlar da tur üsleri tarafından belirlenir. :code:`n` tur üssüne sahip bir doğrulayıcı, her :code:`2^n` işaretini tekrarlayan turlara katılmak zorundadır.
vi: Lịch trình mà người xác thực gửi tin được xác định bởi các vòng của người xác thực, lần lượt được xác định bởi cấp số nhân vòng của họ. Trình xác thực có cấp số nhân vòng :code:`n` phải tham gia vào các vòng lặp lại mỗi :code:`2^n` tích tắc.

source: Each validator is assessed according to their own round exponent. All assigned validators become eligible to receive rewards as long as the block gets finalized with messages that were sent within each validator's own round.
fr: Chaque validateur est évalué en fonction de son propre exposant de tour. Tous les validateurs assignés deviennent éligibles pour recevoir des récompenses tant que le bloc est finalisé avec des messages qui ont été envoyés pendant le tour de chaque validateur.
ru: Каждый валидатор оценивается в соответствии с его собственным округленным показателем. Все назначенные валидаторы получают право на получение вознаграждения, если блок завершается сообщениями, которые были отправлены в рамках каждого раунда валидатора.
tr: Her doğrulayıcı kendi tur üssüne göre değerlendirilir. Blok, her bir doğrulayıcının kendi turunda gönderilen mesajlarla kesinleştirildiği sürece, atanan tüm doğrulayıcılar ödül almaya hak kazanır.
vi: Mỗi người xác thực được đánh giá theo cấp số nhân vòng của riêng họ. Tất cả người xác thực được chỉ định sẽ đủ điều kiện nhận phần thưởng miễn là khối được hoàn thành với các tin được gửi trong mỗi vòng của trình xác thực riêng.

source: We dictate a minimum assigned weight for all rounds. Rounds that meet the requirement are said to be *feasible*, and the ones that do not are said to be *infeasible*. Blocks proposed in infeasible rounds do not receive any rewards.
fr: Nous imposons un poids minimum assigné pour tous tours (rounds). Les tours qui remplissent cette condition sont dits *faisables*, et ceux qui ne le font pas sont dits *infaisables*. Les blocs proposés dans les tours infaisables ne reçoivent aucune récompense.
ru: Мы диктуем минимальный назначенный вес для всех раундов. Раунды, отвечающие этому требованию, называются *feasible*, а раунды, которые не соответствуют *infeasible*. Блоки, предложенные в невыполнимых раундах, не получают награды.
tr: Tüm turlar için minimum atanmış ağırlık dikte ediyoruz. Gereksinimi karşılayan turların *uygulanabilir* olduğu, karşılamayanların ise *uygunsuz* olduğu söylenir. Uygun olmayan turlarda önerilen bloklar herhangi bir ödül almaz.
vi: Chúng tôi bắt buộc khối lượng tối thiểu được chỉ định cho tất cả các vòng. Các vòng đáp ứng yêu cầu được cho là *khả thi* và các vòng không đạt là *không khả thi*. Các khối được đề xuất trong các vòng không khả thi sẽ không nhận được bất kỳ phần thưởng nào.

source: Reward Eligibility
fr: Eligibilité aux récompenses (rewards)
ru: Право на вознаграждение
tr: Ödül Uygunluğu
vi: Phần thưởng khi đủ điều kiện

source: Once a block has been proposed and enough time has passed, the history of messages can be examined to detect whether the block was indeed finalized on time, according to the conditions given above.
fr: Une fois qu'un bloc a été proposé et qu'un temps suffisant s'est écoulé, l'historique des messages peut être examiné pour détecter si le bloc a bien été finalisé à temps, selon les conditions données ci-dessus.
ru: После того, как блок был предложен и прошло достаточно времени, можно изучить историю сообщений, чтобы определить, действительно ли блок был завершен вовремя, в соответствии с условиями, приведенными выше.
tr: Bir blok önerildiğinde ve yeterli zaman geçtikten sonra, yukarıda verilen koşullara göre bloğun gerçekten zamanında tamamlanıp tamamlanmadığını tespit etmek için mesajların geçmişi incelenebilir.
vi: Khi một khối đã được đề xuất và đủ thời gian trôi qua, lịch sử của các tin có thể được kiểm tra để phát hiện xem khối có thực sự được hoàn thành đúng thời gian hay không, theo các điều kiện được đưa ra ở trên.

source: If the block is *not* finalized on time, validators do not receive any rewards. The tokens allocated for the block are simply burned.
fr: Si le bloc n'est *pas* finalisé à temps, les validateurs ne reçoivent aucune récompense. Les jetons alloués pour le bloc sont simplement brûlés.
ru: Если блок не *not* финализирован вовремя, валидаторы не получают вознаграждения. Выделенные для блока токены просто сжигаются.
tr: Blok zamanında *kesinleştirilmezse*, doğrulayıcılar herhangi bir ödül almazlar. Blok için tahsis edilen tokenler basitçe yakılır.
vi: Nếu khối *không* được hoàn thành đúng thời hạn, người xác thực sẽ không nhận được bất kỳ phần thưởng nào. Các mã thông báo được phân bổ cho khối chỉ đơn giản là bị đốt cháy.

source: If the block is finalized on time, assigned validators share the reward pro rata, regardless of whether they have sent messages or not.
fr: Si le bloc est finalisé à temps, les validateurs assignés partagent la récompense au prorata, qu'ils aient envoyé des messages ou non.
ru: Если блок финализируется вовремя, назначенные валидаторы распределяют вознаграждение пропорционально, независимо от того, отправили они сообщения или нет.
tr: Blok zamanında kesinleştirilirse, atanan doğrulayıcılar mesaj gönderip göndermediklerine bakılmaksızın ödülü orantısal olarak paylaşır.
vi: Nếu khối được hoàn thành đúng thời hạn, người xác thực được chỉ định chia sẻ tỷ lệ phần thưởng, bất kể họ đã gửi tin hay chưa.
