Repository: casper-network/docs-archive
Catalog: locale/*/LC_MESSAGES/economics/concepts.po
Languages: fr, tr, vi

source: Staking Concepts
fr: Concepts de Staking
tr: Paydaşlık Kavramları
vi: Khái niệm đặt cọc (Staking)

source: The Casper network is a Proof-of-Stake blockchain that allows validators to stake the Casper native token CSPR on the network. Validators receive CSPR as an incentive for continuing to maintain and secure the network. CSPR rewards are distributed as blocks are validated into existence and organized into eras.
fr: Le réseau Casper est une blockchain de type Proof-of-Stake (POS) qui permet aux validateurs de mettre en jeu les jetons natifs Casper CSPR sur le réseau. Les validateurs reçoivent des CSPR pour les inciter à continuer à entretenir et à sécuriser le réseau. Les récompenses CSPR sont distribuées au fur et à mesure que les blocs sont validés et organisés en ères (eras).
tr: Casper ağı, doğrulayıcıların ağ üzerinde Casper yerel tokeni olan CSPR'yi stake etmesine izin veren bir Hisse Kanıtı blokzincirdir. Doğrulayıcılar, ağın bakımını ve güvenliğini sağlamaya devam etmek için bir teşvik olarak CSPR alır. CSPR ödülleri, blokların varlığı doğrulandıkça ve dönemler halinde düzenlendikçe dağıtılır.
vi: Mạng Casper là một chuỗi khối Proof-of-Stake cho phép nhà xác thực đặt cược token gốc của Casper CSPR trên mạng. Nhà xác nhận nhận được CSPR như một động lực để tiếp tục duy trì và bảo mật mạng. Phần thưởng CSPR được phân phối khi các khối được xác thực về sự tồn tại và được tổ chức thành các kỷ nguyên hay quãng thời gian (era).

source: **Consensus mechanism:** Casper operates using a Proof-of-Stake consensus mechanism per the `Highway Protocol <https://github.com/CasperLabs/highway>`_, a specification of Correct-by-Construction Casper (CBC Casper).
fr: **Mécanisme de consensus:** Casper fonctionne à l'aide d'un mécanisme de consensus de type Proof-of-Stake selon le `Highway Protocol <https://github.com/CasperLabs/highway>`_, une spécification de Correct-by-Construction Casper (CBC Casper).
tr: **Mutabakat mekanizması:** Casper, Correct-by-Construction Casper (CBC Casper)'ın bir belirtimi olan `Highway Protokolü <https://github.com/CasperLabs/highway>`_ uyarınca bir Hisse Kanıtı mutabakat mekanizması kullanarak çalışır.
vi: **Cơ chế đồng thuận:** Casper hoạt động bằng cách sử dụng cơ chế đồng thuận Proof-of-Stake theo `Highway Protocol <https://github.com/CasperLabs/highway>` _, một đặc điểm kỹ thuật của Correct-by-Construction Casper (CBC Casper).

source: **Number of validators:** The Casper network supports up to 100 validators on the network. This number is chosen to strike a balance between performance and decentralization. This platform parameter can be increased through upgrades as development continues and performance improves. In addition, validators can stake on the Casper network through a process of permission-less bonding by participating in an auction for the validator slot.
fr: **Nombre de valideurs:** Le réseau Casper prend en charge jusqu'à 100 valideurs sur le réseau. Ce nombre est choisi pour trouver un équilibre entre les performances et la décentralisation. Ce paramètre de la plate-forme peut être augmenté par des mises à jour, à mesure que le développement se poursuit et que les performances s'améliorent. En outre, les validateurs peuvent miser sur le réseau Casper par le biais d'un processus de liaison sans permission en participant à une enchère pour ganger une place de validateur.
tr: **Doğrulayıcı sayısı:** Casper ağı, ağ üzerinde 100'e kadar doğrulayıcıyı destekler. Bu sayı, performans ve merkeziyetsizlik arasında bir denge sağlamak için seçilmiştir. Bu platform parametresi, geliştirme devam ettikçe ve performans arttıkça yükseltmeler yoluyla artırılabilir. Ek olarak, doğrulayıcılar, doğrulayıcı yuvası için bir açık arttırmaya katılarak izinsiz bir birleştirme süreci aracılığıyla Casper ağında pay sahibi olabilir.
vi: **Số lượng nhà xác thực:** Mạng Casper hỗ trợ tới 100 nhà xác nhận trên mạng. Con số này được chọn để cân bằng giữa hiệu suất và phân cấp. Tham số nền tảng này có thể được tăng lên thông qua việc nâng cấp khi quá trình phát triển tiếp tục và hiệu suất được cải thiện. Ngoài ra, nhà xác thực có thể đặt cọc trên mạng Casper thông qua quy trình cổ phần không cần cấp phép bằng cách tham gia đấu giá giành suất xác thực (validator slot).

source: **Permission-less bonding:** For validators to begin staking and earning rewards, they must win a staking auction by competing with current and prospective validators to supply one of the forthcoming top stakes for a given era. This process is permission-less, meaning validators can join and leave the auction without restrictions, except for a waiting period to unlock staked tokens.
fr: **Permission-less bonding:** Pour que les validateurs puissent commencer à staker et à gagner des récompenses, ils doivent remporter une enchère de staking en concourant avec les validateurs actuels et potentiels pour fournir l'un des meilleurs stake à venir pour une ère (era) donnée. Ce processus est sans permission, ce qui signifie que les validateurs peuvent rejoindre et quitter l'enchère sans restriction, à l'exception d'une période d'attente pour débloquer les jetons stakés.
tr: **İzinsiz bağlanma:** Doğrulayıcıların stake etmeye ve ödül kazanmaya başlaması için, belirli bir dönem için gelecek en yüksek paylardan birini sağlamak için mevcut ve olası doğrulayıcılarla rekabet ederek bir paydaşlık açık arttırması kazanmaları gerekir. Bu işlem izinsizdir, yani doğrulayıcılar, stake edilen tokenlerin kilidini açmak için bir bekleme süresi dışında herhangi bir kısıtlama olmaksızın açık arttırmaya katılabilir ve açık arttırmadan ayrılabilir.
vi: **Cổ phần cần cấp phép:** Đối với những nhà xác thực bắt đầu đặt cọc và kiếm phần thưởng, họ phải giành chiến thắng trong một cuộc đấu giá đặt cọc bằng cách cạnh tranh với những nhà xác thực tiềm năng và hiện tại khác để cung cấp một trong những cổ phần đứng đầu trong một kỷ nguyên nhất định. Quy trình này không cần sự cho phép, có nghĩa là nhà xác thực có thể tham gia và rời khỏi phiên đấu giá mà không bị hạn chế, ngoại trừ một khoảng thời gian chờ đợi để mở khóa các token đã đặt cọc.

source: **Unbonding:** To detach from the Casper network, it takes seven eras for both validators and delegators. Neither validators nor delegators receive rewards during the seven eras required for unbonding, as they are not actively contributing to the network's security during that time.
fr: **Détachement:** Pour se détacher du réseau Casper, il faut sept ères (eras) aux validateurs et aux délégués. Ni les validateurs ni les délégués ne reçoivent de récompenses pendant ces sept ères nécessaires au détachement, car ils ne contribuent pas activement à la sécurité du réseau pendant cette période.
tr: **Çözülme:** Casper ağından ayrılmak hem doğrulayıcılar hem de yetki verenler için yedi dönem alır. Ne doğrulayıcılar ne de yetki verenler, bu süre zarfında ağın güvenliğine aktif olarak katkıda bulunmadıkları için, bağın çözülmesi için gereken yedi dönem boyunca ödül almazlar.
vi: **Rút cổ phần:** Để tách khỏi mạng Casper, nhà xác thực và người ủy quyền mất 7 kỷ nguyên (7 era). Cả nhà xác thực và người ủy quyền đều không nhận được phần thưởng trong 7 kỷ nguyên chờ đợi để rút, vì họ không đóng góp tích cực vào bảo mật của mạng trong thời gian đó.

source: **Eras and block times:** An era on Casper is roughly 2 hours long. Casper's Highway protocol allows validators to propose blocks as quickly as network conditions allow, subject to a platform-wide limit that may be adjusted with upgrades. We anticipate block times to last between thirty seconds and eight minutes.
fr: **Eres et durées des blocs:** Une ère sur Casper dure environ 2 heures. Le protocole Highway de Casper permet aux validateurs de proposer des blocs aussi rapidement que les conditions du réseau le permettent, sous réserve d'une limite à l'échelle de la plate-forme qui peut être ajustée avec les mises à jour. Nous prévoyons que les blocs durent entre trente secondes et huit minutes.
tr: **Dönemler ve blok zamanları:** Casper'da bir dönem yaklaşık 2 saattir. Casper'ın Highway protokolü, doğrulayıcıların, yükseltmelerle ayarlanabilen platform çapında bir sınıra tabi olarak, ağ koşullarının izin verdiği kadar hızlı bir şekilde blok önermesine olanak tanır. Blok sürelerinin otuz saniye ile sekiz dakika arasında süreceğini tahmin ediyoruz.
vi: **Kỷ nguyên và thời gian của khối:** Một kỷ nguyên trên mạng Casper dài khoảng 2 giờ. Giao thức Highway của Casper cho phép nhà xác thực đề xuất các khối nhanh nhất khi điều kiện mạng cho phép, tùy thuộc vào giới hạn trên toàn nền tảng, giới hạn này có thể được điều chỉnh khi nâng cấp. Thời gian của khối sẽ kéo dài từ 30 giây đến 8 phút.

source: **Block rewards:** Block time is orthogonal to rewards, so there is no precise reward per block. Instead, the number of rewards is split proportionally among stakes and reduced for failure to participate in the protocol promptly.
fr: **Récompenses des blocs:** Les récompenses (rewards) ne dépendent pas de la durée des blocs , il n'y a donc pas de récompense précise par bloc. Au lieu de cela, le nombre de récompenses est réparti proportionnellement entre les enjeux et réduit en cas de non participation rapide au protocole.
tr: **Blok Ödülleri:** Blok süresi ödüllerden bağımsızdır, bu nedenle blok başına belirli bir ödül yoktur. Bunun yerine, ödüllerin sayısı paylar arasında orantılı olarak bölünür ve protokole derhal katılmaması durumunda azaltılır.
vi: **Phần thưởng khối:** Thời gian khối là tương đương với phần thưởng, vì vậy không có phần thưởng cố định cho mỗi khối. Thay vào đó, số lượng phần thưởng được chia theo tỷ lệ giữa các cổ phần và giảm đi nếu không tham gia kịp thời vào giao thức.

source: **Reward cycle:** Rewards are distributed to validators and delegators once per era.
fr: **Cycle des récompenses:** Les récompenses sont distribuées aux validateurs et aux délégataires une fois par ère.
tr: **Ödül döngüsü:** Ödüller, doğrulayıcılara ve yetki verenlere dönem başına bir kez dağıtılır.
vi: **Chu kỳ phần thưởng:** Phần thưởng được phân phối cho nhà xác nhận và người ủy quyền một lần trong mỗi kỷ nguyên.

source: **Token supply and inflation:** Mainnet launched with ten billion CSPR at the time of genesis. The target annual supply growth rate is 8%.
fr: **Approvisionnement en jetons et inflation:** Le Mainnet a été lancé avec dix milliards de CSPR au moment de la genèse (Genesis). Le taux de croissance annuel cible de l'offre est de 8%.
tr: **Token arzı ve enflasyon:** Mainnet, oluşum anında on milyar CSPR ile piyasaya sürüldü. Hedeflenen yıllık arz büyüme oranı %8'dir.
vi: **Chu kỳ phần thưởng:** Mainnet ra mắt với 10 tỷ CSPR vào thời điểm ra đời. Mục tiêu tăng trưởng nguồn cung hàng năm là 8%.

source: **Annual reward percentage:** Validators on the Casper network earn between 10% and 20% of their staked CSPR in the first year of the Mainnet operation, with regular participation under expected network conditions. The growth of individual stakes is dependent on total active stake, as only a fixed number of tokens is created per era.
fr: **Pourcentage de récompense annuel: ARP** Les validateurs du réseau Casper gagnent entre 10 et 20 % de leurs CSPR misés au cours de la première année d'exploitation du Mainnet, avec une participation régulière dans les conditions prévues du réseau. La croissance des mises individuelles dépend de la mise active totale, car seul un nombre fixe de jetons est créé par ère.
tr: **Yıllık ödül yüzdesi:** Casper ağındaki doğrulayıcılar, beklenen ağ koşulları altında düzenli katılımla, Mainnet işleminin ilk yılında ağa yatırılmış CSPR'lerinin %10 ila %20'sini kazanır. Dönem başına yalnızca sabit sayıda token oluşturulduğundan, bireysel payların büyümesi toplam aktif hisseye bağlıdır.
vi: **Phần trăm phần thưởng hàng năm:** Nhà xác thực trên mạng Casper kiếm được từ 10% đến 20% số CSPR họ đặt cọc trong năm hoạt động đầu tiên của Mainnet, nếu tham gia thường xuyên trong các điều kiện mạng ổn định. Sự tăng trưởng của các cổ phần nói riêng phụ thuộc vào tổng số cổ phần đang hoạt động, vì chỉ có một số lượng token cố định được tạo ra trong mỗi kỷ nguyên.

source: Please visit the `Staking Guide <https://docs.casperlabs.io/en/latest/staking/index.html>`_ for further details on the staking mechanism.
fr: Consulter le `Guide du staking <https://docs.casperlabs.io/en/latest/staking/index.html>`_ pour plus de détails sur le mécanisme de staking.
tr: Paydaşlık mekanizması hakkında daha fazla bilgi için lütfen `Paydaşlık Kılavuzu <https://docs.casperlabs.io/en/latest/staking/index.html>`_ sayfasını ziyaret edin.
vi: Vui lòng truy cập `Hướng dẫn đặt cược <https://docs.casperlabs.io/en/latest/staking/index.html>`_ để biết thêm chi tiết về cơ chế đặt cọc.
