Repository: casper-network/docs-archive
Catalog: locale/*/LC_MESSAGES/economics/consensus.po
Languages: fr, tr, vi

source: The participation schedule is segmented into rounds, which are allocated dynamically according to the validators' exponents and a deterministic (randomized at era start) assignment of validators to milliseconds of an era. Thus, a validator with the round exponent ``n`` must participate in rounds that repeat every ``2^n`` ticks.
fr: Le calendrier de participation est segmenté en tours, qui sont alloués dynamiquement en fonction des exposants des validateurs et d'une affectation déterministe (randomisée au début de l'ère) des validateurs aux millisecondes d'une ère. Ainsi, un validateur avec l'exposant de tour ``n`` doit participer à des tours qui se répètent tous les ``2^n`` ticks.
tr: Katılım takvimi, doğrulayıcıların üslerine ve doğrulayıcıların bir dönemin milisaniyelerine deterministik (dönem başlangıcında rastgele) atanmasına göre dinamik olarak tahsis edilen turlara bölünmüştür. Bu nedenle, ``n`` tur üslü bir doğrulayıcı, her ``2^n`` sürelerini tekrarlayan turlara katılmalıdır.
vi: Lịch trình tham gia được phân đoạn thành các vòng, các vòng được phân bổ theo số mũ của nhà xác thực và sự phân công (ngẫu nhiên khi bắt đầu một kỷ nguyên) của nhà xác thực tính theo mili giây của một kỷ nguyên. Do đó, một người xác thực với số mũ vòng ``n`` phải tham gia vào các vòng lặp lại sau mỗi ``2^n`` tích tắc.

source: Each validator is assessed according to its round exponent. All assigned validators become eligible to receive tokens as long as the block gets finalized with messages sent within each validator's round.
fr: Chaque validateur est évalué en fonction de son exposant de tour. Tous les validateurs assignés deviennent éligibles pour recevoir des jetons tant que le bloc est finalisé avec des messages envoyés pendant le tour de chaque validateur.
tr: Her doğrulayıcı, tur üssüne göre değerlendirilir. Atanan tüm doğrulayıcılar, blok, her bir doğrulayıcının turunda gönderilen mesajlarla kesinleştirildiği sürece tokenleri almaya hak kazanır.
vi: Mỗi nhà xác thực được đánh giá theo số mũ vòng của họ. Tất cả những nhà xác thực được chỉ định đều đủ điều kiện để nhận token miễn là khối được hoàn thiện với các tin nhắn được gửi đi trong mỗi vòng của nhà xác thực.

source: Eligibility
fr: Eligibilité
tr: Uygunluk
vi: Tính hợp lệ

source: Once a block has been proposed and enough time has passed, the history of protocol messages can be examined to detect whether the block was finalized on time, according to the conditions given above. If the block was *not* finalized on time, validators receive a fraction of the expected tokens, governed by the ``reduced_reward_multiplier`` chainspec parameter. If the block was finalized on time, assigned validators share the reward proportionally to their stake, regardless of whether they have sent messages or not.
fr: Une fois qu'un bloc a été proposé et qu'un temps suffisant s'est écoulé, l'historique des messages du protocole peut être examiné pour détecter si le bloc a été finalisé à temps, selon les conditions données ci-dessus. Si le bloc n'a *pas* été finalisé à temps, les validateurs reçoivent une fraction des jetons attendus, régie par le paramètre de chainspec ``reduced_reward_multiplier``. Si le bloc a été finalisé à temps, les validateurs assignés se partagent la récompense proportionnellement à leur mise, qu'ils aient envoyé des messages ou non.
tr: Bir blok önerildiğinde ve yeterli zaman geçtikten sonra, yukarıda verilen koşullara göre bloğun zamanında kesinleşip kesinleşmediğini tespit etmek için protokol mesajlarının geçmişi incelenebilir. Blok zamanında *kesinleştirilmemişse*, doğrulayıcılar, ``reduced_reward_multiplier`` chainspec parametresi tarafından yönetilen, beklenen tokenlerin bir kısmını alır. Blok zamanında sonuçlandırıldıysa, atanan doğrulayıcılar, mesaj gönderip göndermediklerine bakılmaksızın ödülü paylarıyla orantılı olarak paylaşır.
vi: Khi một khối được đề xuất và đã đủ thời gian trôi qua, lịch sử của các thông điệp giao thức có thể được kiểm tra để phát hiện xem khối đã được hoàn thành đúng thời hạn hay chưa, theo các điều kiện đưa ra ở trên. Nếu khối *không* được hoàn thành đúng thời hạn, nhà xác thực sẽ chỉ nhận được một phần nhỏ trong số các token dự kiến, được điều chỉnh bởi tham số chainpec ``reduced_reward_multiplier``. Nếu khối được hoàn thành đúng thời hạn, những nhà xác thực được chỉ định chia sẻ phần thưởng tương ứng với số cổ phần của họ, bất kể họ có gửi tin nhắn hay không.

source: Inactivity
fr: Inactivité
tr: Durgunluk
vi: Không hiện hoạt

source: Validators who send no messages during an entire era are marked as inactive and cease participating in the auction until they send a special deploy that reactivates their bid.
fr: Les validateurs qui n'envoient aucun message pendant toute une ère sont marqués comme inactifs et cessent de participer à l'enchère jusqu'à ce qu'ils envoient un déploiement spécial qui réactive leur offre.
tr: Tüm bir dönem boyunca mesaj göndermeyen doğrulayıcılar, durgun olarak işaretlenir ve tekliflerini yeniden etkinleştiren özel bir konuşlandırma gönderene kadar açık arttırmaya katılmayı bırakır.
vi: Những nhà xác thực không gửi tin nhắn nào trong suốt quãng thời gian được đánh dấu là không hiện hoạt và ngừng tham gia đấu giá cho đến khi họ gửi một triển khai đặc biệt để kích hoạt lại giá thầu của mình.

source: Slashing
tr: Kesme (slashing)
vi: Slashing – Phạt trừ

source: Please review our `Equivocator Policy <https://github.com/CasperLabs/ceps/blob/master/text/0038-equivocator-policy.md>`_. We are currently conducting research into the utility of slashing as an incentive mechanism.
fr: Veuillez consulter notre `Politique en matière d'équivoque <https://github.com/CasperLabs/ceps/blob/master/text/0038-equivocator-policy.md>`_. Nous menons actuellement des recherches sur l'utilité du slashing comme mécanisme d'incitation.
tr: Lütfen `Equivocator Policy <https://github.com/CasperLabs/ceps/blob/master/text/0038-equivocator-policy.md>`_ inceleyin. Şu anda bir teşvik mekanizması olarak kesmenin faydasına dair araştırmalar yürütüyoruz.
vi: Vui lòng xem lại `Chính sách ngăn chặn hành vi bất thường <https://github.com/CasperLabs/ceps/blob/master/text/0038-equivocator-policy.md>`. Chúng tôi hiện đang tiến hành nghiên cứu về các tiện ích của slashing để xây dựng một cơ chế khuyến khích.

source: Founding validators
fr: Validateurs fondateurs
tr: Kurucu doğrulayıcılar
vi: Nhà xác thực sáng lập

source: Founding validators are subject to token lock-up, which prevents them from withdrawing any tokens from their bids for 90 days, then releases their genesis bid tokens in weekly steps, linearly, over an additional 90 days.
fr: Les validateurs fondateurs sont soumis à un verrouillage des jetons, qui les empêche de retirer des jetons de leurs offres pendant 90 jours, puis libèrent leurs jetons d'offre de genèse par étapes hebdomadaires, de manière linéaire, sur 90 jours supplémentaires.
tr: Kurucu doğrulayıcılar, 90 gün boyunca tekliflerinden herhangi bir token çekmelerini engelleyen token kilitlenmesine tabidir, ardından genesis teklif tokenlerini ek bir 90 gün boyunca doğrusal olarak haftalık adımlarla serbest bırakırlar.
vi: Nhà xác thực sáng lập buộc phải khóa token, để ngăn cản họ rút bất kỳ token nào khỏi giá thầu của mình trong vòng 90 ngày, sau đó phát hành token giá thầu ban đầu của họ theo các đợt hàng tuần, cứ như vậy trong vòng 90 ngày tiếp theo
