Repository: casper-network/docs-archive
Catalog: locale/*/LC_MESSAGES/economics/consensus.po
Languages: fr, tr, vi

source: Consensus Economics
fr: Économie du Consensus
tr: Mutabakat Ekonomisi
vi: Tính kinh tế của Đồng thuận

source: Highway consensus is a continuous, trust-less process where a fixed set of validators engage in scheduled communication to advance the linear chain of finalized blocks, representing the history of changes to the global state of the blockchain. The fixed set of validators may change at each era boundary. The economics of this layer revolve around validator selection and incentivization of participation according to the schedule.
fr: Le consensus Highway est un processus continu et sans confiance dans lequel un ensemble fixe de validateurs s'engage dans une communication programmée pour faire avancer la chaîne linéaire de blocs finalisés, représentant l'historique des changements de l'état global de la blockchain. L'ensemble fixe de validateurs peut changer à chaque limite d'ère. L'économie de cette couche tourne autour de la sélection des validateurs et de l'incitation à la participation selon le calendrier.
tr: Highway mutabakatı, blokzincirin küresel durumundaki değişikliklerin geçmişini temsil eden, kesinleşmiş blokların doğrusal zincirini ilerletmek için sabit bir doğrulayıcı grubunun planlı iletişimde bulunduğu sürekli, güvene dayalı olmayan bir süreçtir. Sabit doğrulayıcı seti, her dönem sınırında değişebilir. Bu katmanın ekonomisi, doğrulayıcı seçimi ve programa göre katılımın teşvik edilmesi etrafında döner.
vi: Giao thức Đồng thuận Highway của Casper là một quá trình liên tục, không cần ủy quyền, trong đó một tập hợp các nhà xác thực nhất định tham gia vào giao tiếp theo lịch trình để thúc đẩy chuỗi tuyến tính của các khối đã hoàn thành, thể hiện lịch sử của những thay đổi trong trạng thái toàn cục của chuỗi khối. Tính kinh tế của Đồng thuận Highway có được là từ việc lựa chọn nhà xác thực và khuyến khích sự tham gia theo lịch trình.

source: Entry
fr: Entrée
tr: Girdi
vi: Điểm vào

source: After genesis, the system selects a set of validators using a stake auction process. The auction takes place in the last block of an era, also called a switch block. An auction contract governs the validator selection process, and a *chainspec* configuration file specifies a few key parameters:
fr: Après la genèse (Genesis), le système sélectionne un ensemble de validateurs à l'aide d'un processus d'enchères de mise (stake). L'enchère a lieu dans le dernier bloc d'une ère, également appelé bloc de commutation (switch block). Un contrat d'enchères régit le processus de sélection des validateurs, et un fichier de configuration *chainspec* spécifie quelques paramètres clés :
tr: Doğuş (genesis) sonrası sistem, bir açık arttırma süreci kullanarak bir dizi doğrulayıcı seçer. Açık arttırma, geçiş bloğu olarak da adlandırılan bir dönemin son bloğunda gerçekleşir. Doğrulayıcı, seçim sürecini bir açık artırma kontratı yönetir ve bir *chainspec* yapılandırma dosyası birkaç temel parametreyi belirtir:
vi: Sau khi khởi tạo, hệ thống chọn một tập hợp những nhà xác thực bằng cách sử dụng quá trình đấu giá cổ phần. Cuộc đấu giá diễn ra trong khối cuối cùng tại kỷ nguyên đó (era), hay còn được gọi là khối chuyển đổi. Hợp đồng đấu giá điều chỉnh quá trình lựa chọn nhà xác thực và tệp cấu hình *chainspec* sẽ chỉ định một số thông số chính, bao gồm:

source: The ``auction_delay`` specifies the amount of time that needs to pass before the system enables a new set of validators. For example, the `auction_delay` is 1 for Mainnet. Therefore, after a delay of 1 era, the winning validators become the validating set for the new era.
fr: Le ``auction_delay`` indique le temps qui doit s'écouler avant que le système n'active un nouvel ensemble de validateurs. Par exemple, le ``auction_delay`` est de 1 pour Mainnet. Par conséquent, après un délai de 1 ère, les validateurs gagnants deviennent le jeu de validateurs pour la nouvelle ère.
tr: ``auction_delay``, sistemin yeni bir doğrulayıcı kümesini etkinleştirmesi için geçmesi gereken süreyi belirtir. Örneğin, `auction_delay`, Mainnet için 1'dir. Bu nedenle, 1 dönem gecikmesinden sonra, kazanan doğrulayıcılar yeni dönem için doğrulama seti olur.
vi: ``auction_delay`` chỉ định lượng thời gian phải trôi qua trước khi hệ thống cho phép một tập hợp những nhà xác thực mới hoạt động. Ví dụ: `auction_delay` là 1 trên Mainnet. Sau 1 quãng thời gian bị trì hoãn, những nhà xác thực chiến thắng sẽ trở thành nhà xác thực cho kỷ nguyên (era) mới.

source: The ``validator_slots`` parameter specifies how many validators can win an auction. The auction selects a fixed number of validators based on their highest bids.
fr: Le paramètre ``validator_slots`` indique le nombre de validateurs pouvant remporter une enchère. L'enchère sélectionne un nombre fixe de validateurs en fonction des mises (bids) les plus élevées.
tr: ``validator_slots`` parametresi, bir açık arttırmayı kaç doğrulayıcının kazanabileceğini belirtir. Açık arttırma, en yüksek tekliflerine göre sabit sayıda doğrulayıcı seçer.
vi: ``validator_slots`` chỉ số lượng nhà xác thực có thể thắng một cuộc đấu giá. Phiên đấu giá chọn một số lượng nhà xác thực nhất định dựa trên giá thầu (bid) cao nhất của họ.

source: Bids
fr: Offres (Bids)
tr: Teklifler
vi: Giá thầu

source: Each bid is a collection of tokens from a prospective or current validator and its delegators, considered in the auction as a single total. Bids and delegations can increase freely, but withdrawals are subject to an unbonding period governed by the ``unbonding_delay`` chainspec parameter. Tokens that are in the unbonding period are not part of the sum total considered in the auction. Consequently, the exact amount of the bid, which translates into protocol weight for winning validators, can vary within an era. The bids are visible in the switch block that determines the winners.
fr: Chaque offre est un ensemble de jetons provenant d'un validateur potentiel ou actuel et de ses délégués, considérés dans l'enchère comme un seul total. Les offres et les délégations peuvent augmenter librement, mais les retraits sont soumis à une période de désolidarisation régie par le paramètre chainspec ``unbonding_delay``. Les jetons qui se trouvent dans la période de désolidarisation ne font pas partie de la somme totale prise en compte dans l'enchère. Par conséquent, le montant exact de l'enchère, qui se traduit par un poids protocolaire pour les validateurs gagnants, peut varier au cours d'une ère. Les enchères sont visibles dans le bloc de commutation qui détermine les gagnants.
tr: Her bir teklif, müstakbel veya mevcut bir doğrulayıcıdan ve açık arttırmada tek bir toplam olarak kabul edilen temsilcilerden oluşan bir token koleksiyonudur. Teklifler ve yetkilendirmeler serbestçe artabilir, ancak geri çekme işlemleri, ``unbonding_delay`` zincir belirtimi parametresi tarafından yönetilen bir çözülme süresine tabidir. Çözülme döneminde olan jetonlar, açık arttırmada dikkate alınan toplamın bir parçası değildir. Sonuç olarak, kazanan doğrulayıcılar için protokol ağırlığına dönüşen teklifin kesin miktarı bir dönem içinde değişebilir. Teklifler, kazananları belirleyen geçiş bloğunda görünür.
vi: Mỗi giá thầu (bid) là một tập hợp các token từ một nhà xác thực tiềm năng hoặc hiện có và những người ủy quyền, trong cuộc đấu giá thầu được coi là một số tổng duy nhất. Giá thầu và ủy quyền có thể tăng tự do, nhưng việc rút ra phải trải qua khoảng thời gian không ràng buộc được điều chỉnh bởi tham số ``unbonding_delay`` của chainpec. Các token đang trong thời gian không ràng buộc này không được coi là một phần trong tổng số tiền được xem xét trong cuộc đấu giá. Do đó, số tiền chính xác của giá thầu (được chuyển thành trọng số cho những nhà xác thực chiến thắng), có thể thay đổi trong một kỷ nguyên. Giá thầu sẽ được hiển thị trong khối chuyển đổi để xác định người chiến thắng.

source: Each bid contains a delegation rate and activity status. The delegation rate can change at any time. Both of these properties are described further in this document.
fr: Chaque offre contient un taux de délégation et un statut d'activité. Le taux de délégation peut changer à tout moment. Ces deux propriétés sont décrites plus loin dans ce document.
tr: Her teklif, bir yetkilendirme oranı ve etkinlik durumu içerir. Yetkilendirme oranı herhangi bir zamanda değişebilir. Bu özelliklerin her ikisi de bu belgede daha ayrıntılı olarak açıklanmaktadır.
vi: Mỗi giá thầu bao gồm một tỷ lệ ủy quyền và trạng thái hoạt động. Tỷ lệ ủy quyền có thể thay đổi bất kỳ lúc nào. Cả hai thuộc tính này đều được mô tả thêm trong tài liệu này.

source: Delegation
fr: Délégation
tr: Yetkilendirme (Delegasyon)
vi: Ủy quyền

source: Delegation allows third parties to participate in consensus by adding weight to their preferred validators. Rewards received by validators are distributed in proportion to tokens bid and delegated. The current or prospective validator responsible for the bid receives a portion of the delegator rewards set by the delegation rate.
fr: La délégation permet à des tiers de participer au consensus en ajoutant du poids à leurs validateurs préférés. Les récompenses reçues par les validateurs sont distribuées en proportion des jetons offerts et délégués. Le validateur actuel ou futur responsable de l'offre reçoit une partie des récompenses du délégataire fixées par le taux de délégation.
tr: Yetkilendirme, üçüncü tarafların tercih ettikleri doğrulayıcılara ağırlık ekleyerek mutabakata izin verir. Doğrulayıcılar tarafından alınan ödüller, teklif edilen ve devredilen tokenlerle orantılı olarak dağıtılır. Tekliften sorumlu mevcut veya olası doğrulayıcı, yetkilendirme oranı tarafından belirlenen yetki veren ödüllerinin bir kısmını alır.
vi: Ủy quyền cho phép các bên thứ ba tham gia vào đồng thuận bằng cách thêm trọng số vào những nhà xác thực ưu tiên của mình. Phần thưởng mà nhà xác thực nhận được sẽ được phân phối theo tỷ lệ giữa token được bán và token được ủy quyền. Nhà xác thực hiện tại hoặc tiềm năng chịu trách nhiệm về giá chào mua (bid) sẽ nhận được một phần thưởng của người ủy quyền theo tỷ lệ ủy quyền.

source: Currently, delegation is unrestricted. Interested readers should review `CEP #29 <https://github.com/CasperLabs/ceps/pull/29>`_, which proposes delegation caps.
fr: Actuellement, la délégation est sans restriction. Les lecteurs intéressés peuvent consulter `CEP #29 <https://github.com/CasperLabs/ceps/pull/29>`_, qui propose des plafonds de délégation.
tr: Şu anda, yetkilendirme sınırsızdır. İlgilenen okuyucular, yetki sınırları öneren `CEP #29 <https://github.com/CasperLabs/ceps/pull/29>`_ kısmını incelemelidir.
vi: Hiện tại, ủy quyền không bị hạn chế. Độc giả quan tâm vui lòng xem lại `CEP #29 <https://github.com/CasperLabs/ceps/pull/29>` về giới hạn ủy quyền

source: Incentives
fr: Incitations
tr: Teşvikler
vi: Khuyến khích

source: Correct operation of the Highway protocol requires the economics of the platform to incentivize non-equivocation for safety and participation for liveness. Participation consists of on-time block proposals and timely responses to block proposals.
fr: Le bon fonctionnement du protocole Highway exige que l'économie de la plateforme récompense la ''non-equivocation'' pour la sécurité et la participation pour la vivacité du réseau. La participation consiste à proposer des blocs à temps et à répondre à temps aux propositions de blocs.
tr: Highway protokolünün doğru çalışması, platformun ekonomisinin güvenlik için belirsizlikten kaçınmayı ve canlılık için katılımı teşvik etmesini gerektirir. Katılım, zamanında yapılan blok tekliflerden ve blok tekliflere zamanında verilen yanıtlardan oluşur.
vi: Việc vận hành chính xác giao thức Highway đòi hỏi tính kinh tế của nền tảng Mạng Casper, để làm sao vừa chú trọng đến sự an toàn vừa khuyến khích sự tham gia mạnh mẽ để hệ thống hoạt động. Sự tham gia này bao gồm đề xuất khối đúng hạn và phản hồi kịp thời cho các đề xuất khối.

source: Safety may be incentivized through slashing for equivocation. This feature is currently disabled but may be reactivated in the future.
fr: La sécurité peut être encouragée par le biais du 'slashing for equivocation'. Cette fonctionnalité est actuellement désactivée mais pourrait être réactivée à l'avenir.
tr: Güvenlik, çelişkili davranış için kesme yoluyla teşvik edilebilir. Bu özellik şu anda devre dışıdır ancak gelecekte yeniden etkinleştirilebilir.
vi: Mục tiêu an toàn có thể được khuyến khích thông qua slashing – hình phạt trừ tài sản để ngăn chặn các hành vi bất thường. Tính năng này hiện đã bị vô hiệu hóa nhưng có thể được kích hoạt lại trong tương lai.

source: The network incentivizes participation by scaling rewards for on-time proposals and responses, taking into account the speed of finalizing blocks. All rewards are added directly to the corresponding bids and delegations.
fr: Le réseau incite à la participation en échelonnant les récompenses pour le respect des délais des propositions et des réponses, en tenant compte de la vitesse de finalisation des blocs. Toutes les récompenses sont ajoutées directement aux offres et délégations correspondantes.
tr: Ağ, blokları kesinleştirme hızını hesaba katarak, zamanında teklifler ve yanıtlar için ödülleri ölçeklendirerek katılımı teşvik eder. Tüm ödüller, doğrudan ilgili tekliflere ve yetkilendirmelere eklenir.
vi: Mạng Casper khuyến khích sự tham gia bằng cách tăng phần thưởng cho các đề xuất và phản hồi đúng hạn, có tính đến tốc độ hoàn thiện các khối. Tất cả phần thưởng được thêm trực tiếp vào giá thầu và ủy quyền tương ứng.

source: Participation
tr: Katılım
vi: Sự tham gia

source: Issuance of new tokens and their distribution to validators incentivizes work even under low transaction load.
fr: L'émission de nouveaux jetons et leur distribution aux validateurs incitent à travailler même en cas de faible charge de transaction.
tr: Yeni tokenlerin verilmesi ve doğrulayıcılara dağıtılması, düşük işlem yükü altında bile çalışmayı teşvik eder.
vi: Việc phát hành các token mới và phân phối chúng tới những nhà xác thực sẽ khuyến khích hoạt động ngay cả khi số lượng các giao dịch thấp.

source: CSPR is issued at a fixed rate and distributed to validators (and, indirectly, delegators) in proportion to their stake. This is analogous to block rewards in Proof-of-Work blockchains, outlining the following:
fr: Les CSPR sont émis à un taux fixe et distribués aux validateurs (et, indirectement, aux délégués) en proportion de leur mise. Ceci est analogue aux récompenses de bloc dans les blockchains Proof-of-Work, en décrivant ce qui suit :
tr: CSPR sabit bir oranda verilir ve doğrulayıcılara (ve dolaylı olarak yetki verenlere) paylarıyla orantılı olarak dağıtılır. Bu, Proof-of-Work blokzincirlerindeki ödüllere benzer ve aşağıdakileri özetler:
vi: CSPR được phát hành với tỷ lệ cố định và được phân phối cho nhà xác thực (và người ủy quyền) theo tỷ lệ cổ phần của họ. Cơ chế này giống với trao phần thưởng trong cơ chế Proof-of-Work của chuỗi khối ở những điểm sau:

source: The growth of CSPR supply is exponential
fr: La croissance de l'offre de CSPR est exponentielle.
tr: CSPR arzının büyümesi üsteldir
vi: Nguồn cung cấp CSPR tăng trưởng theo cấp số nhân

source: Issuance takes into account slashed CSPR
fr: L'émission tient compte de la réduction du CSPR due au slashing
tr: Emisyon, kesilmiş (slashed) CSPR'yi dikkate alır
vi: Việc phát hành có tính đến các CSPR bị slashing (bị phạt trừ)

source: With slashing disabled, we can compute block rewards starting with the formula below, where we have these parameters:
fr: Avec le 'slashing' désactivé, nous pouvons calculer les récompenses par blocs à l'aide de la formule ci-dessous, avec ces paramètres :
tr: Kesme devre dışı iken, aşağıdaki formülden başlayarak blok ödüllerini hesaplayabiliriz, ki burada şu parametrelere sahibiz:
vi: Khi tắt tính năng slashing, chúng ta có thể tính toán phần thưởng khối bằng công thức bên dưới, trong đó:

source: ``i`` - the era's index as a positive integer [0, 1, 2, ..., n]
fr: ``i`` - l'indice de l'ère , nombre entier positif [0, 1, 2, ..., n]
tr: ``i`` - pozitif bir tamsayı olarak dönemin indeksi [0, 1, 2, ..., n]
vi: ``i`` - chỉ số của kỷ nguyên dưới dạng số nguyên dương [0, 1, 2,…, n]

source: ``initial_supply`` - the number of CSPR at genesis
fr: ``initial_supply`` - le nombre de CSPR à la genèse (Genesis).
tr: ``initial_supply`` - genesisteki CSPR sayısı
vi: ``initial_supply`` - số lượng CSPR tại thời điểm ban đầu

source: ``issuance_rate`` - the annual rate at which new CSPR tokens are minted
fr: ``issuance_rate`` - le taux annuel auquel les nouveaux jetons CSPR sont émis (minted).
tr: ``issuance_rate`` - yeni CSPR tokenlerinin basıldığı yıllık oran
vi: ``issuance_rate`` - tỷ lệ hàng năm để mint các token CSPR mới

source: ``ticks_per_year`` - a number equal to 31,536,000,000 calculated as 365*24*60*60*1000 = 31,536,000,000
fr: ``ticks_per_year`` - un nombre égal à 31 536 000 000 calculé comme suit : 365*24*60*60*1000 = 31 536 000 000
tr: ``ticks_per_year`` - 365*24*60*60*1000 = 31.536.000.000 olarak hesaplanan 31.536.000.000'a eşit bir sayı
vi: ``ticks_per_year`` - số 31,536,000,000 được tính như sau: 365*24*60*60*1000 = 31,536,000,000

source: We introduce the *round issuance rate* (corresponding to the chainspec parameter ``round_seigniorage_rate``) with this formula:
fr: Nous introduisons le *round issuance rate* (correspondant au paramètre chainspec ``round_seigniorage_rate``) avec cette formule :
tr: Bu formülle *tur emisyon oranını* (zincir belirtimi parametresi ``round_seigniorage_rate``e karşılık gelir) sunuyoruz:
vi: Chúng tôi giới thiệu *tỷ lệ của vòng phát hành* (tương ứng với tham số chainpec ``round_seigniorage_rate``) với công thức sau:

source: The *round issuance rate* is the annual issuance rate adjusted to a single round of length determined by the chainspec parameter ``minimum_round_exponent``. For illustration, an exponent of 14 corresponds to a round length of roughly 16 seconds.
fr: Le *round issuance rate* est le taux d'émission annuel ajusté à un seul tour d'une longueur déterminée par le paramètre chainspec ``minimum_round_exponent``. À titre d'exemple, un exposant de 14 correspond à une durée de tour d'environ 16 secondes.
tr: *turemisyon oranı*, zincir belirtimi parametresi ``minimum_round_exponent`` tarafından belirlenen tek bir uzunluğa ayarlanan yıllık emisyon oranıdır. Örnek olarak, 14'ün üssü, kabaca 16 saniyelik bir tur uzunluğuna karşılık gelir.
vi: *Tỷ lệ của vòng phát hành* là tỷ lệ phát hành hàng năm được điều chỉnh theo một vòng có độ dài được xác định bởi tham số chainpec ``minimum_round_exponent``. Ví dụ, số mũ 14 tương ứng với độ dài vòng khoảng 16 giây.

source: Finally, the base round reward is computed as:
fr: Enfin, la récompense du tour de base est calculée comme suit :
tr: Son olarak, temel tur ödülü şu şekilde hesaplanır:
vi: Cuối cùng, phần thưởng của vòng cơ sở được tính như sau:

source: This value gives us the maximum amount of CSPR that the validators can collectively receive from a proposed block.
fr: Cette valeur nous donne la quantité maximale de CSPR que les validateurs peuvent collectivement recevoir d'un bloc proposé.
tr: Bu değer bize doğrulayıcıların önerilen bir bloktan toplu olarak alabileceği maksimum CSPR miktarını verir.
vi: Giá trị này cung cấp cho chúng ta số lượng CSPR tối đa mà nhà xác thực có thể nhận được từ một khối được đề xuất.

source: Distribution
tr: Dağıtım
vi: Phân phối

source: Validators receive tokens for proposing and finalizing blocks according to their performance. The concept of weight is crucial for understanding this distribution scheme:
fr: Les validateurs reçoivent des jetons pour récompenser la proposition et finalisation des blocs en fonction de leurs performances. Le concept de poids est crucial pour comprendre ce schéma de distribution :
tr: Doğrulayıcılar, performanslarına göre blok önermek ve sonuçlandırmak için tokenler alır. Ağırlık kavramı, bu dağıtım şemasını anlamak için çok önemlidir:
vi: Nhà xác thực nhận được token nếu đề xuất và hoàn thiện các khối, tùy theo hiệu suất của mình. Cần hiểu khái niệm trọng số trong sơ đồ phân phối này:

source: **Weight:** A validator's bonded stake, used in consensus
fr: **Poids:** Un enjeu (bonded stake) lié au validateur, utilisé dans le consensus.
tr: **Ağırlık:** Bir onaylayıcının, mutabakatta kullanılan bağlı hissesi
vi: **Trọng số:** Cổ phần được đảm bảo của người xác thực, được sử dụng trong đồng thuận

source: **Assigned weight of a block/round:** The total stake of validators scheduled to participate in a block
fr: **Poids assigné d'un bloc/tour:** La mise totale des validateurs prévus pour participer à un bloc.
tr: **Bir blok/turun atanan ağırlığı:** Bir bloğa katılması planlanan doğrulayıcıların toplam hissesi
vi: **Trọng số được chỉ định của một khối/một vòng:** Tổng số cổ phần của những nhà xác thực được lên lịch tham gia vào một khối

source: **Participated weight of a block/round:** The total stake of validators that end up participating or sending messages to finalize a block before the end of their respective round
fr: **Poids des participants d'un bloc/tour:** La participation totale des validateurs qui finissent par participer ou envoyer des messages pour finaliser un bloc avant la fin de leur tour (round) respectif.
tr: **Bir bloğun/turun katılım ağırlığı:** İlgili turun bitiminden önce bir bloğu kesinleştirmek için katılan veya mesaj gönderen onaylayıcıların toplam hissesi
vi: **Trọng số đã tham gia của một khối/một vòng:** Tổng số cổ phần của những nhà xác thực đã ngừng tham gia hoặc gửi tin nhắn hoàn thành một khối trước khi kết thúc vòng tương ứng của mình

source: To determine eligibility, we look at **on-time finalization (OTF)**. Validators should finalize blocks on time by sending required messages before the end of their respective round.
fr: Pour déterminer l'éligibilité, nous examinons la **finalisation à temps (OTF)** (on-time finalization ). Les validateurs doivent finaliser les blocs à temps en envoyant les messages requis avant la fin de leur tour respectif.
tr: Uygunluğu belirlemek için **zamanında sonuçlandırmaya (OTF)** bakarız. Doğrulayıcılar, ilgili turların bitiminden önce gerekli mesajları göndererek blokları zamanında kesinleştirmelidir.
vi: Để xác định tính hợp lệ, chúng tôi xem xét việc **hoàn thành đúng hạn (OTF)**. Nhà xác thực cần hoàn thành các khối đúng hạn bằng cách gửi các tin nhắn được yêu cầu trước khi kết thúc vòng tương ứng.

source: Switch blocks are not visible to the issuance calculation (as this calculation is performed in the switch block itself for each era), and, consequently, no tokens are issued for switch blocks.
fr: Les blocs de commutation ne sont pas visibles pour le calcul d'émission (car ce calcul est effectué dans le bloc de commutation lui-même pour chaque ère), et, par conséquent, aucun jeton n'est émis pour les blocs de commutation.
tr: Geçiş blokları, emisyon hesaplaması tarafından görülmez (bu hesaplama her dönem için geçiş bloğunun kendisinde yapıldığından) ve sonuç olarak, geçiş blokları için token verilmez.
vi: Các khối chuyển đổi không được thể hiện thông qua các phép tính phát hành (vì phép tính này được thực hiện trong chính khối chuyển đổi trong mỗi kỷ nguyên) và do đó, không có token nào được phát hành cho các khối chuyển đổi.

source: Participation schedule
fr: Calendrier de participation
tr: Katılım takvimi
vi: Lịch trình tham gia
