Repository: casper-network/docs-archive
Catalog: locale/*/LC_MESSAGES/economics/index.po
Languages: fr, tr, vi

source: Overview
fr: Présentation générale
tr: Genel Bakış
vi: Tổng quan

source: Economics
fr: Économie
tr: Ekonomi
vi: Mô hình kinh tế

source: This page presents an overview of the Casper economics.
fr: Cette page présente une vue d'ensemble de la dimension économique de Casper.
tr: Bu sayfada Casper ekonomisine genel bir bakış sunulmaktadır.
vi: Trang này trình bày tổng quan về mô hình kinh tế của Casper.

source: Casper's economic activity can be conceptualized as taking place on four distinct layers: consensus, runtime, ecosystem, and the macroeconomy. Each layer, consensus and up, provides a foundation for the activity taking place on the next layer. A trust-less platform requires that proper incentives be provided to participants operating each of these layers to ensure that they work together to unlock the platform's value.
fr: L'activité économique de Casper peut être conceptualisée comme se déroulant sur quatre couches distinctes : le consensus, le runtime, l'écosystème et la macroéconomie. Chaque couche, à partir du consensus, fournit une base pour l'activité qui se déroule sur la couche suivante. Une plateforme sans confiance exige que des incitations appropriées soient fournies aux participants opérant chacune de ces couches afin de s'assurer qu'ils travaillent ensemble pour débloquer la valeur de la plateforme.
tr: Casper'ın ekonomik faaliyeti dört farklı katmanda kavramsallaştırılabilir: mutabakat, çalışma zamanı, ekosistem ve makroekonomi. Her katman, mutabakat ve üstü, bir sonraki katmanda gerçekleşen aktivite için bir temel sağlar. Güvensiz bir platform, platformun değerini ortaya çıkarmak için birlikte çalıştıklarından emin olmak için bu katmanların her birini çalıştıran katılımcılara uygun teşviklerin sağlanmasını gerektirir.
vi: Khái niệm hoạt động kinh tế của Casper diễn ra trên bốn lớp riêng biệt: đồng thuận, thời điểm chạy, hệ sinh thái và kinh tế vĩ mô. Mỗi lớp, sự đồng thuận trở lên, cung cấp nền tảng cho hoạt động diễn ra ở lớp tiếp theo. Một nền tảng không cần cấp phép như Casper yêu cầu phải cung cấp các khuyến khích thích hợp cho những người tham gia vận hành từng lớp này để đảm bảo rằng họ làm việc cùng nhau để đem lại trị cho nền tảng.

source: We cannot yet provide formal game-theoretic results for our incentive mechanisms, but interested readers can follow our progress with the `Economics of the Casper Blockchain <https://github.com/CasperLabs/Casper-economics-paper>`_ paper, which will be periodically updated to summarize ongoing research.
fr: Nous ne pouvons pas encore fournir de résultats théoriques formels pour nos mécanismes d'incitation, mais les lecteurs intéressés peuvent suivre nos travaux grâce au document intitulé `Économie de la blockchain Casper <https://github.com/CasperLabs/Casper-economics-paper>`_, qui sera périodiquement mis à jour pour résumer les recherches en cours.
tr: Teşvik mekanizmalarımız için henüz resmi oyun teorik sonuçları veremiyoruz, ancak ilgilenen okuyucular, devam eden araştırmaları özetlemek için periyodik olarak güncellenecek olan `Casper Blokzincir Ekonomisi <https://github.com/CasperLabs/Casper-economics-paper>`_ makalesiyle ilerlememizi takip edebilir.
vi: Chúng tôi chưa thể cung cấp kết quả chính thức cho các cơ chế khuyến khích của chúng tôi, nhưng độc giả quan tâm có thể theo dõi tiến trình của chúng tôi với bài viết `Mô hình kinh tế của chuỗi khối Casper <https://github.com/CasperLabs/Casper-economics-paper>`_, sẽ được cập nhật định kỳ để tóm tắt các nghiên cứu đang diễn ra.

source: This section of our online documentation is intended only to familiarize the user with our core economics features rather than describe their precise implementation and user interface. Some of the features may not be currently active.
fr: Cette section de notre documentation en ligne a pour seul but de sensibiliser l'utilisateur aux fonctions économiques principales plutôt que de décrire leur mise en œuvre précise et leur interface utilisateur. Certaines de ces fonctionnalités peuvent ne pas être actives actuellement.
tr: Çevrimiçi belgelerimizin bu bölümü, belirli uygulamalarını ve kullanıcı arabirimini açıklamak yerine, yalnızca kullanıcıyı temel ekonomik özelliklerimizle tanıştırmayı amaçlamaktadır. Bazı özellikler şu anda etkin olmayabilir.
vi: Phần này của tài liệu trực tuyến chỉ nhằm mục đích giúp người dùng làm quen với các đặc điểm kinh tế cốt lõi của chúng tôi hơn là mô tả cách triển khai chính xác và giao diện người dùng của chúng. Một số tính năng hiện có thể không hoạt động.

source: Consensus
tr: Mutabakat
vi: Đồng thuận

source: The consensus layer of our platform runs on the Highway flavor of CBC-Casper. The distinguishing characteristics of this protocol are its safety and liveness guarantees. Specifically, under the assumptions made in the `Highway protocol paper <https://github.com/CasperLabs/highway>`_, blocks in the canonical history cannot be reverted, and new blocks continue to be added to this history indefinitely. The assumptions, however, require that a large portion of validators remain online and honest; this assumed behavior must be incentivized for the platform to remain secure and live.
fr: La couche de consensus de notre plateforme fonctionne sur la version Highway de CBC-Casper. Les caractéristiques distinctives de ce protocole sont ses garanties de sécurité et de liveness. Plus précisément, selon les hypothèses formulées dans le document `Highway protocol paper <https://github.com/CasperLabs/highway>`_, les blocs de l'historique canonique ne peuvent pas être annulés, et de nouveaux blocs continuent à être ajoutés à cet historique indéfiniment. Les hypothèses, cependant, exigent qu'une grande partie des validateurs restent en ligne et soient honnêtes ; ce comportement supposé doit être incité pour que la plate-forme reste sécurisée et vivante.
tr: Platformumuzun mutabakat katmanı, CBC-Casper'ın Highway tadında çalışır. Bu protokolün ayırt edici özellikleri, güvenlik ve canlılık garantileridir. Özellikle, `Highway protokol belgesinde <https://github.com/CasperLabs/highway>`_ yapılan varsayımlar altında, kabul edilmiş geçmişindeki bloklar geri alınamaz ve bu geçmişe süresiz olarak yeni bloklar eklenmeye devam eder. Ancak varsayımlar, doğrulayıcıların büyük bir bölümünün çevrimiçi ve dürüst kalmasını gerektirir; Bu varsayılan davranış, platformun güvenli ve canlı kalması için teşvik edilmelidir.
vi: Lớp đồng thuận của nền tảng của chúng tôi chạy trên giao thức Highway của CBC-Casper. Các đặc điểm phân biệt của giao thức này là đảm bảo an toàn và khả năng hoạt động của nó. Cụ thể, theo các giả định được đưa ra trong `Highway protocol paper <https://github.com/CasperLabs/highway>`_, các khối trong lịch sử chuẩn không thể hoàn nguyên và các khối mới tiếp tục được thêm vào lịch sử này vô hạn. Tuy nhiên, các giả định yêu cầu một phần lớn các nhà xác thực vẫn trực tuyến và trung thực; việc giả định này phải được khuyến khích để nền tảng vẫn an toàn và hoạt động tốt.

source: When discussing consensus, we default to considering it "one era at a time," unless expressly stated otherwise, in keeping with the Highway paper. Recall that each era is, effectively, a separate instance of the protocol.
fr: Lorsque nous discutons du consensus, nous le considérons par défaut "une ère à la fois", sauf indication contraire expresse, conformément au document Highway. Rappelons que chaque ère est, en fait, une instance distincte du protocole.
tr: Mutabakatı tartışırken, Highway belgesine uygun olarak, aksi açıkça belirtilmedikçe, bunu "her seferinde bir dönem" olarak kabul ediyoruz. Her dönemin etkin bir şekilde protokolün ayrı bir örneği olduğunu hatırlayın.
vi: Khi thảo luận về sự đồng thuận, chúng tôi mặc định coi đó là "một kỷ nguyên tại một thời điểm", trừ khi được tuyên bố rõ ràng ở hình thức khác, như nội dung trong bản mô tả Highway. Cần nhớ rằng mỗi kỷ nguyên (era) hay một quãng thời gian trong Casper, là một ví dụ về giao thức này

source: Agents (consensus layer)
fr: Agents (couche consensus)
tr: Aracılar (mutabakat katmanı)
vi: Người trung gian (lớp đồng thuận)

source: *Validators* are responsible for maintaining platform security by building an ever-growing chain of finalized blocks, backing this chain's security with their stakes. Their importance (often referred to as "weight") both to protocol operation and security is, in fact, equal to their stake, which includes both their own and delegated tokens.
fr: *Les validateurs* sont responsables du maintien de la sécurité de la plate-forme en construisant une chaîne de blocs finalisés qui ne cesse de croître, et en garantissant la sécurité de cette chaîne par leur mise (stake). Leur importance (souvent appelée "poids") pour le fonctionnement et la sécurité du protocole est, en fait, égale à leur enjeu, qui comprend à la fois leurs propres jetons et ceux qui leur sont délégués.
tr: *Doğrulayıcılar*, sürekli büyüyen bir kesinleşmiş bloklar zinciri oluşturarak ve bu zincirin güvenliğini paylarıyla destekleyerek platform güvenliğini sağlamaktan sorumludur. Aslında, hem protokol çalışması hem de güvenlik açısından önemleri (genellikle "ağırlık" olarak anılır) hem kendi hem de oy hakkı devredilen tokenleri içeren paylarına eşittir.
vi: *Nhà xác thực* chịu trách nhiệm duy trì bảo mật nền tảng bằng cách xây dựng một chuỗi các khối hoàn thiện ngày càng phát triển, hỗ trợ bảo mật của chuỗi này bằng cổ phần của họ. Trên thực tế, tầm quan trọng của họ (thường được gọi là "trọng số") đối với hoạt động và bảo mật của giao thức ngang bằng với số lượng cổ phần của họ, bao gồm cả token được ủy quyền và riêng của họ.

source: *Delegators* are users who participate in the platform's security by delegating their tokens to validators, which adds to their weight and collecting a part of the rewards proportional to their delegations, net of a cut ("delegation rate") that is collected by the validator.
fr: Les *délégateurs* sont des utilisateurs qui participent à la sécurité de la plateforme en déléguant leurs jetons à des validateurs, ce qui augmente leur poids et leur permet de percevoir une partie des récompenses proportionnelle à leurs délégations, déduction faite d'une commission ("taux de délégation") perçue par le validateur.
tr: *Yetki Verenler*, ağırlıklarına eklenen ve ödüllerin delegasyonlarıyla orantılı bir kısmını, doğrulayıcılar tarafından toplanan net bir kesintiyi ("delegasyon oranı") toplayan, tokenlerini doğrulayıcılara devrederek platformun güvenliğine katılan kullanıcılardır.
vi: *Người ủy quyền* là người dùng tham gia vào bảo mật của nền tảng bằng cách ủy quyền token của họ cho nhà xác thực, điều này làm tăng thêm trọng số của họ và thu thập một phần phần thưởng tỷ lệ với ủy quyền của họ, trừ một khoản cắt giảm ("tỷ lệ ủy quyền") mà nhà xác thực thu về.

source: Incentives (consensus layer)
fr: Incitations (couche de consensus)
tr: Teşvikler (mutabakat katmanı)
vi: Khuyến khích (lớp đồng thuận)

source: The *auction* determines the composition of the validator set for each era of the protocol. It is a "first-price" (winning bids become stakes) auction with a fixed number of spots chosen to balance security with performance (generally, the platform will run slower with more validators). Because rewards are proportional to the stake, we expect this competitive mechanism to provide a powerful impetus for staking as many tokens as possible.
fr: L' *enchère* détermine la composition de l'ensemble des validateurs pour chaque ère du protocole. Il s'agit d'une enchère "au premier prix" (les offres gagnantes deviennent des enjeux) avec un nombre fixe de places choisies pour équilibrer la sécurité et les performances (en général, la plateforme fonctionnera plus lentement avec plus de validateurs). Comme les récompenses sont proportionnelles à l'enjeu, nous nous attendons à ce que ce mécanisme concurrentiel incite fortement à miser autant de jetons que possible.
tr: *Açık arttırma*, protokolün her dönemi için doğrulayıcı kümesinin bileşimini belirler. Bu, güvenliği performansla dengelemek için seçilen sabit sayıda noktaya sahip bir "ilk fiyat" (kazanan teklifler hisse olur) açık artırmasıdır (genellikle, platform daha fazla doğrulayıcı ile daha yavaş çalışır). Ödüller bahis miktarıyla orantılı olduğundan, bu rekabetçi mekanizmanın mümkün olduğunca çok sayıda tokeni stake etmek için güçlü bir itici güç sağlamasını bekliyoruz.
vi: *Phiên đấu giá* xác định thành phần của người xác thực được đặt cho từng kỷ nguyên của giao thức. Đây là phiên đấu giá cho "giá đầu tiên" (giá thầu thắng cuộc trở thành cổ phần) với một số với một số giao dịch spot (giao ngay) nhất định được chọn để cân bằng tính bảo mật với hiệu suất (nói chung, nền tảng sẽ chạy chậm hơn khi có nhiều nhà xác thực hơn). Bởi vì phần thưởng tỷ lệ thuận với số lượng cổ phần, chúng tôi hy vọng cơ chế cạnh tranh này sẽ cung cấp động lực mạnh mẽ để cổ phần càng nhiều token càng tốt.

source: *Rewards* (per era) are issued to validators who perform, at their nominal pace, in such a way as to make timely progress on block finalization. These rewards are shared with delegators proportionally to their contributions, net of a cut taken by the validator.
fr: Des *récompenses* (par ère) sont attribuées aux validateurs qui s'exécutent, à leur rythme nominal, de manière à faire progresser en temps voulu la finalisation des blocs. Ces récompenses sont partagées avec les délégués proportionnellement à leurs contributions, déduction faite de la part prise (commission) par le validateur.
tr: *Ödüller* (dönem başına), blok tamamlamada zamanında ilerleme sağlayacak şekilde nominal hızlarında performans gösteren doğrulayıcılara verilir. Bu ödüller, doğrulayıcı tarafından alınan bir kesinti şeklinde, katkılarıyla orantılı olarak yetki verenlerle paylaşılır.
vi: *Phần thưởng* (theo kỷ nguyên) được cấp cho những nhà xác thực thực thi với tốc độ nhanh để đạt được hoàn thiện khối một cách kịp thời. Phần thưởng này được chia sẻ với người ủy quyền theo tỷ lệ đóng góp của họ, trừ đi một khoản mà nhà xác thực thu về.

source: *Evictions* deactivate validators who fail to participate in an era, disabling their bid and suspending their participation until they signal readiness to resume participation by invoking a particular entry point in the auction contract.
fr: *Les évictions/éjections* désactivent les validateurs qui ne participent pas à une ère, en désactivant leur offre (bid) et en suspendant leur participation jusqu'à ce qu'ils signalent qu'ils sont prêts à reprendre leur participation en invoquant un point d'entrée particulier dans le contrat d'enchères.
tr: *Tahliyeler*, bir döneme katılmayan, tekliflerini devre dışı bırakan ve açık arttırma kontratlarında belirli bir giriş noktasını çağırarak katılıma devam etmeye hazır olduklarını gösterene kadar katılımlarını askıya alan doğrulayıcıları devre dışı bırakır.
vi: *Trục xuất* sẽ vô hiệu hóa những nhà xác thực không tham gia vào một kỷ nguyên, vô hiệu hóa giá bid của họ và đình chỉ sự tham gia của họ cho đến khi họ ra hiệu rằng mình sẵn sàng tiếp tục tham gia bằng cách gọi (invoke) một điểm vào cụ thể trong hợp đồng đấu giá.

source: Runtime
tr: Çalışma zamanı
vi: Thời điểm chạy

source: The runtime layer encompasses the deployment and execution of smart contracts, session code, and other activity that performs computation on the global state. This suggests potential markets for finite platform resources, such as markets for computing time and storage. Such markets could ensure that resources are allocated to their highest-value uses. Currently, however, we limit ourselves to `metering computing time <https://docs.casperlabs.io/en/latest/implementation/execution-semantics.html#measuring-computational-work>`_, measured as gas. Gas can be conceptualized as relative time use of different WASM operations and host-side functions. Use of storage is also presently assigned a gas cost. We do not currently have a pricing mechanism for metered gas, although an outstanding Casper Enhancement Proposal (`CEP #22 <https://github.com/CasperLabs/ceps/pull/22>`_) suggests the implementation of a first-price gas auction similar to Ethereum's. The initial Mainnet deploy selection mechanism is based on FIFO.
fr: La couche d'exécution ou runtime englobe le déploiement et l'exécution des contrats intelligents, du code de session et d'autres activités qui effectuent des calculs sur l'état global. Cela suggère l'existence de marchés potentiels pour des ressources finies de la plate-forme, tels que des marchés pour le temps de calcul et le stockage. De tels marchés pourraient garantir que les ressources soient allouées à leur utilisation la plus rentable. Actuellement, cependant, nous nous limitons à `mesurer le temps de calcul <https://docs.casperlabs.io/en/latest/implementation/execution-semantics.html#measuring-computational-work>`_, mesuré en tant que gaz. Le gaz peut être conceptualisé comme l'utilisation relative du temps des différentes opérations WASM et des fonctions côté hôte. L'utilisation du stockage est également actuellement assignée un coût de gaz. Nous n'avons pas actuellement de mécanisme de tarification pour le gaz mesuré, bien qu'une proposition d'amélioration de Casper (`CEP #22 <https://github.com/CasperLabs/ceps/pull/22>`_) suggère la mise en œuvre d'une enchère de gaz de premier prix semblable à celle d'Ethereum. Le mécanisme initial de sélection de déploiement du Mainnet est basé sur FIFO.
tr: Çalışma zamanı katmanı, akıllı kontratların, oturum kodunun ve küresel durumda hesaplama gerçekleştiren diğer etkinliklerin dağıtımını ve yürütülmesini kapsar. Bu, bilgi işlem süresi ve depolama pazarları gibi sınırlı platform kaynakları için potansiyel pazarlar önerir. Bu tür piyasalar, kaynakların en yüksek değerli kullanımlarına tahsis edilmesini sağlayabilir. Ancak şu anda kendimizi gaz olarak `ölçülen hesaplama süresini <https://docs.casperlabs.io/en/latest/implementation/execution-semantics.html#measuring-computational-work>`_ ölçmekle sınırlıyoruz. Gaz, farklı WASM işlemlerinin ve ana bilgisayar tarafı işlevlerinin göreli zaman kullanımı olarak kavramsallaştırılabilir. Depolamanın kullanımına şu anda bir gaz maliyeti de atanmıştır. Olağanüstü bir Casper Geliştirme Önerisi (`CEP #22 <https://github.com/CasperLabs/ceps/pull/22>`_) Ethereum'unkine benzer bir ilk fiyat gaz açık arttırmasının uygulanmasını önermekle birlikte, şu anda ölçülü gaz için bir fiyatlandırma mekanizmamız yok. İlk Mainnet dağıtım seçim mekanizması FIFO'ya dayanmaktadır.
vi: Lớp thời điểm chạy chạy (runtime) bao gồm việc triển khai và thực thi các hợp đồng thông minh, mã phiên và hoạt động thực hiện tính toán ở trạng thái toàn cục. Điều này cho thấy có nhiều thị trường tiềm năng cho các tài nguyên nền tảng hữu hạn, chẳng hạn như thị trường cho thời gian tính toán và lưu trữ. Các thị trường này có thể đảm bảo rằng các nguồn lực được phân bổ và sử dụng với giá trị cao nhất. Tuy nhiên, hiện tại, chúng tôi chỉ `đo thời gian tính toán <https://docs.casperlabs.io/en/latest/implementation/execution-semantics.html#measuring-computational-work>`_ bằng đơn vị gas. Gas có thể được khái niệm hóa là thời gian sử dụng tương đối dành cho các hoạt động WASM khác nhau và các chức năng phía máy chủ. Việc sử dụng kho lưu trữ hiện cũng được ấn định một lượng chi phí gas. Chúng tôi hiện không có cơ chế định giá cho gas đo được, mặc dù một Đề xuất cải tiến Casper (`CEP #22 <https://github.com/CasperLabs/ceps/pull/22>`_) có đề xuất việc thực hiện đấu giá gas theo giá đầu tiên tương tự như trong Ethereum. Mainnet ban đầu triển khai cơ chế lựa chọn dựa trên nguyên tăc FIFO (first in first out)

source: We expect to continue work on runtime resource markets, particularly gas futures (`CEP #17 <https://github.com/CasperLabs/ceps/pull/17>`_).
fr: Nous prévoyons de poursuivre les travaux sur les marchés des ressources en temps réel, notamment les contrats à terme sur le gaz (`CEP #17 <https://github.com/CasperLabs/ceps/pull/17>`_).
tr: Çalışma zamanı kaynak piyasaları, özellikle gaz vadeli işlemleri (`CEP #17 <https://github.com/CasperLabs/ceps/pull/17>`_) üzerinde çalışmaya devam etmeyi umuyoruz.
vi: Chúng tôi kỳ vọng trong tương lai sẽ tiếp tục nghiên cứu các thị trường tài nguyên thời gian chạy, đặc biệt là nghiên cứu về gas (`CEP #17 <https://github.com/CasperLabs/ceps/pull/17>`_).

source: *Validators* again play a vital role in this layer since protocol operation includes construction and validation of new blocks, consisting of deploys that change the global state, which the validators also maintain.
fr: *Les validateurs * jouent à aussi un rôle essentiel dans cette couche puisque le fonctionnement du protocole comprend la construction et la validation de nouveaux blocs, consistant en des déploiements qui modifient l'état global, que les validateurs maintiennent également.
tr: *Doğrulayıcılar* yine bu katmanda hayati bir rol oynar çünkü protokol işlemi, doğrulayıcıların da sürdürdüğü küresel durumu değiştiren dağıtımlardan oluşan yeni blokların oluşturulmasını ve doğrulanmasını içerir.
vi: *Nhà xác thực* lại đóng một vai trò quan trọng trong lớp này vì hoạt động của giao thức bao gồm việc xây dựng và xác thực các khối mới, bao gồm các triển khai thay đổi trạng thái toàn cục - mục tiêu mà nhà xác thực cũng duy trì.

source: *Users* execute session and contract code using the platform's computational resources
fr: *Les utilisateurs* exécutent le code de la session et du contrat en utilisant les ressources informatiques de la plate-forme.
tr: *Kullanıcılar*, platformun hesaplama kaynaklarını kullanarak oturum ve kontrat kodunu yürütür
vi: *Người dùng* thực thi phiên và mã hợp đồng bằng cách sử dụng các tài nguyên tính toán của nền tảng

source: *Transaction fees*, or charges for gas use, ensure that the users compensate validators for performing their computations. Transaction fees are awarded to the block creator. Because we expect to launch with FIFO ordering of deploys, it can be assumed that one unit of gas will be priced at one mote until future changes to deploy orders are implemented.
fr: *Les frais de transaction*, ou frais d'utilisation des gaz, garantissent que les utilisateurs rémunèrent les validateurs pour l'exécution de leurs calculs. Les frais de transaction sont attribués au créateur du bloc. Comme nous prévoyons de lancer le système avec un ordre de déploiement FIFO, on peut assumer que le prix d'une unité de gaz sera d'un 'mote' jusqu'à ce que des changements futurs soient apportés aux ordres de déploiement.
tr: *İşlem ücretleri* veya gaz kullanımı ücretleri, kullanıcıların doğrulayıcıları hesaplamalarını gerçekleştirmeleri için tazmin etmesini sağlar. İşlem ücretleri blok oluşturucuya verilir. FIFO dağıtım siparişi ile başlatmayı beklediğimizden, dağıtım siparişlerinde gelecekteki değişiklikler uygulanana kadar bir birim gazın bir anda fiyatlandırılacağı varsayılabilir.
vi: *Phí giao dịch* hoặc phí sử dụng gas, đảm bảo rằng người dùng sẽ đền bù cho nhà xác thực khi nhà xác thực thực hiện các phép tính của họ. Phí giao dịch được trao tặng cho người tạo khối. Chúng tôi dự kiến ra mắt trình tự triển khai FIFO, giả định rằng một đơn vị gas sẽ được định giá ở mức một mote cho đến khi có thêm thay đổi nào trong yêu cầu triển khai.

source: Ecosystem
fr: Écosystème
tr: Ekosistem
vi: Hệ sinh thái
