Repository: casper-network/docs-archive
Catalog: locale/*/LC_MESSAGES/economics/index.po
Languages: fr, tr, vi

source: The ecosystem layer encompasses dApp design and operation. CasperLabs maintains multiple partnerships with prospective dApp developers, and we anticipate devoting significant resources to research the economics of prospective dApps.
fr: La couche écosystème englobe la conception et l'exploitation des dApps. CasperLabs entretient de multiples partenariats avec des développeurs potentiels de dApps, et nous prévoyons de consacrer des ressources importantes à la recherche sur les aspects économiques des dApps potentielles.
tr: Ekosistem katmanı, dApp tasarımını ve çalışmasını kapsar. CasperLabs, olası dApp geliştiricileriyle birden fazla ortaklık yürütüyor ve olası dApp'lerin ekonomisini araştırmak için önemli kaynaklar ayırmayı öngörüyoruz.
vi: Lớp hệ sinh thái bao gồm thiết kế và vận hành dApp. CasperLabs duy trì nhiều mối quan hệ hợp tác với các nhà phát triển dApp tiềm năng và chúng tôi sẽ dành nguồn lực đáng kể để nghiên cứu tính kinh tế của các dApp triển vọng.

source: Macroeconomy
fr: Macro-économie
tr: Makro ekonomi
vi: Kinh tế vĩ mô

source: Casper's macroeconomics refers to the activity in the cryptocurrency markets, where CSPR can be treated as one cryptoasset among many rather than a computational platform. Our token economics are different from those of "digital gold" tokens like Bitcoin, designed to be scarce. Our tokens are minted from a fixed starting basis, which is accounted for by tokens distributed to genesis validators, employees, community members and held for future distributions. The total supply of tokens grows at a fixed annual percentage rate from this basis.
fr: La macro-économie de Casper fait référence à l'activité des marchés des crypto-monnaies, où CSPR peut être traité comme un crypto-monnaie parmi d'autres plutôt que comme une plateforme de calcul. L'économie de nos jetons est différente de celle des jetons "digital gold" comme le Bitcoin, conçus pour être rares. Nos jetons sont émis (minted) à partir d'une base de départ fixe, qui est comptabilisée par les jetons distribués aux validateurs de 'Genesis', aux employés, aux membres de la communauté et conservés pour des distributions futures. L'offre totale de jetons croît à un taux de pourcentage annuel fixe à partir de cette base.
tr: Casper'ın makro ekonomisi, CSPR'nin bir hesaplama platformundan ziyade birçok kripto varlık arasında bir kripto varlık olarak ele alınabileceği kripto para piyasalarındaki faaliyeti ifade eder. Token ekonomimiz, kıt olacak şekilde tasarlanmış Bitcoin gibi "dijital altın" tokenlerinden farklıdır. Tokenlerimiz, doğuş (genesis) doğrulayıcılarına, çalışanlara, topluluk üyelerine dağıtılan ve gelecekteki dağıtımlar için tutulan tokenler tarafından hesaplanan sabit bir başlangıç temelinde basılmıştır. Toplam token arzı, bu temelden sabit bir yıllık yüzde oranında büyür.
vi: Kinh tế học vĩ mô của Casper đề cập đến hoạt động trong thị trường tiền điện tử, nơi CSPR có thể được coi là một tập hợp tiền điện tử trong số nhiều loại tiền điện tử hơn là một nền tảng tính toán. Về mặt kinh tế, token của chúng tôi khác với mô hình của các token "vàng kỹ thuật số" như Bitcoin, được thiết kế để khan hiếm. Các token của chúng tôi được mint trên một cơ sở xác định trước, được tính bằng các token được phân phối cho nhà xác nhận ban đầu, nhân viên, thành viên cộng đồng và được giữ để phân phối trong tương lai. Tổng nguồn cung cấp token tăng với tỷ lệ phần trăm cố định hàng năm trên cơ sở này.

source: The inflationary nature of our macroeconomics has two significant advantages over enforced scarcity. Inflation incentivizes token holders to stake or delegate their tokens, a behavior we explicitly support with our delegation feature. Additionally, because Casper is a general-purpose computing platform, it is essential to supply tokens to support actual economic activity on the platform and discourage hoarding tokens in expectation of speculative gain.
fr: La nature inflationniste de notre macro-économie a deux avantages importants par rapport à la rareté forcée. L'inflation incite les détenteurs de jetons à staker ou à déléguer leurs jetons, un comportement que nous soutenons explicitement avec notre fonction de délégation. En outre, Casper étant une plateforme informatique polyvalente, il est essentiel de fournir des jetons pour soutenir l'activité économique réelle sur la plateforme et décourager la thésaurisation de jetons dans l'espoir d'un gain spéculatif.
tr: Makro ekonomimizin enflasyonist doğası, zorunlu kıtlığa göre iki önemli avantaja sahiptir. Enflasyon, token sahiplerini, delegasyon özelliğimizle açıkça desteklediğimiz bir davranış olan tokenlerini paylaştırmaya veya devretmeye teşvik eder. Ek olarak, Casper genel amaçlı bir bilgi işlem platformu olduğu için, platformdaki fiili ekonomik aktiviteyi desteklemek için tokenler sağlamak ve spekülatif kazanç beklentisiyle tokenleri istiflemekten vazgeçirmek esastır.
vi: Bản chất lạm phát trong kinh tế vĩ mô của chúng ta có hai lợi thế đáng kể. Lạm phát khuyến khích chủ sở hữu token đặt cọc hoặc ủy quyền token của họ, đây là hành vi mà chúng tôi hỗ trợ tối đa với tính năng ủy quyền. Ngoài ra, vì Casper là một nền tảng máy tính có mục đích chung, nên cần phải cung cấp token để hỗ trợ hoạt động kinh tế thực tế trên nền tảng và không khuyến khích tích trữ token với kỳ vọng thu được lợi nhuận đầu cơ.
