Repository: casper-network/docs-archive
Catalog: locale/*/LC_MESSAGES/economics/runtime.po
Languages: fr, tr, vi

source: Runtime Economics
fr: Économie de l'exécution (Runtime Economics)
tr: Çalışma Zamanı Ekonomisi
vi: Tính kinh tế của thời điểm chạy

source: The economics of the runtime layer should incentivize efficient allocation of computational resources, primarily CPU time, to users. Pending state pruning implementation, disk space use is treated as CPU time usage and charged, irreversibly, per byte written. Currently, gas is allocated according to a first-in, first-out model for deploys, with a fixed price of 1 mote (1/10^9 part of a CSPR token) per 1 unit of gas.
fr: L'économie de la couche d'exécution doit inciter à une allocation efficace des ressources informatiques, principalement du temps CPU, aux utilisateurs. En attendant la mise en œuvre de l'élagage d'état, l'utilisation de l'espace disque est traitée comme l'utilisation du temps CPU et facturée, de manière irréversible, par octet écrit. Actuellement, le gaz est alloué selon le modèle du premier entré, premier sorti (FIFO) pour les déploiements, avec un prix fixe de 1 mote (1/10^9 partie d'un jeton CSPR) pour 1 unité de gaz.
tr: Çalışma zamanı katmanının ekonomisi, başta CPU zamanı olmak üzere hesaplama kaynaklarının kullanıcılara verimli bir şekilde tahsis edilmesini teşvik etmelidir. Bekleyen durum budama uygulaması, disk alanı kullanımı CPU zaman kullanımı olarak değerlendirilir ve yazılan bayt başına geri döndürülemez şekilde ücretlendirilir. Şu anda yakıt, 1 birim yakıt başına 1 mote (CSPR tokeninin 1/10^9 kısmı) sabit bir fiyatla dağıtımlar için ilk giren ilk çıkar modeline göre tahsis edilmektedir.
vi: Tính kinh tế của lớp thời điểm chạy sẽ khuyến khích việc phân bổ hiệu quả các tài nguyên tính toán, chủ yếu là thời gian CPU, cho người dùng. Trạng thái chờ trong khi cắt giảm triển khai, sử dụng không gian đĩa được coi là sử dụng thời gian CPU và được tính phí trên mỗi byte được ghi. Hiện tại, gas được phân bổ theo mô hình first-in, first-out cho các đợt triển khai, với giá cố định là 1 mote (1/10^9 phần của token CSPR) trên 1 đơn vị gas.

source: Gas allocation
fr: Allocation du gaz
tr: Yakıt tahsisi
vi: Phân bổ Gas

source: Any finite resource on a publicly accessible computer network must be rate-limited, as, otherwise, overuse of this resource is an attack vector -- a minimal requirement for platform security. However, rate-limiting, implemented on our platform as a simple block gas limit with several lanes, leaves the platform with the problem of fairly and efficiently allocating the gas. We are researching the optimal structure for spot and futures gas markets, and interested readers should consult the relevant `CEPs <https://github.com/casper-network/ceps>`_. In the meantime, this section outlines some basic features of the platform that would underpin any allocation scheme.
fr: Toute ressource finie sur un réseau informatique accessible au public doit être limitée en débit, sinon, la surexploitation de cette ressource constitue un vecteur d'attaque -- une exigence minimale pour la sécurité de la plate-forme. Cependant, la limitation du débit, mise en œuvre sur notre plate-forme sous la forme d'une simple limite de gaz en bloc avec plusieurs voies, laisse à la plate-forme la gestion du problème de l'allocation équitable et efficace du gaz. Nous recherchons la structure optimale pour les marchés du gaz au comptant et à terme, et les lecteurs intéressés peuvent consulter les `CEPs <https://github.com/casper-network/ceps>`_ pertinents. En attendant, cette section décrit certaines caractéristiques essentielles de la plate-forme qui sont à la base de tout système d'allocation.
vi: Bất kỳ tài nguyên hữu hạn nào trên mạng máy tính có thể truy cập công cộng phải được giới hạn tốc độ, vì nếu không, việc sử dụng quá mức tài nguyên này là một vectơ tấn công - một yêu cầu tối thiểu đối với bảo mật nền tảng. Tuy nhiên, việc giới hạn tỷ lệ, được thực hiện trên nền tảng của chúng tôi dưới dạng giới hạn gas khối đơn giản với một số làn, khiến nền tảng gặp vấn đề trong việc phân bổ gas một cách công bằng và hiệu quả. Chúng tôi đang nghiên cứu cấu trúc tối ưu cho thị trường gas giao ngay và tương lai, và độc giả quan tâm nên tham khảo tài liệu `CEPs <https://github.com/casper-network/ceps>`_ có liên quan. Trong khi chờ đợi, phần này phác thảo một số tính năng cơ bản của nền tảng sẽ làm cơ sở cho bất kỳ kế hoạch phân bổ nào.

source: Consensus before execution & basics of payment
fr: Consensus avant l'exécution et principes de base du paiement
tr: Yürütme öncesi mutabakat ve ödemenin temelleri
vi: Đồng thuận trước thực thi và những điều cơ bản về thanh toán

source: The Highway protocol in its Mainnet implementation reaches consensus on a block *before* the block is executed, introducing a subtle difference from platforms like Ethereum. In addition, deploys sent to the Casper network can only be selected based on claimed, rather than used, gas. Consequently, to incentivize user-side optimization and prevent block space exhaustion by poorly optimized deploys, the platform provides no refunds for unused gas.
fr: Le protocole Highway, dans son implémentation Mainnet, atteint un consensus sur un bloc *avant* que celui-ci ne soit exécuté, ce qui introduit une différence subtile avec des plateformes comme Ethereum. En outre, les déploiements envoyés au réseau Casper ne peuvent être sélectionnés que sur la base du gaz réclamé, et non utilisé. Par conséquent, afin d'encourager l'optimisation du côté utilisateur et d'empêcher l'épuisement de l'espace de bloc par des déploiements mal optimisés, la plateforme ne prévoit aucun remboursement pour le gaz inutilisé.
tr: Mainnet uygulamasındaki Highway protokolü, blok yürütülmeden **önce** bir blok üzerinde mutabakata varır ve Ethereum gibi platformlardan ince bir fark oluşturur. Ayrıca Casper ağına gönderilen dağıtımlar, kullanılan gaz yerine yalnızca talep edilen yakıta göre seçilebilir. Sonuç olarak, kullanıcı tarafı optimizasyonunu teşvik etmek ve yetersiz optimize edilmiş dağıtımlar nedeniyle blok alanı tükenmesini önlemek için platform, kullanılmayan yakıt için herhangi bir geri ödeme sağlamaz.
vi: Giao thức Highway trong việc triển khai Mainnet đạt được sự đồng thuận trên một khối *trước khi* khối được thực thi, tạo ra sự khác biệt so với các nền tảng như Ethereum. Ngoài ra, các triển khai được gửi tới mạng Casper chỉ có thể được chọn dựa trên gas đã được xác nhận chứ không phải gas đã sử dụng. Do đó, để khuyến khích tối ưu hóa phía người dùng và ngăn chặn việc cạn kiệt không gian khối do các triển khai không được tối ưu hóa, nền tảng không hoàn lại tiền cho gas chưa sử dụng.

source: Additionally, a minimal amount of CSPR must be present in the user account to ensure that the payment computation is covered. The community may introduce additional balance checks in the future.
fr: En outre, un montant minimal de CSPR doit être présent sur le compte de l'utilisateur pour garantir que le calcul du paiement est couvert. La communauté peut introduire des contrôles de solde supplémentaires à l'avenir.
tr: Ayrıca, ödeme hesaplamasının kapsandığından emin olmak için kullanıcı hesabında minimum miktarda CSPR bulunmalıdır. Topluluk gelecekte ek bakiye kontrolleri uygulayabilir.
vi: Ngoài ra, phải có một lượng CSPR tối thiểu trong tài khoản người dùng để có thể thực hiện việc tính toán các thanh toán. Trong tương lai, cộng đồng người dùng còn có thể kiểm tra số dư bổ sung.

source: Costs and limits
fr: Coûts et limites
tr: Maliyetler ve limitler
vi: Chi phí và hạn chế

source: Gas cost is a measure of relative time used by different primitive operations of the execution engine, which is also assumed to be additive. By additivity, we mean that the time to execute a program is approximately proportional to the sum of gas expended by the opcodes and functions called within the program. Casper assigns gas costs to primitive execution engine opcodes and specific more complex *host-side* functions that are callable from within the execution engine context. Gas costs for opcodes and host-side functions are specified in the chainspec and may vary according to arguments.
fr: Le coût du gaz est une mesure du temps relatif utilisé par les différentes opérations primitives du moteur d'exécution, qui est également supposé être additif. Par additivité, nous entendons que le temps d'exécution d'un programme est approximativement proportionnel à la somme des gaz dépensés par les 'opcodes' et les fonctions appelés dans le programme. Casper attribue des coûts de gaz aux 'opcodes' primitifs du moteur d'exécution et aux fonctions spécifiques plus complexes *côté hôte* qui peuvent être appelées depuis le contexte du moteur d'exécution. Les coûts des gaz pour les 'opcodes' et les fonctions côté hôte sont spécifiés dans le chainspec et peuvent varier en fonction des arguments.
tr: Yakıt maliyeti, aynı zamanda toplamsal olduğu varsayılan yürütme motorunun farklı ilkel işlemleri tarafından kullanılan göreli zamanın bir ölçüsüdür. Toplamsallık ile, bir programı yürütme süresinin, program içinde çağrılan işlem kodları ve işlevleri tarafından harcanan yakıtın toplamı ile yaklaşık olarak orantılı olduğunu kastediyoruz. Casper, yakıt maliyetlerini ilkel yürütme motoru işlem kodlarına ve yürütme motoru bağlamından çağrılabilen daha karmaşık *ana bilgisayar tarafı* işlevlerine atar. İşlem kodları ve ana bilgisayar tarafı işlevleri için yakıt maliyetleri, zincir belirtiminde belirtilir ve bağımsız değişkenlere göre değişebilir.
vi: Chi phí gas là thước đo thời gian tương đối được sử dụng bởi các hoạt động ban đầu của cơ chế thực thi, cũng được giả định là phần cộng thêm. Có nghĩa là thời gian để thực thi một chương trình tỷ lệ thuận với tổng lượng gas được sử dụng bởi các mã hoạt động opcodes và các hàm được gọi trong chương trình. Casper chỉ định chi phí gas cho các mã hoạt động của cơ chế thực thi ban đầu và các chức năng phía *host-side* phức tạp hơn có thể gọi trong cơ chế thực thi. Chi phí gas cho opcodes và các chức năng phía máy chủ được chỉ định trong chainpec và có thể thay đổi tùy theo các đối số.

source: We expect to refine the current gas cost table to reflect time use more closely, with updates introduced in future upgrades. We also anticipate that, with the introduction of state pruning, storage costs will be calculated separately from computing time.
fr: Nous prévoyons d'améliorer le tableau actuel des coûts du gaz afin de refléter plus fidèlement l'utilisation du temps, avec des améliorations introduites dans les futures mises à jour. Nous prévoyons également que, avec l'introduction de l'élagage des États ( state pruning), les coûts de stockage seront calculés séparément du temps de calcul.
tr: Gelecekteki yükseltmelerde sunulan güncellemelerle, zaman kullanımını daha yakından yansıtmak için mevcut yakıt maliyet tablosunu iyileştirmeyi umuyoruz. Ayrıca durum budamasının devreye girmesiyle birlikte depolama maliyetlerinin hesaplama zamanından ayrı olarak hesaplanacağını da tahmin ediyoruz.
vi: Chúng tôi hy vọng sẽ bảng chi phí gas được tinh chỉnh hiện tại có thể phản ánh lượng thời gian được sử dụng chặt chẽ hơn, các bản cập nhật cũng sẽ được giới thiệu trong các bản nâng cấp trong tương lai. Chúng tôi cũng kỳ vọng rằng, với việc áp dụng cắt giảm trạng thái triển khai, chi phí lưu trữ sẽ được tính riêng và tách bạch với thời gian tính toán.

source: Lanes
fr: Voies (Lanes)
tr: Şeritler
vi: Luồng

source: The block gas limit is split into two lanes, one for native transfers and one for general deploys. The number of transfers, which cost a fixed amount of gas, is governed directly by the ``block_max_transfer_count`` chainspec parameter, set to 2500 when Mainnet launched.
fr: La limite de gaz du bloc est divisée en deux voies, une pour les transferts natifs et une pour les déploiements généraux. Le nombre de transferts, qui coûtent une quantité fixe de gaz, est régi directement par le paramètre chainspec ``block_max_transfer_count``, fixé à 2500 au lancement de Mainnet.
tr: Blok yakıt sınırı, biri yerel transferler ve diğeri genel dağıtımlar için olmak üzere iki şeride ayrılmıştır. Sabit bir miktarda yakıta mal olan transferlerin sayısı, Mainnet başlatıldığında 2500'e ayarlanan doğrudan ``block_max_transfer_count`` Zincir Belirtimi (chainspec) parametresi tarafından yönetilir.
vi: Giới hạn gas của khối được chia thành hai luồng, một luồng dành cho các chuyển khoản và một luồng dành cho các triển khai chung. Số lần chuyển, tốn một lượng gas cố định, được điều chỉnh trực tiếp bởi tham số ``block_max_transfer_count``, được thiết lập là 2500 khi Mainnet khởi chạy.

source: Gas fees
fr: Frais de gaz
tr: Yakıt ücretleri
vi: Phí Gas

source: Currently, the price of gas is fixed at 1 mote per 1 unit of gas.
fr: Actuellement, le prix du gaz est fixé à 1 mote pour 1 unité de gaz.
tr: Şu anda, yakıt fiyatı 1 birim yakıt başına 1 mote olarak sabitlenmiştir.
vi: Hiện tại, giá gas cố định ở mức 1 mote trên 1 đơn vị gas.

source: Fee allocation
fr: Allocation des frais
tr: Ücret tahsisi
vi: Phí phân bổ

source: All fees from a particular block accrue to its proposer, incentivizing non-empty block production and allowing major dApps to execute deploys for free, provided they operate a validator node and are comfortable with the latency introduced by validator scheduling.
fr: Tous les frais d'un bloc particulier reviennent à celui qui le propose, ce qui encourage la production de blocs non vides et permet aux principaux dApps d'exécuter des déploiements gratuitement, à condition qu'ils exploitent un nœud de validation et qu'ils soient à l'aise avec la latence introduite par la programmation des validateurs.
tr: Belirli bir bloktan gelen tüm ücretler, teklif sahibine tahakkuk eder, boş olmayan blok üretimini teşvik eder ve büyük dApp'lerin bir doğrulayıcı düğümü çalıştırmaları ve doğrulayıcı planlamasının getirdiği gecikme konusunda rahat olmaları koşuluyla dağıtımları ücretsiz olarak yürütmesine izin verir.
vi: Tất cả các khoản phí từ một khối cụ thể được tích lũy cho người đề xuất của khối đó, điều này khuyến khích sản xuất khối và cho phép các dApp quan trọng thực thi các triển khai miễn phí, miễn là các dApp đó có thể vận hành một nút nhà xác thực và thoải mái với độ trễ do lịch trình của nhà xác thực gây ra.

source: Spot pricing
fr: Tarification au comptant (Spot pricing)
tr: Spot fiyatlandırma
vi: Giá giao ngay (Spot)

source: Please see `CEP #22 <https://github.com/casper-network/ceps/pull/22>`_ for one potential design of a gas spot market.
fr: Consulter `CEP #22 <https://github.com/casper-network/ceps/pull/22>`_ pour une conception potentielle d'un marché au comptant du gaz.
vi: Vui lòng xem `CEP #22 <https://github.com/casper-network/ceps/pull/22>`_ để biết thiết kế tiềm năng của thị trường gas.

source: Futures pricing
fr: Fixation des prix à terme (Futures pricing)
tr: Vadeli işlem fiyatlandırması
vi: Giá tương lai (Futures)

source: Please see `CEP #17 <https://github.com/casper-network/ceps/pull/17>`_ for our draft proposal of a gas futures market.
fr: Consulter `CEP #17 <https://github.com/casper-network/ceps/pull/17>`_ pour notre proposition de projet d'un marché à terme du gaz.
vi: Vui lòng xem `CEP #17 <https://github.com/casper-network/ceps/pull/17>`_ để biết đề xuất dự thảo của chúng tôi về thị trường gas tương lai.

source: Any finite resource on a publicly accessible computer network must be rate-limited, as, otherwise, overuse of this resource is an attack vector -- a minimal requirement for platform security. However, rate-limiting, implemented on our platform as a simple block gas limit with several lanes, leaves the platform with the problem of fairly and efficiently allocating the gas. We are researching the optimal structure for spot and futures gas markets, and interested readers should consult the relevant `CEPs <https://github.com/CasperLabs/ceps>`_. In the meantime, this section outlines some basic features of the platform that would underpin any allocation scheme.
tr: Herkese açık bir bilgisayar ağındaki herhangi bir sonlu kaynak, hız-sınırlı olmalıdır, aksi takdirde bu kaynağın aşırı kullanımı bir saldırı vektörüdür -- platform güvenliği için minimum bir gerekliliktir. Ancak, platformumuzda birkaç şeritli basit bir blok yakıt limiti olarak uygulanan hız sınırlaması, platformu yakıtın adil ve verimli bir şekilde tahsis edilmesi sorunuyla karşı karşıya bırakmaktadır. Spot ve vadeli yakıt piyasaları için en uygun yapıyı araştırıyoruz ve ilgilenen okuyucular ilgili `CEP <https://github.com/CasperLabs/ceps>`_'lere danışmalıdır. Bu arada, bu bölüm, platformun herhangi bir tahsis şemasını destekleyecek bazı temel özelliklerini özetlemektedir.

source: Please see `CEP #22 <https://github.com/CasperLabs/ceps/pull/22>`_ for one potential design of a gas spot market.
tr: Bir yakıt spot piyasasının potansiyel bir tasarımı için lütfen `CEP #22 https://github.com/CasperLabs/ceps/pull/22>`_'ye bakın.

source: Please see `CEP #17 <https://github.com/CasperLabs/ceps/pull/17>`_ for our draft proposal of a gas futures market.
tr: Bir yakıt vadeli işlem piyasasına ilişkin taslak teklifimiz için lütfen `CEP #17 <https://github.com/CasperLabs/ceps/pull/17>`_'ye bakın.
