Repository: casper-network/docs-archive
Catalog: locale/*/LC_MESSAGES/dapp-dev-guide/tutorials/erc20/implementation.po
Languages: fr, tr, vi

source: ERC-20 Implementation
fr: Implementation de ERC-20
tr: ERC-20 Uygulaması
vi: Triển khai ERC-20

source: The ERC-20 standard is defined in `an Ethereum Improvement Proposal (EIP) <https://github.com/ethereum/EIPs/blob/master/EIPS/eip-20.md#>`_. Read it carefully, as it defines the methods we have implemented:
fr: La norme ERC-20 est définie dans `une proposition d'amélioration d'Ethereum (EIP) <https://github.com/ethereum/EIPs/blob/master/EIPS/eip-20.md#>`_. A Lire attentivement, car elle définit les méthodes que nous avons mises en œuvre :
tr: ERC-20 standardı, `Ethereum İyileştirme Önerisi'nde (EIP) <https://github.com/ethereum/EIPs/blob/master/EIPS/eip-20.md#>`_ tanımlanmıştır. Uyguladığımız yöntemleri tanımladığı için bunu dikkatlice okuyun:
vi: Tiêu chuẩn ERC-20 được định nghĩa trong `Đề xuất cải tiến Ethereum (EIP) <https://github.com/ethereum/EIPs/blob/master/EIPS/eip-20.md#>`_.Bạn nên đọc kỹ, vì nó xác định các phương thức chúng đã triển khai:

source: `allowance <#the-total-supply-balance-of-and-allowance-functions>`_
tr: `ödenek <#the-total-supply-balance-of-and-allowance-functions>`_

source: `approve <#the-approve-and-transfer-from-functions>`_
tr: `onay <#the-approve-and-transfer-from-functions>`_

source: `decimals <#the-name-symbol-and-decimals-functions>`_
tr: `ondalıklar <#the-name-symbol-and-decimals-functions>`_

source: `name <#the-name-symbol-and-decimals-functions>`_
tr: `ad <#the-name-symbol-and-decimals-functions>`_

source: `symbol <#the-name-symbol-and-decimals-functions>`_
tr: `sembol <#the-name-symbol-and-decimals-functions>`_

source: `transfer <#the-transfer-function>`_
tr: `aktarım <#the-transfer-function>`_

source: Cloning the Example Contract
fr: Clonage du Contrat Example
tr: Örnek Kontratı Klonlama
vi: Sao chép Hợp đồng ví dụ

source: An example ERC-20 for Casper is located in `GitHub <https://github.com/casper-ecosystem/erc20>`_.
fr: Un exemple d'ERC-20 pour Casper se trouve à l'adresse suivante `GitHub <https://github.com/casper-ecosystem/erc20>`_.
tr: Casper için örnek bir ERC-20, `GitHub'da <https://github.com/casper-ecosystem/erc20>`_ bulunur.
vi: Ví dụ ERC-20 cho Casper tại `GitHub <https://github.com/casper-ecosystem/erc20>`_.

source: Installing the Required Crates
fr: Installation des 'Crates' requises
tr: Gerekli Paketleri Yükleme
vi: Cài đặt các gói bắt buộc

source: This is a Rust contract. In Rust, the keyword ``use`` is like an ``include`` statement in C/C++. Casper contracts require a few crates to be included. They are:
fr: C'est un contrat Rust. En Rust, le mot-clé "use" est comme une déclaration "include" en C/C++. Les contrats Casper nécessitent l'inclusion de quelques 'crates'. Il s'agit de :
tr: Bu bir Rust kontratıdır. Rust'ta ``use`` anahtar sözcüğü, C/C++'daki ``include`` ifadesi gibidir. Casper kontratları, birkaç paketin dahil edilmesini gerektirir. Bunlar:
vi: Đây là một hợp đồng Rust. Trong Rust, từ khóa ``use'' giống như một câu lệnh ``include`` trong C/C++. Hợp đồng Casper yêu cầu một vài gói, bao gồm:

source: contract: The Casper contract API for runtime and storage
fr: contract : l'API du contrat Casper pour l'exécution et le stockage.
tr: kontrat: Çalışma zamanı ve depolama için Casper kontrat API'si
vi: contract: API hợp đồng Casper cho thời điểm chạy và lưu trữ

source: types: The Casper contract type system
fr: types : Le système de type contrat Casper
tr: türler: Casper kontrat türü sistemi
vi: types: Hệ thống kiểu hợp đồng của Casper

source: Initializing the Contract
fr: Initialisation du Contrat
tr: Kontratın Başlatılması
vi: Khởi tạo Hợp đồng

source: When the contract is deployed, it must be initialized with some values; this is done with the help of the ``call()`` function. The contract is initialized with a name, symbol, decimals, starting balances, and the starting token supply.
fr: Lorsque le contrat est déployé, il doit être initialisé avec certaines valeurs ; ceci est fait à l'aide de la fonction ``call()``. Le contrat est initialisé avec un nom (name), un symbole (symbol), des décimales (decimals), des soldes de départ (starting balances), et l'approvisionnement en jetons de départ.
tr: Sözleşme dağıtıldığında, bazı değerlerle başlatılmalıdır; bu, `call()`` işlevi yardımıyla yapılır. Sözleşme bir ad, sembol, ondalık sayılar, başlangıç ​​bakiyeleri ve başlangıç token arzı ile başlatılır.
vi: Khi hợp đồng được triển khai, nó phải được khởi tạo với một số giá trị; điều này được thực hiện với sự trợ giúp của hàm ``call()``. Hợp đồng được khởi tạo với tên, ký tự, số thập phân, số dư ban đầu và nguồn cung cấp token bắt đầu.

source: The ``name``, ``symbol``, and ``decimals`` functions
fr: Les fonctions ``name``, ``symbol``, et ``decimals``
tr: ``name``, ``symbol`` ve ``decimals`` işlevleri
vi: Hàm ``name``, ``symbol``, và ``decimals``

source: We then also add a few helper functions to set and retrieve values from the contract. Notice that these helper functions reference each of the ``set_key`` definitions when the contract is deployed; a generic ``get_key`` function to retrieve values is also used.
fr: Nous ajoutons ensuite quelques fonctions utilitaires pour définir et récupérer les valeurs du contrat. Remarquez que ces fonctions utilitaires font référence à chacune des définitions de ``set_key`` lorsque le contrat est déployé ; une fonction générique ``get_key`` pour récupérer les valeurs est également utilisée.
tr: Ardından, kontrattan değerleri almak ve ayarlamak için birkaç yardımcı işlev de ekliyoruz.Bu yardımcı işlevlerin, kontrat dağıtıldığında ``set_key`` tanımlarının her birine başvurduğuna dikkat edin; değerleri almak için genel bir ``get_key`` işlevi de kullanılır.
vi: Sau đó, chúng tôi cũng thêm một vài hàm trợ giúp để thiết lập và truy xuất các giá trị từ hợp đồng. Lưu ý rằng các hàm trợ giúp này tham chiếu đến từng định nghĩa ``set_key`` khi hợp đồng được triển khai; một hàm loại ``get_key`` để truy xuất các giá trị cũng được sử dụng.

source: The ``total_supply``, ``balance_of``, and ``allowance`` functions
fr: Les fonctions ``total_supply``, ``balance_of``, et ``allowance``
tr: ``total_supply``, ``balance_of``, ve ``allowance`` işlevleri
vi: Hàm ``total_supply``, ``balance_of``, và ``allowance``

source: Let's explore the implementation of some key ERC-20 methods: ``balance_of``, ``total_supply``, and ``allowance``.
fr: Explorons l'implémentation de certaines méthodes clés de ERC-20 : ``balance_of``, ``total_supply``, et ``allowance``.
tr: Bazı önemli ERC-20 yöntemlerinin uygulanmasını inceleyelim: ``total_supply``, ve ``allowance``.
vi: Hãy cùng khám phá việc triển khai một số phương thức ERC-20 chính: ``balance_of``, ``total_supply``, và ``allowance``.

source: The ``allowance`` method enables owners to specify an amount that a spender account can spend.
fr: La méthode ``allowance`` permet aux propriétaires de spécifier un montant qu'un compte de dépense peut dépenser.
tr: ``allowance`` yöntemi, sahiplerinin harcama yapan bir hesabın harcayabileceği bir tutarı belirlemesine olanak tanır.
vi: Phương thức ``allowance`` cho phép chủ sở hữu chỉ định số tiền mà tài khoản người chi tiêu có thể chi tiêu.

source: The ``transfer`` function
fr: La fonction ``transfer``
tr: ``transfer`` işlevi
vi: Hàm ``transfer``

source: Here is the ``transfer`` method, which makes it possible to transfer tokens from the ``sender`` address to the ``recipient`` address. If the ``sender`` address has enough balance, then tokens should be transferred to the ``recipient`` address.
fr: La méthode ``transfer`` permet de transférer des jetons de l'adresse ``sender`` (expéditeur) à l'adresse ``recipient`` (destinataire). Si l'adresse de l'expéditeur a un solde suffisant, les jetons sont transférés à l'adresse du destinataire.
tr: İşte ``sender`` adresinden ``recipient`` adresine token aktarımını mümkün kılan ``transfer`` yöntemi. Eğer ``sender`` adresi yeterli bakiyeye sahipse, tokenler ``recipient`` adresine aktarılmalıdır.
vi: Đây là phương thức ``transfer``, giúp bạn có thể chuyển mã thông báo từ địa chỉ ``sender`` sang địa chỉ ``recipient``. Nếu địa chỉ ``sender`` có đủ số dư, thì mã thông báo sẽ được chuyển đến địa chỉ ``recipient``.

source: The ``approve`` and ``transfer_from`` functions
fr: Les fonctions ``approve`` et ``transfer_from``
tr: ``approve`` ve ``transfer_from`` işlevleri
vi: Hàm ``approve`` và ``transfer_from``

source: Here are the functions ``approve`` and ``transfer_from``. ``approve`` is used to allow another address to spend tokens on one's behalf. This is used when multiple keys are authorized to perform deployments from an account.
fr: Voici les fonctions ``approve`` et ``transfer_from``. ``approve`` est utilisée pour autoriser une autre adresse à dépenser des jetons en son nom. Ceci est utilisé lorsque plusieurs clés sont autorisées à effectuer des déploiements à partir d'un compte.
tr: İşte ``approve`` ve ``transfer_from`` işlevleri. ``approve``, başka bir adresin kendi adına tokenker harcamasına izin vermek için kullanılır. Bu, bir hesaptan dağıtım gerçekleştirmek için birden çok anahtara yetki verildiğinde kullanılır.
vi: Dưới đây là các hàm ``approve`` và ``transfer_from``. ``approve`` được sử dụng để cho phép một địa chỉ khác sử dụng mã thông báo thay mặt cho một người. Điều này được sử dụng khi nhiều khóa được ủy quyền để thực hiện triển khai từ một tài khoản.

source: ``transfer_from`` allows spending an approved amount of tokens.
fr: ``transfer_from`` permet de dépenser un montant approuvé de jetons.
tr: ``transfer_from``, onaylanmış miktardaki bir token harcanmasına izin verir.
vi: ``transfer_from`` cho phép chi tiêu một lượng token đã được duyệt.

source: The ``get_key`` and ``set_key`` functions
fr: Les fonctions ``get_key`` et ``set_key``
tr: ``get_key`` ve ``set_key`` işlevleri
vi: Hàm ``get_key`` và ``set_key``

source: The ``get_key`` and ``set_key`` functions are generic Casper storage write and read methods. Implement these one time for the contract and then call them as needed.
fr: Les fonctions ``get_key`` et ``set_key`` sont des méthodes génériques d'écriture/lecture du stockage Casper. Implémentez-les une fois pour le contrat, puis appelez-les si nécessaire.
tr: ``get_key`` ve ``set_key`` işlevleri, genel Casper depolama yazma ve okuma yöntemleridir. Bunları kontrat için bir kez uygulayın ve ardından gerektiğinde arama yapın.
vi: Các hàm ``get_key`` and ``set_key`` là các phương thức ghi và đọc lưu trữ chung của Casper. Thực hiện những điều này một lần cho hợp đồng và sau đó gọi chúng khi cần thiết.

source: Other Helper Functions
fr: Autres fonctions utilitaires
tr: Diğer Yardımcı İşlevler
vi: Hàm hỗ trợ khác

source: The ``balance_key`` and ``allowance_key ``functions format the balances and account information from their internal representation into strings.
fr: Les fonctions ``balance_key`` et ``allowance_key`` formatent les soldes et les informations de compte de leur représentation interne en chaînes de caractères.
tr: ``balance_key`` ve ``allowance_key `` işlevleri, bakiyeleri ve hesap bilgilerini dahili gösterimlerinden dizgelere biçimlendirir.

source: The ``balance_key`` and ``allowance_key`` functions format the balances and account information from their internal representation into strings.
vi: Các hàm ``balance_key`` và ``allow_key`` định dạng số dư và thông tin tài khoản từ biểu diễn nội bộ của chúng thành chuỗi.
