Repository: casper-network/docs-archive
Catalog: locale/*/LC_MESSAGES/dapp-dev-guide/tutorials/erc20/tests.po
Languages: fr, tr, vi

source: Testing the Contract
fr: Test du Contrat
tr: Kontratın Test Edilmesi
vi: Kiểm thử hợp đồng

source: The testing framework in this tutorial uses the `Casper engine test support <https://crates.io/crates/casper-engine-test-support>`_ crate for testing the contract implementation against the Casper execution environment.
fr: Le framework de test de ce tutoriel utilise le paquet (crate) `Casper engine test support <https://crates.io/crates/casper-engine-test-support>`_ pour tester l'implémentation du contrat dans l'environnement d'exécution de Casper.
tr: Bu eğitimdeki test çatısı, kontrat uygulamasını Casper yürütme ortamına karşı test etmek için `Casper motor test destek <https://crates.io/crates/casper-engine-test-support>`_ paketini kullanır.
vi: Khung kiểm thử trong hướng dẫn này sử dụng ``Hỗ trợ kiểm thử Casper engine <https://crates.io/crates/casper-engine-test-support>`_ gói để kiểm tra việc triển khai hợp đồng dựa trên môi trường thực thi Casper.

source: We will review the following three `GitHub <https://github.com/casper-ecosystem/erc20/tree/master/tests/src>`_ files, which create the testing framework:
fr: Nous allons passer en revue les trois fichiers `GitHub <https://github.com/casper-ecosystem/erc20/tree/master/tests/src>`_ suivants, qui créent le cadre de test :
tr: Test çatısını oluşturan aşağıdaki üç `GitHub <https://github.com/casper-ecosystem/erc20/tree/master/tests/src>`_ dosyasını inceleyeceğiz:
vi: Chúng tôi sẽ xem xét ba tệp tạo ra khung kiểm thử sau đây `GitHub <https://github.com/casper-ecosystem/erc20/tree/master/tests/src>`:

source: ``tests/src/erc20.rs`` - sets up the testing context and creates helper functions used by unit tests
fr: ``tests/src/erc20.rs`` - configure le contexte de test et crée les fonctions utilitaires requises par les tests unitaires.
tr: ``tests/src/erc20.rs`` - test bağlamını ayarlar ve birim testleri tarafından kullanılan yardımcı işlevler oluşturur
vi: ``tests/src/erc20.rs`` - thiết lập ngữ cảnh kiểm thử và tạo các chức năng trợ giúp được sử dụng bởi các kiểm thử đơn vị

source: ``tests/src/tests.rs`` - contains the unit tests
fr: ``tests/src/tests.rs`` - contient les tests unitaires
tr: `tests/src/tests.rs`` - birim testlerini içerir
vi: ``tests/src/tests.rs`` - chứa các kiểm thử đơn vị

source: ``tests/src/lib.rs`` - links the above files together and is required by the Rust toolchain
fr: ``tests/src/lib.rs`` - lie les fichiers ci-dessus ensemble et est requis par la toolchain Rust.
tr: ``tests/src/lib.rs`` - yukarıdaki dosyaları birbirine bağlar ve Rust araçzinciri tarafından ihtiyaç duyulur
vi: ``tests/src/lib.rs`` - liên kết các tệp trên với nhau và được yêu cầu bởi chuỗi công cụ Rust

source: The following is an example of a complete test:.:
fr: Voici un exemple de test complet :.. :
tr: Aşağıdaki tam bir test örneğidir:.:
vi: Sau đây là một ví dụ về một bài kiểm thử hoàn chỉnh:.:

source: The `tests crate <https://github.com/casper-ecosystem/erc20/tree/master/tests>`_ has a ``build.rs`` file, which is effectively a custom build script executed every time before running the tests. The ``build.rs`` file compiles the `contract crate <https://github.com/casper-ecosystem/erc20/tree/master/contract>`_ in *release* mode and copies the ``contract.wasm`` file to the ``tests/wasm`` directory. In practice, that means you only need to run a single command during development, which is **make test**.
fr: Le `packet tests <https://github.com/casper-ecosystem/erc20/tree/master/tests>`_ possède un fichier ``build.rs``, qui est effectivement un script de build personnalisé exécuté à chaque fois avant de lancer les tests. Le fichier ``build.rs`` compile le `contract crate <https://github.com/casper-ecosystem/erc20/tree/master/contract>`_ en mode *release* et copie le fichier ``contract.wasm`` dans le répertoire ``tests/wasm``. En pratique, cela signifie que vous n'avez besoin d'exécuter qu'une seule commande pendant le développement, qui est **make test**.
tr: `testler paketi <https://github.com/casper-ecosystem/erc20/tree/master/tests>`_ ``build.rs`` dosyasına sahiptir , bu etkin olarak, testleri çalıştırmadan önce her seferinde yürütülen özel bir derleme betiğidir. ``build.rs`` dosyası *release* modunda `kontrat paketini <https://github.com/casper-ecosystem/erc20/tree/master/contract>`_ derler ve ``contract.wasm`` dosyasını ``tests/wasm`` dizinine kopyalar. Pratikte bu, geliştirme sırasında yalnızca tek bir komut çalıştırmanız gerektiği anlamına gelir, bu **make test** komutudur.
vi: `Gói kiểm thử <https://github.com/casper-ecosystem/erc20/tree/master/tests>`_ có tệp ``build.rs`` là một script xây dựng tùy chỉnh được thực thi một cách hiệu quả mỗi lần trước khi chạy Các bài kiểm thử. Tệp ``build.rs`` biên dịch `gói hợp đồng <https://github.com/casper-ecosystem/erc20/tree/master/contract>`_ ở chế độ *release* và sao chép tệp ``contract.wasm`` vào thư mục ``tests/wasm``. Trong thực tế, điều đó có nghĩa là bạn chỉ cần chạy một lệnh duy nhất trong quá trình phát triển, đó là **make test**.

source: Configuring the Test Package
fr: Configuration du package de test
tr: Test Paketini Yapılandırma
vi: Cấu hình gói kiểm thử

source: First, we define a ``tests`` package in the ``tests/Cargo.toml`` file.
fr: D'abord, nous définissons un package ``tests`` dans le fichier ``tests/Cargo.toml``.
tr: İlk olarak, ``tests/Cargo.toml`` içerisinde bir ``tests`` paketi tanımlarız
vi: Đầu tiên, chúng tôi xác định gói ``tests`` trong tệp ``tests/Cargo.toml``.

source: Describing the Logic for Testing
fr: Description de la logique de test
tr: Test Mantığını Tanımlama
vi: Mô tả Logic để kiểm thử

source: To test the smart contract, we need to specify the starting state of the blockchain, deploy the compiled contract to this starting state, and create additional deploys for each of the methods in the contract.
fr: Pour tester le contrat intelligent, nous devons spécifier l'état de départ de la blockchain, déployer le contrat compilé dans cet état de départ et créer des déploiements supplémentaires pour chacune des méthodes du contrat.
tr: Akıllı kontratı test etmek için blokzincir başlangıç ​​durumunu belirtmemiz, derlenmiş kontratı bu başlangıç ​​durumuna dağıtmamız ve kontrat içindeki yöntemlerin her biri için ek dağıtımlar oluşturmamız gerekiyor.
vi: Để kiểm thử hợp đồng thông minh, chúng ta cần chỉ định trạng thái bắt đầu của chuỗi khối, triển khai hợp đồng đã biên dịch đến trạng thái bắt đầu này và tạo các triển khai bổ sung cho từng phương thức trong hợp đồng.

source: The ``tests/src/erc20.rs`` file contains methods that can simulate a real-world deployment (storing the contract in the blockchain) and transactions to invoke the methods in the contract.
fr: Le fichier ``tests/src/erc20.rs`` contient des méthodes qui peuvent simuler un déploiement dans le monde réel (stockage du contrat dans la blockchain) et des transactions pour invoquer les méthodes du contrat.
tr: ``tests/src/erc20.rs`` dosyası, gerçek dünya dağıtımını (kontratı blokzincir içerisinde depolama) simüle edebilen yöntemleri ve kontrat içerisindeki yöntemleri çağırmak için olan işlemleri içerir.
vi: Tệp ``tests/src/erc20.rs`` chứa các phương thức có thể mô phỏng việc triển khai trong thế giới thực (lưu trữ hợp đồng trong chuỗi khối) và các giao dịch để gọi các phương thức trong hợp đồng.

source: Setting up the testing context
fr: Mise en place du contexte de test
tr: Test bağlamını ayarlama
vi: Thiết lập ngữ cảnh kiểm thử

source: Let's start by defining the required constants (i.e., method names, key names, and account addresses). The following code initializes the `global state <https://docs.casperlabs.io/en/latest/glossary/G.html#global-state>`_ with all the data and methods that a smart contract needs to run correctly.
fr: Commençons par définir les constantes requises (c'est-à-dire les noms de méthodes, les noms de clés et les adresses de comptes). Le code suivant initialise l'état global `global state <https://docs.casperlabs.io/fr/latest/glossary/G.html#global-state>`_ avec toutes les données et méthodes dont un contrat intelligent a besoin pour fonctionner correctement.
tr: Gerekli sabitleri tanımlayarak başlayalım (yani, yöntem adları, anahtar adları ve hesap adresleri). Aşağıdaki kod, bir akıllı kontratın doğru çalışması için gereken tüm veri ve yöntemlerle `küresel durumu <https://docs.casperlabs.io/en/latest/glossary/G.html#global-state>`_ başlatır.
vi: Hãy bắt đầu bằng cách xác định các hằng số bắt buộc (tức là tên phương thức, tên khóa và địa chỉ tài khoản). Đoạn mã sau khởi tạo `global state <https://docs.casperlabs.io/en/latest/glossary/G.html#global-state>`_ với tất cả dữ liệu và phương thức mà hợp đồng thông minh cần để chạy chính xác.

source: Deploying the contract
fr: Déploiement du contrat
tr: Kontratı dağıtma
vi: Triển khai hợp đồng

source: The next step is to define the ``ERC20Contract`` struct that has its own VM instance and implements the ERC-20 methods. This struct holds a ``TestContext`` of its own. The *contract_hash* and the *session_code* won’t change after the contract is deployed, so it is good to keep them handy.
fr: L'étape suivante consiste à définir la structure ``ERC20Contract`` qui possède sa propre instance VM et implémente les méthodes ERC-20. Cette structure contient un ``TestContext`` qui lui est propre. Le *contract_hash* et le *session_code* ne changeront pas après le déploiement du contrat, il est donc bon de les garder à portée de main.
tr: Bir sonraki adım, kendi VM örneğine sahip olan ve ERC-20 yöntemlerini uygulayan ``ERC20Contract`` yapısını tanımlamaktır. Bu yapı kendi başına bir ``TestContext`` tutar. *contract_hash* ve *session_code*, kontrat dağıtıldıktan sonra değişmeyecektir, bu nedenle bunları elinizin altında bulundurmak iyidir.
vi: Bước tiếp theo là xác định cấu trúc ``ERC20Contract`` có phiên bản VM của riêng nó và triển khai các phương thức ERC-20. Cấu trúc này chứa một ``TestContext`` của riêng nó. *contract_hash* và *session_code* sẽ không thay đổi sau khi hợp đồng được triển khai, vì vậy tốt hơn hết là bạn nên giữ chúng để tiện sử dụng.

source: This code snippet builds the context and includes the compiled ``contract.wasm`` binary being tested. This function creates a new instance of the ``ERC20Contract`` with the accounts ``ali``\ , ``bob`` and ``joe`` having a positive initial balance. The contract is deployed using the ``ali`` account.
fr: Cet extrait de code construit le contexte et inclut le binaire compilé ``contract.wasm`` à tester. Cette fonction crée une nouvelle instance du contrat ``ERC20Contract`` avec les comptes ``ali``\, ``bob`` et ``joe`` ayant un solde initial positif. Le contrat est déployé en utilisant le compte ``ali``.
tr: Bu kod parçacığı, bağlamı oluşturur ve test edilen derlenmiş ``contract.wasm`` ikili kodunu içerir. Bu işlev, pozitif bir başlangıç ​​bakiyesine sahip ``ali``\ , ``bob`` ve ``joe`` hesaplarıyla ``ERC20Contract``ın yeni bir örneğini oluşturur. Kontrat, ``ali`` hesabı kullanılarak dağıtılır.
vi: Đoạn mã này xây dựng ngữ cảnh và bao gồm tệp nhị phân ``contract.wasm`` đã biên dịch đang được kiểm thử. Hàm này tạo một trường hợp mới của ``ERC20Contract`` với các tài khoản ``ali``\ , ``bob`` và ``joe`` có số dư ban đầu dương. Hợp đồng được triển khai bằng tài khoản `` ali``.

source: Querying the network
fr: Interrogation du réseau
tr: Ağı sorgulamak
vi: Truy vấn tới mạng

source: The previous step has simulated a real deploy on the network. The next code snippet describes how to query the network to find the *contract hash*.
fr: L'étape précédente a simulé un déploiement réel sur le réseau. L'extrait de code suivant décrit comment interroger le réseau pour trouver le *contract hash*.
tr: Önceki adım, ağ üzerinde gerçek bir dağıtımı simüle etti. Sonraki kod parçacığı, *contract hash* bulmak için ağın nasıl sorgulanacağını tanımlar.
vi: Bước trước đó đã mô phỏng một triển khai thực trên mạng. Đoạn mã tiếp theo mô tả cách truy vấn mạng để tìm *contract hash*.

source: Contracts are deployed under the context of an account. Since we created the deploy under the context of ``self.ali``\ , this is what we will query here. The ``query_contract`` function uses ``query`` to lookup named keys. It will be used to implement the ``balance_of``\ , ``total_supply`` and ``allowance`` checks.
fr: Les contrats sont déployés dans le contexte d'un compte. Comme nous avons créé le déploiement dans le contexte de ``self.ali``, c'est ce que nous allons interroger ici. La fonction ``query_contract`` utilise ``query`` pour rechercher des clés nommées. Elle sera utilisée pour implémenter les contrôles ``balance_of``, ``total_supply`` et ``allowance``.
tr: Kontratlar bir hesabın bağlamı altında dağıtılır. ``self.ali``\ bağlamı altında dağıtımı oluşturduğumuz için, burada sorgulayacağımız şey budur. ``query_contract`` işlevi, adlandırılmış anahtarları aramak için ``query`` kullanır. ``balance_of``\ , ``total_supply`` ve ``allowance`` kontrollerini uygulamak için kullanılacaktır.
vi: Các hợp đồng được triển khai theo ngữ cảnh của một tài khoản. Vì chúng tôi đã tạo triển khai trong ngữ cảnh của ``self.ali``\, đây là những gì chúng tôi sẽ truy vấn ở đây. Hàm ``query_contract`` sử dụng ``query`` để tra cứu các khóa đã đặt tên. Nó sẽ được sử dụng để thực hiện kiểm tra ``balance_of``\ , ``total_supply`` và ``allowance``.

source: Invoking contract methods
fr: Appel des méthodes du contrat
tr: Kontrat yöntemleri çağırma
vi: Gọi các phương thức của hợp đồng

source: The following code snippet describes a generic way to call a specific entry point in the contract.
fr: L'extrait de code suivant décrit une manière générique d'appeler un point d'entrée spécifique dans le contrat.
tr: Aşağıdaki kod parçacığı, kontrat içerisindeki belirli bir giriş noktasını çağırmanın genel bir yolunu tanımlar.
vi: Đoạn mã sau đây mô tả cách để gọi một điểm vào cụ thể trong hợp đồng.

source: **Invoking the contract methods**
fr: **Invocation des méthodes du contrat**
tr: **Kontrat yöntemlerini çağırma**
vi: **Gọi các phương thức của hợp đồng**

source: Here is how to invoke each of the methods in the contract:
fr: Voici comment invoquer chacune des méthodes du contrat :
tr: Kontrat içerisindeki yöntemlerin her birini nasıl çağıracağınız aşağıda açıklanmıştır:
vi: Đây là cách gọi từng phương thức trong hợp đồng:

source: Creating Unit Tests
fr: Création de tests unitaires
tr: Birim Testleri Oluşturma
vi: Tạo mới các kiểm thử đơn vị

source: Now that we have a testing context, we can use it to create unit tests in the file called ``tests/src/tests.rs``. The unit tests verify the contract code by invoking the functions defined in ``tests/src/erc20.rs``.
fr: Maintenant que nous avons un contexte de test, nous pouvons l'utiliser pour créer des tests unitaires dans le fichier ``tests/src/tests.rs``. Les tests unitaires vérifient le code du contrat en invoquant les fonctions définies dans ``tests/src/erc20.rs``.
tr: Artık bir test bağlamımız olduğuna göre, bunu ``tests/src/tests.rs`` adlı dosyada birim testleri oluşturmak için kullanabiliriz. Birim testleri, ``tests/src/erc20.rs`` içinde tanımlanmış işlevleri çağırarak kontrat kodunu doğrular.
vi: Bây giờ chúng ta đã có ngữ cảnh kiểm thử, chúng ta có thể sử dụng nó để tạo các bài kiểm tra đơn vị trong tệp có tên là ``tests/src/tests.rs``. Các bài kiểm thử đơn vị xác minh mã hợp đồng bằng cách gọi các chức năng được xác định trong ``tests/src/erc20.rs``.

source: Running the Tests
fr: Exécution des Tests
tr: Testleri Çalıştırma
vi: Chạy kiểm thử

source: Next, we configure the ``lib.rs`` file to run everything via the *make test* command. Within the ``tests/src/lib.rs`` file, we added the following lines:
fr: Ensuite, nous configurons le fichier ``lib.rs`` pour tout exécuter via la commande *make test*. Dans le fichier ``tests/src/lib.rs``, nous avons ajouté les lignes suivantes :
tr: Daha sonra ``lib.rs`` dosyasını *make test* komutu ile her şeyi çalıştıracak şekilde yapılandırıyoruz. ``tests/src/lib.rs`` dosyasının içine şu satırları ekledik:
vi: Tiếp theo, chúng ta cấu hình tệp ``lib.rs`` để chạy mọi thứ thông qua lệnh *make test*. Trong tệp ``tests/src/lib.rs``, chúng tôi đã thêm các dòng sau:

source: Next, let's run the tests:
fr: Ensuite, exécutons les tests :
tr: Ardından testleri çalıştıralım:
vi: Tiếp theo, hãy chạy kiểm thử:

source: This example uses ``bash``. If you are using a Rust IDE, you need to configure it to run the tests.
fr: Cet exemple utilise ``bash``. Si vous utilisez un IDE Rust, vous devez le configurer pour exécuter les tests.
tr: Bu örnek ``bash`` kullanır. Eğer bir Rust IDE kullanıyorsanız, testleri çalıştırmak için onu yapılandırmanız gerekir.
vi: Ví dụ này sử dụng ``bash``. Nếu bạn đang sử dụng Rust IDE, bạn cần cấu hình nó để chạy các bài kiểm thử.
