Repository: casper-network/docs-archive
Catalog: locale/*/LC_MESSAGES/faq/index.po
Languages: fr, tr, vi

source: FAQs regarding the Casper network, CasperLabs, and the CSPR token sale.
fr: FAQ relatives au réseau Casper, à CasperLabs et à la vente de jetons CSPR.
tr: Casper Network, CasperLabs ve CSPR token satışı ile ilgili sıkça sorulan sorular.
vi: Câu hỏi thường gặp về mạng Casper, CasperLabs và việc bán token CSPR.

source: Casper Network
fr: Réseau Casper

source: What is Casper?
fr: C'est quoi Casper ?
tr: Casper Nedir?
vi: Casper là gì?

source: Casper is an open-source Proof-of-Stake blockchain network built off the CBC (`Correct-by-Construction <https://github.com/cbc-casper/cbc-casper-paper>`_) Casper specification originally established by early Ethereum developers. The Casper network is optimized for enterprise and developer adoption by focusing on unique features like upgradeable contracts, predictable network fees, privacy flexibility, on-chain governance, and developer-friendly languages. Casper solves the scalability trilemma by allowing development teams to build with confidence that the network will optimize for security, decentralization, and high throughput.
fr: Casper est un réseau blockchain open-source Proof-of-Stake construit à partir de la spécification CBC (`Correct-by-Construction <https://github.com/cbc-casper/cbc-casper-paper>`_) Casper établie à l'origine par les premiers développeurs d'Ethereum. Le réseau Casper offres des caractéristiques uniques comme les contrats évolutifs, les frais de réseau prévisibles, la flexibilité en terme de confidentialité, la gouvernance sur la chaîne (on-chain governance) et les langages conviviaux pour les développeurs. Il est donc optimisé et conçu pour l'adoption par les entreprises et les développeurs. Casper résout le trilemme de l'évolutivité en permettant aux équipes de développement de concevoir en ayant la certitude que le réseau offrira une sécurité optimale, une décentralisation et un débit élevé.
tr: Casper, aslen erken dönem Ethereum geliştiricileri tarafından oluşturulmuş olan is CBC (`Correct-by-Construction <https://github.com/cbc-casper/cbc-casper-paper>`_) Casper belirtimi üzerine inşa edilmiş, açık kaynak bir Pay-Kanıtı (Proof-of-Stake) blokzincir ağıdır. Casper ağı, güncellenebilir kontratlar, öngörülebilir ağ ücretleri, mahremiyet esnekliği, doğrudan zincir üzerinde yönetişim ve geliştirici dostu diller gibi özgün özelliklere odaklanarak, kurumsal ve geliştirici düzeyinde benimsenmek üzere en iyi hale getirilmiştir. Casper; geliştirici ekiplerinin, ağın güvenlik, merkeziyetsizlik ve yüksek çıktı hızı için en uygun şekilde davranacağına güvenerek projeler inşa etmelerine olanak tanıyarak, ölçeklenebilirlik sorununu çözer.
vi: Casper là mạng blockchain Proof-of-Stake mã nguồn mở được xây dựng dựa trên CBC (`Correct-by-Construction <https://github.com/cbc-casper/cbc-casper-paper>`_) Đặc điểm kỹ thuật của Casper ban đầu được thiết lập bởi các nhà phát triển Ethereum ban đầu. Mạng Casper được tối ưu hóa để doanh nghiệp và nhà phát triển chấp nhận bằng cách tập trung vào các tính năng độc đáo như hợp đồng có thể nâng cấp, phí mạng có thể đoán trước, tính linh hoạt của quyền riêng tư, quản trị trên chuỗi và ngôn ngữ thân thiện với nhà phát triển. Casper giải quyết vấn đề nan giải về khả năng mở rộng bằng cách cho phép các nhóm phát triển xây dựng với niềm tin rằng mạng sẽ tối ưu hóa cho bảo mật, phân quyền và thông lượng cao.

source: When is Casper’s mainnet launch?
fr: Quand le réseau principal Mainnet de Casper sera-t-il lancé ?
tr: Casper’ın ana ağı (mainnet) ne zaman faaliyete geçiyor?
vi: Khi nào ra mắt mạng chính của Casper?

source: Casper’s mainnet launch will occur in Q1 2021.
fr: Le lancement du réseau principal de Casper aura lieu au premier trimestre 2021.
tr: Casper'ın ana ağ lansmanı 2021 yılının ilk çeyreğinde gerçekleşecek.
vi: Mạng chính của Casper ra mắt vào Q1 2021.

source: How does Casper solve the trilemma of security, decentralization, and scalability?
fr: Comment Casper résout-il le trilemme de la sécurité, de la décentralisation et de l'évolutivité ?
tr: Casper güvenlik, ademi merkeziyetçilik ve ölçeklenebilirlik üçlemesini nasıl çözüyor?
vi: Làm cách nào để Casper giải quyết vấn đề nan giải về bảo mật, phân quyền và khả năng mở rộng?

source: As a Proof-of-Stake (PoS) network, Casper relies on a set of validators to uphold the network. PoS validators do not require the same hardware setup as Proof-of-Work networks, allowing validators to be more geographically decentralized and eliminating the centralizing pressures of economies of scale. PoS also enables scalability mechanisms like sharding, a forthcoming feature to allow the network to process multiple transactions simultaneously, improving overall throughput.
fr: En tant que réseau Proof-Of-Stake (PoS), Casper s'appuie sur un ensemble de validateurs pour maintenir le réseau. Les validateurs PoS ne nécessitent pas la même configuration matérielle que les réseaux Proof-of-Work, ce qui permet aux validateurs d'être plus décentralisés géographiquement et d'éliminer les pressions centralisatrices des économies d'échelle. Le PoS permet également des mécanismes d'évolutivité tels que le sharding, une fonctionnalité à venir qui permettra au réseau de traiter plusieurs transactions simultanément, améliorant ainsi le débit global.
tr: Bir Hisse Kanıtı (PoS) ağı olarak Casper, ağı korumak için bir dizi doğrulayıcıya güvenir. PoS doğrulayıcıları, İş Kanıtı ağlarıyla aynı donanım kurulumunu gerektirmez, bu da doğrulayıcıların coğrafi olarak daha merkeziyetsiz olmamasına ve ölçek ekonomilerinin merkezileştirme baskılarını ortadan kaldırmasına olanak tanır. PoS ayrıca, ağın aynı anda birden fazla işlemi işlemesine izin veren ve genel verimi iyileştiren gelecek bir özellik olan bölümlendirme (sharding) gibi ölçeklenebilirlik mekanizmalarını da sağlar.
vi: Là một mạng Proof-of-Stake (PoS), Casper dựa vào một tập hợp các nhà xác thực để duy trì mạng. Nhà xác thực PoS không yêu cầu thiết lập phần cứng giống như mạng Proof-of-Work, cho phép nhà xác thực được phân cấp về mặt địa lý hơn và loại bỏ áp lực tập trung hóa lợi thế kinh tế theo quy mô. PoS cũng cho phép các cơ chế khả năng mở rộng như sharding, một tính năng sắp ra mắt để cho phép mạng xử lý nhiều giao dịch đồng thời, cải thiện thông lượng tổng thể.

source: What is unique about Casper’s blockchain architecture?
fr: En quoi l'architecture blockchain de Casper est-elle unique ?
tr: Casper'ın blokzincir mimarisinde benzersiz olan nedir?
vi: Kiến trúc chuỗi khối của Casper có gì độc đáo?

source: The Highway Protocol is the specific implementation of PoS that supports the Casper network. Highway has two primary benefits over classic Byzantine Fault Tolerant consensus mechanisms. First, Highway enables the network to reach higher thresholds of finality. Second, it achieves flexibility in a way not possible in typical BFT models. `Learn more about Highway <https://blog.casperlabs.io/the-casper-network-highway-consensus-protocol/>`_.
fr: Le protocole Highway est l'implémentation spécifique de PoS qui supporte le réseau Casper. Highway présente deux avantages principaux par rapport aux mécanismes de consensus classiques 'Byzantine Fault Tolerant (BFT)' classiques. Premièrement, Highway permet au réseau d'atteindre des seuils de finalité plus élevés. Ensuite, il offre une flexibilité que les modèles BFT ne permettent pas. `En savoir plus sur Highway <https://blog.casperlabs.io/the-casper-network-highway-consensus-protocol/>`_.
tr: Highway Protokolü, Casper ağını destekleyen özel PoS uygulamasıdır. Highway'in klasik Byzantine Hata Toleranslı mutabakat mekanizmalarına göre iki temel avantajı vardır. İlk olarak, Highway, ağın daha yüksek kesinlik eşiklerine ulaşmasını sağlar. İkincisi, tipik BFT modellerinde mümkün olmayan bir şekilde esneklik sağlar. `Highway hakkında daha fazla bilgi edinin <https://blog.casperlabs.io/the-casper-network-highway-consensus-protocol/>`_.
vi: Giao thức Highway là triển khai cụ thể của PoS mà hỗ trợ mạng Casper. Highway có hai lợi ích chính so với cơ chế đồng thuận Byzantine Fault Tolerant cổ điển. Đầu tiên, Highway cho phép mạng đạt đến ngưỡng cuối cùng cao hơn. Thứ hai, nó đạt được tính linh hoạt theo cách không thể có trong các mô hình BFT điển hình. `Tìm hiểu thêm về Highway <https://blog.casperlabs.io/the-casper-network-highway-consensus-protocol/>`_.

source: Why is Casper a good fit for enterprises and developers?
fr: Pourquoi Casper est-il un bon choix pour les entreprises et les développeurs ?
tr: Casper neden işletmeler ve geliştiriciler için uygundur?
vi: Tại sao Casper lại phù hợp với các doanh nghiệp và nhà phát triển?

source: Casper is optimized for enterprise and developers through three main features: upgradeable contracts, developer-friendly languages, and forthcoming predictable network fees.
fr: Casper est optimisé pour les entreprises et les développeurs grâce à trois caractéristiques principales : des contrats évolutifs, des langages conviviaux pour les développeurs et des frais de réseau prévisibles.
tr: Casper, işletmeler ve geliştiriciler için üç ana özellik aracılığıyla optimize edilmiştir: yükseltilebilir kontratlar, geliştirici dostu diller ve yaklaşan öngörülebilir ağ ücretleri.
vi: Casper được tối ưu hóa cho doanh nghiệp và nhà phát triển thông qua ba tính năng chính: hợp đồng có thể nâng cấp, ngôn ngữ thân thiện với nhà phát triển và phí mạng sắp tới có thể dự đoán.

source: **Upgradeable Contracts**. Casper enables on-chain smart contracts to be directly upgraded, removing the need for complex and migration processes and making it easier to patch smart contract vulnerabilities.
fr: **Contrats évolutifs**. Casper permet de mettre à niveau directement les contrats intelligents sur la chaîne, ce qui élimine la nécessité de passer par des processus de migration complexes et facilite la correction des vulnérabilités des contrats intelligents.
tr: **Yükseltilebilir Kontratlar**. Casper, zincir üzerindeki akıllı kontratların doğrudan yükseltilmesini sağlayarak karmaşık geçiş süreçlerine olan ihtiyacı ortadan kaldırır ve akıllı kontrat güvenlik açıklarını düzeltmeyi kolaylaştırır.
vi: **Hợp đồng có thể nâng cấp**. Casper cho phép các hợp đồng thông minh trên chuỗi được nâng cấp trực tiếp, loại bỏ nhu cầu về các quy trình phức tạp và di chuyển, đồng thời giúp vá các lỗ hổng hợp đồng thông minh dễ dàng hơn.

source: **Developer-Friendly Languages**. Casper supports developers building with WebAssembly. The network’s development ecosystem is designed to be familiar to existing Web2 developers instead of being written in a proprietary language like Solidity. This provides an easier path for developers and businesses to start building with Casper immediately.
fr: **Langages adaptés aux développeurs**. Casper supporte les développements avec WebAssembly. L'écosystème de développement du réseau Casper est conçu pour être familier aux développeurs Web2 au lieu d'être écrit dans un langage propriétaire comme Solidity. Les développeurs et les entreprises peuvent ainsi commencer à développer immédiatement avec Casper.
tr: **Geliştirici Dostu Diller**. Casper, geliştiricilerin WebAssembly ile birşeyler inşa etmesini destekler. Ağın geliştirme ekosistemi, Solidity gibi özel bir dilde yazılmak yerine mevcut Web2 geliştiricilerine aşina olacak şekilde tasarlanmıştır. Bu, geliştiricilerin ve işletmelerin Casper ile hemen birşeyler inşa etmeye başlaması için daha kolay bir yol sağlar.
vi: **Ngôn ngữ thân thiện với nhà phát triển**. Casper hỗ trợ các nhà phát triển xây dựng bằng WebAssembly. Hệ sinh thái phát triển của mạng được thiết kế để quen thuộc với các nhà phát triển Web2 hiện tại thay vì được viết bằng ngôn ngữ độc quyền như Solidity. Điều này cung cấp một con đường dễ dàng hơn cho các nhà phát triển và doanh nghiệp để bắt đầu xây dựng với Casper ngay lập tức.

source: **Predictable Network Fees (In Development)**. Casper intends to incentivize active and diverse network behavior by establishing consistent, predictable, and transparent gas costs - eliminating volatility and improving both developer and user experience.
fr: **Frais de réseau prévisibles (en cours de développement)**. Casper entend encourager un comportement actif et diversifié du réseau en établissant des frais de gaz cohérents, prévisibles et transparents - éliminant ainsi la volatilité et améliorant l'expérience des développeurs et des utilisateurs.
tr: **Öngörülebilir Ağ Ücretleri (Geliştirme Aşamasında)**. Casper, değişkenliği ortadan kaldırarak ve hem geliştirici hem de kullanıcı deneyimini geliştirerek tutarlı, öngörülebilir ve şeffaf gaz maliyetleri oluşturarak aktif ve çeşitli ağ davranışını teşvik etmeyi amaçlamaktadır.
vi: **Phí mạng có thể đoán trước (Đang phát triển)**. Casper dự định khuyến khích hành vi mạng đa dạng và tích cực bằng cách thiết lập chi phí gas nhất quán, có thể dự đoán và minh bạch - loại bỏ sự biến động và cải thiện trải nghiệm của cả nhà phát triển và người dùng.

source: What’s an example of the Casper network in use?
fr: Existe-t-il un exemple d'utilisation du réseau Casper ?
tr: Casper ağının kullanımına bir örnek verebilir misiniz?
vi: Ví dụ về mạng Casper đang được sử dụng là gì?

source: IPwe is a global patent registry currently building on the Casper network. CasperLabs and IPwe have partnered to build a chain of custody (CoC) solution for public patent records. The “CoC Solution” will use the Casper public blockchain to store, secure, and trace patent data. `Learn more <https://blog.casperlabs.io/intellectual-property-and-patent-assets-on-casper/>`_.
fr: IPwe est un registre mondial des brevets qui s'appuie actuellement sur le réseau Casper. CasperLabs et IPwe se sont associés pour construire une solution de chaîne de possession (CoC) pour les registres publics de brevets. La "CoC solution" utilisera la blockchain publique Casper pour stocker, sécuriser et tracer les données des brevets. `En savoir plus <https://blog.casperlabs.io/intellectual-property-and-patent-assets-on-casper/>`_.
tr: IPwe, şu anda Casper ağı üzerinde oluşturulan küresel bir patent kaydıdır. CasperLabs ve IPwe, halka açık patent kayıtları için bir gözetim zinciri (CoC) çözümü oluşturmak üzere ortaklık kurdu. “CoC Çözümü”, patent verilerini depolamak, güvence altına almak ve izlemek için Casper genel blokzincirini kullanacak. `Daha fazla bilgi edinin <https://blog.casperlabs.io/intellectual-property-and-patent-assets-on-casper/>`_.
vi: IPwe là cơ quan đăng ký bằng sáng chế toàn cầu hiện đang được xây dựng trên mạng Casper. CasperLabs và IPwe đã hợp tác để xây dựng giải pháp chuỗi nguồn gốc sản phẩm (CoC) cho các hồ sơ bằng sáng chế công khai. “Giải pháp CoC” sẽ sử dụng chuỗi khối công cộng Casper để lưu trữ, bảo mật và theo dõi dữ liệu bằng sáng chế. `Learn more <https://blog.casperlabs.io/intellectual-property-and-patent-assets-on-casper/>`_.

source: How can I learn more about the Casper network?
fr: Comment puis-je en savoir plus sur le réseau Casper ?
tr: Casper ağı hakkında nasıl daha fazla bilgi edinebilirim?
vi: Làm cách nào để tìm hiểu thêm về mạng Casper?

source: Visit the `CasperLabs website <https://casperlabs.io/>`_, `read the blog <https://blog.casperlabs.io/>`_, and `join our community <https://casperlabs.io/community/>`_.
fr: Visitez le site web de `CasperLabs <https://casperlabs.io/>`_, `lisez le blog <https://blog.casperlabs.io/>`_, et `rejoignez notre communauté <https://casperlabs.io/community/>`_.
tr: `CasperLabs web sayfası <https://casperlabs.io/>`_nı ziyaret edin, `blog <https://blog.casperlabs.io/>`_u okuyun ve ` topluluğa katılın <https://casperlabs.io/community/>`_.
vi: Truy cập `CasperLabs website <https://casperlabs.io/>`_, `đọc blog <https://blog.casperlabs.io/>`_, và `tham gia cộng đồng chúng tôi <https://casperlabs.io/community/>`_.

source: What’s the difference between CasperLabs and Casper?
fr: Quelle est la différence entre CasperLabs et Casper ?
tr: CasperLabs ve Casper arasındaki fark nedir?
vi: Sự khác biệt giữa CasperLabs và Casper là gì?

source: CasperLabs is the development team that is currently building the Casper network. CasperLabs has been developing Casper during its testnet phase and is currently planning for mainnet launch in Q1 2021. As a public, open-source network, Casper can be developed on and by anyone in addition to the CasperLabs team.
fr: CasperLabs est l'équipe de développement qui construit actuellement le réseau Casper. CasperLabs a développé Casper pendant sa phase de testnet et prévoit actuellement le lancement du mainnet au premier trimestre 2021. En tant que réseau public et open-source, Casper peut être développé sur et par n'importe qui en plus de l'équipe CasperLabs.
tr: CasperLabs, şu anda Casper ağını oluşturan geliştirme ekibidir. CasperLabs, Casper'ı test ağı aşamasında geliştiriyor ve şu anda ana ağın 2021'in ilk çeyreğinde lansmanını planlıyor. Herkese açık, açık kaynaklı bir ağ olarak Casper, CasperLabs ekibine ilave olarak herkes tarafından geliştirilebilir.
vi: CasperLabs là nhóm phát triển hiện đang xây dựng mạng Casper. CasperLabs đã và đang phát triển Casper trong giai đoạn testnet của mình và hiện đang lên kế hoạch ra mắt mainnet vào quý 1 năm 2021. Là một mạng công cộng, mã nguồn mở, Casper có thể được phát triển bởi bất kỳ ai ngoài nhóm CasperLabs.

source: What’s the CasperLabs team’s background?
fr: Quel est le background de l'équipe CasperLabs ?
tr: CasperLabs ekibinin geçmişi nedir?
vi: Nền tảng của nhóm CasperLabs là gì?

source: The engineering, executive, business, and marketing teams of CasperLabs are diverse groups of thinkers and builders with decades of experience in internet-scale computing systems across academia, business, and engineering. `Meet the CasperLabs team <https://casperlabs.io/company/meet-our-team/>`_.
fr: Les équipes d'ingénierie, de direction, d'affaires et de marketing de CasperLabs se composent de groupes diversifiés de théoriciens et de concepteurs ayant des décennies d'expérience dans les systèmes informatiques à l'échelle de l'Internet dans le milieu universitaire, les affaires et l'ingénierie. `Meet the CasperLabs team <https://casperlabs.io/company/meet-our-team/>`_.
tr: CasperLabs'ın mühendislik, yönetici, işletme ve pazarlama ekipleri, akademi, işletme ve mühendislik genelinde internet ölçeğinde bilgi işlem sistemlerinde onlarca yıllık deneyime sahip çeşitli düşünce ve üretim gruplarıdır. `CasperLabs ekibiyle tanışın <https://casperlabs.io/company/meet-our-team/>`_.
vi: Các nhóm kỹ thuật, điều hành, kinh doanh và tiếp thị của CasperLabs là những nhóm nhà tư tưởng và nhà xây dựng đa dạng với nhiều thập kỷ kinh nghiệm với các hệ thống máy tính quy mô internet trên khắp các học viện, kinh doanh và kỹ thuật. `Gặp gỡ nhóm CasperLabs <https://casperlabs.io/company/meet-our-team/>`_.

source: What is CasperLabs’ fundraising history?
fr: Quel est l'historique des collectes de fonds de CasperLabs ?
tr: CasperLabs'ın bağış toplama geçmişi nedir?
vi: Lịch sử gây quỹ của CasperLabs thế nào?

source: In September 2019, CasperLabs raised a $14.5 million Series A round led by Terren Piezer with participation from Consensus Capital, Axiom Holdings Group, and Digital Strategies, MW Partners, and more.
fr: En septembre 2019, CasperLabs a levé 14,5 millions de dollars fonds (Serie A round) . Cette levée de fond a été dirigée par Terren Piezer avec la participation de Consensus Capital, Axiom Holdings Group et Digital Strategies, MW Partners, et plus encore.
tr: Eylül 2019'da CasperLabs, Consensus Capital, Axiom Holdings Group ve Digital Strategies, MW Partners ve daha fazlasının katılımıyla Terren Piezer liderliğindeki A Serisi 14.5 milyon dolarlık bir yatırım topladı.
vi: Vào tháng 9 năm 2019, CasperLabs đã huy động được 14,5 triệu đô la vòng Series A do Terren Piezer dẫn đầu với sự tham gia của Consensus Capital, Axiom Holdings Group và Digital Strategies, MW Partners, v.v.

source: Who has partnered with CasperLabs to build on the Casper network?
fr: Qui s'est associé à CasperLabs pour développer le réseau Casper ?
tr: Casper ağını geliştirmek için CasperLabs ile kim ortaklık kurdu?
vi: Ai đã hợp tác với CasperLabs để xây dựng trên mạng Casper?

source: CasperLabs has established a diverse ecosystem of participants who will be building, staking, and validating on Casper from day one, spanning blockchain, enterprise technology, and financial services. Among others, CasperLabs has established relationships with BitGo, Huobi, Ledger Leap, Chainlink, Metis, and Cardinal Cryptography. Companies including IPwe and Broadleaf are already using the Casper Network to unlock new value by tokenizing existing assets.
fr: CasperLabs a établi un écosystème diversifié de participants qui construiront, 'stakeront' et valideront sur le réseau Casper dès le premier jour. Ces participants couvrent les domaines de la blockchain, de la technologie d'entreprise et des services financiers. Entre autres, CasperLabs a établi des relations avec BitGo, Huobi, Ledger Leap, Chainlink, Metis et Cardinal Cryptography. Des entreprises comme IPwe et Broadleaf utilisent déjà le réseau Casper pour créer de la valeur par la tokenisation des actifs existants.
tr: CasperLabs; blokzincir, kurumsal teknoloji ve finansal hizmetleri kapsayan, ilk günden itibaren Casper'ı inşa edecek, değerlendirecek ve onaylayacak çok çeşitli bir katılımcı ekosistemi kurdu. CasperLabs, diğerleri arasında BitGo, Huobi, Ledger Leap, Chainlink, Metis ve Cardinal Cryptography ile ilişkiler kurmuştur. IPwe ve Broadleaf dahil şirketler, mevcut varlıkları tokenize ederek yeni değerlerin kilidini açmak için halihazırda Casper Network'ü kullanıyor.
vi: CasperLabs đã thiết lập một hệ sinh thái đa dạng gồm những người tham gia, những người sẽ xây dựng, stake và xác thực trên Casper ngay từ ngày đầu tiên, mở rộng chuỗi khối, công nghệ doanh nghiệp và dịch vụ tài chính. Trong số những người khác, CasperLabs đã thiết lập mối quan hệ với BitGo, Huobi, Ledger Leap, Chainlink, Metis và Cardinal Cryptography. Các công ty bao gồm IPwe và Broadleaf đã sử dụng Mạng Casper để mở khóa giá trị mới bằng cách token hóa các tài sản hiện có.

source: To learn more about how to work within the Casper ecosystem, contact neil@casperlabs.io.
fr: Pour en savoir plus sur la manière de travailler au sein de l'écosystème Casper, contactez neil@casperlabs.io.
tr: Casper ekosisteminde nasıl çalışılacağı hakkında daha fazla bilgi edinmek için neil@casperlabs.io ile iletişime geçin.
vi: Để tìm hiểu thêm về cách hoạt động trong hệ sinh thái Casper, hãy liên hệ với neil@casperlabs.io.

source: CSPR Token
fr: Jeton CSPR
tr: CSPR Tokeni

source: What is CSPR, and its role in the Casper network?
fr: Qu'est-ce CSPR, et son rôle dans le réseau Casper ?
tr: CSPR nedir ve Casper ağındaki rolü nedir?
vi: CSPR là gì và vai trò của nó trong mạng Casper?
