Repository: casper-network/docs-archive
Catalog: locale/*/LC_MESSAGES/faq/index.po
Languages: fr, tr, vi

source: CSPR is the native token to the Casper network. As a Proof-of-Stake blockchain, Casper relies on CSPR to reward the validators that participate in the PoS consensus mechanism to secure and uphold the network. Casper users also rely on CSPR to pay network fees for on-chain actions. For example, each token transfer costs 0.0001 CSPR (10000 motes) and the amount transferred needs to be 2.5 CSPR or more.
fr: CSPR est le jeton natif du réseau Casper. En tant que blockchain Proof-of-Stake, Casper s'appuie sur CSPR pour récompenser les validateurs qui participent au mécanisme de consensus PoS pour sécuriser et maintenir le réseau. Les utilisateurs de Casper s'appuient également sur CSPR pour payer les frais de réseau pour les actions sur la chaîne. Par exemple, chaque transfert de jeton coûte 0,0001 CSPR (10000 motes) et le montant transféré doit être de 2,5 CSPR ou plus.
tr: CSPR, Casper ağının yerel tokenidir. Bir Hisse Kanıtı blokzinciri olarak Casper, ağı güvence altına almak ve sürdürmek için PoS mutabakat mekanizmasına katılan doğrulayıcıları ödüllendirmek için CSPR'ye güvenmektedir. Casper kullanıcıları ayrıca zincir üstü işlemlerin ağ ücretlerini ödemek için CSPR'ye güvenirler. Örneğin, her token transferinin maliyeti 0.0001 CSPR (10000 motes) ve transfer edilen miktarın 2.5 CSPR veya daha fazla olması gerekir.
vi: CSPR là mã thông báo gốc của mạng Casper. Là một blockchain Proof-of-Stake, Casper dựa vào CSPR để thưởng cho những người xác thực tham gia vào cơ chế đồng thuận PoS để bảo mật và duy trì mạng. Người dùng Casper cũng dựa vào CSPR để trả phí mạng cho các hành động trên chuỗi. Ví dụ: mỗi lần chuyển mã thông báo có giá 0,0001 CSPR (10000 motes) và số tiền được chuyển cần phải từ 2,5 CSPR trở lên.

source: Where can I find information about CSPR, the supply, the allocation, and the sale?
fr: Où puis-je trouver des informations CSPR, l'offre, la répartition et la vente ?
tr: CSPR, tedarik, tahsis ve satış hakkında nereden bilgi bulabilirim?
vi: Tôi có thể tìm thông tin về CSPR, nguồn cung cấp, phân bổ và bán ở đâu?

source: The Casper Association has launched its CSPR token sale. Head to `casper.network <https://casper.network/>`_ to learn more.
fr: L'association Casper a lancé sa vente de jetons CSPR. Rendez-vous sur `casper.network <https://casper.network/>`_ pour en savoir plus.
tr: Casper Association, CSPR token satışını başlattı. Daha fazla bilgi edinmek için `casper.network <https://casper.network/>`_ adresini ziyaret edin.
vi: Hiệp hội Casper đã triển khai bán mã thông báo CSPR của mình. Truy cập `casper.network <https://casper.network/>`_ để tìm hiểu thêm.

source: FAQ
tr: SSS
