Repository: casper-network/docs-archive
Catalog: locale/*/LC_MESSAGES/dapp-dev-guide/sdk/script-sdk.po
Languages: fr, tr, vi

source: The `TypeScript/JavaScript SDK <https://casper-ecosystem.github.io/casper-js-sdk/>`_ allows developers to interact with the Casper Network using TypeScript or JavaScript. This page covers different examples of using the SDK.
tr: `TypeScript/JavaScript SDK <https://casper-ecosystem.github.io/casper-js-sdk/>`_ geliştiricilerin TypeScript veya JavaScript kullanarak Casper Network ile etkileşime girmesine olanak tanır. Bu sayfa, SDK kullanımına ilişkin farklı örnekleri kapsar.

source: Installation
tr: Kurulum
vi: Cài đặt

source: To install this library using Node.js, run the following command:
fr: Pour installer cette librairie en utilisant Node.js, exécutez la commande suivante :
tr: Bu kitaplığı Node.js kullanarak kurmak için aşağıdaki komutu çalıştırın:
vi: Để cài đặt thư viện này bằng Node.js, hãy chạy lệnh sau:

source: Tests
tr: Testler
vi: Kiểm thử

source: You can find basic examples for how to use this library in the ``test`` directory. To run the tests, use this command:
fr: Vous pouvez trouver des exemples de base pour l'utilisation de cette librairie dans le répertoire ``test``. Pour exécuter les tests, utilisez cette commande :
tr: Bu kütüphanenin nasıl kullanılacağına dair temel örnekleri ``test`` dizininde bulabilirsiniz. Testleri çalıştırmak için şu komutu kullanın:
vi: Bạn có thể tìm thấy các ví dụ cơ bản về cách sử dụng thư viện này trong thư mục ``test``. Để chạy các bài kiểm thử, hãy sử dụng lệnh này:

source: Usage Examples
fr: Exemples d'utilisation
tr: Kullanım Örnekleri
vi: Ví dụ sử dụng

source: In this section, we outline a couple of essential tasks you can accomplish with the JavaScript SDK:
fr: Dans cette section, nous présentons quelques tâches essentielles que vous pouvez accomplir avec le SDK JavaScript :
tr: Bu bölümde, JavaScript SDK ile gerçekleştirebileceğiniz birkaç temel görevi özetliyoruz:
vi: Trong phần này, chúng tôi phác thảo một số tác vụ cần thiết mà bạn có thể thực hiện với JavaScript SDK:

source: Generating account keys
fr: Génération de clés de compte
tr: Hesap anahtarları oluşturmak
vi: Tạo khóa tài khoản

source: Sending a transfer
fr: Envoyer un transfert
tr: Bir aktarım göndermek
vi: Gửi chuyển giao

source: For a complete implementation example, read the `Multi-Signature Tutorial <https://docs.casperlabs.io/en/latest/dapp-dev-guide/tutorials/multi-sig/index.html>`_, which uses the JavaScript SDK.
fr: Pour un exemple complet de mise en œuvre, lisez le `Tutoriel de la multi-signature <https://docs.casperlabs.io/fr/latest/dapp-dev-guide/tutorials/multi-sig/index.html>`_, qui utilise le SDK JavaScript.
tr: Eksiksiz bir uygulama örneği için, JavaScript SDK'sını kullanan `Çoklu İmza Eğitimini <https://docs.casperlabs.io/en/latest/dapp-dev-guide/tutorials/multi-sig/index.html>`_ okuyun.
vi: Để có ví dụ triển khai đầy đủ, hãy đọc `Hướng dẫn về Đa chữ ký <https://docs.casperlabs.io/en/latest/dapp-dev-guide/tutorials/multi-sig/index.html>`_, sử dụng SDK JavaScript.

source: Generating Account Keys
fr: Génération de clés de compte
tr: Hesap Anahtarları Oluşturmak
vi: Tạo khóa tài khoản

source: This example shows you how to use the SDK to generate account keys to sign your deploy.
fr: Cet exemple vous montre comment utiliser le SDK pour générer des clés de compte afin de signer votre déploiement.
tr: Bu örnek, dağıtımınızı imzalamak üzere hesap anahtarları oluşturmak için SDK'yı nasıl kullanacağınızı gösterir.
vi: Ví dụ này cho bạn thấy cách sử dụng SDK tạo khóa tài khoản để ký triển khai của bạn.

source: After generating the keys with this code, you can add them to the `CasperLabs Signer Chrome extension <https://chrome.google.com/webstore/detail/casperlabs-signer/djhndpllfiibmcdbnmaaahkhchcoijce?hl=en-US>`_ and use them to sign your transactions.
fr: Après avoir généré les clés avec ce code, vous pouvez les ajouter à l'extension Chrome `CasperLabs Signer <https://chrome.google.com/webstore/detail/casperlabs-signer/djhndpllfiibmcdbnmaaahkhchcoijce?hl=en-US>`_ et les utiliser pour signer vos transactions.
tr: Anahtarları bu kod ile oluşturduktan sonra `CasperLabs Signer Chrome uzantısına <https://chrome.google.com/webstore/detail/casperlabs-signer/djhndpllfiibmcdbnmaaahkhchcoijce?hl=en-US>`_ ekleyebilir ve işlemlerinizi imzalamak için kullanabilirsiniz.
vi: Sau khi tạo khóa bằng mã này, bạn có thể thêm chúng vào `Tiện ích mở rộng CasperLabs Signer của Chrome <https://chrome.google.com/webstore/detail/casperlabs-signer/djhndpllfiibmcdbnmaaahkhchcoijce?hl=en-US>`_ và sử dụng để ký các giao dịch của bạn.

source: Sending a Transfer
fr: Envoyer un transfert
tr: Bir Aktarım Gönderme
vi: Gửi chuyển giao

source: This code block shows you how to define and send a transfer on the Casper Network. Replace the ``account-address`` in the code below with the sender's account address.
fr: Ce bloc de code vous montre comment définir et envoyer un transfert sur le réseau Casper. Remplacez ``account-address``dans le code ci-dessous par l'adresse du compte de l'expéditeur.
tr: Bu kod bloğu, Casper Network'te bir aktarımı nasıl tanımlayacağınızı ve göndereceğinizi gösterir. Aşağıdaki koddaki ``account-address`` kısmını gönderenin hesap adresiyle değiştirin.
vi: Khối mã này chỉ cho bạn cách xác định và gửi chuyển khoản trên Mạng Casper. Thay thế ``account-address`` trong mã bên dưới bằng địa chỉ tài khoản của người gửi.

source: The ``sendTransfer`` function below will return a ``transfer-hash`` which you can check on https://testnet.cspr.live/.
fr: La fonction ``sendTransfer`` ci-dessous renvoie un ``transfer-hash`` que vous pouvez vérifier sur https://testnet.cspr.live/.
tr: Aşağıdaki ``sendTransfer`` işlevi, https://testnet.cspr.live/ adresinde kontrol edebileceğiniz bir ```transfer-hash`` döndürür.
vi: Hàm ``sendTransfer`` bên dưới sẽ trả về ``transfer-hash`` mà bạn có thể kiểm tra tại https://testnet.cspr.live/.

source: **Note**: At any moment, you can serialize the deploy from this example to JSON to accomplish whatever you want (store it, send it, etc.).
fr: **Note** : À tout moment, vous pouvez sérialiser le déploiement de cet exemple en JSON pour accomplir ce que vous voulez (le stocker, l'envoyer, etc.).
tr: **Not**: Her an, istediğinizi (depolayın, gönderin, vb.) gerçekleştirmek için dağıtımı bu örnekten JSON'a serileştirebilirsiniz.
vi: **Lưu ý**: Tại bất kỳ thời điểm nào, bạn có thể tuần tự triển khai từ ví dụ này sang JSON để thực hiện bất kỳ điều gì bạn muốn (lưu trữ, gửi, v.v.).

source: Here is the code you can use to serialize the deploy:
fr: Voici le code que vous pouvez utiliser pour sérialiser le déploiement :
tr: Dağıtımı serileştirmek için kullanabileceğiniz kod:
vi: Đây là mã bạn có thể sử dụng để tuần tự triển khai:

source: Then, you can reconstruct the deploy object using this function:
fr: Ensuite, vous pouvez reconstruire l'objet de déploiement en utilisant cette fonction :
tr: Ardından, bu işlevi kullanarak dağıtım nesnesini yeniden oluşturabilirsiniz:
vi: Sau đó, bạn có thể xây dựng lại đối tượng triển khai bằng cách sử dụng hàm này:

source: Additional Resources
fr: Ressources supplémentaires
tr: Ek Kaynaklar
vi: Tài nguyên bổ sung

source: If you are looking for additional examples, another great resource is the `BitGo JS implementation <https://github.com/BitGo/BitGoJS/tree/master/modules/account-lib/src/coin/cspr>`_.
fr: Si vous recherchez des exemples supplémentaires, une autre excellente ressource est l'implémentation `BitGo JS <https://github.com/BitGo/BitGoJS/tree/master/modules/account-lib/src/coin/cspr>`_.
tr: Ek örnekler arıyorsanız, bir başka harika kaynak da `BitGo JS uygulamasıdır <https://github.com/BitGo/BitGoJS/tree/master/modules/account-lib/src/coin/cspr>`_.
vi: Nếu bạn đang tìm kiếm các ví dụ bổ sung, một tài nguyên tuyệt vời khác là `BitGo JS implementation <https://github.com/BitGo/BitGoJS/tree/master/modules/account-lib/src/coin/cspr>`_.

source: The `TypeScript/JavaScript SDK <https://casper-ecosystem.github.io/casper-js-sdk/next>`_ allows developers to interact with the Casper Network using TypeScript or JavaScript. This page covers different examples of using the SDK.
fr: Le `SDK TypeScript/JavaScript <https://casper-ecosystem.github.io/casper-js-sdk/next>`_ permet aux développeurs d'interagir avec le réseau Casper en utilisant TypeScript ou JavaScript. Cette page couvre différents exemples d'utilisation du SDK.
vi: `TypeScript/JavaScript SDK <https://casper-ecosystem.github.io/casper-js-sdk/next>`_ cho phép các nhà phát triển tương tác với Mạng Casper bằng TypeScript hoặc JavaScript. Trang này bao gồm các ví dụ khác nhau về việc sử dụng SDK.
