Repository: casper-network/docs-archive
Catalog: locale/*/LC_MESSAGES/implementation/accounts.po
Languages: fr, tr, vi

source: A deploy is a user request to perform some execution on the blockchain (see :ref:`Execution Semantics <execution-semantics-deploys>` for more information). It contains “payment code” and “session code” which are contracts that contain the logic to be executed. These contracts are executed in the context of the account of the deploy. This means these contracts use the named keys of the account and use the account’s local storage (i.e., the “root” for the :ref:`local keys <global-state-local-key>` come from the account identity key).
fr: Un déploiement est une requête de l'utilisateur pour exécuter une opération sur la blockchain (voir :ref:`Sémantiques d'exécution <execution-semantics-deploys>` pour plus d'informations). Il contient le "code de paiement" et le "code de session" qui sont des contrats qui contiennent la logique à exécuter. Ces contrats sont exécutés dans le contexte du compte du déploiement. Cela signifie que ces contrats utilisent les clés nommées du compte et utilisent le stockage local du compte (c'est-à-dire que la "racine" (root) pour les :ref:`clés locales<global-state-local-key>` provient de la clé d'identité du compte).
tr: Bir dağıtım, blokzincirde bir miktar yürütme gerçekleştirmek için bir kullanıcı isteğidir (daha fazla bilgi için :ref:`Yürütme Semantiği <execution-semantics-deploys>`ne bakın). Yürütülecek mantığı içeren kontratlar olan “ödeme kodu” ve “oturum kodu”nu içerir. Bu kontratlar, dağıtım hesabı bağlamında yürütülür. Bu, bu kontratların hesabın adlandırılmış anahtarlarını kullandığı ve hesabın yerel deposunu kullandığı anlamına gelir (yani, :ref:`yerel anahtarlar <global-state-local-key>` için “root”, hesap kimlik anahtarından gelir).
vi: Triển khai là một yêu cầu của người dùng để thực hiện một số lệnh trên chuỗi khối (xem :ref: `Ý nghĩa thực thi (Execution Semantics) <execution-semantics-deploys>` để biết thêm thông tin). Nó chứa “mã thanh toán” và “mã phiên” là các hợp đồng chứa logic được thực thi. Các hợp đồng này được thực hiện trong ngữ cảnh tài khoản triển khai. Điều này có nghĩa là các hợp đồng này sử dụng các khóa được đặt tên của tài khoản và sử dụng nơi lưu cục bộ của tài khoản (tức là “gốc” cho :ref:`khoá cục bộ (local keys) <global-state-local-key>` có từ khoá định danh của tài khoản).

source: Note: that other contracts called from the session code by ``call_contract`` are executed in their own context, not the account context. This means, an account (with logic contained in session code) can be used to locally store information relevant to the user owning the account.
fr: Note : que les autres contrats appelés depuis le code de session par ``call_contract`` sont exécutés dans leur propre contexte, et non dans celui du compte. Cela signifie qu'un compte (avec la logique contenue dans le code de session) peut être utilisé pour stocker localement des informations pertinentes pour l'utilisateur qui possède ce compte.
tr: Not: ``call_contract`` tarafından oturum kodundan çağrılan diğer kontratların, hesap bağlamında değil, kendi bağlamlarında yürütüldüğünü unutmayın. Bu, hesabın sahibi olan kullanıcıyla ilgili bilgileri yerel olarak depolamak için bir hesabın (oturum kodunda yer alan mantıkla) kullanılabileceği anlamına gelir.
vi: Lưu ý: các hợp đồng khác được gọi từ mã phiên bởi ``call_contract`` được thực thi trong ngữ cảnh riêng của chúng, không phải trong ngữ cảnh tài khoản. Điều này có nghĩa là, một tài khoản (với logic có trong mã phiên) có thể được sử dụng để lưu trữ cục bộ thông tin liên quan đến người dùng sở hữu tài khoản.

source: Functions for interacting with an account
fr: Fonctions pour interagir avec un compte
tr: Bir hesapla etkileşim için işlevler
vi: Các chức năng tương tác với tài khoản

source: The `Casper Rust library <https://docs.rs/casper-contract/1.0.1/casper_contract/ext_ffi/index.html>`__ contains several functions for working with the various account features:
fr: La librairie `Casper Rust <https://docs.rs/casper-contract/1.0.1/casper_contract/ext_ffi/index.html>`__ contient plusieurs fonctions permettant de travailler avec les différentes fonctionnalités du compte :
tr: `Casper Rust kitaplığı <https://docs.rs/casper-contract/1.0.1/casper_contract/ext_ffi/index.html>`__, çeşitli hesap özellikleriyle çalışmak için çeşitli işlevler içerir:
vi: `Thư viện Casper Rust <https://docs.rs/casper-contract/1.0.1/casper_contract/ext_ffi/index.html>`__ chứa một số hàm để làm việc với các tính năng tài khoản khác nhau:

source: ``casper_update_associated_key``
vi: ``casper_remove_associated_key``
