Repository: casper-network/docs-archive
Catalog: locale/*/LC_MESSAGES/implementation/accounts.po
Languages: fr, tr, vi

source: Accounts
fr: Comptes
tr: Hesaplar
vi: Tài khoản

source: Introduction
tr: Giriş
vi: Giới thiệu

source: An *account* is a cryptographically secured gateway into the Casper system used by entities outside the blockchain (e.g., off-chain components of blockchain-based applications, individual users). All user activity on the Casper blockchain (i.e., “deploys”) must originate from an account. Each account has its own context where it can locally store information (e.g., references to useful contracts, metrics, aggregated data from other parts of the blockchain). Each account also has a “main purse” where it can hold Casper tokens (see :ref:`Tokens <tokens-purses-and-accounts>` for more information).
fr: Un *compte* (Account) est une passerelle cryptographiquement sécurisée vers le système Casper, utilisée par des entités extérieures à la blockchain (par exemple, des composants hors chaîne d'applications basées sur la blockchain, des utilisateurs individuels). Toute activité d'un utilisateur sur la blockchain Casper (c'est-à-dire les " déploiements ") doit provenir d'un compte. Chaque compte possède son propre contexte dans lequel il peut stocker localement des informations (par exemple, des références à des contrats utiles, des métriques, des données agrégées provenant d'autres parties de la blockchain). Chaque compte dispose également d'un " porte-monnaie principal " (purse) où il peut conserver les jetons Casper (voir :ref:`Jetons <tokens-purses-and-accounts>` pour plus d'informations).
tr: Bir *hesap*, blokzincir dışındaki varlıklar (ör. blokzincir tabanlı uygulamaların zincir dışı bileşenleri, bireysel kullanıcılar) tarafından kullanılan, Casper sistemine kriptografik olarak güvenli bir ağ geçididir. Casper blokzincirindeki tüm kullanıcı etkinlikleri (yani “dağıtımlar”) bir hesaptan kaynaklanmalıdır. Her hesabın yerel olarak bilgi depolayabileceği kendi bağlamı vardır (örneğin, faydalı kontratlara referanslar, ölçümler, blokzincirin diğer bölümlerinden toplanan veriler). Her hesabın ayrıca Casper tokenlerini tutabileceği bir “ana cüzdanı” vardır (daha fazla bilgi için :ref:`Tokenler <tokens-purses-and-accounts>`e bakın).
vi: *Tài khoản* là một cổng được bảo mật bằng mật mã vào hệ thống Casper được sử dụng bởi các thực thể bên ngoài chuỗi khối (ví dụ: các thành phần ngoài chuỗi của các ứng dụng dựa trên chuỗi khối, người dùng cá nhân). Tất cả hoạt động của người dùng trên chuỗi khối Casper (tức là “triển khai”) phải bắt nguồn từ một tài khoản. Mỗi tài khoản có ngữ cảnh riêng nơi nó có thể lưu trữ cục bộ thông tin (ví dụ: tham chiếu đến các hợp đồng hữu ích, chỉ số, dữ liệu tổng hợp từ các phần khác của chuỗi khối). Mỗi tài khoản cũng có một “ví chính” nơi nó có thể chứa các mã thông báo Casper (xem :ref:`Tokens <tokens-purses-and-accounts>` để biết thêm thông tin).

source: In this chapter we describe the permission model for accounts, their local storage capabilities, and briefly mention some runtime functions for interacting with accounts.
fr: Dans ce chapitre, nous décrivons le modèle de permission pour les comptes, leurs capacités de stockage local, et nous mentionnons brièvement certaines fonctions runtime pour interagir avec un compte.
tr: Bu bölümde, hesaplar için izin modelini, yerel depolama yeteneklerini açıklıyoruz ve hesaplarla etkileşim için bazı çalışma zamanı işlevlerinden kısaca bahsediyoruz.
vi: Trong chương này, chúng tôi mô tả mô hình quyền cho tài khoản, khả năng lưu trữ cục bộ của chúng và đề cập ngắn gọn một số chức năng thời gian chạy để tương tác với tài khoản.

source: The ``Account`` data structure
fr: La structure de données ``Account``
tr: ``Hesap`` veri yapısı
vi: Cấu trúc dữ liệu ``Tài khoản``

source: An ``Account`` contains the following data:
fr: Un compte , ``Account`` contient les données suivantes :
tr: Bir ``Hesap`` şu verileri içerir:
vi: ``Tài khoản`` chứa dữ liệu sau:

source: A collection of named keys (this plays the same role as the named keys in a :ref:`stored contract <global-state-contracts>`)
fr: Une collection de clés nommées (qui joue le même rôle que les clés nommées dans un :ref:`stored contract<global-state-contracts>`)
tr: Adlandırılmış anahtarların bir koleksiyonu (bu, bir :ref:`stored kontrat <global-state-contracts>` taki adlandırılmış anahtarlarla aynı rolü oynar)
vi: Tập hợp các khóa được đặt tên (điều này đóng vai trò giống như các khóa được đặt tên trong :ref:`hợp đồng được lưu trữ <global-state-contracts>`)

source: A ``URef`` representing the account’s “main purse”
fr: Un ``URef`` représentant la "porte monnaie principale" du compte
tr: Hesabın “ana cüzdanını” temsil eden bir ``URef``
vi: Một ``URef`` đại diện cho “ví chính” của tài khoản

source: A collections of “associated keys” (see below for more information)
fr: Une collection de "clés associées" , “associated keys” (voir ci-dessous pour plus d'informations)
tr: “İlişkili anahtarlar” koleksiyonu (daha fazla bilgi için aşağıya bakın)
vi: Bộ sưu tập các "khóa được liên kết" (xem bên dưới để biết thêm thông tin)

source: “Action thresholds” (see below for more information)
fr: "Seuils d'action" ou “Action thresholds” (voir ci-dessous pour plus d'informations)
tr: “Eylem eşikleri” (daha fazla bilgi için aşağıya bakın)
vi: “Ngưỡng hành động” (xem bên dưới để biết thêm thông tin)

source: Permissions model
fr: Modèle de permissions
tr: İzin modeli
vi: Mô hình quyền

source: Actions and thresholds
fr: Actions et seuils
tr: Eylemler ve eşikler
vi: Các hành động và ngưỡng

source: There are two types of actions an account can perform: a deployment, and key management. A deployment is simply executing some code on the blockchain, while key management involves changing the associated keys (which will be described in more detail later). Key management cannot be performed independently, as all effects to the blockchain must come via a deploy; therefore, a key management action implies that a deployment action is also taking place. The ``ActionThresholds`` contained in the ``Account`` data structure set a ``Weight`` which must be met in order to perform that action. How these weight thresholds can be met is described in the next section. Since a key management action requires a deploy action, the key management threshold should always be greater than or equal to the deploy threshold.
fr: Il existe deux types d'actions qu'un compte peut effectuer : les déploiements et la gestion des clés. Un déploiement consiste simplement à exécuter du code sur la blockchain, tandis que la gestion des clés implique la modification des clés associées (qui sera décrite plus en détail ultérieurement). La gestion des clés ne peut pas être effectuée indépendamment, car tous les effets sur la blockchain doivent passer par un déploiement ; par conséquent, une action de gestion des clés implique qu'une action de déploiement ait également lieu. Les "Seuils d'action" ou ``ActionThresholds`` contenus dans la structure de données "Account" définissent un "Poids" ou ``Weight`` qui doit être atteint afin d'effectuer cette action. La façon dont ces seuils de poids peuvent être atteints est décrite dans la section suivante. Puisqu'une action de gestion des clés nécessite une action de déploiement, le seuil de gestion des clés doit toujours être supérieur ou égal au seuil de déploiement.
tr: Bir hesabın gerçekleştirebileceği iki tür eylem vardır: dağıtım ve anahtar yönetimi. Bir dağıtım basitçe blokzincirde bazı kodları yürütürken, anahtar yönetimi ilişkili anahtarların değiştirilmesini içerir (bu daha sonra daha ayrıntılı olarak açıklanacaktır). Blokzincire tüm etkilerin bir dağıtım yoluyla gelmesi gerektiğinden, anahtar yönetimi bağımsız olarak gerçekleştirilemez; bu nedenle, bir anahtar yönetim eylemi, bir dağıtım eyleminin de gerçekleştiğini ima eder. ``Hesap`` veri yapısında bulunan ``ActionThresholds`` , bu eylemi gerçekleştirmek için karşılanması gereken bir ``Ağırlık`` belirler. Bu ağırlık eşiklerinin nasıl karşılanabileceği bir sonraki bölümde açıklanmaktadır. Bir anahtar yönetimi eylemi bir dağıtım eylemi gerektirdiğinden, anahtar yönetimi eşiği her zaman dağıtım eşiğinden büyük veya ona eşit olmalıdır.
vi: Có hai loại hành động mà tài khoản có thể thực hiện: triển khai và quản lý khóa. Việc triển khai chỉ đơn giản là thực thi một số mã trên chuỗi khối, trong khi quản lý khóa liên quan đến việc thay đổi các khóa được liên kết (sẽ được mô tả chi tiết hơn ở phần sau). Quản lý khóa không thể được thực hiện độc lập, vì tất cả các tác động đối với chuỗi khối phải thông qua một triển khai; do đó, một hành động quản lý chính ngụ ý rằng một hành động triển khai cũng đang diễn ra. Ngưỡng hành động (``ActionThresholds``) có trong cấu trúc dữ liệu tài khoản (``Account``) đặt trọng số (``Weight``) phải được đáp ứng để thực hiện hành động đó. Cách đáp ứng các ngưỡng trọng số này được mô tả trong phần tiếp theo. Vì một hành động quản lý khóa yêu cầu một hành động triển khai, nên ngưỡng quản lý khóa phải luôn lớn hơn hoặc bằng ngưỡng triển khai.

source: Associated keys and weights
fr: Clés et poids associés
tr: İlişkili anahtarlar ve ağırlıklar
vi: Các khoá được liên kết và trọng số

source: As mentioned in the introduction, accounts are secured via cryptography. The *associated keys* of an account are the set of public keys which are allowed to provide signatures on deploys for that account. Each associated key has a weight; these weights are used to meet the action thresholds provided in the previous section. Each deploy must be signed by one or more keys associated with the account that deploy is for, and the sum of the weights of those keys must be greater than or equal to the deployment threshold weight for that account. We call the keys that have signed a deploy the “authorizing keys”. Similarly, if that deploy contains any key management actions (detailed below), then the sum of the weights of the authorizing keys must be greater than or equal to the key management action threshold of the account.
fr: Comme mentionné dans l'introduction, les comptes sont sécurisés par cryptographie. Les *associated keys* d'un compte sont l'ensemble des clés publiques qui sont autorisées à fournir des signatures sur les déploiements pour ce compte. Chaque clé est associée a un poids ; ces poids sont utilisés pour atteindre les seuils d'action fournis dans la section précédente. Chaque déploiement doit être signé par une ou plusieurs clés associées au compte auquel il est destiné, et la somme des poids de ces clés doit être supérieure ou égale au poids du seuil de déploiement pour ce compte. Nous appelons les clés qui ont signé un déploiement les "clés d'autorisation" ou “authorizing keys”. De même, si ce déploiement contient des actions de gestion des clés (détaillées ci-dessous), alors la somme des poids des clés d'autorisation doit être supérieure ou égale au seuil d'action de gestion des clés du compte.
tr: Girişte belirtildiği gibi, hesaplar kriptografi ile güvence altına alınır. Bir hesabın *ilişkili anahtarları*, o hesap için dağıtımlarda imza sağlamasına izin verilen ortak anahtarlar kümesidir. Her ilişkili anahtarın bir ağırlığı vardır; bu ağırlıklar, önceki bölümde sağlanan eylem eşiklerini karşılamak için kullanılır. Her dağıtım, dağıtımın yapıldığı hesapla ilişkili bir veya daha fazla anahtar tarafından imzalanmalıdır ve bu anahtarların ağırlıklarının toplamı, o hesabın dağıtım eşiği ağırlığından büyük veya ona eşit olmalıdır. Bir dağıtımı imzalayan anahtarlara “yetkilendirme anahtarları” diyoruz. Benzer şekilde, bu dağıtım herhangi bir anahtar yönetim eylemi içeriyorsa (aşağıda ayrıntılı olarak açıklanmıştır), yetkilendirme anahtarlarının ağırlıklarının toplamı, hesabın anahtar yönetimi eylemi eşiğinden büyük veya ona eşit olmalıdır.
vi: Như đã đề cập trong phần giới thiệu, các tài khoản được bảo mật thông qua mật mã. *Các khóa được liên kết* của tài khoản là tập hợp các khóa công khai được phép cung cấp chữ ký khi triển khai cho tài khoản đó. Mỗi khóa liên quan có một trọng số; các trọng số này được sử dụng để đáp ứng các ngưỡng hành động được cung cấp trong phần trước. Mỗi triển khai phải được ký bởi một hoặc nhiều khóa được liên kết với tài khoản triển khai và tổng trọng số của các khóa đó phải lớn hơn hoặc bằng trọng số ngưỡng triển khai cho tài khoản đó. Chúng tôi gọi các khóa đã ký triển khai là “khóa ủy quyền”. Tương tự, nếu triển khai đó chứa bất kỳ hành động quản lý khóa nào (chi tiết bên dưới), thì tổng trọng số của các khóa ủy quyền phải lớn hơn hoặc bằng ngưỡng hành động quản lý khóa của tài khoản.

source: Note: that any key may be used to help authorize any action; there are no “special keys”, all keys contribute their weight in exactly the same way.
fr: Note : n'importe quelle clé peut être utilisée pour aider à autoriser n'importe quelle action ; il n'y a pas de "clé spéciales" (“special keys”), toutes les clés apportent leur poids exactement de la même manière.
tr: Not: Herhangi bir işlemin yetkilendirilmesine yardımcı olmak için herhangi bir anahtar kullanılabilir; “özel tuşlar” yoktur, tüm anahtarlar ağırlıklarına tam olarak aynı şekilde katkıda bulunur.
vi: Lưu ý: bất kỳ khóa nào cũng có thể được sử dụng để giúp ủy quyền bất kỳ hành động nào; không có “khoá đặc biệt”, tất cả các khoá đều đóng góp trọng số của chúng theo cùng một cách.

source: Key management actions
fr: Actions de gestion des clés
tr: Anahtar yönetim eylemleri
vi: Các hành động quản lý khoá

source: A *key management action* is any change to any of the permissions parameters for the account. This includes the following:
fr: Une *action de gestion des clés* est toute modification de l'un des paramètres d'autorisation du compte. Cela inclut les éléments suivants :
tr: *Anahtar yönetimi eylemi*, hesaba ilişkin izin parametrelerinden herhangi birinde yapılan herhangi bir değişikliktir. Bu, aşağıdakileri içerir:
vi: *Hành động quản lý khóa* là bất kỳ thay đổi nào đối với bất kỳ thông số quyền nào đối với tài khoản. Điều này bao gồm những điều sau:

source: adding or removing an associated key;
fr: ajouter ou supprimer une clé associée ;
tr: ilişkili bir anahtarın eklenmesi veya çıkarılması;
vi: thêm hoặc xóa một khóa được liên kết;

source: changing the weight of an associated key;
fr: modifier le poids d'une clé associée ;
tr: ilişkili bir anahtarın ağırlığının değiştirilmesi;
vi: thay đổi trọng số của khoá được liên kết;

source: changing the threshold of any action.
fr: modifier le seuil de toute action.
tr: herhangi bir eylemin eşiğini değiştirmek.
vi: thay đổi ngưỡng của bất kỳ hành động nào.

source: Key management actions have validity rules which prevent a user from locking themselves out of their account. For example, it is not allowed to set a threshold larger than the sum of the weights of all associated keys.
fr: Les actions de gestion des clés ont des règles de validité qui empêchent un utilisateur de se bloquer hors de son compte. Par exemple, il n'est pas permis de fixer un seuil supérieur à la somme des poids de toutes les clés associées.
tr: Anahtar yönetimi eylemlerinin, bir kullanıcının kendisini hesabından kilitlemesini engelleyen geçerlilik kuralları vardır. Örneğin, ilişkili tüm anahtarların ağırlıklarının toplamından daha büyük bir eşik ayarlanmasına izin verilmez.
vi: Các hành động quản lý khoá có các quy tắc hợp lệ ngăn người dùng tự khóa tài khoản của họ. Ví dụ: không được phép đặt ngưỡng lớn hơn tổng trọng số của tất cả các khóa liên quan.

source: Account security and recovery using key management
fr: Sécurité et récupération des comptes à l'aide de la gestion des clés
tr: Anahtar yönetimini kullanarak hesap güvenliği ve kurtarma
vi: Bảo mật và khôi phục tài khoản bằng cách sử dụng quản lý khóa

source: The purpose of this permissions model is to enable keeping accounts safe from lost or stolen keys, while allowing usage of capabilities of modern mobile devices. For example, it may be convenient to sign deploys from a smart phone in day-to-day usage, and this can be done without worrying about the repercussions of losing the phone. The recommended setup would be to have a low-weight key on the phone, only just enough for the deploy threshold, but not enough for key management, then if the phone is lost or stolen, a key management action using other associated keys from another device (e.g., a home computer) can be used to remove the lost associated key and add a key which resides on a replacement phone.
fr: L'objectif de ce modèle de permissions est de protéger les comptes contre la perte ou le vol de clés, tout en permettant l'utilisation des capacités des appareils mobiles modernes. Par exemple, il peut être pratique de signer des déploiements à partir d'un téléphone intelligent dans le cadre d'une utilisation quotidienne, et cela peut être fait sans se soucier des répercussions de la perte du téléphone. La configuration recommandée serait d'avoir une clé de faible poids sur le téléphone, juste assez pour le seuil de déploiement, mais pas assez pour la gestion des clés, puis si le téléphone est perdu ou volé, une action de gestion des clés utilisant d'autres clés associées d'un autre dispositif (par exemple, un ordinateur personnel) peut être utilisée pour supprimer la clé associée perdue et ajouter une clé qui réside sur un téléphone de remplacement.
tr: Bu izin modelinin amacı, modern mobil cihazların yeteneklerinin kullanılmasına izin verirken, hesapların kayıp veya çalınan anahtarlardan korunmasını sağlamaktır. Örneğin, günlük kullanımda bir akıllı telefondan dağıtımları imzalamak uygun olabilir ve bu, telefonu kaybetmenin sonuçları hakkında endişelenmeden yapılabilir. Önerilen kurulum, telefonda düşük ağırlıklı bir anahtara sahip ve yalnızca dağıtım eşiği için yeterli olacak, ancak anahtar yönetimi için yeterli olmayacak, o zaman telefon kaybolur veya çalınırsa, kayıp ilişkili anahlarlerı kaldırabilen ve yedek telefonda bulunan bir anahtarı ekleyebilen diğer cihazdan (örneğin, bir ev bilgisayarı) diğer ilişkili anahtarları kullanan bir anahtar yönetim eylemi olacaktır.
vi: Mục đích của mô hình quyền này là cho phép giữ an toàn cho tài khoản khỏi bị mất hoặc bị đánh cắp khóa, đồng thời cho phép sử dụng các khả năng của các thiết bị di động hiện đại. Ví dụ: có thể thuận tiện khi đăng ký triển khai từ điện thoại thông minh trong việc sử dụng hàng ngày và điều này có thể được thực hiện mà không phải lo lắng về hậu quả của việc mất điện thoại. Thiết lập được đề xuất sẽ là có một khóa trọng số thấp trên điện thoại, chỉ đủ cho ngưỡng triển khai, nhưng không đủ để quản lý khóa, sau đó nếu điện thoại bị mất hoặc bị đánh cắp, hành động quản lý khóa bằng cách sử dụng các khóa được liên kết khác từ người khác thiết bị (ví dụ: máy tính gia đình) có thể được sử dụng để xóa khóa được liên kết đã mất và thêm khóa nằm trên điện thoại thay thế.

source: Note: that it is extremely important to ensure there will always be access to a sufficient number of keys to perform the key management action, otherwise future recovery will be impossible (we currently do not support “inactive recovery”).
fr: Note : il est extrêmement important de s'assurer que l'on aura toujours accès à un nombre suffisant de clés pour effectuer l'action de gestion des clés, sinon la récupération future sera impossible (nous ne supportons pas actuellement la "récupération inactive").
tr: Not: Anahtar yönetimi eylemini gerçekleştirmek için her zaman yeterli sayıda anahtara erişimin olmasını sağlamak son derece önemlidir, aksi takdirde gelecekte kurtarma imkansız olacaktır (şu anda “etkin olmayan kurtarmayı” desteklemiyoruz).
vi: Lưu ý: điều cực kỳ quan trọng là phải đảm bảo luôn có quyền truy cập vào đủ số lượng khóa để thực hiện hành động quản lý khóa, nếu không việc khôi phục trong tương lai là không thể (chúng tôi hiện không hỗ trợ "phục hồi không hiện hoạt - inactive recovery").

source: Creating an account
fr: Création d'un compte
tr: Bir hesap oluşturmak
vi: Tạo một tài khoản

source: Account creation happens automatically when there is a :ref:`token transfer <tokens-purses-and-accounts>` to a yet unused :ref:`identity key <global-state-account-key>`. When an account is first created, the balance of its main purse is equal to the number of tokens transferred, its action thresholds are equal to 1, and there is one associated key (equal to the public key used to derive the identity key) with weight 1.
fr: La création de compte se fait automatiquement lorsqu'il y a un :ref: `transfert de token <tokens-purses-and-accounts>` vers une :ref:`clé d'identité <global-state-account-key>`.non encore utilisée. Lorsqu'un compte est créé pour la première fois, le solde de son porte-monnaie principale est égal au nombre de jetons transférés, ses seuils d'action sont égaux à 1, et il y a une clé associée (égale à la clé publique utilisée pour dériver la clé d'identité) avec un poids de 1.
tr: Henüz kullanılmayan bir :ref:`kimlik anahtarı <global-state-account-key>`na bir :ref:`token aktarımı <tokens-purses-and-accounts>` olduğunda hesap oluşturma otomatik olarak gerçekleşir. Bir hesap ilk oluşturulduğunda, ana cüzdanının bakiyesi aktarılan tokenlerin sayısına eşittir, eylem eşikleri 1'e eşittir ve ağırlığı 1 olan bir ilişkili anahtar (kimlik anahtarını türetmek için kullanılan ortak anahtara eşit) vardır.
vi: Việc tạo tài khoản sẽ tự động xảy ra khi :ref: `chuyển token <tokens-purses-and-accounts>` sang :ref:`khoá định danh <global-state-account-key>` chưa sử dụng. Khi một tài khoản được tạo lần đầu tiên, số dư trong ví chính của tài khoản đó bằng số lượng token được chuyển, ngưỡng hành động của nó bằng 1 và có một khóa được liên kết (bằng với khóa công khai được sử dụng để lấy khóa định danh) với trọng số 1.

source: The account context
fr: Le contexte du compte
tr: Hesap bağlamı
vi: Ngữ cảnh tài khoản
