Repository: casper-network/docs-archive
Catalog: locale/*/LC_MESSAGES/implementation/appendix.po
Languages: fr, tr, vi

source: We will discuss how to compute whether two maps of transforms commute in the next section. For now, we assume that run some set of deploys :math:`d_1, d_2, d_3, \ldots` in parallel against a fixed pre-state :math:`G` to obtain a set of transform maps :math:`T_1, T_2, T_3, \ldots`, then select only the transforms that commute :math:`T_i, T_j, T_k, \ldots` to apply to :math:`G`, and thus obtain the post-state :math:`G^\prime`. The remaining deploys we can all run in parallel against :math:`G^\prime`, again choosing the commuting ones to commit, obtaining :math:`G^{\prime\prime}`, and so on. This final post-state is the same as if we had run all the deploys :math:`d_1, d_2, d_3, \ldots` in sequence against :math:`G`, but perhaps faster (depending on how many could commute [#]_) because we were able to run in parallel batches.
fr: Nous verrons dans la section suivante comment calculer si deux maps de transformées commutent. Pour l'instant, nous supposons que l'on exécute un ensemble de déploiements :math:`d_1, d_2, d_3, \ldots` en parallèle sur un pré-état fixe :math:`G` pour obtenir un ensemble de maps de transformées :math : `T_1, T_2, T_3, \ldots`, puis sélectionner uniquement les transformées qui commutent :math:`T_i, T_j, T_k, \ldots` pour les appliquer à :math:`G`, et ainsi obtenir le post-état :math:`G^\prime`. Les déploiements restants peuvent tous être exécutés en parallèle avec :math:`G^\prime`, en choisissant à nouveau ceux à commuter, pour obtenir :math:`G^{\prime\prime}`, et ainsi de suite. Cet état final est le même que si nous avions exécuté tous les déploiements :math:`d_1, d_2, d_3, \ldots` en séquence avec :math:`G`, mais peut-être plus rapidement (selon le nombre de ceux qui ont pu commuter [#]_) parce que nous avons pu les exécuter en lots parallèles.
tr: Bir sonraki bölümde iki dönüşüm haritasının değişip değişmediğini nasıl hesaplayacağımızı tartışacağız. Şimdilik, :math:`d_1, d_2, d_3, \ldots` bazı dağıtım setlerini sabit bir ön-duruma :math:`G` karşı paralel olarak çalıştırarak bir dizi dönüşüm haritası :math:`T_1, T_2, T_3, \ldots` elde ettiğini varsayıyoruz, ardından yalnızca :math:`T_i, T_j, T_k, \ldots` ile takas edilen dönüşümleri seçin ve :math:`G`ye uygulayın ve böylece :math:`G^\prime` durum sonrasını elde edin. Geri kalan dağıtımları, :math:`G^\prime` karşısında paralel olarak çalıştırabiliriz, yine takas edileceklerin takasını seçerek, :math:`G^{\prime\prime}` elde ederek, vb. Bu son durum sonrası, :math:`d_1, d_2, d_3, \ldots` tüm dağıtımlarını :math:`G`ye karşı sırayla çalıştırmış olmamızla aynıdır, ancak belki de daha hızlıdır (kaçının takas edilebileceğine bağlı olarak [ #]_) çünkü paralel gruplar halinde çalışabildik.
vi: Chúng ta sẽ thảo luận về cách tính toán liệu hai bản đồ của phép biến đổi giao hoán được hay không trong phần tiếp theo. Hiện tại, chúng ta giả định rằng chạy một số nhóm triển khai :math:`d_1, d_2, d_3,\ldots` song song với một trạng thái tiền cục định trước :math:`G` để có được một tập các bản đồ biến đổi :math:`T_1, T_2, T_3, \ldots`, sau đó chỉ chọn các phép biến đổi đi kèm:math:`T_i, T_j, T_k, \ldots` để áp dụng cho :math:`G`, và do đó có được trạng thái sau :math:`G^\prime`. Các triển khai còn lại, tất cả chúng ta có thể chạy song song với: math :math:`G^\prime`, sau đó tiếp tục chọn các biến đổi có giao hoán để cam kết và thu được :math:`G^{\prime\prime}`, v.v. Trạng thái cuối cùng này giống như thể chúng ta đã chạy tất cả các triển khai :math:`d_1, d_2, d_3, \ldots` theo trình tự :math:`G`, nhưng nhanh hơn (tùy thuộc vào số lượng có thể hoán đổi [ #] _) vì khi hoán đổi, chúng ta có thể chạy song song với nhau.

source: Recall that committing transforms is a very fast operation relative to execution, so it causes little overhead. The main overhead would come from executing the same deploy against multiple different starting states because it failed to commute multiple times. This can be mitigated by favoring including more expensive deploys in each committed batch.
fr: Rappelons que la commutation des transformées est une opération très rapide par rapport à l'exécution, et qu'elle entraîne donc peu de surcharge. La principale surcharge proviendrait de l'exécution du même déploiement contre plusieurs états de départ différents parce qu'il a échoué à commuter plusieurs fois. Ceci peut être atténué en favorisant l'inclusion des déploiements les plus coûteux dans chaque lot commité.
tr: Dönüşümleri gerçekleştirmenin yürütmeye göre çok hızlı bir işlem olduğunu hatırlayın, bu nedenle çok az ek yüke neden olur. Ana ek yük, birden çok kez takas edilmesi başarısız olduğu için aynı dağıtımı birden çok farklı başlangıç durumuna karşı yürütmekten gelir. Bu, taahhüt edilen her toplu iş için daha pahalı dağıtımlar dahil edilerek azaltılabilir.
vi: Cần nhớ rằng việc cam kết thực hiện các phép chuyển đổi là một hoạt động rất nhanh so với việc thực thi, vì vậy nó gây ra rất ít chi phí. Chi phí chính sẽ đến từ việc thực hiện cùng một triển khai với nhiều trạng thái bắt đầu khác nhau vì nó không hoán đổi nhiều lần. Điều này có thể được giảm thiểu bằng cách ưu tiên đưa vào các đợt triển khai tốn kém hơn trong mỗi đợt triển khai được cam kết.

source: Detecting when maps of transforms commute
fr: Détecter quand les maps de transformées commutent
tr: Dönüşüm haritalarının ne zaman takas edildiğini algılama
vi: Phát hiện khi bản đồ của các biến đổi thực hiện hoán đổi

source: Two transform maps ``m_1: Map<Key, Transform>`` and ``m_2: Map<Key,Transform>`` commute if for all keys ``k`` which are present in both maps, the transforms ``t_1 = m_1[k]`` and ``t_2 = m_2[k]`` commute. Notably, if there are no such keys then the maps trivially commute. Two transforms ``t_1:Transform`` and ``t_2: Transform`` commute if:
fr: Deux maps de transformées ``m_1 : Map<Key, Transform>`` et ``m_2 : Map<Key,Transform>`` commuent si pour toutes les clés ``k`` qui sont présentes dans les deux maps, les transformées ``t_1 = m_1[k]`` et ``t_2 = m_2[k]`` commutent. Notamment, s'il n'y a pas de telles clés, alors les maps sont trivialement commutées. Deux transformées ``t_1:Transform`` et ``t_2 : Transform`` commutent si :
tr: İki dönüşüm haritası ``m_1: Map<Key, Transform>`` ve ``m_2: Map<Key,Transform>``, her iki haritada da bulunan tüm ``k`` anahtarları için, dönüşümler ``t_1 = m_1[k]`` ve ``t_2 = m_2[k]`` takas edildiğinde, takas edilir. Özellikle, böyle bir anahtar yoksa, haritalar önemsiz bir şekilde gidip gelir. İki dönüşüm `` t_1:Transform`` ve ```t_2: Transform`` şu durumlarda takas edilir:
vi: Hai bản đồ biến đổi ``m_1: Map<Key, Transform>`` và ``m_2: Map<Key,Transform>`` hoán đổi nếu tất cả các khoá ``k`` có trong cả hai bản đồ và các biến đổi ```t_1 = m_1[k]`` và ``t_2 = m_2[k]`` hoán đổi. Đáng chú ý, nếu không có các khoá như vậy thì bản đồ sẽ hoán đổi rất dễ dàng. Hai phép biến đổi ``t_1:Transform`` và ``t_2: Transform`` hoán đổi nếu:

source: ``t_1`` and ``t_2`` are both of the same ``Add*`` transform variant (note they do not need to contain the same values within that variant)
fr: ``t_1`` et ``t_2`` sont tous deux de la même variante de transformation ``Add*`` (notez qu'ils ne doivent pas nécessairement contenir les mêmes valeurs au sein de cette variante)
tr: "t_1" ve "t_2", aynı ``Add*`` dönüşüm varyantıdır (bu varyant içinde aynı değerleri içermeleri gerekmediğini unutmayın)
vi: `` t_1`` và ``t_2`` đều thuộc cùng một sự kiện biến đổi ``Add*`` (lưu ý rằng chúng không cần phải chứa các giá trị giống nhau trong sự kiện biến đổi đó)

source: where ``Add*`` is a placeholder representing any of the typed native add operations (``AddInt32``, ``AddInt64``, ``AddInt128``, ``AddInt256``, ``AddInt512``, ``AddKeys``). And they do not commute otherwise. A short montra for this is: reads commute, adds commute, writes conflict. Note that writes *always* conflict, even if they are writing the same value. Consider the following example:
fr: où ``Add*`` est un placeholder générique représentant l'une des opérations d'addition natives typées (``AddInt32``, ``AddInt64``, ``AddInt128``, ``AddInt256``, ``AddInt512``, ``AddKeys``). Et ils ne commutent pas autrement. Un petit exemple de cela est : les lectures commutent, les ajouts commutent, les écritures entrent en conflit. Notez que les écritures sont *toujours* en conflit, même si elles écrivent la même valeur. Prenons l'exemple suivant :
tr: burada ``Add*``, yazılan yerel ekleme işlemlerinden (``AddInt32``, ``AddInt64``, ``AddInt128``, ``AddInt256``, ``AddInt512``, ``AddKeys``) herhangi birini temsil eden bir yer tutucudur. Ve başka türlü takas edilmezler. Bunun için kısa bir tekerleme: okumalar takas olur, eklemeler takas olur, yazmalar çakışır. Aynı değeri yazsalar bile yazmaların *her zaman* çakıştığını unutmayın. Aşağıdaki örneği göz önünde bulundurun:
vi: trong đó ``Add*`` là trình giữ chỗ đại diện cho bất kỳ thao tác thêm gốc nào đã nhập (``AddInt32``, ``AddInt64``, ``AddInt128``, ``AddInt256``, ``AddInt512``, ``AddKeys``). Và chúng không hoán đổi. Ghi chú để nhớ là: đọc hoán đổi (reads commute), thêm hoán đổi (adds commute), ghi xung đột (writes conflict). Lưu ý rằng Write *luôn luôn* xung đột, ngay cả khi chúng đang ghi cùng một giá trị. Hãy xem xét ví dụ sau:

source: If the pre-state :math:`G` has ``local("x") == 7`` then ``f(G)`` results in the transform ``Write(10)``, and so does ``g(G)``. However, if we compose ``g(f(G))`` then we obtain ``Write(100)``, and if we compose ``f(g(G))`` then the result is ``Write(0)`` and hence the functions do not commute.
fr: Si le pré-état :math:`G` a ``local("x") == 7``, alors ``f(G)`` donne la transformée ``Write(10)``, et ``g(G)`` aussi. Cependant, si on compose ``g(f(G))`` alors on obtient ``Write(100)``, et si on compose ``f(g(G))`` alors le résultat est ``Write(0)`` et donc les fonctions ne commuent pas.
tr: :math:`G` ön durumu ``local("x") == 7`` değerine sahipse, o zaman ``f(G)``, ``Write(10)`` dönüşümüyle sonuçlanır ve ``g(G)`` de aynı şekildedir. Ancak, ``g(f(G))`` oluşturursak, o zaman ``Write(100)`` elde ederiz ve ``f(g(G))`` oluşturursak sonuç ``Write(0)`` ve bu nedenle işlevler takas edilmiyor.
vi: Nếu trạng thái tiền toàn cục:math:`G` có ``local("x") == 7`` thì ``f(G)`` dẫn đến biến đổi ``Write(10)``, và tương tự ``g(G)``. Tuy nhiên, nếu chúng ta soạn ``g(f(G))`` thì chúng ta nhận được ``Write(100)``, và nếu chúng ta soạn ``f(g(G))``thì kết quả là ``Write(0)`` và do đó các hàm không hoán đổi.

source: Handling Errors
fr: Traitement des erreurs
tr: Hataları İdare Etmek
vi: Xử lý lỗi

source: The reason we can say "adds commute" in our rules is because mathematically addition is commutative. However, this relies on the infinite nature of the number line and real computers are finite. For example, if we considered the addition of three 8-bit numbers: 250, 3, and 5, any two of them can be added and they commute, but attempting to add all three results in an overflow error. Thus the final result depends on the order of addition:
fr: La raison pour laquelle nous pouvons dire "les additions commutent" dans nos règles est que, mathématiquement, l'addition est commutative. Cependant, cela repose sur la nature infinie des nombres et les ordinateurs réels sont finis. Par exemple, si nous considérons l'addition de trois nombres de 8 bits : 250, 3 et 5, deux d'entre eux peuvent être ajoutés et ils sont commutatifs, mais si l'on tente d'ajouter les trois, on obtient une erreur de débordement. Ainsi, le résultat final dépend de l'ordre d'addition :
tr: Kurallarımızda "eklemeler takas edilir" diyebilmemizin nedeni, matematiksel olarak toplamanın değişmeli olmasıdır. Ancak bu, sayı doğrusunun sonsuz doğasına dayanır ve gerçek bilgisayarlar sonludur. Örneğin, 8 bitlik üç sayının eklenmesini düşünürsek: 250, 3 ve 5, bunlardan herhangi ikisi eklenebilir ve bunlar takas edilirler, ancak üçünü de toplamaya çalışmak bir taşma hatasıyla sonuçlanır. Böylece nihai sonuç, ekleme sırasına bağlıdır:
vi: Lý do chúng ta có thể nói "thêm hoán đổi" trong các quy tắc của mình là vì phép cộng về mặt toán học có tính chất giao hoán. Tuy nhiên, điều này dựa vào tính chất vô hạn của dãy số và tính hữu hạn của máy tính. Ví dụ: nếu chúng tôi xem xét việc cộng ba số 8-bit: 250, 3 và 5, có thể cộng bất kỳ hai số nào trong số chúng và hoán đổi chúng, nhưng cố gắng cộng cả ba sẽ dẫn đến lỗi tràn. Do đó, kết quả cuối cùng phụ thuộc vào thứ tự của phép cộng:

source: 250 + 3 + 5 = 253 (last addition does not happen due to the error)
fr: 250 + 3 + 5 = 253 (le dernier ajout ne se fait pas à cause de l'erreur)
tr: 250 + 3 + 5 = 253 (son ekleme hata nedeniyle olmuyor)
vi: 250 + 3 + 5 = 253 (phép cộng cuối cùng không xảy ra do lỗi)

source: Presently we circumvent this error by actually using modular arithmetic (wrapped addition as it is often called in computer science). Addition in modular arithmetic is still a commutative operation, so our theory holds together. In our example above 250 + 5 + 3 is always equal to 3, no matter what. However in the context of financial applications wrapping back to zero is an unexpected behavior. For this reason we use 512-bit numbers in our mint contract to represent balances, and the total number of token units (motes) available is less than ``U512::MAX``, so overflow is impossible.
fr: Actuellement, nous contournons cette erreur en utilisant l'arithmétique modulaire ('wrapped addition' comme on l'appelle souvent en informatique). L'addition dans l'arithmétique modulaire est toujours une opération commutative, de sorte que notre théorie tient la route. Dans notre exemple ci-dessus, 250 + 5 + 3 est toujours égal à 3, quoi qu'il arrive. Cependant, dans le contexte des applications financières, le retour à zéro est un comportement inattendu. Pour cette raison, nous utilisons des nombres de 512 bits dans notre contrat de 'mint' pour représenter les soldes, et le nombre total d'unités de jetons (motes) disponibles est inférieur à ``U512::MAX``, de sorte que le débordement est impossible.
tr: Şu anda bu hatayı modüler aritmetik (bilgisayar bilimlerinde genellikle adlandırıldığı gibi sarmalanmış toplama) kullanarak atlatıyoruz. Modüler aritmetikte toplama hala değişmeli bir işlemdir, bu nedenle teorimiz tutarlıdır. Yukarıdaki örneğimizde, 250 + 5 + 3, ne olursa olsun her zaman 3'e eşittir. Ancak finansal uygulamalar bağlamında sıfıra geri sarma beklenmeyen bir davranıştır. Bu nedenle, basım sözleşmemizde bakiyeleri temsil etmek için 512 bitlik sayılar kullanıyoruz ve mevcut toplam token birimi (mot) sayısı ``U512::MAX`` değerinden daha az, dolayısıyla taşma mümkün değil.
vi: Hiện tại, chúng tôi đã sửa lỗi này bằng cách sử dụng mô-đun số học (phép cộng quấn quanh wrapped addition như nó thường được gọi trong khoa học máy tính). Phép cộng trong mô-đun số học vẫn là một phép toán giao hoán, vì vậy lý thuyết của chúng tôi phù hợp với nhau. Trong ví dụ trên 250 + 5 + 3 luôn bằng 3, không có vấn đề gì. Tuy nhiên, trong bối cảnh các ứng dụng tài chính trở về 0 là một hành vi không mong muốn. Vì lý do này, chúng ta sử dụng số 512-bit trong hợp mint để đại diện cho số dư và tổng số đơn vị token (motes) có sẵn ít hơn ``U512::MAX``, vì vậy không thể xảy ra lỗi tràn.

source: That said, this is not the only error which may arise due to the finite nature of computers. For example, the ``AddKeys`` transform is about adding elements to a map, which is a commutative operation as well (so long as none of the keys already existed in the map, then it is more akin to a write operation). Yet, this operation can also fail due to the physical machine being out of memory, thus once again meaning the order of additions could effect the final state of the map.
fr: Cela dit, ce n'est pas la seule erreur qui peut survenir en raison de la nature finie des ordinateurs. Par exemple, la transformation ``AddKeys`` consiste à ajouter des éléments à une map, ce qui est aussi une opération commutative (tant qu'aucune des clés n'existe déjà dans la map, alors cela ressemble plus à une opération d'écriture). Cependant, cette opération peut également échouer si la machine physique manque de mémoire, ce qui signifie une fois de plus que l'ordre des ajouts peut affecter l'état final de la map.
tr: Bununla birlikte, bilgisayarların sınırlı doğası nedeniyle ortaya çıkabilecek tek hata bu değildir. Örneğin, ``AddKeys`` dönüşümü, aynı zamanda değişmeli bir işlem olan bir haritaya eleman eklemekle ilgilidir (haritada anahtarlardan hiçbiri mevcut olmadığı sürece, bu daha çok bir yazma işlemine benzer). Ancak bu işlem, fiziksel makinenin belleğinin yetersiz olması nedeniyle de başarısız olabilir, bu nedenle bir kez daha, eklemelerin sırasının haritanın son durumunu etkileyebileceği anlamına gelir.
vi: Đây không phải là lỗi duy nhất có thể phát sinh do tính chất hữu hạn của máy tính. Ví dụ, biến đổi ``AddKeys`` là về việc thêm các phần tử vào bản đồ, đây cũng là một thao tác hoán đổi (miễn là không có khóa nào đã tồn tại trong bản đồ, thì nó giống với thao tác ghi hơn). Tuy nhiên, hoạt động này cũng có thể thất bại do máy vật lý hết bộ nhớ, do đó thứ tự thêm có thể ảnh hưởng đến trạng thái cuối cùng của bản đồ.

source: In a more powerful theory of parallel execution we could consider operations which fail. In this case we could say that transforms ``t_1`` and ``t_2`` commute if they are of the same addition type and the outcome of applying both to the input global state, :math:`G` is not an error. This is a more complex rule because it requires doing some amount of computation during commutativity checking, whereas the previous theory was simple comparison. Yet, this theory might be worth pursuing because it solves the two problems we have listed here (overflow and out-of-memory), along with other problems that we presently cannot handle at all. For example, ``Minus`` could be introduced as a transform, and underflows could be handled using this refined commutativity rule. This has practical application in our system because it would mean transfers from the same source could commute if enough funds are available, whereas presently they will always be conservatively labeled as not commuting.
fr: Dans une théorie plus puissante de l'exécution parallèle, nous pourrions considérer les opérations qui échouent. Dans ce cas, nous pourrions dire que les transformées ``t_1`` et ``t_2`` commutent si elles sont du même type d'addition et que le résultat de leur application à l'état global d'entrée, :math:`G`, n'est pas une erreur. Il s'agit d'une règle plus complexe car elle nécessite d'effectuer un certain nombre de calculs pendant la vérification de la commutativité, alors que la théorie précédente était une simple comparaison. Pourtant, cette théorie pourrait valoir la peine d'être poursuivie car elle résout les deux problèmes que nous avons énumérés ici (overflow et out-of-memory), ainsi que d'autres problèmes que nous ne pouvons actuellement pas du tout gérer. Par exemple, ``Minus`` pourrait être introduit comme une transformation, et les 'underflows' pourraient être gérés en utilisant cette règle de commutativité raffinée. Cela a une application pratique dans notre système car cela signifierait que les transferts de la même source pourraient commuter si suffisamment de fonds sont disponibles, alors qu'actuellement ils seront toujours étiquetés de manière conservatrice comme ne commutant pas.
tr: Daha güçlü bir paralel yürütme teorisinde, başarısız olan işlemleri düşünebiliriz. Bu durumda, ``t_1`` ve ``t_2`` dönüşümlerinin, aynı toplama türünden olmaları ve her ikisinin de giriş global durumuna uygulanmasının sonucu olması durumunda, :math:`G` bir hata olmadığını söyleyebiliriz. Bu daha karmaşık bir kuraldır, çünkü önceki teori basit karşılaştırma iken, değişebilirlik kontrolü sırasında bir miktar hesaplama yapılmasını gerektirir. Yine de, bu teori takip etmeye değer olabilir, çünkü burada listelediğimiz iki sorunu (taşma ve yetersiz bellek) ve şu anda hiç baş edemediğimiz diğer sorunları çözer. Örneğin, ``Minus`` bir dönüşüm olarak tanıtılabilir ve bu iyileştirilmiş değişme kuralı kullanılarak alt akışlar işlenebilir. Bu, sistemimizde pratik bir uygulamaya sahiptir, çünkü bu, aynı kaynaktan yapılan transferlerin, yeterli fon mevcut olduğunda takas edilebileceği anlamına gelirken, oysaki şu anda, her zaman, ılımlı olarak takas edilmiyor olarak etiketleneceklerdir.
vi: Trong một lý thuyết mạnh mẽ hơn về thực thi song song, chúng ta có thể xem xét các hoạt động không thành công. Trong trường hợp này, chúng ta có thể nói rằng các biến đổi ``t_1`` và ``t_2`` nếu chúng có cùng kiểu cộng và kết quả của việc áp dụng cả hai cho trạng thái toàn cục đầu vào thì :math:`G` không phải là một lỗi . Đây là một quy tắc phức tạp hơn vì nó yêu cầu thực hiện một số tính toán trong quá trình kiểm tra tính hoán đổi, trong khi lý thuyết trước đây chỉ cần so sánh đơn giản. Tuy nhiên, lý thuyết này có thể đáng theo đuổi vì nó giải quyết được hai vấn đề mà chúng ta đã liệt kê ở đây (tràn và hết bộ nhớ), cùng với các vấn đề khác mà hiện tại chúng ta không thể xử lý được. Ví dụ: Trừ ``Minus`` có thể được giới thiệu dưới dạng một phép biến đổi và các tiến trình theo nó có thể được xử lý bằng cách sử dụng quy tắc hoán đổi tinh chỉnh này. Điều này có ứng dụng thực tế trong hệ thống của chúng ta vì nó có nghĩa là các khoản chuyển tiền từ cùng một nguồn có thể hoán đổi nếu có đủ tiền, trong khi hiện tại chúng sẽ luôn được gắn nhãn là không hoán đổi.
