Repository: casper-network/docs-archive
Catalog: locale/*/LC_MESSAGES/implementation/appendix.po
Languages: fr, tr, vi

source: An important note about the returned |Transforms|_ is there is exactly one ``Transform`` per key that was used during the execution. Initially, this may be unintuitive because a contract can use the same key multiple times, however, because each deploy executes sequentially, we can use the composition property discussed in the previous section to combine multiple sequential operations into a single operation. Consider the following example.
fr: Une remarque importante à propos des |Transforms|_ retournées est qu'il y a exactement une ``Transform`` par clé utilisée pendant l'exécution. Initialement, cela peut être peu intuitif car un contrat peut utiliser la même clé plusieurs fois. Cependant, comme chaque déploiement s'exécute de façon séquentielle, nous pouvons utiliser la propriété de composition discutée dans la section précédente pour combiner plusieurs opérations séquentielles en une seule opération. Considérons l'exemple suivant.
tr: Döndürülen |Transforms|_ ile ilgili önemli bir not, yürütme sırasında kullanılan anahtar başına tam olarak bir ``Transform`` olmasıdır. Başlangıçta, bir sözleşme aynı anahtarı birden çok kez kullanabileceğinden bu sezgisel olmayabilir, ancak her konuşlandırma sırayla yürütüldüğünden, birden çok sıralı işlemi tek bir işlemde birleştirmek için önceki bölümde tartışılan kompozisyon özelliğini kullanabiliriz. Aşağıdaki örneği düşünün.
vi: Một lưu ý quan trọng về |Transforms| _ được trả về là có chính xác một ``Transform`` cho mỗi khóa được sử dụng trong quá trình thực thi. Ban đầu, điều này có thể không trực quan vì một hợp đồng có thể sử dụng cùng một khóa nhiều lần, tuy nhiên, vì mỗi triển khai thực thi tuần tự, chúng ta có thể sử dụng thuộc tính tổng hợp được thảo luận trong phần trước để kết hợp nhiều hoạt động tuần tự thành một hoạt động duy nhất. Hãy xem xét ví dụ sau.

source: The above function reads a local variable, performs a computation which depends on the current value of that variable, then writes an updated value. Suppose we execute this function on a global state where the value of the local key is ``7``. Then the sequence of transforms on the global state would be ``Read -> Write(22)`` since ``n`` would be odd and thus ``f_n`` would be computed using the ``else`` case. From the perspective of state changes, we only need to keep the ``Write(22)`` transform because final state is the same as if we had also included the ``Read`` transform. In fact, by the same reasoning, we know that we only need to keep the last ``Write``, whatever it happens to be, since it will be the final value on the key after the computation finishes. Notice that the resulting global state function does not exactly reproduce the original contract execution steps; it is a *reduced trace* where only the final effect on the global state is recorded [#]_. In particular, this means applying the results of these executions is very fast relative to the original execution (this will be importnat for how we use these traces in the next section). Also notice that the transforms which are produced depend on the initial state. This might be obvious since we are modeling compuation as functions :math:`f: G \rightarrow End(G)`, so this statement is simply that the function really depends on its input. However, this is again an imporant concept to keep in mind when working with this model of computation. Going back to our example, if the value of the local key was ``16`` then the transform produced would be ``Write(8)``, entirely different from the case where the initial value was ``7``.
fr: La fonction ci-dessus lit une variable locale, effectue un calcul qui dépend de la valeur actuelle de cette variable, puis écrit une valeur actualisée. Supposons que nous exécutions cette fonction sur un état global où la valeur de la clé locale est ``7``. La séquence de transformations sur l'état global serait alors ``Read -> Write(22)`` puisque ``n`` serait impair et donc ``f_n`` serait calculé en utilisant le cas ``else``. Du point de vue des changements d'état, nous n'avons besoin de garder que la transformation ``Write(22)`` car l'état final est le même que si nous avions aussi inclus la transformation ``Read``. En fait, par le même raisonnement, nous savons que nous n'avons besoin de garder que la dernière transformation ``Write``, quelle qu'elle soit, puisqu'elle sera la valeur finale de la clé après la fin du calcul. Remarquez que la fonction d'état global qui en résulte ne reproduit pas exactement les étapes d'exécution du contrat original ; c'est une *trace réduite* où seul l'effet final sur l'état global est enregistré [#]_. En particulier, cela signifie que l'application des résultats de ces exécutions est très rapide par rapport à l'exécution originale (ceci sera important pour l'utilisation de ces traces dans la section suivante). Remarquez également que les transformations produites dépendent de l'état initial. Cela peut sembler évident puisque nous modélisons la computation comme des fonctions :math:`f : G \rightarrow End(G)`, donc cette affirmation est simplement que la fonction dépend réellement de son entrée. Cependant, il s'agit là encore d'un concept important à garder à l'esprit lorsque l'on travaille avec ce modèle de calcul. Pour en revenir à notre exemple, si la valeur de la clé locale était ``16``, alors la transformation produite serait ``Write(8)``, totalement différente du cas où la valeur initiale était ``7``.
tr: Yukarıdaki fonksiyon yerel bir değişkeni okur, o değişkenin mevcut değerine bağlı bir hesaplama yapar ve sonra güncellenmiş bir değer yazar. Bu işlevi, yerel anahtarın değerinin ``7`` olduğu küresel bir durumda çalıştırdığımızı varsayalım. Sonra küresel durumdaki dönüşümlerin sırası ``Read -> Write(22)`` olur, çünkü ``n`` tek olur ve bu nedenle ``f_n``, ``else`` durumu kullanılarak hesaplanır. Durum değişiklikleri açısından, sadece ``Write(22)`` dönüşümünü korumamız gerekiyor çünkü son durum, ``Read`` dönüşümünü de dahil etmişiz gibidir. Aslında, aynı mantıkla, ne olursa olsun, sadece son ``Write``ı tutmamız gerektiğini biliyoruz, çünkü bu, hesaplama bittikten sonra anahtar üzerindeki son değer olacaktır. Ortaya çıkan küresel durum işlevinin orijinal sözleşme yürütme adımlarını tam olarak yeniden üretmediğine dikkat edin; yalnızca küresel durum üzerindeki nihai etkinin kaydedildiği *azaltılmış bir izdir* [#]_. Bu, özellikle, bu yürütmelerin sonuçlarının uygulanmasının orijinal yürütmeye göre çok hızlı olduğu anlamına gelir (bu, sonraki bölümde bu izleri nasıl kullandığımız için önemli olacaktır). Ayrıca üretilen dönüşümlerin başlangıç ​​durumuna bağlı olduğuna dikkat edin. Hesaplamayı :math:`f: G \rightarrow End(G)` fonksiyonları olarak modellediğimiz için bu açık olabilir, bu nedenle bu ifade basitçe fonksiyonun gerçekten girdisine bağlı olduğudur. Ancak, bu, hesaplama modeliyle çalışırken akılda tutulması gereken önemli bir kavramdır. Örneğimize geri dönersek, yerel anahtarın değeri ``16`` ise, üretilen dönüşüm ``Write(8)`` olacaktır, bu ilk değerin ``7`` olduğu durumdan tamamen farklı olacaktır.
vi: Hàm trên đọc một biến cục bộ, thực hiện một phép tính phụ thuộc vào giá trị hiện tại của biến đó, sau đó ghi một giá trị cập nhật. Giả sử chúng ta thực thi hàm này trên trạng thái toàn cục nơi giá trị của khóa cục bộ là ``7``. Sau đó, chuỗi các biến đổi trên trạng thái toàn cục sẽ là ``Read -> Write(22)`` vì ``n`` sẽ là số lẻ và do đó `` `f_n`` sẽ được tính bằng cách sử dụng trường hợp khá là``else``. Từ quan điểm của các thay đổi trạng thái, chúng ta chỉ cần giữ biến đổi ``Write(22)`` vì trạng thái cuối cùng giữ nguyên khi chúng ta đã bao gồm biến đổi ``Read``. Trên thực tế, bằng cách lập luận tương tự, chúng ta biết rằng chúng ta chỉ cần giữ chữ ````Write`` cuối cùng, bất kể điều gì xảy ra, vì nó sẽ là giá trị cuối cùng trên khóa sau khi tính toán kết thúc. Lưu ý rằng hàm trạng thái toàn cục kết quả không tái tạo chính xác các bước thực hiện hợp đồng ban đầu; mà chỉ là các dấu vết có tác động cuối cùng lên trạng thái toàn cục được ghi lại [#] _. Đặc biệt, điều này có nghĩa là việc áp dụng các kết quả của các lần thực thi này rất nhanh so với lần thực thi ban đầu (đây sẽ là bài viết về cách chúng ta sử dụng các dấu vết này trong phần tiếp theo). Cũng lưu ý rằng các phép biến đổi được tạo ra phụ thuộc vào trạng thái ban đầu. Điều này có thể rõ ràng vì chúng ta đang lập mô hình tính toán dưới dạng các hàm :math:`f: G \rightarrow End(G)`, vì vậy câu lệnh này chỉ đơn giản là hàm thực sự phụ thuộc vào đầu vào của nó. Tuy nhiên, đây lại là một khái niệm không cần thiết phải ghi nhớ khi làm việc với mô hình tính toán này. Quay lại với ví dụ của chúng ta, nếu giá trị của khóa cục bộ là ``16`` thì biến đổi được tạo ra sẽ là `` `Write(8)``, hoàn toàn khác với trường hợp giá trị ban đầu là ``7``.

source: There is a special case of constructing reduced traces which is worth calling out explicitly. Suppose the initial value of a key in the global state is ``X``, and after performing the execution, the transform for that key is ``Write(X)``. Then it is valid to replace that transform with ``Read``. This is because the computation acts like the identity function (i.e. the function which makes no changes) at this key, and therefore is equal to ``Read``. Notably we cannot simply remove the transfrom from the map because the key was still used in some way during the computation. We must have a record of what keys were used to correctly detect when deploys commute (see the following sections for more details). Replacing a ``Write`` with a ``Read`` still has great benefits for parallel exectuion because reads do commute with one another, while writes do not. This optimization in the reduced traces is `applied in our reference implementation <https://github.com/CasperLabs/casper-node/blob/master/execution_engine/src/core/engine_state/execution_result.rs#L439>`__.
fr: Il existe un cas particulier de construction de traces réduites qui mérite d'être signalé explicitement. Supposons que la valeur initiale d'une clé dans l'état global soit ``X``, et qu'après avoir effectué l'exécution, la transformation pour cette clé soit ``Write(X)``. Il est alors valide de remplacer cette transformation par "Read". En effet, le calcul agit comme la fonction d'identité (c'est-à-dire la fonction qui n'apporte aucun changement) sur cette clé, et est donc égal à``Read``. Notamment, nous ne pouvons pas simplement supprimer la transformation de la 'map' parce que la clé a encore été utilisée d'une certaine manière pendant le calcul. Nous devons avoir un historique des clés utilisées pour détecter correctement quand les déploiements commuent (voir les sections suivantes pour plus de détails).. Remplacer une ``Write`` par une ``Read`` a toujours de grands avantages pour l'exécution parallèle parce que les lectures commutent entre elles, alors que les écritures ne le font pas. Cette optimisation dans les traces réduites est `appliquée dans notre implémentation de référence <https://github.com/CasperLabs/casper-node/blob/master/execution_engine/src/core/engine_state/execution_result.rs#L439>`__.
tr: Açıkça söylemeye değer, indirgenmiş izler oluşturmanın özel bir durumu vardır. Global durumdaki bir anahtarın başlangıç ​​değerinin ``X`` olduğunu ve yürütmeyi gerçekleştirdikten sonra bu anahtarın dönüşümünün ``Write(X)`` olduğunu varsayalım. O zaman bu dönüşümü ``Read`` ile değiştirmek geçerlidir. Bunun nedeni, hesaplamanın bu anahtardaki kimlik işlevi (yani hiçbir değişiklik yapmayan işlev) gibi davranması ve bu nedenle ``Read`` e eşit olmasıdır. Özellikle, hesaplama sırasında anahtar hala bir şekilde kullanıldığından, dönüşümü haritadan basitçe kaldıramayız. Dağıtımların takasını doğru bir şekilde algılamak için hangi anahtarların kullanıldığının bir kaydına sahip olmamız gerekir (daha fazla ayrıntı için aşağıdaki bölümlere bakın). ``Write`` ı ``Read`` ile değiştirmenin paralel yürütme için hala büyük faydaları vardır, çünkü okumalar birbiriyle takas edilirken yazma işlemleri bu şekilde yapmaz. İndirgenmiş izlerdeki bu optimizasyon `referans uygulamamızda uygulanmıştır <https://github.com/CasperLabs/casper-node/blob/master/execution_engine/src/core/engine_state/execution_result.rs#L439>`__.
vi: Có một trường hợp đặc biệt của việc xây dựng các dấu vết giảm dần đáng thảo luận một cách rõ ràng. Giả sử giá trị ban đầu của một khóa ở trạng thái toàn cục là ``X`` và sau khi thực hiện việc thực thi, phép biến đổi cho khóa đó là ``Write(X)``. Sau đó, nó hợp lệ để thay thế biến đổi đó bằng ``Read``. Đó là do o tính toán hoạt động giống như hàm nhận dạng (tức là hàm không tạo ra thay đổi) tại khóa này, và do đó nó bằng với `Read``. Đáng chú ý là chúng ta không thể đơn giản xóa chuyển đổi khỏi bản đồ vì khóa vẫn được sử dụng theo một cách nào đó trong quá trình tính toán. Chúng tôi phải có hồ sơ về những khoá nào đã được sử dụng để phát hiện chính xác khi triển khai lộ trình hoán đổi. (xem các phần sau để biết thêm chi tiết). Thay thế ``Write`` bằng ``Read`` vẫn mang lại lợi ích lớn cho hoạt động song song vì các lần đọc đi lại với nhau, trong khi các lần ghi thì không. Tối ưu hóa theo dấu vết giảm dần này được `áp dụng trong triển khai tham chiếu <https://github.com/CasperLabs/casper-node/blob/master/execution_engine/src/core/engine_state/execution_result.rs#L439>`__.

source: Constructing the post-state from parallel execution
fr: Construire le post-état à partir de l'exécution parallèle
tr: Paralel yürütmeden durum sonrası oluşturma
vi: Xây dựng trạng thái hậu toàn cục từ thực thi song song

source: Following from the previous section, we know that deploys execute to produce a ``Map<Key, Transform>`` which gives a summary (i.e. "reduced trace") of the effects the deploy would have had on each key in the global state (keys not present in the map are not effected). In the reference implementation we call this the ``exec`` phase. Since creating these maps does not mutate the global state, we can run as many of these as we want in parallel. However, after they have been run we need to actually produce a post-state, the new global state after applying the effects of the deploys (this will then be used as the pre-states for deploys in the following batch of executions). In the reference implementation, we call applying the collection of transforms to obtain a post-state the ``commit`` phase.
fr: Suite à la section précédente, nous savons que les déploiements s'exécutent pour produire une map : ``Map<Key, Transform>`` qui donne un résumé (i.e. une "trace réduite") des effets que le déploiement aurait eu sur chaque clé dans l'état global (les clés non présentes dans la map ne sont pas affectées). Dans l'implémentation de référence, nous appelons cela la phase ``exec``. Puisque la création de ces 'maps' ne modifie pas l'état global, nous pouvons en exécuter autant que nous le souhaitons en parallèle. Cependant, après leur exécution, nous devons produire un post-état, le nouvel état global après avoir appliqué les effets des déploiements (il sera ensuite utilisé comme pré-état pour les déploiements dans le lot suivant d'exécutions). Dans l'implémentation de référence, nous appelons l'application de la collection de transformations pour obtenir un post-état la phase ``commit``.
tr: Önceki bölümden yola çıkarak, dağıtımların, dağıtımın küresel durumda her bir anahtar üzerinde sahip olacağı etkilerin bir özetini (yani "indirgenmiş iz") veren bir ``Map<Key, Transform>`` üretmek için yürütüldüğünü biliyoruz. (haritada bulunmayan tuşlar etkilenmez). Referans uygulamada buna ``exec`` aşaması diyoruz. Bu haritaları oluşturmak küresel durumu değiştirmediğinden, bunlardan istediğimiz kadarını paralel olarak çalıştırabiliriz. Ancak, bunlar çalıştırıldıktan sonra, dağıtımların etkilerini uyguladıktan sonra yeni küresel durum olan bir durum sonrası üretmemiz gerekir (bu daha sonra sonraki yürütme partilerinde dağıtımlar için ön-durumlar olarak kullanılacaktır). Referans uygulamasında, bir durum sonrası elde etmek için dönüşümlerin koleksiyonunu ``commit`` aşamasını uygulamayı çağırıyoruz.
vi: Tiếp theo từ phần trước, chúng ta biết rằng triển khai thực thi để tạo ra một ``Map<Key, Transform>`` cung cấp một bản tóm tắt (tức là "dấu vết giảm dần") về các tác động mà triển khai sẽ có trên mỗi khóa trong trạng thái toàn cục (các khoá không có trong bản đồ sẽ không có hiệu lực). Trong phần triển khai tham chiếu, chúng ta gọi đây là giai đoạn thực thi (``exec`` phase). Vì việc tạo các bản đồ này không làm thay đổi trạng thái toàn cục, chúng ta có thể chạy song song bao nhiêu bản đồ này tùy thích. Tuy nhiên, sau khi chúng được chạy, chúng ta cần thực sự tạo ra một trạng thái hậu toàn cục, trạng thái toàn cục mới sau khi áp dụng các hiệu ứng của các đợt triển khai (sau đó điều này sẽ được sử dụng làm trạng thái trước cho các đợt triển khai sau). Trong triển khai tham chiếu, chúng tôi gọi việc áp dụng tập hợp các biến đổi để có được trạng thái hậu là giai đoạn cam kết (```commit`` phase).

source: Before we can construct the post-state, we must know that one is well-defined. When working with parallel execution with a shared resource, you may encounter "race conditions". This is a situation where the outcome of a parallel computation depends on the order or timing of events, in particular when this timing is not explicitly controlled. Or phrased another way, parallelism with a shared resource is a lie and one of the processes will use the resource first, followed by the other one. A classic blockchain example of a race condition is a double spend (which under an accounts model, as opposed to UTXO, is the same as an overdraft on the account); one payer attempts to pay two payees at the same time without enough tokens to actually pay both. One payee or the other is not getting their tokens, depending on the order the transactions are processed.
fr: Avant de pouvoir construire le post-état, nous devons vérifier qu'il est bien défini. Lorsque vous travaillez en exécution parallèle avec une ressource partagée, vous pouvez rencontrer des "race conditions". Il s'agit d'une situation où le résultat d'un calcul parallèle dépend de l'ordre ou de la synchronisation des événements, en particulier lorsque cette synchronisation n'est pas explicitement contrôlée. Formulé autrement, le parallélisme avec une ressource partagée est un 'mensonge' et l'un des processus utilisera la ressource en premier, suivi par l'autre. Un exemple classique de "race conditions" sur la blockchain est la double dépense (qui, dans le cadre d'un modèle de compte, par opposition à UTXO, équivaut à un découvert sur le compte) ; un payeur tente de payer deux bénéficiaires en même temps sans avoir assez de jetons pour payer les deux. L'un ou l'autre des bénéficiaires ne reçoit pas ses jetons, selon l'ordre dans lequel les transactions sont traitées.
tr: Durum sonrasını inşa etmeden önce, birinin iyi tanımlanmış olduğunu bilmeliyiz. Paylaşılan bir kaynakla paralel yürütme ile çalışırken "yarış koşulları" ile karşılaşabilirsiniz. Bu, paralel bir hesaplamanın sonucunun, özellikle bu zamanlama açıkça kontrol edilmediğinde, olayların sırasına veya zamanlamasına bağlı olduğu bir durumdur. Veya başka bir deyişle, paylaşılan bir kaynakla paralellik bir yalandır ve süreçlerden biri önce kaynağı, ardından diğerini kullanır. Bir yarış koşulunun klasik bir blokzincir örneği, çift harcamadır (bu, UTXO'nun aksine bir hesap modeli altında, hesaptaki bir kredili mevduatla aynıdır); bir ödeyen, her ikisini de ödemeye yetecek kadar token olmadan aynı anda iki alacaklıya ödeme yapmaya çalışır. Bir alacaklı veya diğeri, işlemlerin işlenme sırasına bağlı olarak tokenlerini almıyor.
vi: Trước khi có thể xây dựng trạng thái hậu toàn cục, chúng ta cần biết rằng một trạng thái đã được xác định rõ. Khi làm việc với thực thi song song với một tài nguyên được chia sẻ, bạn có thể gặp phải "các tình huống chạy đua". Đây là tình huống mà kết quả của một phép tính song song phụ thuộc vào thứ tự hoặc thời gian của các sự kiện, đặc biệt khi thời gian này không được kiểm soát rõ ràng. Hay diễn đạt một cách khác, song song với một tài nguyên được chia sẻ là một trong các quy trình sẽ sử dụng tài nguyên trước, sau đó là tiến trình kia. Một ví dụ chuỗi khối cổ điển về tình huống chạy đua là chi tiêu gấp đôi (trong mô hình tài khoản, trái ngược với UTXO, giống như thấu chi trên tài khoản); một người thanh toán cố gắng thanh toán cho hai người được thanh toán cùng một lúc mà không có đủ token để thực sự thanh toán cho cả hai. Một người nhận thanh toán hoặc người kia không nhận được token của họ, tùy thuộc vào thứ tự các giao dịch được xử lý.

source: In our simple model of computation where deploys are functions on the global state, this would correspond to functions that do not *commute*, that is to say, the order in which we apply the functions to the global state matters: :math:`f \circ g \not= g \circ f`. Therefore, in order to prevent race conditions, we will only allow deploys to execute in parallel if they commute. Taking our more sophisticated model of computation, we have two deploys: :math:`f: G \rightarrow End(G)` and :math:`g: G \rightarrow End(G)`, and we will only allow both be committed to the same pre-state :math:`G` if :math:`f(G) \circ g(G) = g(G) \circ f(G)`, i.e. the resulting maps of transforms commute.
fr: Dans notre modèle simple de calcul où les déploiements sont des fonctions sur l'état global, cela correspondrait à des fonctions qui ne *commutent* pas, c'est-à-dire que l'ordre dans lequel nous appliquons les fonctions à l'état global a de l'importance: :math:`f \circ g \not= g \circ f`. Par conséquent, afin d'éviter les situations de concurrence 'race conditions', nous n'autoriserons les déploiements à s'exécuter en parallèle que s'ils 'commutent'. En prenant notre modèle de calcul plus sophistiqué, nous avons deux déploiements: :math:`f: G \rightarrow End(G)` and :math:`g: G \rightarrow End(G)`, et nous ne permettrons que les deux soient affectés au même pré-état. :math:`G` if :math:`f(G) \circ g(G) = g(G) \circ f(G)`, i.e. les 'maps' de 'transforms' résultantes commutent.
tr: Dağıtımların küresel durumda fonksiyonlar olduğu basit hesaplama modelimizde, bu, *takas edilmeyen* fonksiyonlara, yani fonksiyonları küresel duruma uygulama sırasına karşılık gelir: :math:` f \circ g \not= g \circ f`. Bu nedenle, yarış koşullarını önlemek için dağıtımların yalnızca takası durumunda paralel olarak yürütülmesine izin vereceğiz. Daha karmaşık hesaplama modelimizi alırsak, iki dağıtımımız var: :math:`f: G \rightarrow End(G)` ve :math:`g: G \rightarrow End(G)` ve yalnızca :math:`f(G) \circ g(G) = g(G) \circ f(G)` durumunda, aynı :math:`G` ön durumuna takas edilmelerine izin vereceğiz, yani takas edilen dönüşümlerin son haritaları.
vi: Trong mô hình tính toán đơn giản của chúng ta, nơi triển khai là các hàm trên trạng thái toàn cục, điều này sẽ tương ứng với các hàm không *hoán đổi*, nghĩa là thứ tự mà chúng ta áp dụng các hàm cho trạng thái toàn cục là: :math:`f \circ g \not= g \circ f`. Do đó, để ngăn chặn các tình huống chạy đua, chúng ta sẽ chỉ cho phép triển khai thực hiện song song nếu họ giao hoán. Lấy mô hình tính toán phức tạp hơn, chúng ta có hai triển khai: :math:`f: G \rightarrow End(G)` và :math:`g: G \rightarrow End(G)`, chúng ta sẽ chỉ cho phép cả hai triển khai này cam kết với cùng một trạng thái trước :math:`G` if :math:`f(G) \circ g(G) = g(G) \circ f(G)`, tức là bản đồ kết quả của các phép biến đổi hoán đổi với nhau.
