Repository: casper-network/docs-archive
Catalog: locale/*/LC_MESSAGES/implementation/appendix.po
Languages: fr, tr, vi

source: Appendix
fr: Annexe
tr: Ek Bölüm
vi: Phụ lục

source: A - Casper Rust Library
fr: A - Librairie Casper Rust
tr: A - Casper Rust Kütüphanesi
vi: A - Thư viện Casper Rust

source: Casper provides low-level bindings for host-side (“external”) functions for developers creating smart contracts in other programming languages. Developers can import these functions into a wasm module used as a contract on the Casper Network. Thus, the contract will have access to features specific to the Casper platform which are not supported by general wasm instructions (e.g., accessing the global state, creating new ``URef``\ s). These are defined and automatically imported if the `Casper Rust library <https://crates.io/crates/casper-contract>`__ is used to develop the contract. For an up-to-date description of exported functions, please visit the `casper-contract <https://docs.rs/casper-contract/latest/casper_contract/ext_ffi/index.html>`__ crate documentation.
fr: Casper fournit des 'bindings' de bas niveau pour les fonctions 'host-side' ("externes") destinées aux développeurs qui créent des contrats intelligents dans d'autres langages de programmation. Les développeurs peuvent importer ces fonctions dans un module wasm utilisé comme contrat sur le réseau Casper. Ainsi, le contrat aura accès à des fonctionnalités spécifiques à la plateforme Casper qui ne sont pas prises en charge par les instructions générales de wasm (par exemple, l'accès à l'état global, la création de nouveaux ``URef``\ s). Celles-ci sont définies et automatiquement importées si la librairie `Casper Rust' <https://crates.io/crates/casper-contract>`__ est utilisée pour développer le contrat. Pour une description actualisée des fonctions exportées, veuillez consulter la documentation de le packet (crate) `casper-contract <https://docs.rs/casper-contract/latest/casper_contract/ext_ffi/index.html>`_.
tr: Casper, diğer programlama dillerinde akıllı kontratlar oluşturan geliştiriciler için ana bilgisayar tarafı (“harici”) işlevler için düşük düzeyli bağlamalar sağlar. Geliştiriciler, bu işlevleri Casper Network'te kontrat olarak kullanılan bir wasm modülüne aktarabilir. Böylece kontrat, genel wasm talimatları tarafından desteklenmeyen Casper platformuna özgü özelliklere (örneğin, küresel duruma erişme, yeni ``URef``\ ler oluşturma) erişime sahip olacaktır. Bunlar tanımlanır ve kontratı geliştirmek için `Casper Rust library <https://crates.io/crates/casper-contract>`__ kullanılırsa otomatik olarak içe aktarılır. Dışa aktarılan işlevlerin güncel bir açıklaması için lütfen `casper-contract <https://docs.rs/casper-contract/latest/casper_contract/ext_ffi/index.html>`__ paket belgelerini ziyaret edin.
vi: Casper cung cấp ít các ràng buộc với các chức năng phía máy chủ (“bên ngoài”) cho các nhà phát triển tạo hợp đồng thông minh trong các ngôn ngữ lập trình khác nhau. Các nhà phát triển có thể nhập các chức năng này vào một mô-đun wasm được sử dụng như một hợp đồng trên Mạng Casper. Do đó, hợp đồng sẽ có quyền truy cập vào các tính năng dành riêng cho nền tảng Casper, trong khi các hướng dẫn chung của wasm không hỗ trợ (ví dụ: truy cập trạng thái toàn cục, tạo mới ```URef``\). Chúng được xác định và tự động kết nhập nếu thư viện `Casper Rust <https://crates.io/crates/casper-contract>`__ được sử dụng để phát triển hợp đồng. Để có mô tả cập nhật về các hàm đã có, vui lòng truy cập tài liệu `casper-contract <https://docs.rs/casper-contract/latest/casper_contract/ext_ffi/index.html>`__.

source: B - Serialization Format
fr: B - Format de sérialisation
tr: B - Serileştirme Formatı
vi: B - Định dạng tuần tự

source: The Casper serialization format is used to transfer data between wasm and the Casper host runtime. It is also used to persist global-state data in the Merkle trie. The definition of this format is described in the :ref:`global state <global-state-head>` section.
fr: Le format de sérialisation Casper est utilisé pour transférer les données entre wasm et le runtime Casper. Il est également utilisé pour faire persister les données de l'état global dans l'arbre de Merkle. La définition de ce format est décrite dans la section :ref:`global state <global-state-head>`.
tr: Casper serileştirme formatı, wasm ve Casper ana bilgisayar çalışma zamanı arasında veri aktarmak için kullanılır. Ayrıca Merkle ağacında küresel durum verilerini sürdürmek için kullanılır. Bu format tanımı :ref:`global state <global-state-head>` bölümünde açıklanmıştır.
vi: Định dạng tuần tự của Casper được sử dụng để truyền dữ liệu giữa wasm và thời điểm chạy máy chủ Casper. Nó cũng được sử dụng để duy trì dữ liệu trạng thái toàn cục trong Merkle trie. Định nghĩa của định dạng này được mô tả trong phần :ref: `trạng thái toán cục <global-state-head>`.

source: A Rust reference implementation for those implementing this specification in another programming language can be found here:
fr: Une implémentation de référence Rust pour ceux qui mettent en œuvre cette spécification dans un autre langage de programmation peut être trouvée ici :
tr: Bu belirtimi başka bir programlama dilinde uygulayanlar için bir Rust referans uygulaması burada bulunabilir:
vi: Bạn có thể tìm thấy triển khai tham chiếu Rust cho những người triển khai đặc tả này bằng ngôn ngữ lập trình khác tại đây:

source: Additionally, examples of all data types and their serializations are found in the `GitHub code base <https://github.com/CasperLabs/casper-node/blob/553b9f11eb3b1e8043acfe3fa04005d951047c4a/types/src/bytesrepr.rs#L26>`_. These examples include a set of useful `serialization tests <https://github.com/CasperLabs/casper-node/blob/553b9f11eb3b1e8043acfe3fa04005d951047c4a/types/src/bytesrepr.rs#L1189>`_.
fr: De plus, des exemples de tous les types de données et de leurs sérialisations se trouvent dans la base de code `GitHub <https://github.com/CasperLabs/casper-node/blob/553b9f11eb3b1e8043acfe3fa04005d951047c4a/types/src/bytesrepr.rs#L26>`_. Ces exemples comprennent un ensemble de `tests de sérialisation utiles <https://github.com/CasperLabs/casper-node/blob/553b9f11eb3b1e8043acfe3fa04005d951047c4a/types/src/bytesrepr.rs#L1189>`_.
tr: Ek olarak, tüm veri türlerinin örnekleri ve bunların serileştirmeleri `GitHub code base <https://github.com/CasperLabs/casper-node/blob/553b9f11eb3b1e8043acfe3fa04005d951047c4a/types/src/bytesrepr.rs#L26>`_ adresinde bulunur. Bu örnekler, bir dizi yararlı `serialization tests <https://github.com/CasperLabs/casper-node/blob/553b9f11eb3b1e8043acfe3fa04005d951047c4a/types/src/bytesrepr.rs#L1189>`_ içerir.
vi: Ngoài ra, các ví dụ về tất cả các kiểu dữ liệu và tuần tự hóa của chúng được tìm thấy trong `GitHub code base <https://github.com/CasperLabs/casper-node/blob/553b9f11eb3b1e8043acfe3fa04005d951047c4a/types/src/bytesrepr.rs#L26>`_. Những ví dụ này bao gồm một tập hợp các `bài kiểm thử tuần tự hóa <https://github.com/CasperLabs/casper-node/blob/553b9f11eb3b1e8043acfe3fa04005d951047c4a/types/src/bytesrepr.rs#L1189>`_.

source: C - Parallel Execution
fr: C - Exécution parallèle
tr: C - Paralel Yürütme
vi: C - Thực thi song song

source: Introduction
tr: Giriş
vi: Giới thiệu

source: The state of the Casper Network is represented by the :ref:`global state <global-state-head>`. The evolution of this state is captured by the blockchain itself, and eventually agreed upon by all nodes in the network via the consensus mechanism. In this section we are concerned with only a single step of that evolution. We think of such a step as performing some "computation" that changes the global state. A :ref:`deploy <execution-semantics-deploys>` is a user request for computation, and contains two atomic units of computation: the payment code and the session code (the details of which are discussed elsewhere). For the purpose of this section, we think of each of these units as a (mathematical) function which takes the current global state as input, perhaps along with some other arguments, and produces a new global state as output. However, since the overall global state is ambient from the perspective of the session/payment code itself, the global state is not an explicit parameter in any user's source code, nor is there any explicit return value.
fr: L'état du réseau Casper est représenté par :ref:`état global <global-state-head>`. L'évolution de cet état est capturée par la blockchain elle-même, et finalement acceptée par tous les nœuds du réseau via le mécanisme de consensus. Dans cette section, nous ne intéressons qu'à une seule étape de cette évolution. Nous considérons qu'une telle étape consiste à effectuer un "calcul" qui modifie l'état global.. A :ref:`deploy <execution-semantics-deploys>` est une requête de calcul de l'utilisateur, et contient deux unités atomiques de calcul : le code de paiement et le code de session (dont les détails sont discutés ailleurs). Dans le cadre de cette section, nous considérons chacune de ces unités comme une fonction (mathématique) qui prend l'état global actuel en paramètre d'entrée, éventuellement avec d'autres arguments, et produit un nouvel état global en sortie. Cependant, puisque l'état global est dependant du code de session/paiement lui-même, l'état global n'est pas un paramètre explicite dans le code source d'un utilisateur, et il n'y a pas non plus de valeur de retour explicite.
tr: Casper Network'ün durumu :ref:`global state <global-state-head>` ile temsil edilir. Bu durumun evrimi, blok zincirinin kendisi tarafından yakalanır ve sonunda ağdaki tüm düğümler tarafından mutabakat mekanizması aracılığıyla kararlaştırılır. Bu bölümde, bu evrimin yalnızca tek bir adımıyla ilgileniyoruz. Küresel durumu değiştiren bazı "hesaplamalar" yapan bir adım olarak düşünüyoruz. A :ref:`deploy <execution-semantics-deploys>`, hesaplama için bir kullanıcı isteğidir ve iki atomik hesaplama birimi içerir: ödeme kodu ve oturum kodu (ayrıntıları başka bir yerde tartışılmıştır). Bu bölümün amacı için, bu birimlerin her birini, belki başka argümanlarla birlikte mevcut küresel durumu girdi olarak alan ve çıktı olarak yeni bir küresel durum üreten (matematiksel) bir fonksiyon olarak düşünüyoruz. Bununla birlikte, genel küresel durum, oturum/ödeme kodunun kendi perspektifinden olduğu için, küresel durum, herhangi bir kullanıcının kaynak kodunda açık bir parametre değildir ve herhangi bir açık dönüş değeri de yoktur.
vi: Trạng thái của Mạng Casper được biểu thị bằng: ref: `trạng thái toàn cục <global-state-head>`. Sự phát triển của trạng thái này được chính chuỗi khối nắm bắt và cuối cùng được tất cả các nút trong mạng đồng thuận thông qua cơ chế đồng thuận. Trong phần này, chúng tôi chỉ quan tâm đến một bước duy nhất của quá trình phát triển đó. Chúng tôi coi một bước như thực hiện một số "tính toán" làm thay đổi trạng thái toàn cục. :ref: `Triển khai <execution-semantics-deploys>` là một yêu cầu tính toán của người dùng và chứa hai đơn vị tính toán nguyên tử: mã thanh toán và mã phiên (chi tiết về chúng sẽ được thảo luận ở phần khác). Với mục đích của phần này, chúng tôi coi mỗi đơn vị này là một hàm (toán học) lấy trạng thái toàn cục hiện tại làm đầu vào, có thể cùng với một số đối số khác, và tạo ra một trạng thái toàn cục mới làm đầu ra. Tuy nhiên, vì trạng thái toàn cục tổng thể là môi trường xung quanh theo quan điểm của chính mã phiên / thanh toán, trạng thái toàn cục không phải là một tham số rõ ràng trong bất kỳ mã nguồn nào của người dùng và cũng không có bất kỳ giá trị trả lại rõ ràng nào.

source: In this section we refine this idea of computation modeled as functions, and describe how it is used to enable parallel execution.
fr: Dans cette section, nous affinons cette idée de calcul modélisé sous forme de fonctions, et décrivons comment elle est utilisée pour permettre l'exécution parallèle.
tr: Bu bölümde, işlevler olarak modellenen bu hesaplama fikrini iyileştireceğiz ve paralel yürütmeyi etkinleştirmenin nasıl kullanıldığını açıklayacağız.
vi: Trong phần này, chúng tôi tinh chỉnh ý tưởng tính toán được mô hình hóa dưới dạng các hàm và mô tả cách nó được sử dụng để cho phép thực thi song song.

source: Computation as functions on the global state
fr: Calculs en tant que fonctions de l'état global
tr: Küresel durumda fonksiyon olarak hesaplama
vi: Tính toán dưới dạng các hàm trong trạng thái toàn cục

source: As discussed in the introduction, we think of computation on the Casper platform as being functions from the global state, :math:`G`, to itself. Naturally, we can compose two such functions, to obtain another function. This corresponds to sequential execution. For example, you can think of the sequence ``payment_code -> session_code`` as being the composition of two individual functions, capturing the effects of the payment and session codes, respectively. If there are smart contracts which are called during those execution phases, you could even break these down further into a sequence of those calls: ``deployed_payment_wasm -> contract_a -> contract_b -> stored_session_code -> contract_c -> ...``. For notational purposes, we will call the set of functions :math:`\left\{ f \ \vert \ f: G \rightarrow G \right\} = End(G)`, meaning "endomorphisms of :math:`G`."
fr: Comme nous l'avons vu dans l'introduction, nous considérons que les calculs effectués sur la plate-forme Casper sont des fonctions de l'état global, :math:`G`, vers lui-même. Naturellement, on peut composer deux telles fonctions, pour obtenir une autre fonction. Cela correspond à l'exécution séquentielle. Par exemple, on peut penser à la séquence ``payment_code -> session_code`` comme étant la composition de deux fonctions individuelles, capturant les effets des codes de paiement et de session, respectivement. S'il y a des contrats intelligents qui sont appelés pendant ces phases d'exécution, vous pouvez même les décomposer davantage en une séquence de ces appels : ``deployed_payment_wasm -> contract_a -> contract_b -> stored_session_code -> contract_c -> ...``. Pour des raisons de notation, nous appellerons l'ensemble des fonctions :math:`\left\{ f \ \vert \ f: G \rightarrow G \right\} = End(G)`, signifiant "endomorphisms of :math:`G`."
tr: Giriş bölümünde tartışıldığı gibi, Casper platformundaki hesaplamanın, küresel durumdan, :math:`G`, kendisine yönelik işlevler olduğunu düşünüyoruz. Doğal olarak, başka bir fonksiyon elde etmek için böyle iki fonksiyon oluşturabiliriz. Bu, sıralı yürütmeye karşılık gelir. Örneğin, ``payment_code -> session_code`` dizisini, sırasıyla ödeme ve oturum kodlarının etkilerini yakalayan iki ayrı işlevin bileşimi olarak düşünebilirsiniz. Bu yürütme aşamalarında çağrılan akıllı kontratlar varsa, bunları bu çağrıların bir dizisine ayırabilirsiniz: ``deployed_payment_wasm -> contract_a -> contract_b -> stored_session_code -> contract_c -> ...``. Gösterim amacıyla, işlevler kümesini :math:`\left\{ f \ \vert \ f: G \rightarrow G \right\} = End(G)` olarak adlandıracağız, yani ":math:`G'nin endomorfizmaları" `."
vi: Như đã thảo luận trong phần giới thiệu, chúng tôi coi tính toán trên nền tảng Casper như là các hàm từ trạng thái toàn cục,: math:`G`. Đương nhiên, chúng ta có thể soạn hai hàm như vậy, để có được một hàm khác. Điều này tương ứng với thực hiện tuần tự. Ví dụ: bạn có thể coi chuỗi ``Payment_code -> session_code`` là thành phần của hai hàm riêng lẻ, ghi lại ảnh hưởng của mã thanh toán và mã phiên tương ứng. Nếu có các hợp đồng thông minh được gọi trong các giai đoạn thực thi đó, bạn thậm chí có thể chia nhỏ các hợp đồng này thành chuỗi các lệnh gọi đó:``deployed_payment_wasm -> contract_a -> contract_b -> stored_session_code -> contract_c -> ...`'. Đối với mục đích ký hiệu, chúng tôi sẽ gọi tập hợp các hàm :math:`\left\{ f \ \vert \ f: G \rightarrow G \right\} = End(G)`, có nghĩa là "endomorphisms của :math:`G`."

source: While this simple model captures sequential execution, it does not model parallel execution. Parallel execution is important because it can enable the execution engine to run more than one deploy at the same time, possibly improving block processing times. Note: each deploy itself is still single-threaded; we will not support parallel execution within a single contract or deploy. This optimization is purely for the performance of the node implementation, not contract developers.
fr: Si ce modèle simple rend compte de l'exécution séquentielle, il ne modélise pas l'exécution parallèle. L'exécution parallèle est importante car elle peut permettre au moteur d'exécution d'exécuter plus d'un déploiement en même temps, ce qui peut améliorer les temps de traitement des blocs. Remarque : chaque déploiement lui-même est toujours 'single-threaded' ; nous ne prendrons pas en charge l'exécution parallèle dans un seul contrat ou déploiement. Cette optimisation est uniquement destinée aux performances de l'implémentation du nœud, et non aux développeurs de contrats.
tr: Bu basit model sıralı yürütmeyi yakalarken, paralel yürütmeyi modellemez. Paralel yürütme önemlidir, çünkü yürütme motorunun aynı anda birden fazla dağıtımı çalıştırmasını sağlayarak blok işleme sürelerini iyileştirebilir. Not: her dağıtımın kendisi hala tek iş parçacıklıdır; tek bir kontrat veya dağıtım içinde paralel yürütmeyi desteklemeyeceğiz. Bu optimizasyon, kontrat geliştiricileri için değil, yalnızca düğüm uygulamasının performansı içindir.
vi: Mặc dù mô hình đơn giản này nắm bắt được thực thi tuần tự, nhưng nó không mô hình hóa thực thi song song. Thực thi song song rất quan trọng vì nó có thể cho phép công cụ thực thi chạy nhiều triển khai cùng một lúc, có thể cải thiện thời gian xử lý khối. Lưu ý: bản thân mỗi triển khai vẫn là một luồng; chúng tôi sẽ không hỗ trợ thực hiện song song trong một hợp đồng hoặc triển khai. Việc tối ưu hóa này hoàn toàn là cho hiệu suất của việc triển khai nút, không phải cho nhà phát triển hợp đồng.

source: Computation as functions from :math:`G` to :math:`End(G)`
fr: Calcul en tant que fonctions de :math:`G` à :math:`End(G)`
tr: :math:`G` ile :math:`End(G)` arasındaki fonksiyonlar olarak hesaplama
vi: Tính toán dưới dạng các hàm từ :math:`G` đến :math:`End(G)`

source: The problem with functions on the global state itself is they mutate the state, potentially causing problems if we wanted to apply two such functions at the same time. Therefore, we will instead think of computations as outputting a description of the changes to the global state that they would make if given the chance. Or phrased another way, the execution of a deploy will return a function that could be applied to the global state to obtain the post-state we would have obtained from running the computation while mutating the global state. The reason this helps is because we can apply multiple such functions to the same global state at the same time; they are pure functions that do not modify the global state. Thus we can execute multiple deploys in parallel and later combine their outputs (more on this later).
fr: Le problème des fonctions sur l'état global lui-même est qu'elles modifient cet état, ce qui pourrait causer des problèmes si nous voulions appliquer deux fonctions de ce type en même temps. Par conséquent, nous considérerons plutôt que les calculs produisent une description des changements qu'ils apporteraient à l'état global s'ils en avaient la possibilité. En d'autres termes, l'exécution d'un déploiement renverra une fonction qui pourrait être appliquée à l'état global pour obtenir le post-état que nous aurions obtenu en exécutant le calcul tout en mutant l'état global. La raison pour laquelle cela est utile est que nous pouvons appliquer plusieurs de ces fonctions au même état global en même temps ; ce sont des fonctions pures qui ne modifient pas l'état global. Ainsi, nous pouvons exécuter plusieurs déploiements en parallèle et combiner ultérieurement leurs résultats (nous y reviendrons plus tard).
tr: Küresel durumun kendisindeki fonksiyonlarla ilgili sorun, durumu mutasyona uğratmaları ve bu tür iki fonksiyonu aynı anda uygulamak istersek potansiyel olarak sorunlara neden olmalarıdır. Bu nedenle, bunun yerine hesaplamaları, şans verildiğinde küresel durumda yapacakları değişikliklerin bir tanımını çıktı olarak düşüneceğiz. Veya başka bir şekilde ifade edilirse, bir dağıtımın yürütülmesi, küresel durumu değiştirirken hesaplamayı çalıştırarak elde edeceğimiz son durumu elde etmek için küresel duruma uygulanabilecek bir fonksiyon döndürür. Bunun yardımcı olmasının nedeni, aynı küresel duruma aynı anda birden çok fonksiyonu uygulayabilmemizdir; ki bunlar küresel durumu değiştirmeyen saf fonksiyonlardır. Böylece birden fazla dağıtımı paralel olarak yürütebilir ve daha sonra çıktılarını birleştirebiliriz (bununla ilgili daha fazla bilgi daha sonra verilecektir).
vi: Vấn đề với các hàm trên trạng thái toàn cục là chúng thay đổi trạng thái, có khả năng gây ra vấn đề nếu chúng ta muốn áp dụng hai hàm như vậy cùng một lúc. Do đó, chúng ta coi các tính toán như là việc xuất ra một mô tả về những thay đổi đối với trạng thái toàn cục mà chúng sẽ thực hiện nếu có cơ hội. Hoặc theo cách khác, việc thực thi triển khai sẽ trả về một hàm có thể được áp dụng cho trạng thái toàn cục để có được trạng thái hậu toàn cục mà chúng ta sẽ có được từ việc chạy tính toán trong khi thay đổi trạng thái toàn cục. Lý do điều này hữu ích là vì chúng ta có thể áp dụng nhiều hàm như vậy cho cùng một trạng thái toàn cục cùng một lúc; chúng là những hàm thuần túy không sửa đổi trạng thái toàn cục. Do đó, chúng ta có thể thực hiện nhiều triển khai song song và sau đó kết hợp các đầu ra của chúng (sẽ nói thêm về điều này sau).

source: The way this is modeled in the Casper execution engine is via the |TrackingCopy|_. Executing deploys (and the contracts they call) read/write from the |TrackingCopy|_ instead of the global state directly. The |TrackingCopy|_ *tracks* the operations and returns the |Transforms|_ which act on each key in the global state effected by the execution. Using the nomenclature from the theory, this collection of keys and transforms describes a function :math:`f: G \rightarrow G` which is an endomorphism on :math:`G`, i.e. an element of :math:`End(G)`.
fr: Dans le système d'exécution de Casper, cela est modélisé par |TrackingCopy|_. L'exécution des déploiements (et des contrats qu'ils appellent) se fait avec des lecture/écriture de |TrackingCopy|_ au lieu de l'état global directement. La |TrackingCopy|_ *surveille* les opérations et renvoie des |Transforms|_ qui agissent sur chaque clé dans l'état global effectué par l'exécution. En utilisant la nomenclature de la théorie, cette collection de clés et de transformées décrit une fonction :math:`f: G \rightarrow G` qui est un endomorphisme sur :math:`G`, c'est-à-dire un élément de :math:`End(G)`.
tr: Bunun Casper yürütme motorunda modellenme şekli |TrackingCopy|_ aracılığıyladır. Dağıtımları (ve çağırdıkları sözleşmeleri) doğrudan küresel durum yerine |TrackingCopy|_'den okumak/yazmak. |TrackingCopy|_ *işlemleri izler* ve yürütmenin etkilediği küresel durumda her bir anahtar üzerinde etkili olan |Transforms|_ ları döndürür. Teorideki terminolojiyi kullanarak, bu anahtarlar ve dönüşümler toplamı, :math:`G` üzerinde bir endomorfizm olan :math:`f: G \rightarrow G` fonksiyonunu tanımlar, yani :math:`End(G)` 'nin bir ögesi.
vi: Các điều này được mô hình hóa trong công cụ thực thi Casper thông qua |TrackingCopy|_. Thực thi triển khai (và các hợp đồng mà chúng gọi) đọc/ghi từ |TrackingCopy|_ thay vì trạng thái toàn cục một cách trực tiếp. |TrackingCopy|_ *theo dõi* các hoạt động và trả về |Transforms|_ hoạt động trên mỗi khóa trong trạng thái toàn cục bị ảnh hưởng bởi việc thực thi đó. Tập hợp các khóa và các biến đổi này mô tả hàm: math: :math:`f: G \rightarrow G` là một endomorphism trên: math:`G`, tức là một phần tử của: math:`End (G)`.
