Repository: casper-network/docs-archive
Catalog: locale/*/LC_MESSAGES/implementation/block-structure.po
Languages: fr, tr, vi

source: Block Structure
fr: Structure du bloc
tr: Blok Yapısı
vi: Cấu trúc khối

source: Introduction
tr: Giriş
vi: Giới thiệu

source: A *block* is the primary data structure by which network nodes communicate information about the state of the Casper Network. We briefly describe here the format of this data structure.
fr: Un *bloc* est la principale structure de données par laquelle les nœuds du réseau communiquent des informations sur l'état du réseau Casper. Nous décrivons brièvement ici le format de cette structure de données.
tr: Bir *blok*, ağ düğümlerinin Casper Network'ün durumu hakkında bilgi ilettiği birincil veri yapısıdır. Burada bu veri yapısının biçimini kısaca açıklıyoruz.
vi: *Khối* là cấu trúc dữ liệu chính mà các nút mạng giao tiếp thông tin về trạng thái của Mạng Casper. Chúng tôi mô tả ngắn gọn ở đây định dạng của cấu trúc dữ liệu này.

source: Data fields
fr: Champs de données
tr: Veri alanları
vi: Trường dữ liệu

source: A block consists of the following:
fr: Un bloc se compose des éléments suivants :
tr: Bir blok aşağıdakileri içerir:
vi: Một khối bao gồm những phần sau:

source: a ``block_hash``
fr: un ``block_hash``
tr: ``block_hash``
vi: một ``block_hash``

source: a header
fr: un header (en-tête)
tr: başlık
vi: phần đầu

source: a body
fr: un corps (body)
tr: gövde
vi: phần thân

source: Each of these fields is detailed in the subsequent sections.
fr: Chacun de ces champs est détaillé dans les sections suivantes.
tr: Bu alanların her biri sonraki bölümlerde ayrıntılandırılmıştır.
vi: Mỗi trường này được trình bày chi tiết trong các phần tiếp theo.

source: The ``block_hash`` is the ``blake2b256`` hash of the header.
fr: Le ``block_hash`` est le hash ``blake2b256`` de l'en-tête.
tr: ``block_hash``, başlığın ``blake2b256`` özetidir.
vi: ``block_hash`` là hàm băm ``blake2b256`` của tiêu đề.

source: Header
fr: Header (en-tête)
tr: Başlık
vi: Phần đầu

source: The block header contains the following fields:
fr: L'en-tête de bloc contient les champs suivants :
tr: Blok başlığı aşağıdaki alanları içerir:
vi: Tiêu đề khối chứa các trường sau:

source: a list of ``block_hash``\ es giving the parents of the block
fr: une liste de ``block_hash`` donnant les parents du bloc
tr: bloğun üst öğelerini veren bir ``block_hash`` listesi
vi: danh sách ``block_hash`` cung cấp lớp trên của khối

source: justifications
tr: gerekçeler
vi: biện minh

source: a list of ``block_hash``\ es giving the justifications of the block (see consensus description in part A for more details)
fr: une liste de ``block_hash`` donnant les justifications du bloc (voir la description du consensus dans la partie A pour plus de détails)
tr: bloğun gerekçelerini veren bir ``block_hash`` listesi (daha fazla ayrıntı için A bölümündeki mutabakat açıklamasına bakınız)
vi: danh sách ``block_hash`` đưa ra các biện minh cho khối (xem mô tả đồng thuận trong phần A để biết thêm chi tiết)

source: a summary of the global state, including
fr: un résumé de l'état global, y compris
tr: küresel durumun bir özeti, şunlar da dahil olmak üzere:
vi: một bản tóm tắt về trạng thái toàn cục, bao gồm

source: the :ref:`root hash of the global state trie <global-state-trie>` before executing the deploys in this block (``pre_state_hash``)
fr: le :ref:`hash de la racine de l'arbre de d'état global <global-state-trie>` avant l'éxécution des déploiements dans ce bloc (``pre_state_hash``)
tr: bu bloktaki dağıtımları yürütmeden önceki küresel durum önek ağacı <global-state-trie>` :ref:`root özeti (``pre_state_hash``)
vi: :ref: `root hash của trạng thái toàn cục trie <global-state-trie>` 1` trước khi thực hiện triển khai trong khối này (``pre_state_hash``)

source: the root hash of the global state trie after executing the deploys in this block (``post_state_hash``)
fr: le hash racine du tableau d'état global après l'exécution des déploiements dans ce bloc (``post_state_hash``)
tr: küresel durum denemesinin bu bloktaki dağıtımları yürüttükten sonraki kök özeti (``post_state_hash``)
vi: root hash trạng thái toàn cục trie sau khi thực hiện triển khai trong khối này (``post_state_hash``)

source: the list of currently bonded validators, and their stakes
fr: la liste des validateurs actuellement 'cautionnés', et leurs enjeux
tr: şu anda bağlı olan doğrulayıcıların listesi ve hisseleri
vi: danh sách các nhà xác thực đã cổ phần hiện tại và phần đặt cọc của họ

source: the ``blake2b256`` hash of the body of the block
fr: le hash ``blake2b256`` du corps du bloc
tr: bloğun gövdesinin ``blake2b256`` özeti
vi: băm ``blake2b256`` của phần thân của khối

source: the time the block was created
fr: la date de création du bloc
tr: bloğun oluşturulduğu zaman
vi: thời gian khối được tạo ra

source: the protocol version the block was executed with
fr: la version du protocole avec laquelle le bloc a été exécuté
tr: bloğun birlikte yürütüldüğü protokol sürümü
vi: phiên bản giao thức mà khối đã được thực thi cùng

source: the number of deploys in the block
fr: le nombre de déploiements dans le bloc
tr: bloktaki dağıtımların sayısı
vi: số lượng triển khai trong khối

source: the human-readable name corresponding to this instance of the Casper Network (``chain_id``)
fr: le nom correspondant à cette instance du réseau Casper (``chain_id``)
tr: Casper Network'ün bu örneğine karşılık gelen, okunaklı ad (``chain_id``)
vi: tên gọi thân thiện với con người và tương ứng với phiên bản này của Mạng Casper (``chain_id``)

source: an indicator for whether this message is intended as a valid block or merely a *ballot* (see consensus description in part A for more details)
fr: un indicateur pour savoir si ce message est destiné à être un bloc valide ou simplement un * scrutin* (voir la description du consensus dans la partie A pour plus de détails)
tr: bu mesajın geçerli bir blok olarak mı yoksa yalnızca bir *oy pusulası* olarak mı tasarlandığını gösteren bir gösterge (daha fazla ayrıntı için A bölümündeki mutabakat açıklamasına bakınız)
vi: một chỉ báo cho biết thông báo này được dự định là một khối hợp lệ hay chỉ đơn thuần là một *phiếu bầu* (xem mô tả đồng thuận trong phần A để biết thêm chi tiết)

source: Body
fr: Corps
tr: Gövde
vi: Phần thân

source: The block body contains an **ordered** list of ``DeployHashes`` which refer to deploys, and an **ordered** list of ``DeployHashes`` for native transfers (which are specialized deploys that only transfer token between accounts). All deploys, including a specialization such as native transfer, can be broadly categorized as some unit of work that, when executed and committed, affect change to global state :ref:`Global State<global-state-intro>`. It should be noted that a valid block may contain no deploys and / or native transfers.
fr: Le corps du bloc contient une liste **ordonnée** de ``DeployHashes`` qui font référence aux déploiements, et une liste **ordonnée** de ``DeployHashes`` pour les transferts natifs (qui sont des déploiements spécialisés qui transfèrent uniquement le jeton entre les comptes). Tous les déploiements, y compris une spécialisation telle que le transfert natif, peuvent être classés de manière générale comme des unités de travail qui, lorsqu'elles sont exécutées et validées, modifient l'état global :ref:`Etat global <global-state-intro>`. Il convient de noter qu'un bloc valide peut ne contenir aucun déploiement et/ou transfert natif.
tr: Blok gövdesi, dağıtımlara atıfta bulunan **sıralı** bir ``DeployHashes`` listesi ve yerel aktarımlar için ``DeployHashes`` ın **sıralı** bir listesini içerir (yalnızca hesaplar arasında token aktaran özelleştirilmiş dağıtımlardır). Yerel aktarım gibi bir özelleşme de dahil olmak üzere tüm dağıtımlar, genel olarak, yürütüldüğünde ve taahhüt edildiğinde küresel duruma değişikliği etkileyen bazı iş birimleri olarak kategorize edilebilir :ref:`Global State<global-state-intro>`. Geçerli bir bloğun dağıtım ve/veya yerel aktarım içermeyebileceğine dikkat edilmelidir.
vi: Phần thân khối chứa **danh sách được sắp xếp** của ``DeployHashes`` đề cập đến việc triển khai và một **danh sách được sắp xếp** của ``DeployHashes`` dành cho chuyển giao gốc (là các triển khai chuyên biệt chỉ chuyển token giữa các tài khoản ). Tất cả các triển khai, kể cả có tính đặc thù như chuyển giao gốc, có thể được phân loại rộng rãi là một số đơn vị công việc, khi được thực thi và cam kết, sẽ ảnh hưởng đến sự thay đổi đối với trạng thái toàn cục: :ref:`Global State<global-state-intro>`. Cần lưu ý rằng một khối hợp lệ có thể không có triển khai và / hoặc chuyển giao gốc.

source: The block body also contains the public key of the validator that proposed the block.
fr: Le corps du bloc contient également la clé publique du validateur qui a proposé le bloc.
tr: Blok gövdesi, bloğu öneren doğrulayıcının açık anahtarını da içerir.
vi: Phần thân khối cũng chứa khóa công khai của nhà xác thực đã đề xuất khối.

source: Refer to the :ref:`Deploy Serialization Standard <serialization-standard-deploy>` for additional information on deploys and how they are serialized. Refer to :ref:`Block Serialization Standard <serialization-standard-block>` for how blocks are serialized.
fr: Se référer à :ref:`Deploy Serialization Standard <serialization-standard-deploy>` pour des informations supplémentaires sur les déploiements et la façon dont ils sont sérialisés. Se référer à :ref:`Block Serialization Standard <serialization-standard-block>` pour la façon dont les blocs sont sérialisés.
tr: Dağıtımlar ve bunların nasıl serileştirildiği hakkında ek bilgi için :ref:`Dağıtım Serileştirme Standardı<serialization-standard-deploy>`na bakın.Blokların nasıl serileştirildiğini öğrenmek için :ref:`Blok Serileştirme Standardı<serialization-standard-block>`na bakın.
vi: Tham khảo :ref: `Tiêu chuẩn tuần tự triển khai <serialization-standard-deploy>` để biết thêm thông tin về các đợt triển khai và cách chúng được sắp xếp tuần tự. Tham khảo :ref: <serialization-standard-block>` để biết cách các khối được tuần tự hóa.
