Repository: casper-network/docs-archive
Catalog: locale/*/LC_MESSAGES/implementation/execution-semantics.po
Languages: fr, tr, vi

source: A wasm module is not natively able to create any effects outside of reading / writing from its own linear memory. To enable other effects (e.g. reading / writing to the CasperLabs global state), wasm modules must import functions from the host environment they are running in. In the case of contracts on the CasperLabs blockchain, this host is the CasperLabs Runtime. Here, we briefly describe the functionalities provided by imported function. All these features are conveniently accessible via functions in the `CasperLabs rust library <https://crates.io/crates/casperlabs-contract-ffi>`__. For a more detailed description of the functions available for contracts to import, see :ref:`Appendix A <appendix-a>`.
tr: Bir wasm modülü doğal olarak kendi doğrusal belleğinden okuma/yazma dışında herhangi bir efekt oluşturamaz. Diğer efektleri etkinleştirmek için (örn. CasperLabs küresel durumuna okuma/yazma), wasm modüllerinin çalıştıkları ana bilgisayar ortamından işlevleri içe aktarması gerekir. CasperLabs blokzincirdeki kontratlar için, bu ana bilgisayar, CasperLabs Runtime'dır. Burada, içe aktarılan fonksiyonun sağladığı işlevleri kısaca açıklıyoruz. Tüm bu özelliklere, `CasperLabs rust library <https://crates.io/crates/casperlabs-contract-ffi>`__ içindeki işlevler aracılığıyla kolayca erişilebilir. Kontratların içe aktarılaabileceği işlevlerin daha ayrıntılı açıklaması için bkz. :ref:`Appendix A <appendix-a>`.
