Repository: casper-network/docs-archive
Catalog: locale/*/LC_MESSAGES/implementation/execution-semantics.po
Languages: fr, tr, vi

source: Each of payment and session code are independently specified, so different methods of specifying them may be used (e.g. payment could be specified by a hash key, while session is explicitly provided as a wasm module).
fr: Le code de paiement et le code de session sont spécifiés indépendamment, de sorte que différentes méthodes de spécification peuvent être utilisées (par exemple, le paiement pourrait être spécifié par un hash key, tandis que la session est explicitement fournie comme un module wasm).
tr: Ödeme ve oturum kodunun her biri bağımsız olarak belirtilir, bu nedenle bunları belirtmek için farklı yöntemler kullanılabilir (örneğin, ödeme bir özet anahtarı ile belirtilebilirken, oturum açıkça bir wasm modülü olarak sağlanır).
vi: Mỗi mã thanh toán và mã phiên được chỉ định độc lập, vì vậy có thể sử dụng các phương pháp chỉ định chúng khác nhau (ví dụ: thanh toán có thể được chỉ định bằng khóa băm, trong khi phiên được cung cấp rõ ràng dưới dạng mô-đun wasm).

source: Deploys as functions on the global state
fr: Déploiements en tant que fonctions sur l'état global
tr: Küresel durumda dağıtımların fonksiyonları
vi: Triển khai dưới dạng các hàm trên trạng thái toàn cục

source: To enable concurrent modification of :ref:`global state <global-state-head>` (either by parallel deploys in the same block or parallel blocks on different forks of the chain), we view each deploy as a function taking our global state as input and producing a new global state as output. It is safe to execute two such functions concurrently if they do not interfere with each other, which formally can be defined to mean the functions *commute* (i.e., if they were executed sequentially, it does not matter in what order they are executed, the final result is the same for a given input). Whether two deploys commute is determined based on the effects they have on the global state, i.e. which operation (read, write, add) it does on each key in the key-value store. How this is done is described in :ref:`Appendix C <appendix-c>`.
fr: Pour permettre la modification concurrente de :ref:`l'état global<global-state-head>` (soit par des déploiements parallèles dans le même bloc, soit par des blocs parallèles sur différents forks de la chaîne), nous considérons chaque déploiement comme une fonction prenant notre état global en entrée et produisant un nouvel état global en sortie. Il est sûr d'exécuter deux de ces fonctions simultanément si elles n'interfèrent pas l'une avec l'autre, ce qui peut être défini formellement comme signifiant que les fonctions *commutent* (c'est-à-dire que si elles étaient exécutées séquentiellement, l'ordre dans lequel elles sont exécutées importe peu, le résultat final est le même pour une entrée donnée). La commutation de deux déploiements est déterminée en fonction des effets qu'ils ont sur l'état global, c'est-à-dire l'opération (lecture, écriture, ajout) qu'ils effectuent sur chaque clé du registre clé-valeur. La façon dont cela est fait est décrite dans :ref:`Annexe C <appendix-c>`.
tr: :ref:`global state <global-state-head>`in (aynı blokta paralel konuşlandırmalar veya zincirin farklı çatallarındaki paralel bloklar tarafından) eşzamanlı olarak değiştirilmesini sağlamak için, her dağıtımı küresel durumumuzu girdi olarak alan ve yeni bir küresel durum üreten bir fonksiyon olarak görüyoruz. Birbirleriyle etkileşime girmiyorlarsa, bu tür iki fonksiyonu aynı anda yürütmek güvenlidir; bu, biçimsel olarak *takas* fonksiyonları olarak tanımlanabilir (yani, sırayla yürütülürlerse, hangi sırayla yürütüldükleri önemli değildir, nihai sonuç, belirli bir girdi için aynıdır). İki dağıtımın takas edip etmediği, küresel durum üzerindeki etkilerine, yani anahtar/değer deposundaki her bir anahtar üzerinde hangi işlemi (okuma, yazma, ekleme) yaptığına göre belirlenir. Bunun nasıl yapıldığı :ref:`Appendix C <appendix-c>` de açıklanmıştır.
vi: Để cho phép sửa đổi đồng thời :ref:`trạng thái toàn cục <global-state-head>` (bằng cách triển khai song song trong cùng một khối hoặc các khối song song trên các nhánh khác nhau của chuỗi), chúng ta xem mỗi triển khai như một hàm lấy trạng thái toàn cục làm đầu vào và tạo ra một trạng thái toàn cục như đầu ra. Sẽ an toàn khi thực hiện đồng thời hai hàm như vậy nếu chúng không can thiệp vào nhau, điều này chính thức có thể được định nghĩa là các hàm *hoán đổi* (nghĩa là nếu chúng được thực thi tuần tự, không quan trọng chúng được thực thi theo thứ tự nào, kết quả cuối cùng giống nhau đối với một đầu vào nhất định). Hai lần triển khai hoán đổi được xác định dựa trên tác động của chúng đối với trạng thái toàn cục, tức là thao tác nào (đọc, ghi, thêm) nó thực hiện trên mỗi khóa trong kho khóa-giá trị. Cách thực hiện điều này được mô tả trong :ref:`Phụ lục C <appendix-c>`.

source: The Casper Network runtime
fr: Le runtime du Réseau Casper
vi: Thời điểm chạy Mạng Casper

source: A wasm module is not natively able to create any effects outside of reading / writing from its own linear memory. To enable other effects (e.g. reading / writing to the Casper global state), wasm modules must import functions from the host environment they are running in. In the case of contracts on the Casper blockchain, this host is the Casper runtime.
fr: Un module wasm n'est pas nativement capable de créer des effets autres que la lecture/écriture dans sa propre mémoire linéaire. Pour permettre d'autres effets (par exemple, lire/écrire dans l'état global de Casper), les modules wasm doivent importer des fonctions de l'environnement hôte dans lequel ils sont exécutés. Dans le cas des contrats sur la blockchain Casper, cet hôte est le runtime Casper.
vi: Mô-đun wasm không có khả năng tạo ra bất kỳ hiệu ứng nào ngoài việc đọc/ghi từ bộ nhớ tuyến tính của chính nó. Để kích hoạt các hiệu ứng khác (ví dụ: đọc/ghi vào trạng thái toàn cục của Casper), mô-đun wasm phải nhập các hàm từ môi trường chủ mà chúng đang chạy. Trong trường hợp hợp đồng trên chuỗi khối Casper, môi trường chủ này là thời điểm chạy Casper.

source: Here, we briefly describe the functionalities provided by imported functions. All these features are conveniently accessible via functions in the `Casper Rust library <https://crates.io/crates/casper-contract>`_. For a more detailed description of the functions available for contracts to import, see :ref:`Appendix A <appendix-a>`.
fr: Nous décrivons ici brièvement les fonctionnalités fournies par les fonctions importées. Toutes ces fonctionnalités sont facilement accessibles via les fonctions de la `Librairie Casper Rust <https://crates.io/crates/casper-contract>`_. Pour une description plus détaillée des fonctions disponibles pour les contrats et pouvant être importées, voir :ref:`Appendix A <appendix-a>`.
vi: Ở đây, chúng tôi mô tả ngắn gọn các chức năng được cung cấp bởi các hàm đã kết nhập. Tất cả các tính năng này đều có thể truy cập thuận tiện thông qua các hàm trong `thư viện Casper Rust <https://crates.io/crates/casper-contract>`_. Để có mô tả chi tiết hơn về các hàm kết nhập có sẵn cho các hợp đồng, hãy xem :ref:`Phụ lục A<appendix-a>`.

source: Reading / writing from global state
fr: Lecture / écriture de l'état global
tr: Küresel durumdan okuma / yazma
vi: Đọc / ghi từ trạng thái toàn cục

source: ``read``, ``write``, ``add`` functions allow working with exiting :ref:`URefs <uref-head>`
fr: Les fonctions ``read``, ``write``, ``add`` permettent de travailler avec des :ref:`URefs <uref-head>`
tr: ``read``, ``write``, ``add`` fonksiyonları mevcut :ref:`URefs <uref-head>` ile çalışmaya izin verir.
vi: hàm ``read``, ``write``, ``add`` cho phép làm việc với :ref:`URefs <uref-head>`

source: ``new_uref`` allows creating a new ``URef`` initialized with a given value (see section below about how ``URef``\ s are generated)
fr: ``new_uref`` permet de créer un nouveau ``URef`` initialisé avec une valeur donnée (voir la section ci-dessous sur la façon dont les ``URef`` sont générés).
tr: ``new_uref``, belirli bir değerle başlatılan yeni bir ``URef`` oluşturmaya izin verir (``URef``\ lerin nasıl oluşturulduğuyla ilgili aşağıdaki bölüme bakın)
vi: ``new_uref`` cho phép tạo một ``URef`` mới được khởi tạo với một giá trị nhất định (xem phần bên dưới về cách tạo ``URef``)

source: ``store_function`` allows writing a contract under a :ref:`hash key <global-state-hash-key>`
fr: ``store_function`` permet de d'écrire un contrat dans le cadre d'un :ref:`hash key <global-state-hash-key>`
tr: ``store_function``, bir :ref:`hash key <global-state-hash-key>` altında bir kontrat yazmaya izin verir.
vi: ``store_function`` cho phép viết một hợp đồng theo :ref:`khoá băm<global-state-hash-key>`

source: ``get_uref``, ``list_known_urefs``, ``add_uref``, ``remove_uref`` allow working with the :ref:`named keys <global-state-contracts>` of the current context (account or contract)
fr: ``get_uref``, ``list_known_urefs``, ``add_uref``, ``remove_uref`` permettent de travailler avec le :ref:`named keys <global-state-contracts>` du contexte actuel (compte ou contrat)
tr: ``get_uref``, ``list_known_urefs``, ``add_uref``, ``remove_uref`` geçerli bağlamın (hesap veya kontrat) :ref:`named keys <global-state-contracts>` i ile çalışmaya izin verir
vi: ``get_uref``, ``list_known_urefs``, ``add_uref``, ``remove_uref`` cho phép làm việc với :ref:`khoá được đặt tên <global-state-contracts>` của ngữ cảnh hiện tại (tài khoản hoặc hợp đồng)

source: Account functionality
fr: Fonctionnalité du compte
tr: Hesap işlevi
vi: Chức năng tài khoản

source: ``add_associated_key``, ``remove_associated_key``, ``update_associated_key``, ``set_action_threshold`` support the various :ref:`key management actions <accounts-key-management>`
fr: ``add_associated_key``, ``remove_associated_key``, ``update_associated_key``, ``set_action_threshold`` supportent les différentes :ref:`actions de la gestion des clés <accounts-key-management>`
tr: ``add_associated_key``, ``remove_associated_key``, ``update_associated_key``, ``set_action_threshold`` çeşitli :ref:`key management actions <accounts-key-management>` yönetim eylemlerini destekler.
vi: ``add_associated_key``, ``remove_associated_key``, ``update_associated_key``, ``set_action_threshold`` hỗ trợ :ref:`hoạt động quản lý khoá <accounts-key-management>` khác nhau

source: ``main_purse`` returns the :ref:`main purse <tokens-purses-and-accounts>` of the account
fr: ``main_purse`` renvoie le :ref:`porte-monnaie principal <tokens-purses-and-accounts>` du compte
tr: ``main_purse`` hesabın :ref:`main purse <tokens-purses-and-accounts>` döndürür
vi: ``main_purse`` trả về :ref:`ví chính <tokens-purses-and-accounts>` của tài khoản

source: Runtime flow and properties
fr: Flux et propriétés d'exécution
tr: Çalışma zamanı akışı ve özellikleri
vi: Thời điểm chạy luồng và thuộc tính

source: ``call_contract`` allows executing a contract stored under a key (hash or ``URef``), including passing arguments and getting a return value
fr: ``call_contract`` permet d'exécuter un contrat stocké sous une clé (hash ou ``URef``), notamment en passant des arguments et en obtenant une valeur de retour.
tr: ``call_contract``, bir anahtar (özet veya ```URef``) altında saklanan bir kontratın yürütülmesine izin verir, ki burada argümanları iletmek ve bir dönüş değeri almak dahildir
vi: ``call_contract`` cho phép thực hiện một hợp đồng được lưu trữ dưới một khóa (băm hoặc ``URef``), bao gồm việc truyền các đối số và nhận giá trị trả về

source: ``ret`` is used by contracts to return a value to their caller (i.e. enables return values from ``call_contract``)
fr: ``ret`` est utilisé par les contrats pour retourner une valeur à leur appelant (i.e. permet de retourner des valeurs de ``call_contract``)
tr: ``ret``, kontratlar tarafından çağırana bir değer döndürmek için kullanılır (yani ``call_contract`` ögesinden dönüş değerlerini etkinleştirir)
vi: ``ret`` được sử dụng bởi các hợp đồng để trả về một giá trị cho hàm gọi (tức là cho phép trả về các giá trị từ ``call_contract``)

source: ``get_named_arg`` allows getting arguments passed to the contract (either to session code as part of the deploy, or arguments to ``call_contract``)
fr: ``get_named_arg`` permet de récupérer les arguments passés au contrat (soit au code de session dans le cadre du déploiement, soit aux arguments de ``call_contract``)
tr: ``get_named_arg`` kontrata geçirilen argümanların alınmasına izin verir (dağıtımın bir parçası olarak oturum koduna veya ``call_contract`` argümanlarına)
vi: ``get_named_arg`` cho phép nhận các đối số được truyền cho hợp đồng (hoặc cho mã phiên như một phần của triển khai hoặc các đối số cho ``call_contract``)

source: ``revert`` exits the entire executing deploy, reverting any effects it caused, and returns a status code that is captured in the block
fr: ``revert`` termine l'ensemble du déploiement en cours d'exécution, en annulant tous les effets qu'il a causés, et renvoie un code d'état qui est saisi dans le bloc
tr: ``revert`` tüm yürütme dağıtımından çıkar, neden olduğu etkileri geri alır ve blokta yakalanan bir durum kodu döndürür
vi: ``revert`` thoát toàn bộ triển khai đang thực thi, hoàn nguyên bất kỳ tác động nào mà nó gây ra và trả về mã trạng thái được ghi lại trong khối

source: ``get_caller`` returns the public key of the account for the current deploy (can be used for control flow based on specific users of the blockchain)
fr: ``get_caller`` renvoie la clé publique du compte pour le déploiement actuel (peut être utilisé pour le flux de contrôle basé sur des utilisateurs spécifiques de la blockchain).
tr: ``get_caller`` geçerli dağıtım için hesabın genel anahtarını döndürür (blokzincirin belirli kullanıcılarına dayalı kontrol akışı için kullanılabilir)
vi: ``get_caller`` trả về khóa công khai của tài khoản cho triển khai hiện tại (có thể được sử dụng cho luồng kiểm soát dựa trên những người dùng cụ thể của chuỗi khối)

source: ``get_phase`` returns the current :ref:`phase <execution-semantics-phases>` of the deploy execution
fr: ``get_phase`` renvoie la :ref:`phase <execution-semantics-phases>` courante de l'exécution du déploiement
tr: ``get_phase``, konuşlandırma yürütmesinin geçerli :ref:`phase <execution-semantics-phases>` değerini döndürür
vi: ``get_phase`` trả về :ref:`giai đoạn <execution-semantics-phases>` hiện tại của quá trình triển khai

source: ``get_blocktime`` gets the timestamp of the block this deploy will be included in
fr: ``get_blocktime`` obtient le timestamp du bloc dans lequel ce déploiement sera inclus.
tr: ``get_blocktime``, bu dağıtımın dahil edileceği bloğun zaman damgasını alır
vi: ``get_blocktime`` lấy dấu thời gian của khối mà triển khai này sẽ được đưa vào

source: :ref:`Mint <tokens-mints-and-purses>` functionality
fr: La fonctionnalité :ref:`Mint <tokens-mints-and-purses>`
tr: :ref:`Mint <tokens-mints-and-purses>` işlevi
vi: Chức năng :ref:`Mint <tokens-mints-and-purses>`

source: ``create_purse`` creates a new empty purse, returning the ``URef`` to the purse
fr: ``create_purse`` crée un nouveau porte-monnaie vide, en retournant le ``URef`` au porte-monnaie.
tr: ``create_purse`` yeni bir boş cüzdan oluşturur ve ``URef``i cüzdana döndürür
vi: ``create_purse`` tạo một ví trống mới, trả về ``URef`` cho ví

source: ``get_balance`` reads the balance of a purse
fr: ``get_balance`` lit le solde d'un porte-monnaie
tr: ``get_balance`` bir çantanın bakiyesini okur
vi: ``get_balance`` đọc số dư của ví

source: ``transfer_to_account`` transfers from the present account’s main purse to the main purse of a specified account (creating the account if it does not exist)
fr: ``transfer_to_account`` transfère du porte-monnaie principal du compte actuel vers le porte-monnaie principal d'un compte spécifié (en créant le compte s'il n'existe pas).
tr: ``transfer_to_account``, mevcut hesabın ana cüzdanından belirli bir hesabın ana cüzdanına transferi sağlar (hesap yoksa hesabın oluşturulmasını sağlar)
vi: ``transfer_to_account`` chuyển từ ví chính của tài khoản hiện tại sang ví chính của một tài khoản được chỉ định (tạo tài khoản nếu nó không tồn tại)

source: ``transfer_from_purse_to_account`` transfer from a specified purse to the main purse of a specified account (creating the account if it does not exist)
fr: ``transfer_from_purse_to_account`` transfert d'un porte-monnaie spécifié vers le porte-monnaie principal d'un compte spécifié (en créant le compte s'il n'existe pas).
tr: ``transfer_from_purse_to_account`` belirtilen bir cüzdandan belirtilen bir hesabın ana cüzdanına transferi sağlar (eğer yoksa hesabın oluşturulmasını sağlar)
vi: ``transfer_from_purse_to_account`` chuyển từ một ví cụ thể sang ví chính của một tài khoản được chỉ định (tạo tài khoản nếu nó không tồn tại)

source: ``transfer_from_purse_to_purse`` alias for the :ref:`mint’s transfer function <tokens-mint-interface>`
fr: ``transfer_from_purse_to_purse`` alias de la :ref:`fonction de transfert de minage <tokens-mint-interface>` (mint)
tr: ``transfer_from_purse_to_purse``, diğer bir deyişle, :ref:`mint’s transfer function <tokens-mint-interface>`
vi: ``transfer_from_purse_to_purse`` alias cho :ref:`hàm trao đổi mint <tokens-mint-interface>`

source: Generating ``URef``\ s
fr: Générer des ``URef``
tr: ``URef``\ lerin oluşturulması
vi: Tạo ``URef``

source: ``URef``\ s are generated using a `cryptographically secure random number generator <https://rust-random.github.io/rand/rand_chacha/struct.ChaCha20Rng.html>`__ using the `ChaCha algorithm <https://cr.yp.to/chacha.html>`__. The random number generator is seeded by taking the ``blake2b256`` hash of the deploy hash concatenated with an index representing the current phase of execution (to prevent collisions between ``URef``\ s generated in different phases of the same deploy).
fr: Les ``URef`` sont générés à l'aide d'un `générateur de nombres aléatoires cryptographiquement sécurisé <https://rust-random.github.io/rand/rand_chacha/struct.ChaCha20Rng.html>`__ utilisant l'algorithme `ChaCha <https://cr.yp.to/chacha.html>`__. Le générateur de nombres aléatoires est ensemencé (seeded) en prenant le hash ``blake2b256`` du déploiement concaténé avec un index représentant la phase actuelle d'exécution (pour éviter les collisions entre les ``URef`` générés dans différentes phases du même déploiement).
tr: "URef"\'ler, `cryptographically secure random number generator <https://rust-random.github.io/rand/rand_chacha/struct.ChaCha20Rng.html>`__ , `ChaCha algorithm <https://cr.yp.to/chacha.html>`__ kullanılarak oluşturulur. Rastgele sayı üreteci, (aynı dağıtımın farklı aşamalarında oluşturulan ``Uref``\ lerin çakışmalarını önlemek için) yürütmenin şu anki aşamasını gösteren indeks ile birleştirilmiş dağıtım özetinin ``blake2b256`` özeti alınarak seed edilir.
vi: ``URef`` được tạo bằng cách sử dụng `trình tạo số ngẫu nhiên an toàn bằng mật mã <https://rust-random.github.io/rand/rand_chacha/struct.ChaCha20Rng.html>`__ bằng cách sử dụng `thuật toán ChaCha <https://cr.yp.to/chacha.html>`__. Trình tạo số ngẫu nhiên được tạo từ khoá hạt giống (seed) bằng cách lấy băm ``blake2b256`` của băm triển khai kết hợp với một chỉ mục đại diện cho giai đoạn thực thi hiện tại (để ngăn chặn xung đột giữa các ``URef`` được tạo trong các giai đoạn khác nhau của cùng một triển khai) .

source: The CasperLabs system is a decentralized computation platform. In this chapter we describe aspects of the computational model we use.
tr: CasperLabs sistemi, merkezi olmayan bir hesaplama platformudur. Bu bölümde, kullandığımız hesaplama modelinin özelliklerini açıklıyoruz.

source: Computation is all done in a `WebAssembly (wasm) <https://webassembly.org/>`__ interpreter, allowing any programming language which compiles to wasm to become a smart contract language for the CasperLabs blockchain. Similar to Ethereum, we use ``Gas`` to measure computational work in a way which is consistent from node to node in the CasperLabs network. Each wasm instruction is `assigned <https://github.com/CasperLabs/casper-node/blob/cb1d20ad1ea6e245cd8237f9406885a1e785c669/execution_engine/src/shared/wasm_config.rs#L15>`_ a ``Gas`` value, and the amount of gas spent is tracked by the runtime with each instruction executed by the interpreter. All executions are finite because each has a finite *gas limit* that specifies the maximum amount of gas that can be spent before the computation is terminated by the runtime. How this limit is determined is discussed in more detail below.
tr: Hesaplamanın tamamı bir `WebAssembly (wasm) <https://webassembly.org/>`__ yorumlayıcısında yapılır ve wasm'yi derleyen herhangi bir programlama dilinin CasperLabs blokzincir için akıllı bir kontrat dili haline gelmesine izin verir. Ethereum'a benzer şekilde, CasperLabs ağındaki düğümden düğüme tutarlı bir şekilde hesaplamalı çalışmayı ölçmek için ``Gas`` kullanıyoruz. Her wasm talimatına bir `<https://github.com/CasperLabs/casper-node/blob/cb1d20ad1ea6e245cd8237f9406885a1e785c669/execution_engine/src/shared/wasm_config.rs#L15>` ``Gas`` değeri atanır ve harcanan gazın miktarı, yorumlayıcı tarafından yürütülen her talimatla çalışma zamanı tarafından izlenir. Tüm yürütmeler sınırlıdır, çünkü her birinin, hesaplama çalışma zamanı tarafından sonlandırılmadan önce harcanabilecek maksimum gaz miktarını belirten sonlu bir *gaz sınırı* vardır. Bu sınırın nasıl belirlendiği aşağıda daha ayrıntılı olarak tartışılmaktadır.

source: In particular, the finalization phase refunds the user any unspent ``Gas`` originally purchased (after converting back to motes), and moves the remaining payment into the rewards pool for the validators. The finalization phase does not include any user-defined logic, it is merely upkeep for the system.
tr: Özellikle, sonlandırma aşaması, kullanıcıya orijinal olarak satın alınan (motelere geri dönüştürmeden sonra) harcanmamış herhangi bir ``Gas`` ı iade eder ve kalan ödemeyi doğrulayıcılar için ödül havuzuna taşır. Sonlandırma aşaması, kullanıcı tanımlı herhangi bir mantık içermez, sadece sistem için bakımdır.

source: Payment code ultimately provides its payment by performing a :ref:`token transfer <tokens-mint-interface>` into the `Handle Payment contract’s payment purse <https://github.com/CasperLabs/casper-node/blob/cb1d20ad1ea6e245cd8237f9406885a1e785c669/types/src/system/handle_payment/mod.rs#L65>`__. If payment is not given or not enough is transferred, then payment execution is not considered successful. In this case the effects of the payment code on the global state are reverted and the cost of the computation is covered by motes taken from the offending account’s main purse.
tr: Ödeme kodu nihayetinde ödemesini `Ödeme kontratının ödeme cüzdanına <https://github.com/CasperLabs/casper-node/blob/cb1d20ad1ea6e245cd8237f9406885a1e785c669/types/src/system/handle_payment/mod.rs#L65>` bir :ref:`token transfer <tokens-mint-interface>` gerçekleştirerek sağlar. Ödemenin yapılmaması veya yeterince havale edilmemesi durumunda ödemenin gerçekleştirilmesi başarılı sayılmaz. Bu durumda, ödeme kodunun küresel durum üzerindeki etkileri geri alınır ve hesaplamanın maliyeti, kusurlu hesabın ana cüzdanından alınan motlarla karşılanır.

source: The CasperLabs runtime
tr: CasperLabs çalışma zamanı
