Repository: casper-network/docs-archive
Catalog: locale/*/LC_MESSAGES/implementation/execution-semantics.po
Languages: fr, tr, vi

source: Execution Semantics
fr: Sémantiques d'exécution
tr: Yürütme Semantiği
vi: Ngữ nghĩa thực thi

source: Introduction
tr: Giriş
vi: Giới thiệu

source: The Casper Network is a decentralized computation platform. In this chapter we describe aspects of the computational model we use.
fr: Le réseau Casper est une plateforme de calcul décentralisée. Dans ce chapitre, nous décrivons les aspects du modèle de calcul que nous utilisons.
vi: Mạng Casper là một nền tảng tính toán phi tập trung. Trong chương này, chúng tôi mô tả các khía cạnh của mô hình tính toán mà chúng tôi sử dụng.

source: Measuring computational work
fr: Mesurer le travail de calcul
tr: Hesaplama çalışmasının ölçülmesi
vi: Đo lường công việc tính toán

source: Computation is all done in a `WebAssembly (wasm) <https://webassembly.org/>`__ interpreter, allowing any programming language which compiles to wasm to become a smart contract language for the Casper blockchain. Similar to Ethereum, we use ``Gas`` to measure computational work in a way which is consistent from node to node in the Casper Network. Each wasm instruction is `assigned <https://github.com/casper-network/casper-node/blob/cb1d20ad1ea6e245cd8237f9406885a1e785c669/execution_engine/src/shared/wasm_config.rs#L15>`_ a ``Gas`` value, and the amount of gas spent is tracked by the runtime with each instruction executed by the interpreter. All executions are finite because each has a finite *gas limit* that specifies the maximum amount of gas that can be spent before the computation is terminated by the runtime. How this limit is determined is discussed in more detail below.
fr: Les calculs sont effectués dans un interpréteur `WebAssembly (wasm) <https://webassembly.org/>`__, permettant à tout langage de programmation compilé en wasm de devenir un langage de contrat intelligent pour la blockchain Casper. Comme pour Ethereum, nous utilisons le ``Gas`` pour mesurer le travail de calcul d'une manière cohérente d'un nœud à l'autre du réseau Casper. Chaque instruction wasm se voit `attribuer <https://github.com/casper-network/casper-node/blob/cb1d20ad1ea6e245cd8237f9406885a1e785c669/execution_engine/src/shared/wasm_config.rs#L15>`_ une valeur ``Gas``, et la quantité de gaz dépensée est contrôlée par le runtime avec chaque instruction exécutée par l'interpréteur. Toutes les exécutions sont finies car chacune a une *limite de gaz* (gas limit) finie qui spécifie la quantité maximale de gaz qui peut être dépensée avant que le calcul ne soit terminé par le runtime. La façon dont cette limite est déterminée est discutée plus en détail ci-dessous.
vi: Tất cả tính toán được thực hiện trong một trình thông dịch `WebAssembly (wasm) <https://webassembly.org/>` __, cho phép bất kỳ ngôn ngữ lập trình nào biên dịch thành wasm trở thành ngôn ngữ hợp đồng thông minh cho chuỗi khối Casper. Tương tự như Ethereum, chúng tôi sử dụng ``Gas`` để đo lường công việc tính toán theo cách nhất quán từ nút này sang nút khác trong Mạng Casper. Mỗi lệnh wasm được `chỉ định <https://github.com/casper-network/casper-node/blob/cb1d20ad1ea6e245cd8237f9406885a1e785c669/execution_engine/src/shared/wasm_config.rs#L15>`_ một giá trị ``Gas``, và lượng gas đã tiêu được theo dõi trong thời điểm chạy với mỗi lệnh được thực thi bởi trình thông dịch. Tất cả các lần thực thi đều hữu hạn vì mỗi lần thực thi đều có *giới hạn gas* hữu hạn chỉ định lượng gas tối đa có thể được sử dụng trước khi quá trình tính toán kết thúc bởi thời điểm chạy. Cách xác định giới hạn này sẽ được thảo luận chi tiết hơn bên dưới.

source: Although computation is measured in ``Gas``, we still take payment for computation in :ref:`motes <tokens-divisibility>`. Therefore, there is a conversion rate between ``Gas`` and motes. How this conversion rate is determined is discussed elsewhere.
fr: Bien que le calcul soit mesuré en ``Gas``(gaz) , nous acceptons toujours le paiement du calcul en :ref:`motes <tokens-divisibility>`. Par conséquent, il existe un taux de conversion entre le ``Gas``et les motes. La façon dont ce taux de conversion est déterminé est discutée ailleurs.
tr: Hesaplama ``Gas`` ile ölçülse de, yine de :ref:`motes <tokens-divisibility>` daki hesaplama için ödemeyi alıyoruz. Bu nedenle, ``Gas`` ve mote arasında bir dönüşüm oranı vardır. Bu dönüşüm oranının nasıl belirlendiği başka bir yerde tartışılmaktadır.
vi: Mặc dù tính toán được đo bằng ``Gas``, chúng tôi vẫn tính tiền cho việc tính toán trong :ref:`motes <tokens-divisibility>`. Do đó, có một tỷ lệ chuyển đổi giữa ``Gas`` và motes. Cách xác định tỷ lệ chuyển đổi này sẽ được thảo luận ở phần khác.

source: Please note that Casper will not refund any amount of unused gas.
fr: Veuillez noter que Casper ne remboursera pas le montant du gaz non utilisé.
vi: Xin lưu ý rằng Casper sẽ không hoàn lại bất kỳ lượng gas nào chưa sử dụng.

source: This decision is taken to incentivizing the `Casper Runtime Economics <https://docs.casperlabs.io/en/latest/economics/runtime.html?highlight=consensus-before-execution%20model#runtime-economics>`_ by efficiently allocating the computational resources. The `consensus-before-execution model <https://docs.casperlabs.io/en/latest/economics/runtime.html?highlight=consensus-before-execution%20model#consensus-before-execution-basics-of-payment>`_ implements the mechanism to encourage the optimized gas consumption from the user-side and to prevent the overuse of block space by poorly handled deploys.
fr: Cette décision est prise pour inciter l' `économie du temps d'exécution de Casper <https://docs.casperlabs.io/en/latest/economics/runtime.html?highlight=consensus-before-execution%20model#runtime-economics>`_ en allouant efficacement les ressources de calcul. Le modèle `consensus-before-execution <https://docs.casperlabs.io/en/latest/economics/runtime.html?highlight=consensus-before-execution%20model#consensus-before-execution-basics-of-payment>`_ met en œuvre le mécanisme pour encourager la consommation optimisée de gaz du côté de l'utilisateur et pour empêcher la surutilisation de l'espace de bloc par des déploiements mal gérés.
vi: Quyết định này được thực hiện để khuyến khích `Casper Runtime Economics <https://docs.casperlabs.io/en/latest/economics/runtime.html?highlight=consensus-before-execution%20model#runtime-economics>`_ bằng cách hiệu quả phân bổ tài nguyên tính toán. `Mô hình consensus-before-execution <https://docs.casperlabs.io/en/latest/economics/runtime.html?highlight=consensus-before-execution%20model#consensus-before-execution-basics-of-payment>`_ thực hiện cơ chế khuyến khích việc tiêu thụ gas tối ưu từ phía người dùng và ngăn chặn việc sử dụng quá mức không gian khối do các triển khai được xử lý kém.

source: Deploys
fr: Déploiements
tr: Dağıtımlar
vi: Triển khai

source: A *deploy* represents a request from a user to perform computation on our platform. It has the following information:
fr: Un *déploiement* représente une demande d'un utilisateur pour effectuer un calcul sur notre plateforme. Il contient les informations suivantes :
tr: *Dağıtım*, bir kullanıcıdan platformumuzda hesaplama yapma isteğini temsil eder. Aşağıdaki bilgilere sahiptir:
vi: *Triển khai* đại diện cho một yêu cầu từ người dùng để thực hiện tính toán trên nền tảng của chúng tôi. Nó có các thông tin sau:

source: Body: containing payment code and session code (more details on these below)
fr: Corps (Body): contenant le code de paiement et le code de session (plus de détails sur ceux-ci ci-dessous)
tr: Gövde: ödeme kodunu ve oturum kodunu içerir (bunlarla ilgili daha fazla ayrıntı aşağıdadır)
vi: Phần thân: có chứa mã thanh toán và mã phiên (thêm chi tiết về những điều này bên dưới)

source: Header: containing
fr: En-tête (Header) : contenant
tr: Başlık: şunları içerir;
vi: Phần đầu: gồm có

source: the :ref:`identity key <global-state-account-key>` of the account the deploy will run in
fr: la :ref:`clé d'identité (identity key) <global-state-account-key>` du compte avec lequel le déploiement sera exécuté
tr: dağıtımın çalıştırılacağı hesabın :ref:`identity key <global-state-account-key>`
vi: :ref:`khoá định danh <global-state-account-key>` của tài khoản mà trong đó triển khai sẽ chạy

source: the timestamp when the deploy was created
fr: le timestamp où le déploiement a été créé
tr: dağıtımın oluşturulduğu zaman damgası
vi: dấu thời gian khi tạo mới triển khai

source: a time to live, after which the deploy is expired and cannot be included in a block
fr: un temps de vie, après lequel le déploiement est périmé et ne peut être inclus dans un bloc
tr: yaşam süresi, ki bu süre sonunda dağıtımın ömrü sona erer ve bir blok içerisinde dahil edilemez
vi: thời gian tồn tại, sau đó quá trình triển khai sẽ hết hạn và không thể được đưa vào một khối

source: the ``blake2b256`` hash of the body
fr: le hash ``blake2b256`` du corps du bloc
tr: gövdenin ``blake2b256`` özet (hash) değeri
vi: hàm băm ``blake2b256`` của phần thân

source: Deploy hash: the ``blake2b256`` hash of the Header
fr: Deploy hash: le hash ``blake2b256`` de l'en-tête
tr: Dağıtım özeti: Başlığın ``blake2b256`` özet (hash) değeri
vi: Triển khai hàm băm: hàm băm ``blake2b256`` của Phần đầu

source: Approvals: the set of signatures which have signed the deploy hash, these are used in the :ref:`account permissions model <accounts-associated-keys-weights>`
fr: Approbations : l'ensemble des signatures qui ont signé le hash du déploiement (deploy hash), ces signatures sont utilisées dans le processus d'approbation. :ref:`modèle de permissions de compte <accounts-associated-keys-weights>`
tr: Onaylar: dağıtım özetini imzalayan imzalar kümesi, bunlar :ref:`account permissions model <accounts-associated-keys-weights>` de kullanılır.
vi: Phê duyệt: tập hợp các chữ ký đã ký vào hàm băm triển khai, chúng được sử dụng trong :ref:`mô hình phân quyền tài khoản <accounts-associated-keys-weights>`

source: Each deploy is an atomic piece of computation in the sense that, whatever effects a deploy would have on the global state must be entirely included in a block or the entire deploy must not be included in a block.
fr: Chaque déploiement est un morceau atomique de calcul dans le sens où, quels que soient les effets qu'un déploiement aurait sur l'état global, ils doivent être entièrement inclus dans un bloc ou le déploiement entier ne doit pas être inclus dans un bloc.
tr: Her dağıtım, bir dağıtımın küresel durum üzerindeki etkileri ne olursa olsun, tamamen bir bloğa dahil edilmesi veya tüm dağıtımın bir bloğa dahil edilmemesi gerektiği anlamında atomik bir hesaplama parçasıdır.
vi: Mỗi triển khai là một phần tử của tính toán theo nghĩa là, bất kỳ tác động nào của một triển khai đối với trạng thái toàn cục phải bao gồm hoàn toàn trong một khối hoặc toàn bộ triển khai không được bao gồm trong một khối.

source: Phases of deploy execution
fr: Phases d'exécution d'un déploiement
tr: Dağıtım yürütme aşamaları
vi: Các giai đoạn triển khai thực hiện

source: A deploy is executed in distinct *phases* in order to accommodate paying for computation in a flexible way. The phases of a deploy are payment, session, and finalization. During the payment phase, the payment code is executed. If it is successful, then the sessions code is executed during the session phase. And, finally (independent of whether session code was executed), the finalization phase is executed, which does some bookkeeping around payment.
fr: Un déploiement est exécuté en plusieurs *phases* afin de permettre le paiement des calculs de manière flexible. Les phases d'un déploiement sont le paiement, la session et la finalisation. Pendant la phase de paiement, le code de paiement est exécuté. S'il est réussi, le code de session est exécuté pendant la phase de session. Enfin, (indépendamment de l'exécution du code de session), la phase de finalisation est exécutée, ce qui permet une certaine comptabilité autour du paiement.
tr: Hesaplama için ödemeyi esnek bir şekilde sağlamak için bir dağıtım, farklı *aşamalarda* yürütülür. Dağıtımın aşamaları ödeme, oturum ve sonuçlandırmadır. Ödeme aşamasında ödeme kodu çalıştırılır. Başarılı olursa, oturum kodu oturum aşamasında yürütülür. Ve son olarak (oturum kodunun yürütülüp yürütülmediğinden bağımsız olarak), ödeme ile ilgili bir miktar defter tutma işlemi yapılan sonuçlandırma aşaması yürütülür.
vi: Triển khai được thực hiện theo *giai đoạn* riêng biệt để phù hợp với thanh toán cho việc tính toán một cách linh hoạt. Các giai đoạn của một triển khai là thanh toán, các phiên và hoàn thành. Trong giai đoạn thanh toán, mã thanh toán được thực hiện. Nếu nó thành công, thì mã phiên được thực thi trong giai đoạn phiên. Và cuối cùng (không phụ thuộc vào việc mã phiên đã được thực thi hay chưa), giai đoạn hoàn thành được thực hiện, điều này thực hiện một số việc ghi sổ kế toán xung quanh việc thanh toán.

source: According to new amendments, the finalization phase does not refund the user any unspent ``Gas`` originally purchased (after converting back to motes). Please refer to the :ref:`gas refunding <execution-semantics-gas-refunding>` section for more details. The finalization phase does not include any user-defined logic, it is merely upkeep for the system.
fr: Selon les nouveaux amendements, la phase de finalisation ne rembourse pas à l'utilisateur le ``Gas`` non dépensé acheté à l'origine (après reconversion en motes). Se référer à la section :ref:`remboursement du gaz <execution-semantics-gas-refunding>` pour plus de détails. La phase de finalisation ne comprend pas de logique définie par l'utilisateur, il s'agit simplement d'un entretien du système.
vi: Theo các sửa đổi mới, giai đoạn hoàn thành không hoàn lại cho người dùng bất kỳ ``Gas`` nào chưa sử dụng đã mua ban đầu (sau khi chuyển đổi trở lại thành motes). Vui lòng tham khảo phần :ref:`gas hoàn trả <execution-semantics-gas-refunding>` để biết thêm chi tiết. Giai đoạn hoàn thành không bao gồm bất kỳ logic nào do người dùng xác định, nó chỉ đơn thuần là duy trì cho hệ thống.

source: Payment code
fr: Code de paiement
tr: Ödeme kodu
vi: Mã thanh toán

source: *Payment code* provides the logic used to pay for the computation the deploy will do. Payment code is allowed to include arbitrary logic, providing maximal flexibility in how a deploy can be paid for (e.g., the simplest payment code could use the account’s :ref:`main purse <tokens-purses-and-accounts>`, while an enterprise application may require deploys to pay via a multi-sig application accessing a corporate purse). We restrict the gas limit of the payment code execution, based on the current conversion rate between gas and motes, such that no more than ``MAX_PAYMENT_COST`` motes (a constant of the system) are spent. To ensure payment code will pay for its own computation, we only allow accounts with a balance in their main purse greater than or equal to ``MAX_PAYMENT_COST``, to execute deploys.
fr: Le *code de paiement* fournit la logique utilisée pour payer les calculs effectués par le déploiement. Le code de paiement est autorisé à inclure une logique arbitraire, ce qui permet une flexibilité maximale dans la façon dont un déploiement peut être payé (par exemple, le code de paiement le plus simple pourrait utiliser le :ref:`porte-monnaie principal <tokens-purses-and-accounts>` (main purse) d'un compte, tandis qu'une application d'entreprise peut exiger que les déploiements paient via une application multi-sig accédant à un porte-monnaie d'entreprise. Nous fixons la limite de gaz de l'exécution du code de paiement, en fonction du taux de conversion actuel entre le gaz et les motes, de manière à ne pas dépenser plus de ``MAX_PAYMENT_COST`` motes (une constante du système). Pour s'assurer que le code de paiement paiera pour son propre calcul, nous n'autorisons que les comptes dont le solde du porte-monnaie principal est supérieur ou égal à ``MAX_PAYMENT_COST``, à exécuter des déploiements.
tr: *Ödeme kodu*, dağıtımın yapacağı hesaplama için ödeme yapmak için kullanılan mantığı sağlar. Ödeme kodunun, bir dağıtımın nasıl ödenebileceği konusunda maksimum esneklik sağlayan rastgele mantık içermesine izin verilir (örneğin, en basit ödeme kodu hesabın :ref:`main purse <tokens-purses-and-accounts>` ini kullanabilirken, bir kurumsal uygulama, dağıtımların şirket cüzdanına erişen çoklu imza uygulaması yoluyla ödeme yapmasını gerektirebilir). Ödeme kodu yürütmesinin gaz sınırını, gaz ve motlar arasındaki mevcut dönüştürme oranına bağlı olarak, ``MAX_PAYMENT_COST`` 'dan (sistemin bir sabiti) fazla harcanmayacak şekilde kısıtlarız. Ödeme kodunun kendi hesaplaması için ödeme yapmasını sağlamak için, yalnızca ana cüzdanlarında ``MAX_PAYMENT_COST`` a eşit veya daha fazla bakiyesi olan hesapların dağıtımları yürütmesine izin veriyoruz.
vi: *Mã thanh toán* cung cấp logic được sử dụng để thanh toán cho tính toán mà triển khai sẽ thực hiện. Mã thanh toán được phép bao gồm logic tùy ý, mang lại sự linh hoạt tối đa trong cách thức triển khai có thể được thanh toán (ví dụ: mã thanh toán đơn giản nhất có thể sử dụng :ref:`ví chính <tokens-purses-and-accounts>` của tài khoản, trong khi ứng dụng doanh nghiệp có thể yêu cầu triển khai thanh toán qua một ứng dụng nhiều truy cập đồng thời vào ví của công ty). Chúng tôi hạn chế giới hạn gas của việc thực thi mã thanh toán, dựa trên tỷ lệ chuyển đổi hiện tại giữa gas và mote, sao cho không sử dụng quá ``MAX_PAYMENT_COST`` (một hằng số của hệ thống). Để đảm bảo mã thanh toán sẽ thanh toán cho việc tính toán của chính nó, chúng tôi chỉ cho phép các tài khoản có số dư trong ví chính lớn hơn hoặc bằng ``MAX_PAYMENT_COST`` để thực hiện các đợt triển khai.

source: Payment code ultimately provides its payment by performing a :ref:`token transfer <tokens-mint-interface>` into the `Handle Payment contract’s payment purse <https://github.com/casper-network/casper-node/blob/cb1d20ad1ea6e245cd8237f9406885a1e785c669/types/src/system/handle_payment/mod.rs#L65>`__. If payment is not given or not enough is transferred, then payment execution is not considered successful. In this case the effects of the payment code on the global state are reverted and the cost of the computation is covered by motes taken from the offending account’s main purse.
fr: Le code de paiement fournit finalement son paiement en effectuant un :ref:` transfert de jetons <tokens-mint-interface>` dans le `Traitement du porte-monnaie du contrat de paiement <https://github.com/casper-network/casper-node/blob/cb1d20ad1ea6e245cd8237f9406885a1e785c669/types/src/system/handle_payment/mod.rs#L65>`__. Si le paiement n'est pas effectué ou si le transfert est insuffisant, l'exécution du paiement n'est pas considérée comme réussie. Dans ce cas, les effets du code de paiement sur l'état global sont inversés et le coût du calcul est couvert par des motes prélevés sur le porte-monnaie principale du compte fautif.
vi: Mã thanh toán cuối cùng cung cấp thanh toán bằng cách thực hiện một :ref:`chuyển khoản token <tokens-mint-interface>` vào `Xử lý ví thanh toán của hợp đồng thanh toán <https://github.com/casper-network/casper-node/blob/cb1d20ad1ea6e245cd8237f9406885a1e785c669/types/src/system/handle_payment/mod.rs#L65>`__. Nếu thanh toán không được đưa ra hoặc không đủ được chuyển, thì việc thực hiện thanh toán không được coi là thành công. Trong trường hợp này, các tác động của token đối với trạng thái toàn cục được hoàn nguyên và chi phí tính toán được chi trả bằng một khoản tiền lấy từ ví chính của tài khoản vi phạm.

source: Session code
fr: Code de session
tr: Oturum kodu
vi: Mã phiên

source: *Session code* provides the main logic for the deploy. It is only executed if the payment code is successful. The gas limit for this computation is determined based on the amount of payment given (after subtracting the cost of the payment code itself).
fr: Le *code de session* fournit la logique principale du déploiement. Il n'est exécuté que si le code de paiement est réussi. La limite de gaz pour ce calcul est déterminée en fonction du montant du paiement donné (après avoir soustrait le coût du code de paiement lui-même).
tr: *Oturum kodu*, dağıtım için ana mantığı sağlar. Yalnızca ödeme kodu başarılı olduğunda yürütülür. Bu hesaplama için gaz limiti, verilen ödeme miktarına göre belirlenir (ödeme kodunun kendisinin maliyeti çıkarıldıktan sonra).
vi: *Mã phiên* cung cấp logic chính cho việc triển khai. Nó chỉ được thực hiện nếu mã thanh toán thành công. Giới hạn gas cho phép tính này được xác định dựa trên số tiền thanh toán đã cho (sau khi trừ chi phí của chính mã thanh toán).

source: Specifying payment code and session code
fr: Spécifier le code de paiement et le code de session
tr: Ödeme kodu ve oturum kodunun belirtilmesi
vi: Chỉ định mã thanh toán và mã phiên

source: The user-defined logic of a deploy can be specified in a number of ways:
fr: La logique définie par l'utilisateur d'un déploiement peut être spécifiée de plusieurs façons :
tr: Bir dağıtımın kullanıcı tanımlı mantığı birkaç yolla belirtilebilir:
vi: Logic do người dùng xác định của một triển khai có thể được chỉ định theo một số cách:

source: a wasm module in binary format representing a valid :ref:`contract <global-state-contracts>` (Note: the named keys do not need to be specified because they come from the account the deploy is running in)
fr: un module wasm au format binaire représentant un :ref:`contrat <global-state-contracts>` valide (Note : les clés nommées -named keys- n'ont pas besoin d'être spécifiées car elles proviennent du compte dans lequel le déploiement est exécuté).
tr: geçerli bir :ref:`contract <global-state-contracts>` ı temsil eden ikili kod biçiminde bir wasm modülü (Not: dağıtımın çalıştığı hesaptan geldikleri için adlandırılmış anahtarların belirtilmesi gerekmez)
vi: một mô-đun wasm ở định dạng nhị phân đại diện cho một :ref:`contract <global-state-contracts>` hợp lệ (Lưu ý: không cần chỉ định các khóa được đặt tên vì chúng từ tài khoản mà đang chạy triển khai)

source: a 32-byte identifier representing the :ref:`hash <global-state-hash-key>` or :ref:`URef <global-state-uref>` where a contract is already stored in the global state
fr: un identifiant 32-byte représentant le :ref:`hash <global-state-hash-key>` ou :ref:`URef <global-state-uref>` où un contrat est déjà stocké dans l'état global
tr: :ref:`hash <global-state-hash-key>` veya :ref:`URef <global-state-uref>`i temsil eden 32 baytlık bir tanımlayıcı, ki burada kontrat zaten küresel durumda depolanır
vi: một mã định danh 32 byte đại diện cho :ref:`hash <global-state-hash-key>` hoặc :ref:`URef <global-state-uref>` trong đó một hợp đồng đã được lưu trữ ở trạng thái toàn cục

source: a name corresponding to a named key in the account, where a contract is stored under the key
fr: un nom correspondant à une clé nommée dans le compte, où un contrat est stocké sous la clé
tr: anahtar altında bir kontratın saklandığı hesaptaki adlandırılmış bir anahtara karşılık gelen bir ad
vi: tên tương ứng với khóa được đặt tên trong tài khoản, nơi hợp đồng được lưu trữ dưới khóa
