Repository: casper-network/docs-archive
Catalog: locale/*/LC_MESSAGES/implementation/global-state.po
Languages: fr, tr, vi

source: Global State
fr: État global (Global State)
tr: Küresel Durum
vi: Trạng thái toàn cục

source: Introduction
tr: Giriş
vi: Giới thiệu

source: The “global state” is the storage layer for the blockchain. All accounts, contracts, and any associated data they have are stored in the global state. Our global state has the semantics of a key-value store (with additional permissions logic since not all users can access all values in the same way). Refer to :ref:`Keys and Permissions <serialization-standard-state-keys>` for further information on keys. Each block causes changes to this global state because of the execution of the deploys it contains. For validators to efficiently judge the correctness of these changes, information about the new state needs to be communicated succinctly. Moreover, we need to communicate pieces of the global state to users while allowing them to verify the correctness of the parts they receive. For these reasons, the key-value store is implemented as a :ref:`Merkle trie <global-state-trie>`.
fr: L`"état global" est la couche de stockage de la blockchain. Tous les comptes, les contrats et toutes les données qui leur sont associées sont stockés dans l'état global. Notre état global a la sémantique d'un store clé-valeur (avec une logique de permissions supplémentaires puisque tous les utilisateurs ne peuvent pas accéder à toutes les valeurs de la même manière). Voir :ref:`Keys and Permissions <serialization-standard-state-keys>` pour plus d'informations sur les clés. Chaque bloc entraîne des modifications de cet état global en raison de l'exécution des déploiements qu'il contient. Pour que les validateurs puissent juger efficacement de l'exactitude de ces changements, les informations sur le nouvel état doivent être communiquées de manière succincte. De plus, nous devons communiquer des parties de l'état global aux utilisateurs tout en leur permettant de vérifier l'exactitude des parties qu'ils reçoivent. Pour ces raisons, le store clé-valeur est implémenté en tant que :ref:`Merkle trie <global-state-trie>`.
tr: “Küresel durum”, blok zincirin depolama katmanıdır. Tüm hesaplar, sözleşmeler ve sahip oldukları ilişkili veriler küresel durumda saklanır. Küresel durumumuz, bir anahtar/değer deposu semantiğine sahiptir (tüm kullanıcılar tüm değerlere aynı şekilde erişemeyeceğinden ek izinler mantığıyla). Anahtarlar hakkında daha fazla bilgi için :ref:`Keys and Permissions <serialization-standard-state-keys>` bölümüne bakınız. Her blok, içerdiği dağıtımların yürütülmesi nedeniyle bu genel durumda değişikliklere neden olur. Doğrulayıcıların bu değişikliklerin doğruluğunu verimli bir şekilde yargılayabilmeleri için yeni durum hakkındaki bilgilerin kısa ve öz bir şekilde iletilmesi gerekir. Ayrıca, küresel durumun parçalarını kullanıcılara ileterek, aldıkları parçaların doğruluğunu doğrulamalarına izin vermemiz gerekiyor. Bu nedenlerle, anahtar/değer deposu bir :ref:`Merkle trie <global-state-trie>` olarak uygulanır.
vi: “Trạng thái toàn cục” là lớp lưu trữ cho chuỗi khối. Tất cả các tài khoản, hợp đồng và bất kỳ dữ liệu liên quan nào họ có đều được lưu trữ ở trạng thái toàn cục. Trạng thái toàn cục của chúng tôi có ngữ nghĩa của kho khóa-giá trị (với logic cấp quyền bổ sung vì không phải tất cả người dùng đều có thể truy cập tất cả các giá trị theo cùng một cách). Tham khảo :ref:`Khoá và quyền <serialization-standard-state-keys>` để biết thêm thông tin về các khoá. Mỗi khối gây ra các thay đổi đối với trạng thái toàn cục này do việc thực thi các triển khai mà nó có. Để người xác thực có thể đánh giá hiệu quả tính đúng đắn của những thay đổi này, thông tin về trạng thái mới cần được truyền đạt một cách ngắn gọn. Hơn nữa, chúng ta cần truyền đạt các phần của trạng thái toàn cục cho người dùng đồng thời cho phép họ xác minh tính đúng đắn của các phần mà họ nhận được. Vì những lý do này, kho khóa-giá trị được triển khai dưới dạng :ref:`Merkle trie <global-state-trie>`.

source: Merkle trie structure
fr: Structure de l'arbre de Merkle
tr: Merkle ağacı yapısı
vi: Cấu trúc Merkle trie

source: At a high level, a Merkle trie is a key-value store data structure that can be shared piece-wise in a verifiable way (via a construction called a Merkle proof). Each node is labeled by the hash of its data. Leaf nodes are labeled with the hash of their data. Non-leaf nodes are labeled with the hash of the labels of their child nodes.
fr: À un niveau élevé, un arbre de Merkle est une structure de données de stockage clé-valeur qui peut être partagée par morceaux de manière vérifiable (via une construction appelée preuve de Merkle). Chaque nœud est étiqueté par le hachage de ses données. Les nœuds feuilles sont étiquetés avec le hachage de leurs données. Les nœuds non-feuilles sont étiquetés avec le hachage des étiquettes de leurs nœuds enfants.
tr: Yüksek düzeyde, bir Merkle ağacı, doğrulanabilir bir şekilde parça parça paylaşılabilen bir anahtar-değer deposu veri yapısıdır (Merkle kanıtı adı verilen bir yapı aracılığıyla). Her düğüm, verilerinin özet değeriyle etiketlenir. Yaprak düğümleri, verilerinin özeti ile etiketlenir. Yaprak olmayan düğümler, alt düğümlerinin etiketlerinin özeti ile etiketlenir.
vi: Ở mức độ cao, Merkle trie là một cấu trúc dữ liệu lưu trữ khóa-giá trị có thể được chia sẻ từng phần theo cách có thể xác minh được (thông qua một cấu trúc được gọi là bằng chứng Merkle). Mỗi nút được gắn nhãn bằng băm dữ liệu của nó. Các nút lá được gắn nhãn bằng băm dữ liệu của chúng. Các nút không phải lá được gắn nhãn bằng giá trị băm nhãn các nút con của chúng.

source: Our implementation of the trie has radix of 256, meaning each branch node can have up to 256 children. A path through the tree can be an array of bytes, and serialization directly links a key with a path through the tree as its associated value.
fr: Notre implémentation de l'arbre a un 'radix' de 256, ce qui signifie que chaque nœud de branche peut avoir jusqu'à 256 enfants. Un chemin à travers l'arbre peut être un tableau d'octets, et la sérialisation lie directement une clé avec un chemin à travers l'arbre comme valeur associée.
tr: Ağaç uygulamamızın kökü bulunmakta, yani düğümünün 256'ya kadar alt ögesi olabilir. Ağacın içinden geçen bir yol, bir bayt dizisi olabilir ve serileştirme, bir anahtarı, ilişkili değeri olarak ağaçtan geçen bir yola doğrudan bağlar.
vi: Việc triển khai trie của chúng ta có cơ số là 256, nghĩa là mỗi nút nhánh có thể có tối đa 256 nút con. Một đường dẫn dạng cây có thể là một mảng byte và trình tự liên kết trực tiếp một khóa với một đường dẫn dạng cây như là giá trị liên kết của nó.

source: Formally, a trie node is one of the following:
fr: Formellement, un nœud d'arbre est l'un des éléments suivants :
tr: Resmi olarak, bir ağaç düğümü aşağıdakilerden biridir:
vi: Về mặt hình thức, một nút trie là một trong những nút sau:

source: a leaf, which includes a key and a value
fr: un feuillet, qui comprend une clé et une valeur
tr: bir anahtar ve bir değer içeren bir yaprak
vi: một lá, bao gồm một khóa và một giá trị

source: a branch, which has up to 256 ``blake2b256`` hashes, pointing to up to 256 other nodes in the trie (recall each node is labeled by its hash)
fr: une branche, qui a jusqu'à 256 hashs ``blake2b256``, pointant vers jusqu'à 256 autres noeuds dans l'arbre (rappelons que chaque noeud est étiqueté par son hash).
tr: 256'ya kadar ``blake2b256`` özet değerine sahip olan ve ağaç içindeki 256 diğer düğüme işaret eden bir dal (her düğümün özet değeriyle etiketlendiğini hatırlayın)
vi: một nhánh, có tới 256 băm ``blake2b256``, trỏ đến tối đa 256 nút khác trong trie (mỗi nút được gắn nhãn bởi hàm băm của nó)

source: an extension node, which includes a byte array (called the affix) and a ``blake2b256`` hash pointing to another node in the trie
fr: un noeud d'extension, qui comprend un tableau d'octets (appelé affix) et un hash ``blake2b256`` pointant vers un autre noeud dans l'arbre
tr: bir bayt dizisi (ek olarak adlandırılır) ve denemedeki başka bir düğüme işaret eden bir ``blake2b256`` özet içeren bir uzantı düğümü
vi: một nút mở rộng, bao gồm một mảng byte (gọi là thêm vào) và một băm ``blake2b256`` trỏ đến một nút khác trong trie

source: The purpose of the extension node is to allow path compression. Consider an example where all keys use the same first four bytes for values in the trie. In this case, it would be inefficient to traverse through four branch nodes where there is only one choice; instead, the root node of the trie could be an extension node with affix equal to those first four bytes and pointer to the first non-trivial branch node.
fr: L'objectif du nœud d'extension est de permettre la compression des chemins (path compression). Prenons un exemple où toutes les clés utilisent les mêmes quatre premiers octets pour les valeurs dans l'arbre. Dans ce cas, il serait inefficace de traverser quatre nœuds de branche où il n'y a qu'un seul choix ; au lieu de cela, le nœud racine de la table pourrait être un nœud d'extension avec un 'affix' égal à ces quatre premiers octets et un pointeur vers le premier nœud de branche non trivial.
tr: Uzantı düğümünün amacı, yol sıkıştırmasına izin vermektir. Tüm anahtarların ağaçtaki değerler için aynı ilk dört baytı kullandığı bir örnek düşünün. Bu durumda, yalnızca bir seçeneğin olduğu dört dal düğümü arasında geçiş yapmak verimsiz olacaktır; bunun yerine, ağacın kök düğümü, ilk dört bayta eşit eki olan ve önemsiz olmayan ilk dal düğümüne işaret eden bir uzantı düğümü olabilir.
vi: Mục đích của nút mở rộng là cho phép nén đường dẫn. Hãy xem xét một ví dụ trong đó tất cả các khóa sử dụng bốn byte đầu tiên giống nhau cho các giá trị trong trie. Trong trường hợp này, sẽ không hiệu quả nếu qua bốn nút nhánh chỉ với một lựa chọn; thay vào đó, nút gốc của trie có thể là một nút mở rộng với việc thêm vào bốn byte đầu tiên và trỏ đến nút nhánh quan trọng đầu tiên.

source: The rust implementation of our trie can be found on GitHub:
fr: L'implémentation rust de notre 'arbre' peut être trouvée sur GitHub :
tr: Ağacımızın Rust uygulaması GitHub'da bulunabilir:
vi: Việc triển khai rust trên trie của chúng ta có thể xem trên GitHub:

source: `definition of the trie data structure <https://github.com/CasperLabs/casper-node/blob/cb1d20ad1ea6e245cd8237f9406885a1e785c669/execution_engine/src/storage/trie/mod.rs#L320>`_
fr: `définition de la structure de données de l'arbre <https://github.com/CasperLabs/casper-node/blob/cb1d20ad1ea6e245cd8237f9406885a1e785c669/execution_engine/src/storage/trie/mod.rs#L320>`_
tr: `ağaç veri yapısı tanımı <https://github.com/CasperLabs/casper-node/blob/cb1d20ad1ea6e245cd8237f9406885a1e785c669/execution_engine/src/storage/trie/mod.rs#L320>`_

source: `reading from the trie <https://github.com/CasperLabs/casper-node/blob/cb1d20ad1ea6e245cd8237f9406885a1e785c669/execution_engine/src/storage/trie_store/operations/mod.rs#L37>`_
fr: `Lire sur l'arbre <https://github.com/CasperLabs/casper-node/blob/cb1d20ad1ea6e245cd8237f9406885a1e785c669/execution_engine/src/storage/trie_store/operations/mod.rs#L37>`_
tr: `ağaçtan veri okumak <https://github.com/CasperLabs/casper-node/blob/cb1d20ad1ea6e245cd8237f9406885a1e785c669/execution_engine/src/storage/trie_store/operations/mod.rs#L37>`_

source: `writing to the trie <https://github.com/CasperLabs/casper-node/blob/cb1d20ad1ea6e245cd8237f9406885a1e785c669/execution_engine/src/storage/trie_store/operations/mod.rs#L638>`_
fr: `Écrire sur l'arbre <https://github.com/CasperLabs/casper-node/blob/cb1d20ad1ea6e245cd8237f9406885a1e785c669/execution_engine/src/storage/trie_store/operations/mod.rs#L638>`_
tr: `ağaca veri yazmak <https://github.com/CasperLabs/casper-node/blob/cb1d20ad1ea6e245cd8237f9406885a1e785c669/execution_engine/src/storage/trie_store/operations/mod.rs#L638>`_

source: Note: Conceptually, each block has its trie because the state changes based on the deploys it contains. For this reason, our implementation has a notion of a ``TrieStore``, which allows us to look up the root node for each trie.
fr: Note : Conceptuellement, chaque bloc a son arbre car l'état change en fonction des déploiements qu'il contient. Pour cette raison, notre implémentation a une notion de ``TrieStore``, qui nous permet de chercher le noeud racine pour chaque arbre (trie).
tr: Not: Kavramsal olarak, her bloğun bir ağacı vardır, çünkü durum içerdiği dağıtımlara göre değişir. Bu nedenle, uygulamamız, her deneme için kök düğümü aramamıza izin veren bir "TrieStore" kavramına sahiptir.
vi: Lưu ý: Về mặt khái niệm, mỗi khối có trie của nó vì trạng thái thay đổi dựa trên các triển khai mà nó chứa. Vì lý do này, việc triển khai của chúng ta có khái niệm về `` TrieStore '', cho phép chúng ta tra cứu nút gốc cho mỗi trie.

source: `definition of the trie data structure <https://github.com/casper-network/casper-node/blob/cb1d20ad1ea6e245cd8237f9406885a1e785c669/execution_engine/src/storage/trie/mod.rs#L320>`_
vi: `định nghĩa của cấu trúc dữ liệu trie <https://github.com/casper-network/casper-node/blob/cb1d20ad1ea6e245cd8237f9406885a1e785c669/execution_engine/src/storage/trie/mod.rs#L320>`_

source: `reading from the trie <https://github.com/casper-network/casper-node/blob/cb1d20ad1ea6e245cd8237f9406885a1e785c669/execution_engine/src/storage/trie_store/operations/mod.rs#L37>`_
vi: `đọc từ trie <https://github.com/casper-network/casper-node/blob/cb1d20ad1ea6e245cd8237f9406885a1e785c669/execution_engine/src/storage/trie_store/operations/mod.rs#L37>`_

source: `writing to the trie <https://github.com/casper-network/casper-node/blob/cb1d20ad1ea6e245cd8237f9406885a1e785c669/execution_engine/src/storage/trie_store/operations/mod.rs#L638>`_
vi: `ghi vào trie<https://github.com/casper-network/casper-node/blob/cb1d20ad1ea6e245cd8237f9406885a1e785c669/execution_engine/src/storage/trie_store/operations/mod.rs#L638>`_
