Repository: casper-network/docs-archive
Catalog: locale/*/LC_MESSAGES/implementation/p2p.po
Languages: fr, tr, vi

source: Network Communication
fr: Communication en réseau
tr: Ağ İletişimi
vi: Giao tiếp mạng

source: Nodes form a peer-to-peer network are continually communicating with each other to reach *consensus* about the blockchain state. A node is not necessarily a single physical machine. Still, it appears as a single logical entity to the rest of its peers by having a unique ID and address where it responds to incoming network traffic.
fr: Les nœuds forment un réseau peer-to-peer et communiquent continuellement entre eux pour parvenir à un *consensus* sur l'état de la blockchain. Un nœud n'est pas nécessairement une machine physique unique. Cependant, il apparaît comme une entité logique unique au reste de ses pairs en ayant un ID unique et une adresse où il répond au trafic réseau entrant.
tr: Eşler arası bir ağ oluşturan düğümler, blokzincir durumu hakkında *mutabakat*a ulaşmak için sürekli olarak birbirleriyle iletişim kurar. Bir düğüm mutlaka tek bir fiziksel makine değildir. Yine de, gelen ağ trafiğine yanıt verdiği benzersiz bir kimliğe ve adrese sahip olarak, diğer eşlerine tek bir mantıksal varlık olarak görünür.
vi: Các nút tạo thành một mạng ngang hàng giao tiếp với nhau để đạt được *đồng thuận* về trạng thái chuỗi khối. Một nút không nhất thiết là máy tính vật lý. Tuy nhiên, nó xuất hiện như một thực thể logic duy nhất đối với phần còn lại bằng cách có một ID và địa chỉ duy nhất, và nó phản hồi cho dữ liệu mạng gửi tới.

source: Identity
fr: Identité
tr: Kimlik
vi: Định danh

source: Each node has an identity on the network (which is not the same as its identity in the consensus process). The network identity (ID) is based on the fingerprint of the public key of a self-signed TLS certificate. A node generates a new private key each time it starts, ensuring a unique ID.
fr: Chaque nœud a une identité sur le réseau (qui n'est pas la même que son identité dans le processus de consensus). L'identité du réseau (ID) est basée sur l'empreinte de la clé publique d'un certificat TLS auto-signé. Un nœud génère une nouvelle clé privée à chaque démarrage, ce qui garantit une identité unique.
tr: Her düğümün ağ üzerinde bir kimliği vardır (mutabakat sürecindeki kimliğiyle aynı değildir). Ağ kimliği (ID), kendinden imzalı bir TLS sertifikasının ortak anahtarının parmak izini temel alır. Bir düğüm, her başladığında benzersiz bir kimlik sağlayarak yeni bir özel anahtar oluşturur.
vi: Mỗi nút có một định danh trên mạng (không giống với định danh của nó trong quá trình đồng thuận). Định danh mạng (ID) dựa trên dấu vân tay của khóa công khai của chứng chỉ TLS tự ký. Một nút tạo ra một khóa riêng mới mỗi khi nó khởi động, đảm bảo một ID duy nhất.

source: Each identity is linked with an address, which is an IP and port pair where the node is reachable. This address is also called an endpoint.
fr: Chaque identité est liée à une adresse, qui est une paire IP et port où le nœud est joignable. Cette adresse est également appelée point de terminaison (endpoint).
tr: Her kimlik, düğümün erişilebilir olduğu bir IP ve bağlantı noktası çifti olan bir adresle bağlantılıdır. Bu adrese uç nokta da denir.
vi: Mỗi danh tính được liên kết với một địa chỉ, là một cặp IP và cổng nơi nút có thể truy cập được. Địa chỉ này còn được gọi là điểm cuối.

source: Inter-node connections
fr: Connexions inter-nœuds
tr: Düğümler arası bağlantılar
vi: Kết nối giữa các nút

source: Should a node want to connect to another node with a known endpoint, it opens a TLS connection to the endpoint's address. In the context of common TLS terminology, this makes the connecting node the *client* and the remote node the *server* for this connection.
fr: Si un nœud veut se connecter à un autre nœud avec un point de terminaison (endpoint) connu, il ouvre une connexion TLS à l'adresse du point de terminaison. Dans le contexte de la terminologie TLS, cela fait du nœud se connectant le *client* et du nœud distant le *serveur* de cette connexion.
tr: Bir düğüm, bilinen bir uç noktaya sahip başka bir düğüme bağlanmak isterse, uç noktanın adresine bir TLS bağlantısı açar. Ortak TLS terminolojisi bağlamında, bu bağlantı için, bağlantı düğümünü *istemci* ve uzak düğümü *sunucu* yapar.
vi: Nếu một nút muốn kết nối với một nút khác có điểm cuối đã biết, nó sẽ mở một kết nối TLS đến địa chỉ của điểm cuối. Trong ngữ cảnh của thuật ngữ TLS phổ biến, điều này làm cho nút kết nối trở thành *máy khách* và nút ở xa trở thành *máy chủ* cho kết nối này.

source: During connection setup, the client checks the server's certificate, matching the endpoint's expected public identity to ensure we have connected to the right node. Additionally, the TLS parameters of the connection and certificate are required to contain the same ciphers, digests, etc., to protect against downgrade attacks.
fr: Pendant l'établissement de la connexion, le client vérifie le certificat du serveur, en faisant correspondre l'identité publique attendue du point de terminaison (endpoint) pour s'assurer que nous nous sommes connectés au bon nœud. En outre, les paramètres TLS de la connexion et du certificat doivent contenir les mêmes ' ciphers', 'digests', etc. afin de se protéger contre les attaques.
tr: Bağlantı kurulumu sırasında istemci, sunucunun sertifikasını kontrol eder ve doğru düğüme bağlandığımızdan emin olmak için uç noktanın beklenen genel kimliğiyle eşleşir. Ayrıca, sürüm düşürme saldırılarına karşı koruma sağlamak için bağlantının ve sertifikanın TLS parametrelerinin aynı şifreleri, özetleri vb. içermesi gerekir.
vi: Trong quá trình thiết lập kết nối, máy khách kiểm tra chứng chỉ của máy chủ, khớp với danh tính công khai dự kiến của điểm cuối để đảm bảo chúng ta đã kết nối với đúng nút. Ngoài ra, các tham số TLS của kết nối và chứng chỉ được yêu cầu phải chứa cùng một mật mã, thông báo, v.v., để bảo vệ khỏi các cuộc tấn công hạ cấp (downgrade).

source: Simultaneously, the connecting node sends its certificate as the client certificate, allowing the server to perform the same check-in reverse and establish the client's ID. At the end of the process, both nodes can be sure to which peer they are connected.
fr: Simultanément, le nœud 'client' envoie son certificat en tant que certificat du client, ce qui permet au nœud 'serveur' d'effectuer le même contrôle inverse et d'établir l'identité du client. À la fin du processus, les deux nœuds sont sûrs de savoir à quel pair ils sont connectés.
tr: Eşzamanlı olarak, bağlantı düğümü sertifikasını istemci sertifikası olarak göndererek sunucunun aynı denetleme işlemini tersine gerçekleştirmesine ve istemcinin kimliğini oluşturmasına izin verir. İşlemin sonunda her iki düğüm de hangi eşe bağlı olduklarından emin olabilir.
vi: Đồng thời, nút kết nối sẽ gửi chứng chỉ của nó dưới dạng chứng chỉ máy khách, cho phép máy chủ thực hiện ngược lại quá trình đăng ký tương tự và thiết lập ID của máy khách. Vào cuối quá trình, cả hai nút có thể chắc chắn rằng chúng được kết nối với nút ngang hàng nào.

source: Once a connection is established, the server will immediately seek to connect back to a node based on its endpoint (see `Node Discovery`_ on how the server finds endpoints) if it is a one-way connection. If a bidirectional connection setup cannot be established within a certain amount of time, all peer ID connections are dropped.
fr: Une fois qu'une connexion est établie, le serveur cherche immédiatement à se reconnecter à un noeud en fonction de son point de terminaison (voir `Découverte des nœuds`_ sur la façon dont le serveur trouve les points de terminaison) s'il s'agit d'une connexion unidirectionnelle. Si une connexion bidirectionnelle ne peut pas être établie dans un certain laps de temps, toutes les connexions de type peer ID sont abandonnées.
tr: Bir bağlantı kurulduktan sonra, sunucu, tek yönlü bir bağlantıysa, uç noktasına bağlı olarak (sunucunun uç noktaları nasıl bulduğuna ilişkin `Düğüm Keşfi`_ bölümüne bakın) derhal bir düğüme yeniden bağlanmaya çalışacaktır. Belirli bir süre içinde çift yönlü bağlantı kurulumu yapılamazsa, tüm eş kimliği bağlantıları kesilir.
vi: Sau khi kết nối được thiết lập, máy chủ sẽ ngay lập tức tìm cách kết nối trở lại với một nút dựa trên điểm cuối của nó (xem phần `` Khám phá nút'_ về cách máy chủ tìm điểm cuối) nếu đó là kết nối một chiều. Nếu không thể thiết lập thiết lập kết nối hai chiều trong một khoảng thời gian nhất định, tất cả các kết nối ID ngang hàng sẽ bị loại bỏ.

source: Connections are used for sending messages one-way only; only the node initiating a connection will send messages on it.
fr: Les connexions sont utilisées pour envoyer des messages dans un seul sens ; seul le nœud qui initie une connexion peut envoyer des messages sur celle-ci.
tr: Bağlantılar yalnızca tek yönlü mesaj göndermek için kullanılır; sadece bir bağlantı başlatan düğüm ona mesaj gönderir.
vi: Kết nối chỉ được sử dụng để gửi tin nhắn một chiều; chỉ có nút khởi tạo kết nối mới gửi tin nhắn trên đó.

source: Network
fr: Réseau
tr: Ağ
vi: Mạng

source: As soon as a node has connected to one node in the network, it partakes in `Node Discovery`_. In general, any node will attempt to connect to any other node on the network it finds as described above, leading to a fully connected network.
fr: Dès qu'un nœud s'est connecté à un autre nœud du réseau, il participe à la `Découverte des nœuds`_. En général, tout nœud tente de se connecter à tout autre nœud du réseau qu'il trouve comme décrit ci-dessus, ce qui conduit à un réseau entièrement connecté.
tr: Bir düğüm ağdaki bir düğüme bağlanır bağlanmaz `Düğüm Keşfi`_ne katılır. Genel olarak, herhangi bir düğüm, ağ üzerinde bulduğu diğer herhangi bir düğüme yukarıda açıklandığı gibi bağlanmaya çalışacak ve bu da tamamen bağlı bir ağa yol açacaktır.
vi: Ngay sau khi một nút đã kết nối với một nút trong mạng, nó sẽ tham gia vào `Khám phá nút`_. Nói chung, bất kỳ nút nào sẽ cố gắng kết nối với bất kỳ nút nào khác trên mạng mà nó tìm thấy như được mô tả ở trên, dẫn đến một mạng được kết nối đầy đủ.

source: Two classes of data transfers happen in the network; broadcasts and gossiping. A broadcast message is sent once, without guarantees, to all the nodes connected to it. The process of gossiping is described further below.
fr: Deux classes de transferts de données se produisent dans le réseau : 'broadcasts' (diffusions) et 'gossiping' . Un message broadcast est envoyé une fois, sans garantie, à tous les nœuds qui lui sont connectés. Le processus de 'gossiping' est décrit plus loin.
tr: Ağda iki sınıf veri aktarımı gerçekleşir; yayın ve dedikodu. Bir yayın mesajı, kendisine bağlı tüm düğümlere garantisiz olarak bir kez gönderilir. Dedikodu süreci aşağıda daha ayrıntılı olarak açıklanmaktadır.
vi: Hai lớp truyền dữ liệu xảy ra trong mạng; chương trình phát và gossiping. Một tin nhắn được gửi một lần sẽ không có bảo đảm là tới tất cả các nút được kết nối với nó. Quá trình gossiping được mô tả thêm bên dưới.

source: In general, only consensus messages, which are only sent by active validators, are broadcast. Everything else is gossipped.
fr: En général, seuls les messages de consensus, qui ne sont envoyés que par les validateurs actifs, sont de type 'broadcast'. Tout le reste est de type 'gossiping'.
tr: Genel olarak, yalnızca etkin doğrulayıcılar tarafından gönderilen mutabakat mesajları yayınlanır. Diğer her şey dedikodudur.
vi: Nói chung, chỉ những thông báo đồng thuận mà được gửi bởi những người xác thực đang hoạt động, mới được phát đi. Mọi thứ khác đều là gossip.

source: Gossiping
fr: Gossiping (bavardage)
tr: Dedikodu

source: Multiple types of objects are gossipped, the most prominent ones being blocks, deploys, and endpoints (see `Identity`_). Each of these objects is immutable and can be identified by a unique hash.
fr: Plusieurs types d'objets sont 'gossipés', les plus importants étant les blocs, les déploiements et les endpoints (voir `Identité`_). Chacun de ces objets est immuable et peut être identifié par un hash unique.
tr: En belirginleri bloklar, dağıtımlar ve uç noktalar olmak üzere birden çok nesne türü dedikodu edilir (bkz. 'Kimlik'_). Bu nesnelerin her biri değişmezdir ve benzersiz bir özet (hash) ile tanımlanabilir.
vi: Nhiều loại đối tượng được gossipped, những đối tượng nổi bật nhất là khối, triển khai và điểm cuối (xem `Identity`_). Mỗi đối tượng này là bất biến và có thể được xác định bằng một hàm băm duy nhất.

source: Gossiping is a process of distributing a value across the entire network without directly sending it to each node. This process allows only a subset of nodes to be connected to the original sender and spreading the bandwidth and processing requirements across the network at the cost of latency and overall bandwidth consumed.
fr: Le Gossiping est un processus qui consiste à distribuer une valeur sur l'ensemble du réseau sans l'envoyer directement à chaque nœud. Ce processus permet de ne connecter qu'un sous-ensemble de nœuds à l'expéditeur initial et de répartir les besoins en bande passante et en traitement sur l'ensemble du réseau, au prix de la latence et de la bande passante globale consommée.
tr: Dedikodu, bir değeri doğrudan her bir düğüme göndermeden tüm ağ boyunca dağıtma işlemidir. Bu süreç, orijinal göndericiye yalnızca bir düğüm alt kümesinin bağlanmasına ve bant genişliği ve işleme gereksinimlerinin ağ genelinde gecikme süresi ve tüketilen toplam bant genişliği pahasına yayılmasına izin verir.
vi: Gossiping là một quá trình phân phối một giá trị trên toàn bộ mạng mà không cần gửi trực tiếp đến từng nút. Quá trình này chỉ cho phép một tập hợp con của các nút được kết nối với người gửi ban đầu và trải rộng băng thông, yêu cầu xử lý trên toàn mạng do đó đổi lại là độ trễ và chiếm băng thông tổng thể.

source: The process can be summarized as follows:
fr: Le processus peut être résumé comme suit :
tr: Süreç şu şekilde özetlenebilir:
vi: Quá trình này có thể được tóm tắt như sau:

source: Given a message `M` to gossip, the desired saturation `S`, and an infection limit `L`:
fr: Étant donné un message `M` à 'gossiper', la saturation souhaitée `S`, et une limite d'infection `L` :
tr: Dedikodu için bir `M` mesajı, istenen `S` doygunluğu ve bir bulaşma sınırı `L` verildiğinde:
vi: Đưa ra một thông báo `M` để thực hiện gossip, độ bão hòa mong muốn `S`, và giới hạn trao đổi `L`:

source: Pick a subset `T` of `k` nodes from all currently connected nodes.
fr: Choisir un sous-ensemble `T` de `k` noeuds parmi tous les noeuds actuellement connectés.
tr: Şu anda bağlı olan tüm düğümlerden `k` düğümlerinin bir `T` alt kümesini seçin.
vi: Chọn một tập hợp con `T` trong số `k` nút từ tất cả các nút hiện đang được kết nối.

source: Send `M` to each node in `T`, noting which nodes were already infected (a node is considered infected if it already had received or known `M`).
fr: Envoyer `M` à chaque nœud de `T`, en notant les nœuds déjà infectés (un nœud est considéré comme infecté s'il a déjà reçu ou connu `M`).
tr: Hangi düğümlerin zaten enfekte olduğunu not ederek `T`deki her bir düğüme `M` gönderin (bir düğüm zaten `M` almışsa veya biliniyorsa virüslü olarak kabul edilir).
vi: Gửi `M` đến từng nút trong` T`, lưu ý những nút nào đã bị trao đổi (một nút được coi là bị trao đổi nếu nó đã nhận hoặc đã biết `M`).

source: For every node shown as already infected, add another random node outside to `T` and send it `M`, again noting the response.
fr: Pour chaque nœud indiqué comme étant déjà infecté, ajoutez un autre nœud aléatoire à l'extérieur de `T` et envoyez-lui `M`, en notant à nouveau la réponse.
tr: Halihazırda bulaşmış olarak gösterilen her düğüm için, `T` dışında başka bir rastgele düğüm ekleyin ve yanıtı tekrar not ederek `M`yi gönderin.
vi: Đối với mỗi nút được hiển thị là đã bị trao đổi, hãy thêm một nút ngẫu nhiên khác bên ngoài vào `T` và gửi` M`, một lần nữa ghi nhận phản hồi.

source: End when we confirm infection of `L` new nodes or encountered `S` already infected nodes.
fr: On arrête quand on confirme l'infection de `L` nouveaux noeuds ou qu'on atteint `S` noeuds déjà infectés.
tr: `L` yeni düğümlerin bulaştığını doğruladığımızda ya da zaten virüslü `S` düğümlerle karşılaştığımızda sona erdirin.
vi: Kết thúc khi chúng tôi xác nhận trao đổi của `L` nút mới hoặc gặp các nút `S` đã bị trao đổi.

source: Through this process, a message will spread to almost all nodes over time.
fr: Grâce à ce processus, un message se répandra à presque tous les nœuds au fil du temps.
tr: Bu süreç boyunca, bir mesaj zaman içinde neredeyse tüm düğümlere yayılacaktır.
vi: Thông qua quá trình này, một thông báo sẽ lan truyền đến hầu hết tất cả các nút theo thời gian.

source: Requesting missing data
fr: Demande de données manquantes
tr: Eksik veri talep etme
vi: Yêu cầu dữ liệu bị thiếu

source: While gossiping and broadcasting are sufficient to distribute data across the network in most cases, nodes can also request missing data from peers should they require it. A common example is a missing deploy from a block.
fr: Si le 'gossiping' et le 'broadcasting' suffisent à distribuer les données sur le réseau dans la plupart des cas, les nœuds peuvent également demander des données manquantes à leurs pairs s'ils en ont besoin. Un exemple courant est le déploiement manquant d'un bloc.
tr: Dedikodu ve yayın, çoğu durumda ağ genelinde veri dağıtmak için yeterli olsa da, düğümler ihtiyaç duymaları halinde eşlerden eksik verileri de talep edebilir. Yaygın bir örnek, bir bloktan eksik bir dağıtımdır.
vi: Trong khi gossiping và phát sóng là đủ để phân phối dữ liệu trên toàn mạng trong hầu hết các trường hợp, các nút cũng có thể yêu cầu dữ liệu bị thiếu từ các nút ngang hàng nếu họ yêu cầu. Một ví dụ phổ biến là triển khai bị thiếu từ một khối.

source: Validation
tr: Doğrulama
vi: Xác thực

source: Objects have a concept of dependencies. For example, a block depends on all the deploys whose hashes are listed inside it. A node considers any object valid if all of its dependencies are available on the local node.
fr: Les objets ont un concept de dépendances. Par exemple, un bloc dépend de tous les déploiements dont les hashs sont listés à l'intérieur. Un nœud considère qu'un objet est valide si toutes ses dépendances sont disponibles sur le nœud local.
tr: Nesnelerin bir bağımlılık kavramı vardır. Örneğin, bir blok, özet (hash) değerleri içinde listelenen tüm dağıtımlara bağlıdır. Bir düğüm, tüm bağımlılıkları yerel düğümde mevcutsa, herhangi bir nesneyi geçerli kabul eder.
vi: Các đối tượng có một khái niệm về sự phụ thuộc. Ví dụ, một khối phụ thuộc vào tất cả các lần triển khai có hàm băm được liệt kê bên trong nó. Một nút coi bất kỳ đối tượng nào là hợp lệ nếu tất cả các phụ thuộc của nó đều có sẵn trên nút cục bộ.

source: Should a node receive an object from a peer that is not valid yet, it will attempt to complete its validation before processing it further. In the case of gossiping, this means pausing the gossiping of the object until all its dependencies can be retrieved.
fr: Si un nœud reçoit un objet non encore valide d'un pair , il tentera de compléter sa validation avant de le traiter. Dans le cas du 'gossiping', cela signifie la mise en pause du 'gossiping' sur cet objet jusqu'à ce que toutes ses dépendances soient récupérées.
tr: Bir düğüm, bir eşten henüz geçerli olmayan bir nesne alırsa, daha fazla işlemeden önce doğrulamasını tamamlamaya çalışır. Dedikodu durumunda, bu, tüm bağımlılıkları alınana kadar nesnenin dedikodusunu duraklatmak anlamına gelir.
vi: Nếu một nút nhận được một đối tượng từ một nút ngang hàng chưa hợp lệ, nó sẽ cố gắng hoàn thành việc xác thực trước khi xử lý thêm. Trong trường hợp gossiping, điều này có nghĩa là tạm dừng gossiping của đối tượng cho đến khi tất cả các phụ thuộc của nó có thể được truy xuất.

source: Any node is responsible for only propagating valid objects. Should a node not retrieve all missing dependencies of an object from the peer that sent it, it may punish the peer for doing so.
fr: Tout nœud est responsable de ne propager que des objets valides. Si un nœud ne récupère pas toutes les dépendances manquantes d'un objet auprès du pair qui l'a envoyé, il peut le punir pour cela.
tr: Herhangi bir düğüm yalnızca geçerli nesneleri yaymaktan sorumludur. Bir düğüm, bir nesnenin tüm eksik bağımlılıklarını onu gönderen eşten alamazsa, bunu yaptığı için eşi cezalandırabilir.
vi: Bất kỳ nút nào có trách nhiệm chỉ truyền các đối tượng hợp lệ. Nếu một nút không truy xuất được tất cả các phụ thuộc còn thiếu của một đối tượng từ nút ngang hàng đã gửi, nó có thể phạt nút ngang hàng vì làm như vậy.

source: Node Discovery
fr: Découverte des nœuds
tr: Düğüm Keşfi
vi: Khám phá nút

source: Node discovery happens by each node periodically gossiping its public address. Upon receiving an address via gossip, each node immediately tries to establish a connection to it and notes the resulting endpoint, if successful.
fr: La découverte des nœuds se fait par le biais de chaque nœud qui communique périodiquement son adresse publique. Lorsqu'il reçoit une adresse via 'gossip', un nœud essaie immédiatement d'établir une connexion avec cette adresse et mémorise son point de terminaison (endpoint) en cas de succès.
tr: Düğüm keşfi, her düğümün periyodik olarak genel adresini dedikodu yapmasıyla gerçekleşir. Dedikodu yoluyla bir adres aldığında, her düğüm hemen onunla bir bağlantı kurmaya çalışır ve başarılı olursa sonuçta ortaya çıkan uç noktayı not eder.
vi: Việc khám phá nút được thực hiện bởi mỗi nút định kỳ gossiping địa chỉ công khai của nó. Khi nhận được một địa chỉ qua gossip, mỗi nút ngay lập tức cố gắng thiết lập kết nối với nó và ghi chú điểm cuối kết quả, nếu thành công.
