Repository: casper-network/docs-archive
Catalog: locale/*/LC_MESSAGES/implementation/serialization-standard.po
Languages: fr, tr, vi

source: This key type is used specifically for storing information related to auction bids in the global state. Information for the bids is stored under this key only. The 32-byte identifier which represents this key is derived from the ``blake2b256`` hash of the public key used to create the associated account (see :ref:`Accounts <accounts-associated-keys-weights>` for more information).
fr: Ce type de clé est utilisé spécifiquement pour stocker les informations relatives aux offres d'enchères dans l'état global. Les informations relatives aux offres sont stockées sous cette clé uniquement. L'identifiant de 32 octets qui représente cette clé est dérivé du hachage ``blake2b256`` de la clé publique utilisée pour créer le compte associé (voir :ref:`Comptes <accounts-associated-keys-weights>` pour plus d'informations).
tr: Bu anahtar türü, küresel durumda açık arttırma teklifleriyle ilgili bilgileri depolamak için özel olarak kullanılır. Tekliflere ilişkin bilgiler yalnızca bu anahtar altında saklanır. Bu anahtarı temsil eden 32 baytlık tanımlayıcı, ilişkili hesabı oluşturmak için kullanılan genel anahtarın ``blake2b256`` özet değerinden türetilmiştir (daha fazla bilgi için bkz. :ref:`Accounts <accounts-associated-keys-weights>`).
vi: Loại khóa này được sử dụng đặc biệt để lưu trữ thông tin liên quan đến giá thầu đấu giá ở trạng thái toàn cục. Thông tin cho các giá thầu chỉ được lưu trữ trong khóa này. Mã định danh 32 byte đại diện cho khóa này được lấy từ băm ``blake2b256`` của khóa công khai được sử dụng để tạo tài khoản được liên kết (xem: ref: `Tài khoản <accounts-associated-keys-weights>` để biết thêm).

source: Withdraw Key
tr: Para Çekme Anahtarı
vi: Khoá rút tiền

source: This key type is used specifically for storing information related to auction withdraws in the global state. Information for the withdrawals is stored under this key only. The 32-byte identifier which represents this key is derived from the ``blake2b256`` hash of the public key used to create the associated account (see :ref:`Accounts <accounts-associated-keys-weights>` for more information).
fr: Ce type de clé est utilisé spécifiquement pour stocker les informations relatives aux retraits d'enchères dans l'état global. Les informations relatives aux retraits sont stockées sous cette clé uniquement. L'identifiant de 32 octets qui représente cette clé est dérivé du hachage ``blake2b256`` de la clé publique utilisée pour créer le compte associé (voir :ref:`Comptes <accounts-associated-keys-weights>` pour plus d'informations).
tr: Bu anahtar türü, özellikle küresel durumda açık arttırma para çekimleri ilgili bilgileri depolamak için kullanılır. Para çekme bilgileri sadece bu anahtar altında saklanır. Bu anahtarı temsil eden 32 baytlık tanımlayıcı, ilişkili hesabı oluşturmak için kullanılan genel anahtarın ``blake2b256`` özet değerinden türetilmiştir (daha fazla bilgi için bkz. :ref:`Accounts <accounts-associated-keys-weights>`).
vi: Loại khóa này được sử dụng đặc biệt để lưu trữ thông tin liên quan đến việc rút tiền đấu giá trong trạng thái toàn cục. Thông tin về việc rút tiền chỉ được lưu trữ trong khóa này. Mã định danh 32 byte đại diện cho khóa này được lấy từ băm ``blake2b256`` của khóa công khai được sử dụng để tạo tài khoản được liên kết (xem: ref: `Tài khoản <accounts-associated-keys-weights>` để biết thêm).

source: Serialization for ``Key``
fr: Sérialisation pour "Key" (clé)
tr: ``Key`` için serileştirme
vi: Trình tự hoá cho ``Key``

source: Given the different variants for the over-arching ``Key`` data-type, each of the different variants is serialized differently. This section of this chapter details how the individual variants are serialized. The leading byte of the serialized buffer acts as a tag indicating the serialized variant.
fr: Étant donné les différentes variantes du type de données principal ``Key``, chacune d'entre elles est sérialisée différemment. Cette section de ce chapitre détaille la façon dont les différentes variantes sont sérialisées. L'octet de tête du buffer sérialisé agit comme un tag indiquant la variante sérialisée.
tr: Kapsamlı ``Key`` veri türü için farklı varyantlar göz önüne alındığında, farklı varyantların her biri farklı şekilde serileştirilir. Bu kısmın bu bölümü, bireysel varyantların nasıl serileştirildiğini ayrıntılarıyla anlatır. Serileştirilmiş arabelleğin baştaki baytı, serileştirilmiş varyantı gösteren bir etiket görevi görür.
vi: Với các biến thể khác nhau cho kiểu dữ liệu ``Key``, mỗi biến thể khác nhau được trình tự hóa khác nhau. Phần này của chương này trình bày chi tiết cách các biến thể riêng lẻ được trình tự hoá. Byte đầu của bộ đệm được trình tự hóa hoạt động như một tag chỉ ra biến thể được trình tự hóa.

source: ``Account`` serializes as a 32 byte long buffer containing the byte representation of the underlying ``AccountHash``
fr: ``Account`` se sérialise sous la forme d'un tampon de 32 octets contenant la représentation en octets du ``AccountHash`` sous-jacent.
tr: ``Account``, temel alınan ``AccountHash`` öğesinin bayt temsilini içeren 32 bayt uzunluğunda bir arabellek olarak serileştirilir
vi: ``Account`` tuần tự hóa dưới dạng một bộ đệm dài 32 byte chứa biểu diễn byte của phần cơ bản ``AccountHash``

source: ``Hash`` serializes as a 32 byte long buffer containing the byte representation of the underlying ``Hash`` itself.
fr: ``Hash`` is serialized as a 32-byte long buffer containing the byte representation of the underlying ``Hash`` itself.
tr: ``Hash``, temel ``Hash``in kendisinin bayt temsilini içeren 32 bayt uzunluğunda bir arabellek olarak serilştirilir.
vi: ``Hash`` tuần tự hóa dưới dạng một bộ đệm dài 32 byte chứa biểu diễn byte của phần cơ bản ``Hash``.

source: ``URef`` is a tuple that contains the address of the URef and the access rights to that ``URef``. The serialized representation of the ``URef`` is 33 bytes long. The first 32 bytes are the byte representation of the ``URef`` address, and the last byte contains the bits corresponding to the access rights of the ``URef``. Refer to the :ref:`CLValue<serialization-standard-values>` section of this chapter for details on how ``AccessRights`` are serialized.
fr: ``URef`` est un tuple qui contient l'adresse de l'URef et les droits d'accès à cette ``URef``. La représentation sérialisée du ``URef`` est longue de 33 octets. Les 32 premiers octets sont la représentation en octets de l'adresse du ``URef``, et le dernier octet contient les bits correspondant aux droits d'accès du ``URef``. Se réferer à la section :ref:`CLValue<serialization-standard-values>` de ce chapitre pour les détails sur la sérialisation des ``AccessRights`` .
tr: ``URef``, URef adresini ve bu ``URef`` 'e erişim haklarını içeren bir tanımlama grubudur. ``URef`` in serileştirilmiş gösterimi 33 bayt uzunluğundadır. İlk 32 bayt, "URef" adresinin bayt temsilidir ve son bayt, "URef"in erişim haklarına karşılık gelen bitleri içerir. ``AccessRights`` ın nasıl serileştirildiğine ilişkin ayrıntılar için bu kısmın :ref:`CLValue<serialization-standard-values>` bölümüne bakın.
vi: ``URef`` là một bộ chứa địa chỉ của URef và các quyền truy cập vào ``URef`` đó. Biểu diễn trình tự của ``URef`` dài 33 byte. 32 byte đầu tiên là biểu diễn byte của địa chỉ ``URef`` và byte cuối cùng chứa các bit tương ứng với quyền truy cập của ``URef``. Tham khảo phần :ref: `CLValue<serialization-standard-values>` của chương này để biết chi tiết về cách ``AccessRights`` được trình tự hoá.

source: ``Transfer`` serializes as a 32 byte long buffer containing the byte representation of the hash of the transfer.
fr: ``Transfer`` se sérialise sous la forme d'un buffer de 32 octets de long contenant la représentation en octets du hash du transfert.
tr: ``Transfer``, aktarımın özet değerinin bayt temsilini içeren 32 bayt uzunluğunda bir arabellek olarak serileştirilir.
vi: ``Transfer`` trình tự hóa như một bộ đệm dài 32 byte chứa biểu diễn byte của băm của quá trình chuyển khoản.

source: ``DeployInfo`` serializes as 32 byte long buffer containing the byte representation of the Deploy hash. See the Deploy section above for how Deploy hashes are serialized.
fr: ``DeployInfo`` se sérialise sous la forme d'un buffer de 32 octets contenant la représentation en octets du Deploy hash. Voir la section Deploy ci-dessus pour savoir comment Deploy les hashs sont sérialisés.
tr: ``DeployInfo``, Deploy karmasının bayt temsilini içeren 32 bayt uzunluğunda bir arabellek olarak serileştirilir. Dağıtım özetlerinin nasıl serileştirildiğini öğrenmek için yukarıdaki Dağıtma bölümüne bakın.
vi: ``DeployInfo`` trình tự hóa dưới dạng bộ đệm dài 32 byte chứa biểu diễn byte của băm Triển khai. Xem phần Triển khai ở trên để biết cách trình tự hoá chuỗi băm Triển khai.

source: ``EraInfo`` serializes a ``u64`` primitive type containing the little-endian byte representation of ``u64``.
fr: ``EraInfo`` sérialise en un type primitif ``u64`` contenant la représentation en octets little-endian de ``u64``.
tr: ``EraInfo``, ``u64`` ün küçük son haneli bayt temsilini içeren ``u64`` ilkel türünü serileştirir.
vi: ``EraInfo`` trình tự hóa một kiểu sơ khai ``u64`` chứa biểu diễn byte little-endian của ``u64``.

source: ``Balance`` serializes as 32 byte long buffer containing the byte representation of the URef address.
fr: ``Balance`` se sérialise sous la forme d'un buffer long de 32 octets contenant la représentation en octets de l'adresse URef.
tr: ``Balance``, URef adresinin bayt temsilini içeren 32 bayt uzunluğunda bir arabellek olarak serileştirilir.
vi: ``Balance`` trình tự hóa dưới dạng bộ đệm dài 32 byte chứa biểu diễn byte của địa chỉ URef.

source: ``Bid`` and ``Withdraw`` both contain the ``AccountHash`` as their identifier; therefore, they serialize in the same manner as the ``Account`` variant.
fr: ``Bid`` et ``Withdraw`` contiennent tous deux le ``AccountHash`` comme identifiant ; par conséquent, ils se sérialisent de la même manière que la variante ``Account``.
tr: ``Bid`` ve ``Withdraw``, tanımlayıcı olarak ``AccountHash`` i içerir; bu nedenle, ``Account`` değişkeniyle aynı şekilde serileştirilirler.
vi: Cả ```Bid`` và ``Withdraw`` đều chứa ``AccountHash`` làm định danh của chúng; do đó, chúng trình tự hóa theo cách tương tự như ``Account``.

source: Permissions
tr: İzinler
vi: Phân quyền

source: There are three types of actions that can be done on a value: read, write, add. The reason for *add* to be called out separately from *write* is to allow for commutativity checking. The available actions depend on the key type and the context. Some key types only allow controlled access by smart contracts via the contract API, and other key types refer to values produced and used by the system itself and are not accessible to smart contracts at all but can be read via off-chain queries. This is summarized in the table below:
fr: Il existe trois types d'actions qui peuvent être effectuées sur une valeur : lire, écrire, ajouter (read, write, add). La raison pour laquelle *add* est appelé séparément de *write* est de permettre la vérification de la commutativité. Les actions disponibles dépendent du type de clé et du contexte. Certains types de clés ne permettent qu'un accès contrôlé par les smart contracts via l'API du contrat, et d'autres types de clés font référence à des valeurs produites et utilisées par le système lui-même et ne sont pas du tout accessibles aux smart contracts mais peuvent être lues via des requêtes hors-chaîne (off-chain). Ceci est résumé dans le tableau ci-dessous :
tr: Bir değer üzerinde yapılabilecek üç tür eylem vardır: okuma, yazma, ekleme. *ekle*'nin *yaz*'tan ayrı olarak çağrılmasının nedeni, değişme denetimine izin vermektir. Kullanılabilir eylemler, anahtar türüne ve bağlama bağlıdır. Bazı anahtar türleri, yalnızca sözleşme API'si aracılığıyla akıllı kontratlara kontrollü erişime izin verir ve diğer anahtar türleri, sistemin kendisi tarafından üretilen ve kullanılan değerlere atıfta bulunur ve akıllı kontratlara hiçbir şekilde erişilemez, ancak zincir dışı sorgular aracılığıyla okunabilir. Bu, aşağıdaki tabloda özetlenmiştir:
vi: Có ba loại hành động có thể được thực hiện trên một giá trị: đọc, ghi, thêm. Lý do *add* được gọi riêng với *write* là để cho phép kiểm tra tính giao hoán. Các hành động khả dụng phụ thuộc vào loại khóa và ngữ cảnh. Một số loại khóa chỉ cho phép truy cập được kiểm soát bởi các hợp đồng thông minh thông qua API hợp đồng và các loại khóa khác tham chiếu đến các giá trị do chính hệ thống sinh ra, sử dụng và hoàn toàn không thể truy cập vào các hợp đồng thông minh nhưng có thể được đọc qua các truy vấn ngoài chuỗi. Điều này được tóm tắt trong bảng dưới đây:

source: Key Type
tr: Anahtar Türü
vi: Kiểu khoá

source: Available Actions
fr: Actions possibles
tr: Mevcut İşlemler
vi: Hoạt động có thể thực hiện

source: Read + Add (via API)
tr: Oku + Ekle (API ile)
vi: Read + Add (qua API)

source: Read
tr: Oku

source: Read + Write and/or Add
tr: Oku + Yaz ve/veya Ekle

source: Read (via API)
tr: Oku (API yolu ile)
vi: Read (qua API)

source: Refer to :ref:`URef permissions<uref-permissions>` on how permissions are handled in the case of ``URef``\ s.
fr: Se référer à :ref:`URef permissions<uref-permissions>` sur la façon dont les permissions sont gérées dans le cas des ``URef``.
tr: ``URef``\ durumunda izinlerin nasıl idare edildiğine ilişkin :ref:`URef permissions<uref-permissions>` 'a bakınız.
vi: Tham khảo :ref:`Quyền URef<uref-permissions>` về cách xử lý quyền trong trường hợp ``URef``.
