Repository: casper-network/docs-archive
Catalog: locale/*/LC_MESSAGES/implementation/serialization-standard.po
Languages: fr, tr, vi

source: accounts serialize in the same way as data with ``CLType`` equal to ``Tuple5(FixedList(U8, 32), Map(String, Key), URef, Map(FixedList(U8, 32), U8), Tuple2(U8, U8))``.
fr: Les comptes se sérialisent de la même manière que les données dont le ``CLType`` est égal à ``Tuple5(FixedList(U8, 32), Map(String, Key), URef, Map(FixedList(U8, 32), U8), Tuple2(U8, U8))``.
tr: kontratlar, ``CLType``, ``Tuple5(FixedList(U8, 32), Map(String, Key), URef, Map(FixedList(U8, 32), U8), Tuple2(U8, U8))``'e eşit olduğu verilerle aynı şekilde serileştirilir;
vi: tài khoản trình tự hóa theo cách tương tự như dữ liệu với ``CLType`` bằng ``Tuple5(FixedList(U8, 32), Map(String, Key), URef, Map(FixedList(U8, 32), U8), Tuple2(U8, U8))``.

source: Note: ``Tuple5`` is not a presently supported ``CLType``. However, it is clear how to generalize the rules for ``Tuple1``, ``Tuple2``, ``Tuple3`` to any size tuple.
fr: Note : ``Tuple5`` n'est pas un ``CLType`` actuellement supporté. Cependant, il est clair comment généraliser les règles pour ``Tuple1``, ``Tuple2``, ``Tuple3`` à n'importe quelle taille de tuple.
tr: Not: ``Tuple5``, şu anda desteklenen bir ``CLType`` değildir. Ancak, ``Tuple1``, ``Tuple2``, ``Tuple3`` için kuralların herhangi bir boyuttaki demete nasıl genelleştirileceği açıktır.
vi: Lưu ý: ``Tuple5`` hiện không được hỗ trợ ``CLType``. Tuy nhiên, có cách rõ ràng để tổng quát hóa các quy tắc cho ``Tuple1``, ``Tuple2``, ``Tuple3`` thành bộ bộ dữ liệu với bất kỳ kích thước nào.

source: Note: links to further serialization examples and a reference implementation are found in :ref:`Appendix B <appendix-b>`.
fr: Note : des liens vers d'autres exemples de sérialisation et une implémentation de référence se trouvent dans :ref:`Annexe B <appendix-b>`.
tr: Not: daha fazla serileştirme örneklerine ve bir referans uygulamasına bağlantılar :ref:`Appendix B <appendix-b>1` 'de bulunur.
vi: Lưu ý: có thể xem liên kết đến các ví dụ về trình tự hóa khác và cách triển khai trong: ref: `Phụ lục B <appendix-b>`.

source: ``CLValue`` is used to describe data that is used by smart contracts. This could be as a local state variable, input argument, or return value. A ``CLValue`` consists of two parts: a ``CLType`` describing the type of the value and an array of bytes representing the data in our serialization format.
fr: ``CLValue`` est utilisé pour décrire les données qui sont utilisées par les contrats intelligents. Il peut s'agir d'une variable d'état locale, d'un argument d'entrée ou d'une valeur de retour. Une ``CLValue`` se compose de deux parties : un ``CLType`` décrivant le type de la valeur et un tableau d'octets représentant les données dans notre format de sérialisation.
tr: ``CLValue``, akıllı kontratlar tarafından kullanılan verileri tanımlamak için kullanılır. Bu, yerel durum değişkeni, girdi argümanı veya dönüş değeri olabilir. Bir ``CLValue`` iki bölümden oluşur: değerin türünü açıklayan bir ``CLType`` ve serileştirme biçimimizdeki verileri temsil eden bir bayt dizisi.
vi: ``CLValue`` được sử dụng để mô tả dữ liệu được sử dụng bởi các hợp đồng thông minh. Đây có thể là một biến trạng thái cục bộ, đối số đầu vào hoặc giá trị trả về. Một ``CLValue`` bao gồm hai phần: một ``CLValue`` mô tả loại giá trị và một mảng byte đại diện cho dữ liệu ở định dạng trình tự hóa.

source: ``CLType`` is described by the following recursive data type:
fr: ``CLType`` est décrit par le type de données récursif suivant :
tr: ``CLType`` aşağıdaki özyinelemeli veri türüyle tanımlanır:
vi: ``CLType`` được mô tả bởi kiểu dữ liệu đệ quy sau:

source: All data which can be assigned a (non-``Any``) ``CLType`` can be serialized according to the following rules (this defines the Casper serialization format):
fr: Toutes les données auxquelles on peut attribuer un ``CLType`` (non- ``Any``) peuvent être sérialisées selon les règles suivantes (ceci définit le format de sérialisation Casper) :
tr: (``Any`` olmayan) bir ``CLType`` atanabilen tüm veriler aşağıdaki kurallara göre serileştirilebilir (bu, Casper serileştirme biçimini tanımlar):
vi: Tất cả dữ liệu có thể được gán cho ``CLType`` (không phải là ``Bất kỳ``) có thể được trình tự hóa theo các quy tắc sau (điều này xác định định dạng trình tự hóa Casper):

source: Boolean values serialize as a single byte; ``true`` maps to ``1``, while ``false`` maps to ``0``.
fr: Les valeurs booléennes sont sérialisées sous la forme d'un seul octet ; ``true`` correspond à ``1``, tandis que ``false`` correspond à ``0``.
tr: Boolean değerler tekil bir bayt olarak serileştirilir; ``true``, ``1`` ile eşlenirken ``false``, ``0`` ile eşlenir.
vi: Các giá trị Boolean trình tự hóa thành một byte duy nhất; ``true`` ánh xạ tới ``1``, trong khi ``false`` ánh xạ tới ``0``.

source: Numeric values consisting of 64 bits or less serialize in the two's complement representation with little-endian byte order, and the appropriate number of bytes for the bit-width.
fr: Les valeurs numériques composées de 64 bits ou moins sont sérialisées dans la représentation du complément à deux avec l'ordre des octets little-endian, et le nombre d'octets approprié pour la largeur des bits.
tr: 64 bit veya daha azından oluşan sayısal değerler, düşük son haneli bayt sırası ve bit genişliği için uygun sayıda bayt ile ikiye tümleyen gösteriminde serileştirilir.
vi: Các giá trị số có 64 bit hoặc ít hơn được trình tự hóa trong biểu diễn little-endian với thứ tự byte và số byte thích hợp cho bit-width.

source: E.g. ``7u8`` serializes as ``0x07``
fr: Ex. ``7u8`` se serialise en ``0x07``
tr: Örneğin, ``7u8``, ``0x07`` olarak serileştirilir
vi: Ví dụ ``7u8`` trình tự hoá thành ``0x07``

source: E.g. ``7u32`` serializes as ``0x07000000``
fr: Ex. ``7u32`` se sérialise en ``0x07000000``
tr: Örneğin, ``7u32``, ``0x07000000`` olarak serileştirilir
vi: Ví dụ ``7u32`` trình tự hoá thành ``0x07000000``

source: E.g. ``1024u32`` serializes as ``0x00040000``
fr: Ex. ``1024u32`` se sérialise en ``0x00040000``
tr: Örneğin, ``1024u32``, ``0x00040000`` olarak serileştirilir
vi: Ví dụ ``1024u32`` trình tự hoá thành ``0x00040000``

source: Wider numeric values (i.e. ``U128``, ``U256``, ``U512``) serialize as one byte given the length of the next number (in bytes), followed by the two's complement representation with little-endian byte order. The number of bytes should be chosen as small as possible to represent the given number. This is done to reduce the serialization size when small numbers are represented within a wide data type.
fr: Les valeurs numériques larges (par exemple ``U128``, ``U256``, ``U512``) sont sérialisées sous la forme d'un octet donné par la longueur du nombre suivant (en octets), suivi de la représentation du complément à deux dans l'ordre des octets little-endian. Le nombre d'octets doit être choisi aussi petit que possible pour représenter le nombre donné. Cela permet de réduire la taille de la sérialisation lorsque de petits nombres sont représentés dans un type de données large.
tr: Daha geniş sayısal değerler (yani ``U128``, ``U256``, ``U512``), sonraki sayının uzunluğu (bayt cinsinden) verilen bir bayt olarak serileştirilir, ardından düşük son haneli bayt sıralamasında ikiye tümleyen gösterimi takip eder. Bayt sayısı, verilen sayıyı temsil etmek için mümkün olduğunca küçük seçilmelidir. Bu, geniş bir veri türünde küçük sayılar temsil edildiğinde serileştirme boyutunu azaltmak için yapılır.
vi: Các giá trị số rộng hơn (ví dụ: ``U128``, ``U256``, ``U512``) trình tự hóa thành một byte cho độ dài của số tiếp theo (tính bằng byte), theo sau là biểu diễn phần bù của cả hai với thứ tự byte little-endian. Số lượng byte nên được chọn càng nhỏ càng tốt để đại diện cho số lượng đã cho. Điều này được thực hiện để giảm kích thước trình tự hóa khi các số nhỏ được biểu diễn trong một kiểu dữ liệu rộng.

source: E.g. ``U512::from(7)`` serializes as ``0x0107``
fr: Ex. ``U512::from(7)`` se sérialise en ``0x0107``
tr: Örneğin, ``U512::from(7)``, ``0x0107`` olarak serileştirilir
vi: Ví dụ ``U512::from(7)`` trình tự hoá thành ``0x0107``

source: E.g. ``U512::from(1024)`` serializes as ``0x020004``
fr: Ex. ``U512::from(1024)`` se sérialise en ``0x020004``
tr: Örneğin, ``U512::from(1024)``, ``0x020004`` olarak serileştirilir
vi: Ví dụ ``U512::from(1024)`` trình tự hoá thành ``0x020004``

source: E.g. ``U512::from("123456789101112131415")`` serializes as ``0x0957ff1ada959f4eb106``
fr: Ex. ``U512::from("123456789101112131415")`` se sérialise en``0x0957ff1ada959f4eb106``
tr: Örneğin, ``U512::from("123456789101112131415")``, ``0x0957ff1ada959f4eb106`` olarak serileştirilir
vi: Ví dụ ``U512::from("123456789101112131415")`` trình tự hoá thành ``0x0957ff1ada959f4eb106``

source: Unit serializes to an empty byte array.
fr: Unit se sérialise en un tableau d'octets vide.
tr: Birim boş bir bayt dizisine serileştirilir.
vi: Đơn vị trình tự hóa thành một mảng byte trống.

source: Strings serialize as a 32-bit integer representing the length in bytes (note: this might be different than the number of characters since special characters, such as emojis, take more than one byte), followed by the UTF-8 encoding of the characters in the string.
fr: Les chaînes de caractère sont sérialisées sous la forme d'un nombre entier de 32 bits représentant la longueur en octets (remarque : ce nombre peut être différent du nombre de caractères, car les caractères spéciaux, tels que les emojis, prennent plus d'un octet), suivi de l'encodage UTF-8 des caractères de la chaîne.
tr: Dizeler, uzunluğu bayt cinsinden temsil eden 32 bitlik bir tam sayı olarak serileştirilir (not: emojiler gibi özel karakterler birden fazla bayt aldığından bu, karakter sayısından farklı olabilir), ardından dizide karakterlerin UTF-8 kodlaması gelir.
vi: Chuỗi trình tự hóa dưới dạng số nguyên 32 bit thể hiện độ dài tính bằng byte (lưu ý: số này có thể khác với số ký tự vì các ký tự đặc biệt, chẳng hạn như biểu tượng cảm xúc, chiếm nhiều hơn một byte), theo sau là mã hóa UTF-8 của các ký tự trong chuỗi.

source: E.g. ``"Hello, World!"`` serializes as ``0x0d00000048656c6c6f2c20576f726c6421``
fr: Ex. ``"Hello, World!"`` se sérialise en ``0x0d00000048656c6c6f2c20576f726c6421``
tr: Örneğin. ``"Hello, World!"``` 0x0d00000048656c6c6f2c20576f726c6421`` olarak seri hale getirilir
vi: Ví dụ ``"Hello, World!"`` trình tự hoá thành ``0x0d00000048656c6c6f2c20576f726c6421``

source: Optional values serialize with a single byte tag, followed by the serialization of the value itself. The tag is equal to ``0`` if the value is missing, and ``1`` if it is present.
fr: Les 'Optional' sont sérialisées avec un tag d'un octet, suivie de la sérialisation de la valeur elle-même. Le tag est égale à ``0`` si la valeur est manquante, et à ``1`` si elle est présente.
tr: İsteğe bağlı değerler, tekil bir bayt etiketiyle serileştirilir, ardından değerin kendisinin serileştirilmesi gelir. Etiket, değer yoksa ``0``, varsa ``1`` değerine eşittir.
vi: Các giá trị tùy chọn trình tự hóa bằng một byte tag đơn, sau đó là trình tự hóa chính giá trị đó. Thẻ bằng ``0`` nếu thiếu giá trị và ``1`` nếu nó có giá trị.

source: E.g. ``None`` serializes as ``0x00``
fr: Ex. ``None`` se sérialise en ``0x00``
tr: Örneğin, ``None``, ``0x00`` olarak serileştirilir
vi: Ví dụ ``None`` trình tự hoá thành ``0x00``

source: E.g. ``Some(10u32)`` serializes as ``0x010a000000``
fr: Ex. ``Some(10u32)`` se sérialise en ``0x010a000000``
tr: Örneğin, ``Some(10u32)``, ``0x010a000000`` olarak serileştirilir
vi: Ví dụ ``Some(10u32)`` trình tự hoá thành ``0x010a000000``

source: A list of values serializes as a 32-bit integer representing the number of elements in the list (note this differs from strings where it gives the number of *bytes*), followed by the concatenation of each serialized element.
fr: Une liste de valeurs se sérialise sous la forme d'un nombre entier de 32 bits représentant le nombre d'éléments de la liste (notez que cela diffère des chaînes de caractères où l'on donne le nombre d'*octets*), suivi de la concaténation de chaque élément sérialisé.
tr: Değerler listesi, listedeki öğelerin sayısını temsil eden 32 bitlik bir tam sayı olarak serileştirilir (bunun, *bayt* sayısını verdiği dizelerden farklı olduğunu unutmayın), ardından her serileştirilmiş öğenin bitiştirilmesi gelir.
vi: Danh sách các giá trị được trình tự hóa dưới dạng số nguyên 32 bit đại diện cho số phần tử trong danh sách (lưu ý rằng điều này khác với các chuỗi mà nó cung cấp số *byte*), tiếp theo là sự nối tiếp của mỗi phần tử được tuần tự hóa.

source: E.g. ``List()`` serializes as ``0x00000000``
fr: Ex. ``List()`` se sérialise en ``0x00000000``
tr: Örneğin, ``List()``, ``0x00000000`` olarak serileştirilir
vi: Ví dụ ``List()`` trình tự hoá thành ``0x00000000``

source: E.g. ``List(1u32, 2u32, 3u32)`` serializes as ``0x03000000010000000200000003000000``
fr: Ex. ``List(1u32, 2u32, 3u32)`` se sérialise en ``0x03000000010000000200000003000000``
tr: Örneğin, ``List(1u32, 2u32, 3u32)``, ``0x03000000010000000200000003000000`` olarak serileştirilir
vi: Ví dụ ``List(1u32, 2u32, 3u32)`` trình tự hoá thành ``0x03000000010000000200000003000000``

source: A fixed-length list of values serializes as the concatenation of the serialized elements. Unlike a variable-length list, the length is not included in the serialization because it is statically known by the type of the value.
fr: Une liste de valeurs de longueur fixe se sérialise comme la concaténation des éléments sérialisés. Contrairement à une liste à longueur variable, la longueur n'est pas incluse dans la sérialisation car elle est connue de manière statique par le type de la valeur.
tr: Sabit uzunlukta bir değerler listesi, serileştirilmiş öğelerin birleştirilmesi olarak serileştirilir. Değişken uzunluklu bir listeden farklı olarak, uzunluk, değer türüne göre statik olarak bilindiği için serileştirmeye dahil edilmez.
vi: Một danh sách các giá trị có độ dài cố định sắp xếp theo thứ tự là sự ghép nối của các phần tử được trình tự hóa. Không giống như danh sách có độ dài thay đổi, độ dài không được bao gồm trong trình tự hóa vì nó cố định bởi kiểu giá trị.

source: E.g. ``[1u32, 2u32, 3u32]`` serializes as ``0x010000000200000003000000``
fr: Ex. ``[1u32, 2u32, 3u32]`` se sérialise en ``0x010000000200000003000000``
tr: Örneğin, ``[1u32, 2u32, 3u32]``, ``0x010000000200000003000000`` olarak serileştirilir
vi: Ví dụ ``[1u32, 2u32, 3u32]`` trình tự hoá thành ``0x010000000200000003000000``

source: A ``Result`` serializes as a single byte tag followed by the serialization of the contained value. The tag is equal to ``1`` for the success variant and ``0`` for the error variant.
fr: Un ``Result`` se sérialise sous la forme d'un tag d'un octet suivie de la sérialisation de la valeur contenue. Le tag est égale à ``1`` pour la variante succès et ``0`` pour la variante erreur.
tr: Bir ``Result``, tek bir baytlık etiket olarak serileştirilir ve ardından içerilen değerin serileştirilmesi gelir. Etiket, başarılı değişken için ``1`` ve hata değişkeni için ``0`` değerine eşittir.
vi: Một ``Result`` trình tự hóa dưới dạng một byte tag đơn, tiếp theo là trình tự hóa giá trị được chứa. Thẻ bằng ``1`` đối với biến thể thành công và ``0`` đối với biến thể lỗi.

source: E.g. ``Ok(314u64)`` serializes as ``0x013a01000000000000``
fr: Ex. ``Ok(314u64)`` se sérialise en ``0x013a01000000000000``
tr: Örneğin, ``Ok(314u64)``, ``0x013a01000000000000`` olarak serileştirilir
vi: Ví dụ ``Ok(314u64)`` trình tự hoá thành ``0x013a01000000000000``

source: E.g. ``Err("Uh oh")`` serializes as ``0x00050000005568206f68``
fr: Ex. ``Err("Uh oh")`` se sérialise en ``0x00050000005568206f68``
tr: Örneğin, ``Err("Uh oh")``, ```0x00050000005568206f68`` olarak serileştirilir
vi: Ví dụ ``Err("Uh oh")`` trình tự hoá thành ``0x00050000005568206f68``

source: Tuples serialize as the concatenation of their serialized elements. Similar to ``FixedList`` the number of elements is not included in the serialization because it is statically known in the type.
fr: Les tuples se sérialisent comme la concaténation de leurs éléments sérialisés. Comme pour ``FixedList``, le nombre d'éléments n'est pas inclus dans la sérialisation car il est statiquement connu dans le type.
tr: Demetler, serileştirilmiş öğelerinin birleştirilmesi olarak serileştirilir. ``FixedList``e benzer şekilde, tipte statik olarak bilindiği için öğelerin sayısı serileştirmeye dahil edilmez.
vi: Tuples trình tự hóa như là sự nối tiếp các phần tử được trình tự hóa của chúng. Tương tự như ``FixedList``, số lượng phần tử không được bao gồm trong trình tự hóa vì nó cố trình trong kiểu giá trị.

source: E.g. ``(1u32, "Hello, World!", true)`` serializes as ``0x010000000d00000048656c6c6f2c20576f726c642101``
fr: Ex. ``(1u32, "Hello, World!", true)`` se sérialise en ``0x010000000d00000048656c6c6f2c20576f726c642101``
tr: Örneğin, ``(1u32, "Hello, World!", true)``, ``0x010000000d00000048656c6c6f2c20576f726c642101`` olarak serileştirilir
vi: Ví dụ ``(1u32, "Hello, World!", true)`` trình tự hoá thành ``0x010000000d00000048656c6c6f2c20576f726c642101``

source: A ``Map`` serializes as a list of key-value tuples. There must be a well-defined ordering on the keys, and in the serialization, the pairs are listed in ascending order. This is done to ensure determinism in the serialization, as ``Map`` data structures can be unordered.
fr: Une "Map" se sérialise comme une liste de tuples clé-valeur. Il doit y avoir un ordre bien défini sur les clés, et dans la sérialisation, les paires sont listées par ordre croissant. Ceci est fait pour assurer le déterminisme dans la sérialisation, car les structures de données ``Map`` peuvent être non ordonnées.
tr: Bir ``Map``, anahtar/değer demetlerinin bir listesi olarak serileştirilir. Anahtarlarda iyi tanımlanmış bir sıralama olmalı ve serileştirmede çiftler artan sırada listelenir. Bu, ``Map`` veri yapıları sırasız olabileceğinden, serileştirmede belirliliği sağlamak için yapılır.
vi: Một ``Map`` trình tự hóa dưới dạng danh sách các bộ giá trị khóa. Phải có một thứ tự được xác định rõ ràng trên các khóa và trong trình tự hóa, các cặp được liệt kê theo thứ tự tăng dần. Điều này được thực hiện để đảm bảo tính xác định trong trình tự hóa, vì cấu trúc dữ liệu ``Map`` có thể không có thứ tự.

source: ``URef`` values serialize as the concatenation of its address (which is a fixed-length list of ``u8``) and a single byte tag representing the access rights. Access rights are converted as follows:
fr: Les valeurs ``URef`` se sérialisent comme la concaténation de leur adresse (qui est une liste de longueur fixe de ``u8``) et d'un tag d'un octet représentant les droits d'accès. Les droits d'accès sont convertis comme suit :
tr: ``URef`` değerleri, adresinin (``u8`` sabit uzunluklu listesidir) ve erişim haklarını temsil eden tek bir bayt etiketinin birleşimi olarak serileştirilir. Erişim hakları aşağıdaki gibi dönüştürülür:
vi: Các giá trị ``URef`` được trình tự hóa dưới dạng nối địa chỉ của nó (là danh sách có độ dài cố định của ``u8``) và một byte tag đơn đại diện cho các quyền truy cập. Quyền truy cập được chuyển đổi như sau:

source: Access Rights
tr: Erişim Hakları
vi: Quyền truy cập

source: Serialization
tr: Serileştirme
vi: Trình tự hoá

source: ``PublicKey`` serializes as a single byte tag representing the algorithm followed by 32 bytes of the ``PublicKey`` itself:
fr: La ``PublicKey`` est sérialisée sous la forme d'un tag d'un octet représentant l'algorithme, suivie de 32 octets de la ``PublicKey`` elle-même :
tr: ``PublicKey``, algoritmayı ve ardından ``PublicKey``'in 32 baytını temsil eden tek bir bayt etiketi olarak serileştirilir:
vi: ``PublicKey`` trình tự hóa dưới dạng một byte tag đơn và đại diện cho thuật toán tiếp theo là 32 byte của chính ``PublicKey``:

source: If the ``PublicKey`` is an ``Ed25519`` key, the single tag byte is ``1`` followed by the individual bytes of the serialized key.
fr: Si la ``PublicKey``est une clé ``Ed25519``, l'octet de tag unique est ``1`` suivi des octets individuels de la clé sérialisée.
tr: ``PublicKey`` bir ``Ed25519`` anahtarıysa, tek etiket baytı ``1`` ve ardından serileştirilmiş anahtarın tekil baytlarI gelir.
vi: Nếu ``PublicKey`` là khóa ``Ed25519``, thì byte tag đơn là ``1`` tiếp theo là các byte riêng lẻ của khóa được trình tự hóa.

source: If the ``PublicKey`` is a ``Secp256k1`` key, the single tag byte is a ``2`` followed by the individual bytes of the serialized key.
fr: Si la ``PublicKey``est une clé ``Secp256k1``, l'octet de tag unique est ``2`` suivi des octets individuels de la clé sérialisée.
tr: ``PublicKey`` bir ``Secp256k1`` anahtarıysa, tek etiket baytı bir ``2`` ve ardından serileştirilmiş anahtarın tekil baytlarıdır.
vi: Nếu ``PublicKey`` là khóa ``Secp256k1``, thì byte tag đơn là ``2`` tiếp theo là các byte riêng lẻ của khóa được trình tự hóa.

source: ``Key`` values serialize as a single byte tag representing the variant, followed by the serialization of the data that variant contains. For most variants, this is simply a fixed-length 32-byte array. The exception is ``Key::URef``, which contains a ``URef``; so its data serializes per the description above. The tags are as follows: ``Key::Account`` serializes as ``0``, ``Key::Hash`` as ``1``, ``Key::URef`` as ``2``.
fr: Les valeurs "Key" sont sérialisées sous la forme d'un tag d'un seul octet représentant la variante, suivi de la sérialisation des données que cette variante contient. Pour la plupart des variantes, il s'agit simplement d'un tableau de 32 octets de longueur fixe. L'exception est ``Key::URef``, qui contient un ``URef`` ; ses données sont donc sérialisées selon la description ci-dessus. Les tags sont les suivantes : ``Key::Account`` se sérialise comme ``0``, ``Key::Hash`` comme ``1``, ``Key::URef`` comme ``2``.
tr: ``Key`` değerleri, varyantı temsil eden tek bir bayt etiketi olarak serileştirilir, ardından varyantın içerdiği verilerin serileştirilmesi gelir. Çoğu varyant için bu, yalnızca sabit uzunluklu 32 baytlık bir dizidir. Bunun istisnası, bir ``URef`` içeren ``Key::URef``'tir; bu nedenle verileri yukarıdaki açıklamaya göre serileştirilir. Etiketler şu şekildedir: ``Key::Account``, ``0`` olarak; ``Key::Hash``, ``1`` olarak; ``Key::URef``, ``2` olarak serileştirilir.
vi: Các giá trị ``Key`` trình tự hóa dưới dạng một byte tag đơn, đại diện cho biến thể, theo sau là trình tự hóa dữ liệu mà biến thể đó chứa. Đối với hầu hết các biến thể, đây chỉ đơn giản là một mảng 32 byte có độ dài cố định. Ngoại lệ là ``Key::URef``, chứa một `URef``; vì vậy dữ liệu của nó trình tự theo mô tả ở trên. Các thẻ như sau: ``Key::Account`` trình tự hóa thành ``0``, ``Key::Hash`` thành ``1``, ``Key::URef`` thành ``2``.
