Repository: casper-network/docs-archive
Catalog: locale/*/LC_MESSAGES/implementation/serialization-standard.po
Languages: fr, tr, vi

source: Serialization Standard
fr: Normes de sérialisation
tr: Serileştirme Standardı
vi: Tiêu chuẩn trình tự

source: We provide a custom implementation to serialize data structures used by the Casper node to their byte representation. This document details how this custom serialization is implemented, allowing developers to build a library that implements the custom serialization.
fr: Nous fournissons une implémentation personnalisée pour sérialiser les structures de données utilisées par le nœud Casper vers leur représentation en octets. Ce document détaille l'implémentation de cette sérialisation personnalisée, permettant aux développeurs de construire une librairie qui implémente la sérialisation personnalisée.
tr: Casper düğümü tarafından kullanılan veri yapılarını bayt gösterimlerine göre serileştirmek için özel bir uygulama sağlıyoruz. Bu belge, bu özel serileştirmenin nasıl uygulandığını ayrıntılarıyla anlatarak geliştiricilerin özel serileştirmeyi uygulayan bir kitaplık oluşturmasına olanak tanır.
vi: Chúng tôi cung cấp một triển khai tùy chỉnh để trình tự hóa các cấu trúc dữ liệu được sử dụng bởi nút Casper thành biểu diễn byte của chúng. Tài liệu này trình bày chi tiết cách thực hiện trình tự hóa tùy chỉnh này, cho phép các nhà phát triển xây dựng một thư viện triển khai trình tự hóa tùy chỉnh.

source: Block
fr: Bloc
tr: Blok
vi: Chuỗi khối

source: A block is the core component of the Casper linear blockchain, used in two contexts:
fr: Un bloc est le composant central de la blockchain linéaire Casper, utilisé dans deux contextes :
tr: Bir blok, Casper doğrusal blokzinciri için temel bir bileşendir, iki bağlamda kullanılır:
vi: Một khối là thành phần cốt lõi của chuỗi khối tuyến tính Casper, được sử dụng trong hai ngữ cảnh:

source: A data structure containing a collection of transactions. Blocks form the primary structure of the blockchain.
fr: Une structure de données contenant une collection de transactions. Les blocs constituent la structure primaire de la blockchain.
tr: Bir işlem yığınını içeren bir veri yapısı. Bloklar, blokzincirin birincil yapısını oluşturur.
vi: Một cấu trúc dữ liệu chứa một tập hợp các giao dịch. Các khối tạo thành cấu trúc chính của chuỗi khối.

source: A message that is exchanged between nodes containing the data structure as explained in (1).
fr: Un message qui est échangé entre les nœuds contenant la structure de données comme expliqué dans (1).
tr: (1)'de açıklandığı gibi veri yapısını içeren düğümler arasında değiş tokuş edilen bir mesaj.
vi: Một thông báo được trao đổi giữa các nút chứa cấu trúc dữ liệu như được giải thích trong (1).

source: Each block has a globally unique ID, achieved by hashing the contents of the block.
fr: Chaque bloc possède un identifiant unique au monde, obtenu par hachage du contenu du bloc.
tr: Her bloğun, bloğun içeriğinin özetinin alınmasıyla (hashing) elde edilen global olarak benzersiz bir kimliği vardır.
vi: Mỗi khối có một ID duy nhất trên toàn cầu, có được bằng cách băm nội dung của khối.

source: Each block points to its parent. An exception is the first block, which has no parent.
fr: Chaque bloc pointe vers son parent. L'exception est le premier bloc, qui n'a pas de parent.
tr: Her blok kendi üst ögesini işaret eder. İstisna ilk bloktur, onun hiçbir üst ögesi yoktur.
vi: Mỗi khối trỏ đến lớp trên của nó. Một ngoại lệ là khối đầu tiên, không có lớp trên.

source: A block is structurally defined as follows:
fr: Un bloc est structurellement défini comme suit :
tr: Bir blok yapısal olarak şu şekilde tanımlanır:
vi: Một khối được định nghĩa về cấu trúc như sau:

source: ``hash``: A hash over the header of the block.
fr: ``hash``: Un hash de l'en-tête du bloc.
tr: ``hash``: Bloğun başlığı üzerinde bir özet (hash).
vi: ``hash``: Hàm băm trên tiêu đề của khối.

source: ``header``: The header of the block that contains information about the contents of the block with additional metadata.
fr: ``En-tête`` (header): L'en-tête du bloc qui contient des informations sur le contenu du bloc avec des métadonnées supplémentaires.
tr: ``header``: Ek meta verilerle bloğun içeriği hakkında bilgi içeren bloğun başlığı.
vi: ``header``: Tiêu đề của khối chứa thông tin về nội dung của khối với siêu dữ liệu bổ sung.

source: ``body``: The block's body contains the proposer of the block and hashes of deploys and transfers contained within it.
fr: ``corps`` (body) : Le corps du bloc contient l'auteur du bloc et les hashs des déploiements et transferts qu'il contient.
tr: ``body``: Bloğun gövdesi, bloğu öneren kişiyi ve içinde bulunan dağıtımların ve aktarımların özetlerini içerir.
vi: ``body``: Phần thân của khối chứa người đề xuất khối và các hàm băm triển khai và chuyển giao bên trong nó.

source: Block hash
fr: Hash du bloc
tr: Blok özeti
vi: Băm của khối

source: The block hash is a ``Digest`` over the contents of the block Header. The ``BlockHash`` serializes as the byte representation of the hash itself.
fr: Le hash de bloc est un ``Digest`` sur le contenu de l'en-tête de bloc. Le ``BlockHash`` est sérialisé comme la représentation en octets du hash lui-même.
tr: Blok özeti, blok Başlığının içeriği üzerinde bir ``Özet``tir. ``BlockHash``, özetin kendisini bayt gösterimi olarak seri hale getirilir.
vi: Băm khối là một ``Digest`` trên nội dung của Tiêu đề khối. ``BlockHash`` tuần tự hóa như đại diện byte của chính hàm băm.

source: Block header
fr: En-tête de bloc
tr: Blok başlığı
vi: Phần đầu của khối

source: The header portion of a block, structurally, is defined as follows:
fr: La partie en-tête d'un bloc, structurellement, est définie comme suit :
tr: Bloğun başlık kısmı, yapısal olarak, şu şekilde tanımlanır:
vi: Phần đầu của một khối, về mặt cấu trúc, được định nghĩa như sau:

source: ``parent_hash``: is the hash of the parent block. It serializes to the byte representation of the parent hash. The serialized buffer of the ``parent_hash`` is 32 bytes long.
fr: ``parent_hash``: est le hash du bloc parent. Il se sérialise en une représentation en octets du hash du parent. Le tampon (buffer) sérialisé du ``parent_hash`` a une longueur de 32 octets.
tr: ``parent_hash``: üst ögenin özetidir. Üst öge özetinin bayt gösterimine serileştirilir. ``parent_hash``'in serileştirilmiş arabelleği 32 bayt uzunluğundadır.
vi: ``parent_has``: là băm của khối lớp trên. Nó trình tự hóa thành đại diện byte của băm lớp trên. Bộ đệm được trình tự hóa của ``parent_hash`` dài 32 byte.

source: ``state_root_hash``: is the global state root hash produced by executing this block's body. It serializes to the byte representation of the ``state root hash``. The serialized buffer of the ``state_root_hash`` is 32 bytes long.
fr: ``state_root_hash``: est le hash racine de l'état global produit par l'exécution du corps de ce bloc. Il se sérialise en une représentation en octets du ``state root hash`` . Le buffer sérialisé du ``state_root_hash`` a une longueur de 32 octets.
tr: ``state_root_hash``: bu bloğun gövdesini yürüterek üretilen küresel durum kök özetidir. "Durum kök özeti"nin bayt gösterimini serileştirir. ``state_root_hash``nin serileştirilmiş arabelleği 32 bayt uzunluğundadır.
vi: ``state_root_hash``: là băm gốc trạng thái toàn cục được tạo ra bằng cách thực thi phần thân của khối này. Nó trình tự hóa thành đại diện byte của ``state root hash``. Bộ đệm được trình tự hóa của ``state_root_hash`` dài 32 byte.

source: ``body_hash``: the hash of the block body. It serializes to the byte representation of the body hash. The serialized buffer of the ``body_hash`` is 32 bytes long.
fr: ``body_hash``: est le hash du corps du bloc. Il se sérialise en une représentation en octets du hash du parent. Le tampon (buffer) sérialisé du ``parent_hash`` a une longueur de 32 octets.
tr: ``body_hash``: blok gövdesinin özeti. Gövde özetinin bayt gösterimini seri hale getirir. "body_hash"ın serileştirilmiş arabelleği 32 bayt uzunluğundadır.
vi: ``body_hash``: băm phần thân của khối. Nó trình tự hóa thành đại diện byte của băm phần thân. Bộ đệm tuần tự của ``body_hash`` dài 32 byte.

source: ``random_bit``: is a boolean needed for initializing a future era. It is serialized as a single byte; true maps to 1, while false maps to 0.
fr: ``random_bit`` : est un booléen nécessaire pour initialiser une future ère. Il est sérialisé sous la forme d'un seul octet ; true (vrai) correspond à 1 et false (faux) à 0.
tr: ``random_bit``: gelecekteki bir dönemi başlatmak için gereken bir mantıksal (boolean) değeridir. Tek bir bayt olarak serileştirilir; doğru eşlemeler 1'e, yanlış eşlemeler 0'a eşlenir.
vi: ``random_bit``: là một boolean cần thiết để khởi tạo một kỷ nguyên trong tương lai. Nó được trình tự hóa thành một byte duy nhất; true ánh xạ với 1, nếu false thì ánh xạ với 0.

source: ``accumulated_seed``: A seed needed for initializing a future era. It serializes to the byte representation of the parent Hash. The serialized buffer of the ``accumulated_hash`` is 32 bytes long.
fr: ``accumulated_seed``: Une graine (seed) nécessaire pour initialiser une ère future. Il se sérialise dans la représentation en octets du Hash parent. Le buffer sérialisé du ``accumulated_hash`` a une longueur de 32 octets.
tr: ``accumulated_seed``: Gelecekteki bir dönemi başlatmak için gereken bir tohum. Üst Öge Özet'in bayt gösterimini serileştirir. ``accumulated_hash``in serileştirilmiş arabelleği 32 bayt uzunluğundadır.
vi: ``accumulated_seed``: Một từ khoá hạt giống cần thiết để khởi tạo một kỷ nguyên trong tương lai. Nó trình tự hóa thành biểu diễn byte của Hash lớp trên. Bộ đệm được trình tự hóa của ``accumulated_hash`` dài 32 byte.

source: ``era_end``: contains equivocation and reward information to be included in the terminal finalized block. It is an optional field. Thus if the field is set as ``None``, it serializes to `0`. The serialization of the other case is described in the :ref:`EraEnd<serialization-standard-era-end>` .
fr: ``era_end``: contient des informations sur l'équivoque et la récompense à inclure dans le bloc terminal finalisé. Il s'agit d'un champ facultatif. Par conséquent, si le champ est défini comme ``None``, il est sérialisé à `0`. La sérialisation de l'autre cas est décrite dans le :ref:`EraEnd<serialization-standard-era-end>` .
tr: ``era_end``: kesinleştirilmiş terminal bloğuna dahil edilecek mükerrerlik ve ödül bilgilerini içerir. İsteğe bağlı bir alandır. Böylece alan ``Yok`` olarak ayarlanırsa, `0` olarak serileşir. Diğer durumun serileştirilmesi :ref:`EraEnd<serialization-standard-era-end>` içinde açıklanmıştır.
vi: ``era_end``: chứa thông tin không rõ ràng và thông tin phần thưởng trong khối cuối cùng được hoàn thành. Nó là một trường tùy chọn. Do đó, nếu trường được đặt là ``None``, nó sẽ trình tự thành `0`. Sự trình tự của trường hợp khác được mô tả trong :ref:`EraEnd<serialization-standard-era-end>` .

source: ``timestamp``: The timestamp from when the block was proposed. It serializes as a single ``u64`` value. The serialization of a ``u64`` value is described in in the :ref:`CLValues<serialization-standard-values>` section.
fr: ``timestamp``: Le timestamp à partir duquel le bloc a été proposé. Il est sérialisé sous la forme d'une valeur unique ``u64``. La sérialisation d'une valeur ``u64`` est décrite dans la section :ref:`CLValues<serialization-standard-values>`.
tr: ``timestamp``: Bloğun önerildiği zamana ait zaman damgası. Tek bir ``u64`` değeri olarak serileşir. Bir ``u64`` değerinin serileştirilmesi :ref:`CLValues<serialization-standard-values>` bölümünde açıklanmıştır.
vi: ``timestamp``: Dấu thời gian từ khi khối được đề xuất. Nó trình tự hóa thành một giá trị ``u64`` duy nhất. Việc trình tự hóa giá trị ``u64`` được mô tả trong phần :ref:`CLValues<serialization-standard-values>`.

source: ``era_id``: Era ID in which this block was created. It serializes as a single ``u64`` value.
fr: ``era_id`` : ID de l'ère dans laquelle ce bloc a été créé. Il est sérialisé sous la forme d'une valeur unique ``u64``.
tr: ``era_id``: Bu bloğun oluşturulduğu dönem kimliği. Tek bir ``u64`` değeri olarak serileşir.
vi: ``era_id``: ID kỷ nguyên mà khối này được tạo. Nó trình tự hóa thành một giá trị ``u64`` duy nhất.

source: ``height``: The height of this block, i.e., the number of ancestors. It serializes as a single ``u64`` value.
fr: ``height``: La hauteur de ce bloc, c'est-à-dire le nombre d'ancêtres. Elle est sérialisée sous la forme d'une valeur unique ``u64``.
tr: ``height``: Bu bloğun yüksekliği, yani üst soyların sayısı. Tek bir ``u64`` değeri olarak serileşir.
vi: ``height``: Chiều cao của khối này, tức là số tổ gốc. Nó trình tự hóa thành một giá trị ``u64`` duy nhất.

source: ``protocol_version``: The version of the Casper network when this block was proposed. It is 3-element tuple containing ``u32`` values. It serializes as a buffer containing the three ``u32`` serialized values. Refer to the :ref:`CLValues<serialization-standard-values>` section on how ``u32`` values are serialized.
fr: ``protocol_version``: La version du réseau Casper lorsque ce bloc a été proposé. Il s'agit d'un tuple à 3 éléments contenant des valeurs ``u32``. Il se sérialise comme un buffer contenant les trois valeurs ``u32`` sérialisées. Se référer à la section :ref:`CLValues<serialization-standard-values>` sur comment les valeurs ``u32`` sont sérialisées.
tr: ``protocol_version``: Bu blok önerildiğinde Casper ağının sürümü. ``u32`` değerleri içeren 3 elemanlı bir demettir. Serileştirilmiş üç ``u32`` değerini içeren bir arabellek olarak serileştirilir. ``u32`` değerlerinin nasıl serileştirildiğine ilişkin :ref:`CLValues<serialization-standard-values>` bölümüne bakınız.
vi: ``protocol_version``: Phiên bản của mạng Casper khi khối này được đề xuất. Nó là bộ 3 phần tử chứa các giá trị ``u32``. Nó trình tự hóa như một bộ đệm chứa ba giá trị được trình tự hóa ``u32``. Tham khảo đến phần :ref:`CLValues<serialization-standard-values>` và cách trình tự hoá giá trị ``u32``.

source: ``EraEnd`` as represented within the block header, is a struct containing two fields.
fr: ``EraEnd`` tel que représenté dans l'en-tête du bloc, est un struct contenant deux champs.
tr: ``EraEnd`` blok başlığında gösterildiği gibi, iki alan içeren bir yapıdır.
vi: ``EraEnd`` được biểu diễn trong tiêu đề khối, là một cấu trúc chứa hai trường.

source: ``era_report``: The first field is termed as ``EraReport`` and contains information about equivocators and rewards for an era.
fr: ``era_report``: Le premier champ est appelé ``EraReport`` et contient des informations sur les équivoques et les récompenses pour une ère.
tr: ``era_report``: İlk alan ``EraReport`` olarak adlandırılır ve bir dönem için çelişkililer ve ödüller hakkında bilgi içerir.
vi: ``era_report``: Trường đầu tiên được gọi là `EraReport`` và chứa thông tin tương đương và phần thưởng cho một thời đại.

source: ``next_era_validator_weights``: The second field is map for the validators and their weights for the era to follow.
fr: ``next_era_validator_weights``: Le deuxième champ est une map pour les validateurs et leurs poids pour l'ère à suivre.
tr: ``next_era_validator_weights``: İkinci alan, doğrulayıcılar için harita ve takip eden dönem için ağırlıklarıdır.
vi: ``next_era_validator_weights``: Trường thứ hai là ánh xạ cho người xác thực và trọng số của họ cho thời đại tiếp theo.

source: ``EraReport`` itself contains two fields:
fr: ``EraReport`` contient lui-même deux champs :
tr: ``EraReport``'un kendi iki alan içerir:
vi: ``EraReport`` bản thân nó chứa hai trường:

source: ``equivocators``: A vector of ``PublicKey``.
fr: ``equivocators``: Un vecteur de ``PublicKey``.
tr: ``equivocators``: Bir ``PublicKey`` vektörü.
vi: ``equivocators``: Vector của ``PublicKey``.

source: ``rewards``: A Binary Tree Map of ``PublicKey`` and ``u64``.
fr: ``rewards``: Une map d'arbre binaire (Binary Tree Map) de ``PublicKey`` et ``u64``.
tr: ``rewards``: ``PublicKey`` ve ``u64``ün İkili Kod Ağaç Haritası.
vi: ``rewards``: Bản đồ cây nhị phân của ``PublicKey`` và ``u64``.

source: When serializing an EraReport, the buffer is first filled with the individual serialization of the PublicKey contained within the vector.
fr: Lors de la sérialisation d'un EraReport, le buffer est d'abord rempli avec la sérialisation individuelle de la PublicKey contenue dans le vecteur.
tr: Bir EraReport'u serileştirirken, arabellek ilk önce vektör içinde bulunan PublicKey'in serileştirmesiyle doldurulur.
vi: Khi tuần tự hóa một EraReport, bộ đệm đầu tiên sẽ được lấp đầy bằng cách trình tự hóa riêng lẻ PublicKey có trong vectơ.

source: If the ``PublicKey`` is an ``Ed25519`` key, the first byte within the buffer is a ``1`` followed by the individual bytes of the serialized key.
fr: Si la ``PublicKey`` est une clé ``Ed25519``, le premier octet du buffer est un ``1`` suivi des différents octets de la clé sérialisée.
tr: ``PublicKey`` bir ``Ed25519`` anahtarıysa, arabellek içindeki ilk bayt bir ``1`` ve ardından serileştirilmiş anahtarın bireysel baytlarıdır.
vi: Nếu ``PublicKey`` là khoá ``Ed25519``, byte đầu tiên trong bộ đệm là ``1`` theo sau là các byte riêng lẻ của khóa được trình tự hóa.

source: If the ``PublicKey`` is an ``Secp256k1`` key, the first byte within the buffer is a ``2`` followed by the individual bytes of the serialized key.
fr: Si la ``PublicKey`` est une clé ``Secp256k1``, le premier octet du buffer est un ``2`` suivi des différents octets de la clé sérialisée.
tr: ``PublicKey`` bir ``Secp256k1`` anahtarıysa, arabellek içindeki ilk bayt bir ``2`` ve ardından serileştirilmiş anahtarın bireysel baytlarıdır.
vi: Nếu ``PublicKey`` là khoá ``Secp256k1``, byte đầu tiên của bộ đệm là ``2`` theo sau là các byte riêng lẻ của khóa được trình tự hóa.

source: When serializing the overarching struct of ``EraEnd``, we first allocate a buffer, which contains the serialized representation of the ``EraReport`` as described above, followed by the serialized BTreeMap.
fr: Lors de la sérialisation de la structure globale de ``EraEnd``, nous allouons d'abord un buffer, qui contient la représentation sérialisée de ``EraReport`` comme décrit ci-dessus, suivie de la BTreeMap sérialisée.
tr: ``EraEnd``'in kapsayıcı yapısını serileştirirken, önce yukarıda açıklandığı gibi ``EraReport``'un serileştirilmiş gösterimini ve ardından serileştirilmiş BTreeMap'i içeren bir arabellek ayırırız.
vi: Khi trình tự hóa cấu trúc bao trùm của ``EraEnd``, trước tiên chúng tôi cấp phát một bộ đệm, chứa phần biểu diễn được trình tự hóa của ``EraReport`` như được mô tả ở trên, tiếp theo là Bản đồ BTreeMap được trình tự hóa.

source: Note that ``EraEnd`` is an optional field. Thus the above scheme only applies if there is an ``EraEnd``; if there is no era end, the field simply serializes to `0`.
fr: Notez que ``EraEnd`` est un champ optionnel. Ainsi, le schéma ci-dessus ne s'applique que s'il y a un ``EraEnd`` ; s'il n'y a pas de fin d'ère, le champ est simplement sérialisé à `0`.
tr: ``EraEnd`` isteğe bağlı bir alandır. Bu nedenle, yukarıdaki şema yalnızca bir ``EraEnd`` varsa geçerlidir; dönem sonu yoksa, alan basitçe `0` olarak serileştirilir.
vi: Lưu ý rằng ``EraEnd`` là một trường tùy chọn. Do đó, lược đồ trên chỉ áp dụng nếu có ``EraEnd``; Nếu không có kỷ nguyên kết thúc, trường chỉ cần trình tự hóa thành `0`.

source: Body
fr: Corps
tr: Gövde (Body)
vi: Phần thân

source: The body portion of the block is structurally defined as:
fr: La partie corps (body) du bloc est structurellement définie comme suit :
tr: Bloğun gövde kısmı yapısal olarak şu şekilde tanımlanır:
vi: Phần thân của khối được định nghĩa cấu trúc là:

source: ``proposer``: The PublicKey which proposed this block.
fr: ``proposer``: La clé publique qui a proposé ce bloc.
tr: ``proposer``: Bu bloğu öneren PublicKey.
vi: ``proposer``: PublicKey đã đề xuất khối này.

source: ``deploy_hashes``: Is a vector of hex-encoded hashes identifying Deploys included in this block.
fr: ``deploy_hashes``: Est un vecteur de hashs en hexadécimal identifiant les déploiements inclus dans ce bloc.
tr: ``deploy_hashes``: Bu bloğa dahil edilen Dağıtımları tanımlayan onaltılık kodlu özetlerin bir vektörüdür.
vi: ``deploy_hashes``: Là một vectơ gồm các hàm băm được mã hóa hex và xác định các Triển khai (Deploys) được đưa vào trong khối này.

source: ``transfer_hashes``: Is a vector of hex-encoded hashes identifying Transfers included in this block.
fr: ``transfer_hashes``: Est un vecteur de hashs en hexadécimal identifiant les Transferts inclus dans ce bloc.
tr: ``transfer_hashes``: Bu bloğa dahil edilen Transferleri tanımlayan onaltılık kodlu özetlerin bir vektörüdür.
vi: ``transfer_hashes``: Là một vectơ gồm các hàm băm được mã hóa hex và xác định các Chuyển giao (Transfers) được bao gồm trong khối này.

source: When we serialize the ``BlockBody``, we create a buffer that contains the serialized representations of the individual fields present within the block.
fr: Lorsque nous sérialisons le ``BlockBody``, nous créons un buffer qui contient les représentations sérialisées des champs individuels présents dans le bloc.
tr: ``BlockBody``yi serileştirdiğimizde, blok içinde bulunan bireysel alanların serileştirilmiş temsillerini içeren bir arabellek oluştururuz.
vi: Khi chúng tôi trình tự hóa ``BlockBody`` chúng tôi tạo một bộ đệm chứa các đại diện được trình tự hóa của các trường riêng lẻ có trong khối.

source: ``proposer``: serializes to the byte representation of the ``PublicKey``. If the ``PublicKey`` is an ``Ed25519`` key, then the first byte within the serialized buffer is 1 followed by the bytes of the key itself; else, in the case of ``Secp256k1``, the first byte is 2.
fr: ``proposer``: sérialise la représentation en octets de la ``PublicKey``. Si la ``PublicKey`` est une clé ``Ed25519``, alors le premier octet du tampon sérialisé est 1 suivi des octets de la clé elle-même ; sinon, dans le cas de ``Secp256k1``, le premier octet est 2.
tr: ``proposer``: ``PublicKey``'in bayt temsilini serileştirir. ``PublicKey`` bir ``Ed25519`` anahtarıysa, serileştirilmiş arabellek içindeki ilk bayt 1'dir ve ardından anahtarın baytları gelir; Aksi takdirde, ``Secp256k1`` durumunda ilk bayt 2'dir.
vi: ``proposer``: trình tự hóa thành biểu diễn byte của ``PublicKey``. Nếu ``PublicKey`` là khóa ``Ed25519``, thì byte đầu tiên trong bộ đệm `trình tự hóa là 1, tiếp theo là các byte của chính khóa đó; ngoài ra, trong trường hợp của ``Secp256k1``, byte đầu tiên là 2.

source: ``deploy_hashes``: serializes to the byte representation of all the deploy_hashes within the block header. Its length is ``32 * n``, where n denotes the number of deploy hashes present within the body.
fr: ``deploy_hashes``: sérialise la représentation en octets de tous les deploy_hashes dans l'en-tête du bloc. Sa longueur est de ``32 * n``, où n désigne le nombre de hashs deploy présents dans le corps.
tr: ``deploy_hashes``: blok başlığındaki tüm deploy_hashes'lerinin bayt gösterimini serileştirir. Uzunluğu ``32 * n`` dir, burada n, gövde içinde bulunan dağıtım özetlerinin sayısını gösterir.
vi: ``deploy_hashes``: trình tự hóa thành biểu diễn byte của tất cả các deploy_hashes trong tiêu đề khối. Độ dài của nó là ``32 * n``, trong đó n biểu thị số lượng băm triển khai có trong phần thân.
