Repository: casper-network/docs-archive
Catalog: locale/*/LC_MESSAGES/implementation/serialization-standard.po
Languages: fr, tr, vi

source: ``CLType`` itself also has rules for serialization. A ``CLType`` serializes as a single-byte tag, followed by the concatenation of serialized inner types, if any (e.g., lists and tuples have inner types). ``FixedList`` is a minor exception because it also includes the length in the type. However, the length is included in the serialization (as a 32-bit integer, per the serialization rules above), following the serialization of the inner type. The tags are as follows:
fr: ``CLType`` lui-même a également des règles pour la sérialisation. Un ``CLType`` se sérialise comme un tag d'un seul octet, suivi de la concaténation de types internes sérialisés, s'il y en a (par exemple, les listes et les tuples ont des types internes). ``FixedList`` est une exception mineure car il inclut également la longueur dans le type. Cependant, la longueur est incluse dans la sérialisation (en tant qu'entier de 32 bits, conformément aux règles de sérialisation ci-dessus), après la sérialisation du type interne. Les tags sont les suivants :
tr: ``CLType`` kendisi de serileştirme için kurallara sahiptir. Bir ``CLType``, tek baytlık bir etiket olarak serileştirilir, ardından varsa serileştirilmiş iç türlerin birleştirilmesi izler (örneğin, listeler ve demetlerin iç türleri vardır). ``FixedList``, türde uzunluğu da içerdiğinden küçük bir istisnadır. Ancak uzunluk, iç türün serileştirilmesini takiben serileştirmeye dahil edilir (yukarıdaki serileştirme kurallarına göre 32 bit tam sayı olarak). Etiketler aşağıdaki gibidir:
vi: Bản thân ``CLType`` cũng có các quy tắc để trình tự hóa. Một ``CLType`` trình tự hóa dưới dạng byte tag đơn, theo sau là nối các kiểu bên trong được trình tự hóa, nếu có (ví dụ: danh sách và bộ dữ liệu có các kiểu bên trong). ``FixedList`` là một ngoại lệ nhỏ vì nó cũng bao gồm độ dài trong kiểu. Tuy nhiên, độ dài được bao gồm trong trình tự hóa (dưới dạng số nguyên 32 bit, theo các quy tắc trình tự hóa ở trên), tiếp theo là trình tự hóa kiểu bên trong. Các tag như sau:

source: Serialization Tag
fr: Tag de sérialisation
tr: Serileştirme Etiketi
vi: Thẻ trình tự hóa

source: A complete ``CLValue``, including both the data and the type, can also be serialized (to store it in the global state). This is done by concatenating: the serialization of the length (as a 32-bit integer) of the serialized data (in bytes), the serialized data itself, and the serialization of the type.
fr: Une ``CLValue`` complète, comprenant à la fois les données et le type, peut également être sérialisée (pour la stocker dans l'état global). Cela se fait en concaténant : la sérialisation de la longueur (en tant qu'entier 32 bits) des données sérialisées (en octets), les données sérialisées elles-mêmes, et la sérialisation du type.
tr: Hem verileri hem de türü içeren eksiksiz bir ``CLValue`` da serileştirilebilir (küresel durumda depolamak için). Bu, şunları birleştirerek yapılır: serileştirilmiş verilerin (bayt cinsinden) uzunluğunun (32 bit tam sayı olarak) serileştirilmişi, serileştirilmiş verilerin kendisinin ve türün serileştirilmesi.
vi: Một ``CLValue`` hoàn chỉnh, bao gồm cả dữ liệu và kiểu, cũng có thể được trình tự hóa (để lưu trữ nó ở trạng thái toàn cục). Điều này được thực hiện bằng cách nối: trình tự hóa độ dài (dưới dạng số nguyên 32 bit) của dữ liệu được trình tự hóa (tính bằng byte), bản thân dữ liệu được trình tự hóa và kiểu được trình tự hóa.

source: Contracts
fr: Contrats
tr: Kontratlar
vi: Hợp đồng

source: Contracts are a special value type because they contain the on-chain logic of the applications running on the Casper network. A *contract* contains the following data:
fr: Les Contrats sont un type de valeur particulier car ils contiennent la logique on-chain des applications fonctionnant sur le réseau Casper. Un *contract* contient les données suivantes :
tr: Kontratlar, Casper ağında çalışan uygulamaların zincir üzerindeki mantığını içerdikleri için özel bir değer türüdür. Bir *kontrat* aşağıdaki verileri içerir:
vi: Hợp đồng là một loại giá trị đặc biệt vì chúng chứa logic trên chuỗi của các ứng dụng chạy trên mạng Casper. *Hợp đồng* chứa dữ liệu sau:

source: a `wasm module <https://webassembly.org/docs/modules/>`__
fr: un `module wasm <https://webassembly.org/docs/modules/>`__
tr: bir `wasm modülü <https://webassembly.org/docs/modules/>`__
vi: `wasm mô-đun <https://webassembly.org/docs/modules/>`__

source: a collection of named keys
fr: une collection de clés nommées (named keys)
tr: adlandırılmış anahtarların bir toplamı
vi: một tập hợp các khóa được đặt tên

source: a protocol version
fr: une version du protocole
tr: protokol sürümü
vi: một phiên bản giao thức

source: The wasm module must contain a function named ``call``, which takes no arguments and returns no values. This is the main entry point into the contract. Moreover, the module may import any of the functions supported by the Casper runtime; a list of all supported functions can be found in :ref:`Appendix A <appendix-a>`.
fr: Le module wasm doit contenir une fonction nommée ``call``, qui ne prend aucun argument et ne renvoie aucune valeur. Il s'agit du principal point d'entrée dans le contrat. De plus, le module peut importer n'importe quelle fonction supportée par le runtime Casper ; une liste de toutes les fonctions supportées peut être trouvée dans :ref:`Annexe A <appendix-a>`.
tr: wasm modülü, hiçbir argüman almayan ve hiçbir değer döndürmeyen ``call`` adlı bir işlev içermelidir. Bu, kontrata ana giriş noktasıdır. Ayrıca modül, Casper çalışma zamanı tarafından desteklenen işlevlerden herhangi birini içe aktarabilir; desteklenen tüm işlevlerin bir listesi :ref:`Ek A <appendix-a>`da bulunabilir.
vi: Mô-đun wasm phải chứa một hàm có tên là ``call``, hàm này không nhận đối số và không trả về giá trị nào. Đây là điểm vào chính trong hợp đồng. Hơn nữa, mô-đun có thể nhập bất kỳ hàm nào được hỗ trợ bởi thời điểm chạy Casper; danh sách tất cả các hàm được hỗ trợ có thể được tìm thấy trong :ref: `Phụ lục A <appendix-a>`.

source: Note: though the ``call`` function signature has no arguments and no return value, within the ``call`` function body, the ``get_named_arg`` runtime function can be used to accept arguments (by ordinal), and the ``ret`` runtime function can be used to return a single ``CLValue`` to the caller.
fr: Note : bien que la signature de la fonction ``call`` n'ait pas d'arguments et pas de valeur de retour, dans le corps de la fonction ``call``, la fonction d'exécution ``get_named_arg`` peut être utilisée pour accepter des arguments (by ordinal), et la fonction d'exécution ``ret`` peut être utilisée pour retourner une seule ``CLValue`` à l'appelant.
tr: Not: ``call`` fonksiyonu imzasının argümanları ve dönüş değeri olmamasına rağmen, ``call`` fonksiyon gövdesi içinde ``get_named_arg`` çalışma zamanı fonksiyonu, argümanları (sıraya göre) kabul etmek için kullanılabilir ve ``ret`` çalışma zamanı işlevi, çağırana tek bir ``CLValue`` döndürmek için kullanılabilir.
vi: Lưu ý: mặc dù chữ ký hàm ``call`` không có đối số và không có giá trị trả về, trong thân hàm ``call``, hàm thời điểm chạy ``get_named_arg`` có thể được sử dụng để chấp nhận các đối số (theo thứ tự) và hàm điểm gian chạy ``ret`` có thể được sử dụng để trả về một ``CLValue`` duy nhất cho người gọi.

source: The named keys are used to give human-readable names to keys in the global state, which are essential to the contract. For example, the hash key of another contract it frequently calls may be stored under a meaningful name. It is also used to store the ``URef``\ s, which are known to the contract (see the section on Permissions for details).
fr: Les clés nommées sont utilisées pour donner des noms lisibles aux clés de l'état global, qui sont essentielles au contrat. Par exemple, la clé de hash d'un autre contrat qu'il appelle fréquemment peut être stockée sous un nom significatif. Il est également utilisé pour stocker les ``URef``, qui sont connus du contrat (voir la section sur les permissions pour plus de détails).
tr: Adlandırılmış anahtarlar, kontrat için gerekli olan küresel durumdaki anahtarlara okunabilir adlar vermek için kullanılır. Örneğin, sık çağırdığı başka bir kontratın özet anahtarı, anlamlı bir ad altında saklanabilir. Ayrıca kontratta bilinen ``URef``\ leri saklamak için de kullanılır (ayrıntılar için İzinler bölümüne bakınız).
vi: Các khóa được đặt tên được sử dụng để đặt tên mà con người có thể đọc được cho các khóa ở trạng thái toàn cục, điều này rất cần thiết cho hợp đồng. Ví dụ, khóa băm của một hợp đồng khác mà nó thường gọi có thể được lưu trữ dưới một tên có nghĩa. Nó cũng được sử dụng để lưu trữ các ``URef``, được biết đến trong các hợp đồng (xem phần Quyền để biết chi tiết).

source: Each contract specifies the Casper protocol version that was active when the contract was written to the global state.
fr: Chaque contrat spécifie la version du protocole Casper qui était active lorsque le contrat a été écrit dans l'état global.
tr: Her sözleşme, sözleşme küresel duruma yazıldığında etkin olan Casper protokol sürümünü belirtir.
vi: Mỗi hợp đồng chỉ định phiên bản giao thức Casper đã hoạt động khi hợp đồng được ghi ở trạng thái toàn cục.

source: Keys
fr: Clés
tr: Anahtarlar
vi: Khoá

source: In this chapter, we describe what constitutes a “key”, the permissions model for the keys, and how they are serialized.
fr: Dans ce chapitre, nous décrivons ce qui constitue une "clé" (key), le modèle de permissions pour les clés, et comment elles sont sérialisées.
tr: Bu bölümde, “key”ı neyin oluşturduğunu, anahtarlar için izin modelini ve bunların nasıl seri hale getirildiğini açıklıyoruz.
vi: Trong chương này, chúng tôi mô tả những gì cấu thành một “key”, mô hình quyền cho các khóa và cách chúng được trình tự hóa.

source: A *key* in the :ref:`Global State<global-state-intro>` is one of the following data types:
fr: Une *clé* (key) dans le :ref:`Global State<global-state-intro>` est l'un des types de données suivants :
tr: :ref:`Global State<global-state-intro>` içindeki bir *anahtar*, aşağıdaki veri türlerinden biridir:
vi: *Key* trong :ref:`Trạng thái toàn cục<global-state-intro>` là một trong các kiểu dữ liệu sau:

source: 32-byte account identifier (called an “account identity key”)
fr: identifiant du compte de type 32-byte (appelé "account identity key")
tr: 32 baytlık hesap tanımlayıcısı ("hesap kimliği anahtarı" olarak adlandırılır)
vi: Mã định danh tài khoản 32 byte (được gọi là “khóa định dạng tài khoản”)

source: 32-byte immutable contract identifier (called a “hash key”)
fr: Identifiant de contrat immuable de type 32-byte (appelé “hash key”)
tr: 32 baytlık değişmez sözleşme tanımlayıcısı ("özet anahtarı" olarak adlandırılır)
vi: Mã định danh hợp đồng bất biến 32 byte (được gọi là “khóa băm”)

source: 32-byte reference identifier (called an “unforgeable reference”)
fr: Identifiant de référence de type 32-byte (appelé “unforgeable reference”)
tr: 32 baytlık referans tanımlayıcısı ("yenilmez referans" olarak adlandırılır)
vi: Mã định danh tham chiếu 32 byte (được gọi là “tham chiếu không thể giả mạo”)

source: 32-byte transfer identifier
fr: Identifiant de transfert de type 32-byte.
tr: 32 baytlık transfer tanımlayıcısı
vi: Mã định danh chuyển 32 byte

source: 32-byte deploy information identifier
fr: Identifiant d'information de déploiement de type 32-byte
tr: 32 baytlık dağıtım bilgisi tanımlayıcısı
vi: Mã định danh thông tin triển khai 32 byte

source: 32-byte purse balance identifier
fr: Identifiant de solde de porte-monnaie (purse balance identifier) de type 32-byte
tr: 32 baytlık çanta bakiyesi tanımlayıcısı
vi: Mã định danh số dư ví 32 byte

source: 32-byte Auction bid identifier
fr: Identifiant de l'enchère (Auction bid identifier) de type 32-byte
tr: 32 bayt Açık Arttırma teklif tanımlayıcısı
vi: Mã định danh giá thầu của Phiên đấu giá 32 byte

source: 32-byte Auction withdrawal identifier
fr: Identifiant de retrait d'enchères (Auction withdrawal identifier) de type 32-byte
tr: 32 bayt Açık Arttırma geri çekme tanımlayıcısı
vi: Mã định danh rút tiền trong Phiên đấu giá 32 byte

source: The one exception to note here is the identifier for ``EraInfo``, which actually serializes as a ``u64`` value with an additional byte for the tag.
fr: La seule exception à noter ici est l'identifiant pour ``EraInfo``, qui est en fait sérialisé comme une valeur ``u64`` avec un octet supplémentaire pour le tag.
tr: Burada dikkate alınması gereken bir istisna, aslında etiket için ek bir bayt ile ``u64`` değeri olarak seri hale getirilen ``EraInfo`` tanımlayıcısıdır.
vi: Một ngoại lệ cần lưu ý ở đây là định danh cho ``EraInfo``, thực sự trình tự hóa dưới dạng giá trị ``u64`` với một byte bổ sung cho tag.

source: Account identity key
tr: Hesap kimliği anahtarı
vi: Khóa định danh tài khoản

source: This key type is used specifically for accounts in the global state. All accounts in the system must be stored under an account identity key, and no other types. The 32-byte identifier which represents this key is derived from the ``blake2b256`` hash of the public key used to create the associated account (see :ref:`Accounts <accounts-associated-keys-weights>` for more information).
fr: Ce type de clé est utilisé spécifiquement pour les comptes dans l'état global. Tous les comptes du système doivent être stockés sous une clé d'identité de compte (account identity key), et aucun autre type. L'identifiant de 32 octets qui représente cette clé est dérivé du hachage ``blake2b256`` de la clé publique utilisée pour créer le compte associé. (voir :ref:`Comptes <accounts-associated-keys-weights>` pour plus d'information).
tr: Bu anahtar türü, özellikle küresel durumdaki hesaplar için kullanılır. Sistemdeki tüm hesaplar bir hesap kimlik anahtarı altında saklanmalı ve başka hiçbir türde saklanmamalıdır. Bu anahtarı temsil eden 32 baytlık tanımlayıcı, ilişkili hesabı oluşturmak için kullanılan genel anahtarın ``blake2b256`` özet değerinden türetilmiştir (daha fazla bilgi için bkz. :ref:`Accounts <accounts-associated-keys-weights>`).
vi: Loại khóa này được sử dụng đặc biệt cho các tài khoản ở trạng thái toàn cục. Tất cả các tài khoản trong hệ thống phải được lưu trữ dưới một khóa nhận dạng tài khoản và không có các loại khác. Mã định danh 32 byte đại diện cho khóa này được lấy từ băm ``blake2b256`` của khóa công khai được sử dụng để tạo tài khoản được liên kết (xem :ref:`Tài khoản <accounts-associated-keys-weights>` để biết thêm chi tiết).

source: Hash key
tr: Özet (hash) anahtarı
vi: Khoá băm

source: This key type is used for storing contracts immutably. Once a contract is written under a hash key, that contract can never change. The 32-byte identifier representing this key is derived from the ``blake2b256`` hash of the deploy hash (see :ref:`block-structure-head` for more information) concatenated with a 4-byte sequential ID. The ID begins at zero for each deploy and increments by one each time a contract is stored. The purpose of this ID is to allow each contract stored in the same deploy to have a unique key.
fr: Ce type de clé est utilisé pour stocker les contrats de manière immuable. Une fois qu'un contrat est écrit sous une clé de hash, ce contrat ne peut jamais changer. L'identifiant de 32 octets représentant cette clé est dérivé du hachage ``blake2b256`` du deploy hash (voir :ref:`block-structure-head` pour plus d'informations) concaténé avec un ID séquentiel de 4 octets. L'ID commence à zéro pour chaque déploiement et s'incrémente de un à chaque fois qu'un contrat est stocké. L'objectif de cet ID est de permettre à chaque contrat stocké dans le même déploiement d'avoir une clé unique.
tr: Bu anahtar türü, kontratları değişmez bir şekilde saklamak için kullanılır. Bir özet anahtarının altına bir kontrat yazıldığında, o kontrat asla değişmez. Bu anahtarı temsil eden 32 baytlık tanımlayıcı, 4 baytlık sıralı bir kimlikle birleştirilmiş dağıtım özetinin ``blake2b256`` özetinden türemiştir (daha fazla bilgi için bkz :ref:`block-structure-head` ). Kimlik, her dağıtım için sıfırdan başlar ve kontrat her depolandığında bir artar. Bu kimliğin amacı, aynı dağıtımda depolanan her kontratın benzersiz bir anahtara sahip olmasına izin vermektir.
vi: Loại khóa này được sử dụng để lưu trữ các hợp đồng bất biến. Một khi hợp đồng được viết dưới khóa băm, hợp đồng đó không bao giờ có thể thay đổi. Mã định danh 32 byte đại diện cho khóa này được lấy từ băm ``blake2b256`` của băm triển khai (xem :ref: `block-structure-head` để biết thêm thông tin) được nối với ID tuần tự 4 byte. ID bắt đầu bằng 0 cho mỗi lần triển khai và tăng dần mỗi lần một hợp đồng được lưu trữ. Mục đích của ID này là cho phép mỗi hợp đồng được lưu trữ trong cùng một triển khai có một khóa duy nhất.

source: Unforgeable Reference (``URef``)
fr: Référence infalsifiable (URef) (Unforgeable Reference )
tr: Taklit Edilemez Referans (``URef``)
vi: Tham chiếu không thể giả mạo (``URef``)

source: ``URef`` broadly speaking can be used to store values and manage permissions to interact with the value stored under the ``URef``. ``URef`` is a tuple which contains the address under which the values are stored and the Access rights to the ``URef``. Refer to the :ref:`Unforgeable Reference<uref-head>` section for details on how ``URefs`` are managed.
fr: ``URef`` peut être utilisé pour stocker des valeurs et gérer les droits d'interaction avec la valeur stockée sous ``URef``. ``URef`` est un tuple qui contient l'adresse sous laquelle les valeurs sont stockées et les droits d'accès à la ``URef``. Reportez-vous à la section :ref:`Unforgeable Reference<uref-head>` pour plus de détails sur la façon dont les ``URefs`` sont gérés.
tr: Genel olarak ``URef``, değerleri depolamak ve ``URef`` altında depolanan değerle etkileşime girmek için izinleri yönetmek için kullanılabilir. "URef", değerlerin saklandığı adresi ve ``URef``e erişim haklarını içeren bir tanımlama demetidir. ``URef``lerin nasıl yönetildiğine ilişkin ayrıntılar için :ref:`Unforgeable Reference<uref-head>` bölümüne bakın.
vi: Nói rộng ra, ``URef`` có thể được sử dụng để lưu trữ các giá trị và quản lý quyền tương tác với giá trị được lưu trữ trong ``URef``. ``URef`` là một bộ chứa địa chỉ mà các giá trị được lưu trữ và các quyền Truy cập đối với ``URef``. Tham khảo phần :ref: `Tham chiếu không thể giả mạo<uref-head>` để biết cách quản lý ``URef``.

source: Transfer Key
tr: Transfer Anahtarı
vi: Khóa chuyển khoản

source: This key type is used specifically for transfers in the global state. All transfers in the system must be stored under a transfer key and no other type. The 32-byte identifier which represents this key is derived from the ``blake2b256`` hash of the transfer address associated with the given transfer
fr: Ce type de clé est utilisé spécifiquement pour les transferts dans l'état global. Tous les transferts dans le système doivent être stockés sous une clé de transfert et aucun autre type. L'identifiant de 32 octets qui représente cette clé est dérivé du hachage ``blake2b256`` de l'adresse de transfert associée au transfert donné.
tr: Bu anahtar türü, özellikle küresel durumdaki aktarımlar için kullanılır. Sistemdeki tüm transferler bir transfer anahtarı altında saklanmalı ve başka bir türde saklanmamalıdır. Bu anahtarı temsil eden 32 baytlık tanımlayıcı, verilen aktarımla ilişkili aktarım adresinin ``blake2b256`` özet değerinden türetilir.
vi: Loại khóa này được sử dụng đặc biệt để chuyển tiền trong trạng thái toàn cục. Tất cả các chuyển khoản trong hệ thống phải được lưu trữ dưới một khóa chuyển và không có loại nào khác. Định danh 32 byte đại diện cho khóa này được lấy từ băm ``blake2b256`` của địa chỉ chuyển khoản được liên kết với địa chỉ chuyển khoản đã cho

source: DeployInfo Key
tr: DeployInfo Anahtarı
vi: Khóa DeployInfo

source: This key type is used specifically for storing information related to deploys in the global state. Information for a given deploy is stored under this key only. The 32-byte identifier which represents this key is derived from the ``blake2b256`` hash of the deploy itself.
fr: Ce type de clé est utilisé spécifiquement pour stocker les informations relatives aux déploiements dans l'état global. Les informations relatives à un déploiement donné ne sont stockées que sous cette clé. L'identifiant de 32 octets qui représente cette clé est dérivé du hachage ``blake2b256`` du déploiement lui-même.
tr: Bu anahtar türü, özellikle küresel durumdaki dağıtımlarla ilgili bilgileri depolamak için kullanılır. Belirli bir dağıtım için bilgiler yalnızca bu anahtar altında depolanır. Bu anahtarı temsil eden 32 baytlık tanımlayıcı, dağıtımın kendisinin ``blake2b256`` özet değerinden türetilir.
vi: Loại khóa này được sử dụng đặc biệt để lưu trữ thông tin liên quan đến triển khai ở trạng thái toàn cục. Thông tin cho một triển khai nhất định chỉ được lưu trữ trong khóa này. Mã định danh 32 byte đại diện cho khóa này được lấy từ băm ``blake2b256`` của chính quá trình triển khai.

source: EraInfo Key
tr: EraInfo Anahtarı
vi: Khoá EraInfo

source: This key type is used specifically for storing information related to the ``Auction`` metadata for a particular era. The underlying data type stored under this is a vector of the allocation of seigniorage for that given era. The identifier for this key is a new type that wraps around the primitive ``u64`` data type and co-relates to the era number when the auction information was stored.
fr: Ce type de clé est utilisé spécifiquement pour stocker les informations de déploiement dans le rapport global. Les informations relatives à un déploiement donné ne sont stockées que sous cette clé. L'identifiant de 32 octets qui représente cette clé est dérivé du hachage ``blake2b256`` du déploiement lui-même.
tr: Bu anahtar türü, belirli bir döneme ilişkin ``Auction`` meta verileriyle ilgili bilgileri depolamak için özel olarak kullanılır. Bunun altında saklanan temel veri türü, o dönem için senyoraj tahsisinin bir vektörüdür. Bu anahtarın tanımlayıcısı, ilkel ``u64`` veri türünü saran ve açık artırma bilgilerinin depolandığı dönem numarasıyla ilişkili olan yeni bir türdür.
vi: Loại khóa này được sử dụng đặc biệt để lưu trữ thông tin liên quan đến siêu dữ liệu ``Auction`` cho một kỷ nguyên cụ thể. Kiểu dữ liệu cơ bản được lưu trữ dưới đây là một vectơ phân bổ lưu trữ seigniorage cho kỷ nguyên nhất định đó. Định danh cho khóa này là một kiểu mới bao trùm kiểu dữ liệu ``u64`` nguyên thủy và đồng liên quan đến số kỷ nguyên khi thông tin đấu giá được lưu trữ.

source: Balance Key
tr: Bakiye Anahtarı
vi: Khóa số dư

source: This key type is used to store information related to the balance of a given purse. All purse balances are stored using this key. The 32-byte identifier which represents this key is derived from the Address of the URef, which relates to the purse.
fr: Ce type de clé est utilisé pour stocker les informations relatives au solde d'un porte-monnaie donné. Tous les soldes de porte-monnaie sont stockés à l'aide de cette clé. L'identifiant de 32 octets qui représente cette clé est dérivé de l'adresse de l'URef, qui se rapporte au porte-monnaie.
tr: Bu anahtar türü, belirli bir cüzdanın bakiyesiyle ilgili bilgileri depolamak için kullanılır. Tüm cüzdan bakiyeleri bu anahtar kullanılarak saklanır. Bu anahtarı temsil eden 32 baytlık tanımlayıcı, cüzdana ilişkin URef'in Adresinden türetilir.
vi: Loại khóa này được sử dụng để lưu trữ thông tin liên quan đến số dư của một ví nhất định. Tất cả số dư trong ví được lưu trữ bằng cách sử dụng khóa này. Định danh 32 byte đại diện cho khóa này được lấy từ Địa chỉ của URef, liên quan đến ví.

source: Bid Key
tr: Teklif Anahtarı
vi: Khóa giá thầu
