Repository: casper-network/docs-archive
Catalog: locale/*/LC_MESSAGES/implementation/serialization-standard.po
Languages: fr, tr, vi

source: ``transfer_hashes``: serializes to the byte representation of all the deploy_hashes within the block header. Its length is ``32 * n``, where n denotes the number of transfers present within the body.
fr: ``transfer_hashes``: sérialise la représentation en octets de tous les deploy_hash dans l'en-tête du bloc. Sa longueur est de ``32 * n``, où n désigne le nombre de transferts présents dans le corps.
tr: ``transfer_hashes``: blok başlığındaki tüm deploy_hashes'lerinin bayt gösterimini serileştirir. Uzunluğu ``32 * n`` dir, burada n, gövdede bulunan transferlerin sayısını gösterir.
vi: ``transfer_hashes``: trình tự hóa thành biểu diễn byte của tất cả các deploy_hashes trong tiêu đề khối. Chiều dài của nó là ``32 * n``, trong đó n biểu thị số lần chuyển có trong phần thân.

source: Deploy
fr: Déploiement
tr: Dağıtım
vi: Triển khai

source: A deploy is a data structure containing a smart contract and the requester's signature(s). Additionally, the deploy header contains additional metadata about the deploy itself. A deploy is structurally defined as follows:
fr: Un déploiement est une structure de données contenant un contrat intelligent et la ou les signatures du demandeur. En outre, l'en-tête du déploiement contient des métadonnées supplémentaires sur le déploiement lui-même. La structure d'un déploiement est définie comme suit :
tr: Dağıtım, akıllı bir kontratı ve istekte bulunanın imzasını/imzalarını içeren bir veri yapısıdır. Ayrıca, dağıtımın başlığı, dağıtımın kendisi hakkında ek meta veriler içerir. Bir dağıtım yapısal olarak şu şekilde tanımlanır:
vi: Triển khai là một cấu trúc dữ liệu chứa hợp đồng thông minh và (các) chữ ký của người yêu cầu. Ngoài ra, tiêu đề triển khai chứa siêu dữ liệu bổ sung về chính quá trình triển khai. Triển khai được định nghĩa theo cấu trúc như sau:

source: ``hash``: The hash of the deploy header.
fr: ``hash``: Le hash de l'en-tête de déploiement.
tr: ``hash``: Dağıtım başlığının özeti.
vi: ``hash``: Hàm băm của tiêu đề triển khai.

source: ``header``: Contains metadata about the deploy. The structure of the header is detailed further in this document.
fr: ``header``: Contient des métadonnées sur le déploiement. La structure de l'en-tête est détaillée plus loin dans ce document.
tr: ``header``: Dağıtımla ilgili meta verileri içerir. Başlığın yapısı bu belgede daha ayrıntılı olarak açıklanmıştır.
vi: ``header``: Chứa siêu dữ liệu về việc triển khai. Cấu trúc của tiêu đề được trình bày chi tiết trong tài liệu này.

source: ``payment``: The payment code for contained smart contract.
fr: ``payment``: Le code de paiement pour le contrat intelligent contenu dans le déploiement.
tr: ``payment``: Kapsanan akıllı kontrat için ödeme kodu.
vi: ``payment``: Mã thanh toán cho hợp đồng thông minh có sẵn.

source: ``session``: The stored contract itself.
fr: ``session``: Le contrat stocké lui-même.
tr: ``session``: Saklanan kontratın kendisi.
vi: ``session``: Hợp đồng lưu trữ chính nó.

source: ``approvals``: A list of signatures:
fr: ``approvals``: Une liste de signatures :
tr: ``approvals``: İmza listesi:
vi: ``approvals``: Danh sách các chữ ký:

source: The deploy hash is a digest over the contents of the deploy header. The deploy hash serializes as the byte representation of the hash itself.
fr: Le hash de déploiement est un digest du contenu de l'en-tête de déploiement. Le hash deploy est sérialisé comme la représentation en octets du hash lui-même.
tr: Dağıtım özeti, dağıtım başlığının içeriği üzerinde bir özettir. Dağıtım özeti, özetin kendisinin bayt gösterimi olarak seri hale getirilir.
vi: Băm triển khai là một bản tóm tắt nội dung của tiêu đề triển khai. Băm triển khai trình tự hóa dưới dạng biểu diễn byte của chính hàm băm.

source: ``account``: A supported public key variant (currently either ``Ed25519`` or ``Secp256k1``). An ``Ed25519`` key is serialized as a buffer of bytes, with the leading byte being ``1`` for ``Ed25519``, with remainder of the buffer containing the byte representation of the signature. Correspondingly, a ``Secp256k1`` key is serialized as a buffer of bytes, with the leading byte being ``2``.
fr: ``account`` : Une variante de clé publique supportée (actuellement soit ``Ed25519`` soit ``Secp256k1``). Une clé ``Ed25519`` est sérialisée sous la forme d'un buffer d'octets, l'octet de tête étant ``1`` pour ``Ed25519``, le reste du buffer contenant la représentation en octets de la signature. De même, une clé ``Secp256k1``est sérialisée sous forme de buffer d'octets, l'octet de tête étant ``2``.
tr: ``account``: Desteklenen bir ortak anahtar değişkeni (şu anda ``Ed25519`` veya ``Secp256k1``). Bir ``Ed25519`` anahtarı, bayt arabelleği olarak serileştirilir; baştaki bayt, ``Ed25519`` için ``1`` olur ve arabelleğin geri kalanı imzanın bayt gösterimini içerir. Buna uygun olarak, bir ``Secp256k1`` anahtarı, baştaki bayt ``2`` olacak şekilde bir bayt arabelleği olarak serileştirilir.
vi: ``account``: Một biến thể khóa công khai được hỗ trợ (hiện tại là ``Ed25519`` hoặc ``Secp256k1``). Khóa ``Ed25519`` được trình tự hóa như một bộ đệm byte, với byte đầu là ``1`` cho ``Ed25519``, với phần còn lại của bộ đệm chứa biểu diễn byte của chữ ký. Tương ứng, khóa ``Secp256k1`` được trình tự hóa dưới dạng bộ đệm các byte, với byte đầu là ``2``.

source: ``timestamp``: A timestamp is a struct that is a unary tuple containing a ``u64`` value. This value is a count of the milliseconds since the UNIX epoch. Thus the value ``1603994401469`` serializes as ``0xbd3a847575010000``
fr: ``timestamp``: Un timestamp est un tuple unaire contenant une valeur ``u64``. Cette valeur est un décompte des millisecondes depuis UNIX epoch. Ainsi, la valeur ``1603994401469`` est sérialisée en ``0xbd3a847575010000``
tr: ``timestamp``: Zaman damgası, ``u64`` değeri içeren tekli demet bir yapıdır. Bu değer, UNIX döneminden bu yana geçen milisaniyelerin bir sayısıdır. Böylece ``1603994401469`` değeri ``0xbd3a847575010000`` olarak serileştirilir.
vi: ``timestamp``: Dấu thời gian là một cấu trúc có một bộ giá trị một ngôi chứa giá trị ``u64`` . Giá trị này là số phần nghìn giây kể từ kỷ nguyên UNIX. Do đó, giá trị ``1603994401469`` sắp xếp thành ``0xbd3a847575010000``

source: ``ttl``: The **Time to live** is defined as the amount of time for which deploy is considered valid. The ``ttl`` serializes in the same manner as the timestamp.
fr: ``ttl``: Le **Time to live** est défini comme la durée pendant laquelle le déploiement est considéré comme valide. Le ``ttl`` se sérialise de la même manière que le timestamp.
tr: ``ttl``: **Yaşama süresi**, dağıtımın geçerli olduğu kabul edilen süre olarak tanımlanır. ``ttl``, zaman damgasıyla aynı şekilde serileştirilir.
vi: ``ttl``: **Thời gian tồn tại** được định nghĩa là khoảng thời gian mà việc triển khai được coi là hợp lệ. ``Ttl`` `trình tự hóa theo cách tương tự như dấu thời gian.

source: ``gas_price``: The gas is ``u64`` value which is serialized as ``u64`` CLValue discussed below.
fr: ``gas_price``: Le gaz est une valeur ``u64`` qui est sérialisée comme ``u64`` CLValue discuté ci-dessous.
tr: ``gas_price``: Gaz, aşağıda tartışılan ``u64`` CLValue olarak serileştirilmiş ``u64`` değeridir.
vi: ``gas_price``: Gas có giá trị ``u64`` được trình tự dạng CLValue ``u64`` được thảo luận bên dưới.

source: ``body_hash``: Body hash is a hash over the contents of the deploy body, which includes the payment, session, and approval fields. Its serialization is the byte representation of the hash itself.
fr: ``body_hash``: Le hash du corps est un hash du contenu du corps du déploiement, qui comprend les champs de paiement, de session et d'approbation. Sa sérialisation est la représentation en octets du hash lui-même.
tr: ``body_hash``: Gövde özeti, ödeme, oturum ve onay alanlarını içeren dağıtım gövdesinin içeriği üzerindeki bir özettir. Serileştirmesi, özetin kendisinin bayt gösterimidir.
vi: ``body_hash``: Băm nội dung là một hàm băm đối với nội dung của phần thân triển khai, bao gồm các trường thanh toán, phiên và phê duyệt. Trình tự hóa của nó là biểu diễn byte của chính hàm băm.

source: ``dependencies``: Dependencies is a vector of deploy hashes referencing deploys that must execute before the current deploy can be executed. It serializes as a buffer containing the individual serialization of each DeployHash within the Vector.
fr: ``dependencies``: 'Dependencies' est un vecteur de hashs de déploiement référençant les déploiements qui doivent s'exécuter avant que le déploiement actuel puisse être exécuté. Il se sérialise comme un buffer contenant la sérialisation individuelle de chaque DeployHash dans le vecteur.
tr: ``dependencies``: Bağımlılıklar, geçerli dağıtım yürütülmeden önce yürütülmesi gereken dağıtmlara atıfta bulunan dağıtım özetlerinin bir vektörüdür. Vektör içindeki her DeployHash'in bireysel serileştirmesini içeren bir arabellek olarak seri hale getirir.
vi: ``dependencies``: Sự phụ thuộc là một vectơ của các băm triển khai tham chiếu đến các triển khai phải thực thi trước khi triển khai hiện tại có thể được thực thi. Nó trình tự hóa như một bộ đệm chứa trình tự hóa riêng lẻ của từng DeployHash trong Vector.

source: ``chain_name``: Chain name is a human-readable string describing the name of the chain as detailed in the chainspec. It is serialized as a String CLValue described below.
fr: ``chain_name``: Le nom de la chaîne est une chaîne de caractères décrivant le nom de la chaîne tel qu'il est détaillé dans le chainspec. Il est sérialisé sous la forme d'une CLValue de type String décrite ci-dessous.
tr: ``chain_name``: Zincir adı, zincir belirtiminde ayrıntılı olarak açıklandığı şekilde zincirin adını açıklayan, okunabilen bir dizedir. Aşağıda açıklandığı şekilde, bir String CLValue olarak serileştirilir.
vi: ``chain_name``: Tên chuỗi là một chuỗi mà con người có thể đọc được, mô tả tên của chuỗi được nêu chi tiết trong chainpec. Nó được trình tự hóa dưới dạng String CLValue và mô tả bên dưới.

source: Payment & Session
fr: Paiement & Session
tr: Ödeme ve Oturum
vi: Thanh toán &amp; Phiên

source: Payment and Session are both defined as ``ExecutableDeployItems``. ``ExecutableDeployItems`` is an enum described as follows:
fr: Paiement et Session sont tous deux définis en tant que ``ExecutableDeployItems``. ``ExecutableDeployItems`` est un enum décrit comme suit :
tr: Ödeme ve Oturum, ``ExecutableDeployItems`` olarak tanımlanır. ``ExecutableDeployItems`` aşağıdaki şekilde açıklanan bir numaralandırmadır:
vi: Thanh toán và Phiên đều được định nghĩa là ``ExecutableDeployItems``. ``ExecutableDeployItems`` là một enum được mô tả như sau:

source: Module Bytes are serialized such that the first byte within the serialized buffer is ``0`` with the rest of the buffer containing the bytes present.
fr: Module Bytes sont sérialisés de telle sorte que le premier octet du buffer sérialisé est ``0``, le reste du buffer contenant les octets présents.
tr: Modül Baytları, serileştirilmiş arabellek içindeki ilk bayt ``0`` olacak ve arabelleğin geri kalanı mevcut baytları içerecek şekilde serileştirilir.
vi: Các byte mô-đun được trình tự hóa sao cho byte đầu tiên trong bộ đệm được tuần tự hóa là ``0`` với phần còn lại của bộ đệm chứa các byte hiện tại.

source: ``ModuleBytes { module_bytes: "[72 bytes]", args: 434705a38470ec2b008bb693426f47f330802f3bd63588ee275e943407649d3bab1898897ab0400d7fa09fe02ab7b7e8ea443d28069ca557e206916515a7e21d15e5be5eb46235f5 }`` will serialize to
fr: ``ModuleBytes { module_bytes: "[72 bytes]", args: 434705a38470ec2b008bb693426f47f330802f3bd63588ee275e943407649d3bab1898897ab0400d7fa09fe02ab7b7e8ea443d28069ca557e206916515a7e21d15e5be5eb46235f5 }`` sera sérialisé en
tr: ``ModuleBytes { module_bytes: "[72 bytes]", args: 434705a38470ec2b008bb693426f47f330802f3bd63588ee275e943407649d3bab1898897ab0400d7fa09fe02ab7b7e8ea443d28069ca557e206916515a7e21d15e5be5eb46235f5 }`` şu şekilde serileştirilir
vi: ``ModuleBytes { module_bytes: "[72 bytes]", args: 434705a38470ec2b008bb693426f47f330802f3bd63588ee275e943407649d3bab1898897ab0400d7fa09fe02ab7b7e8ea443d28069ca557e206916515a7e21d15e5be5eb46235f5 }`` sẽ trình tự hoá thành

source: StoredContractByHash serializes such that the first byte within the serialized buffer is 1u8. This is followed by the byte representation of the remaining fields.
fr: StoredContractByHash se sérialise de telle sorte que le premier octet du buffer sérialisé est 1u8. Il est suivi par la représentation en octets des autres champs.
tr: StoredContractByHash, serileştirilmiş arabellek içindeki ilk bayt 1u8 olacak şekilde serileştirir. Bunu, kalan alanların bayt gösterimi takip eder.
vi: StoredContractByHash trình tự hóa sao cho byte đầu tiên trong bộ đệm được trình tự hóa là 1u8. Tiếp theo là biểu diễn byte của các trường còn lại.

source: StoredContractByName serializes such that the first byte within the serialized buffer is 2u8. This is followed by the individual byte representation of the remaining fields.
fr: StoredContractByName est sérialisé de telle sorte que le premier octet du buffer sérialisé est 2u8. Il est suivi de la représentation individuelle en octets des champs restants.
tr: StoredContractByName, serileştirilmiş arabellek içindeki ilk bayt 2u8 olacak şekilde seri hale getirir. Bunu, kalan alanların tekil bayt gösterimi takip eder.
vi: StoredContractByName trình tự hóa sao cho byte đầu tiên trong bộ đệm được tuần tự hóa là 2u8. Tiếp theo là biểu diễn byte riêng lẻ của các trường còn lại.

source: StoredVersionedContractByHash serializes such that the first byte within the serialized buffer is 3u8. However, the field version within the enum serializes as an Option CLValue, i.e., if the value is None as shown in the example, it serializes to 0, else it serializes the inner u32 value, which is described below.
fr: StoredVersionedContractByHash se sérialise de telle sorte que le premier octet du buffer sérialisé est 3u8. Cependant, la version du champ dans l'enum est sérialisée comme une Option CLValue, c'est-à-dire que si la valeur est None comme indiqué dans l'exemple, elle est sérialisée à 0, sinon elle sérialise la valeur u32 interne, qui est décrite ci-dessous.
tr: StoredVersionedContractByHash, serileştirilmiş arabellek içindeki ilk bayt 3u8 olacak şekilde serileştirir. Ancak, numaralandırma içindeki alan sürümü bir Option CLValue olarak serileştirilir, yani değer örnekte gösterildiği gibi None ise 0'a serileştirilir, aksi takdirde aşağıda açıklanan iç u32 değerini serileştirir.
vi: StoredVersionedContractByHash trình tự hóa sao cho byte đầu tiên trong bộ đệm được trình tự hóa là 3u8. Tuy nhiên, phiên bản trường trong enum trình tự hóa dưới dạng Option CLValue, tức là, nếu giá trị là None được như hiển thị trong ví dụ, nó sẽ tuần tự hóa thành 0, nếu không nó sẽ trình tự hóa giá trị u32 bên trong, được mô tả bên dưới.

source: StoredVersionedContractByName serializes such that the first byte within the serialized buffer is 4u8. The name and entry_point are serialized as a String CLValue, with the Option version field serializing to 0 if the value is None; else, it serializes the inner u32 value as described below.
fr: StoredVersionedContractByName est sérialisé de telle sorte que le premier octet du buffer sérialisé soit 4u8. Le name et le entry_pointsont sérialisés sous la forme d'une chaîne CLValue, le champ Option version étant sérialisé à 0 si la valeur est None ; sinon, il sérialise la valeur interne u32 comme décrit ci-dessous.
tr: StoredVersionedContractByName, serileştirilmiş arabellek içindeki ilk bayt 4u8 olacak şekilde seri hale gelir. Ad ve entry_point, değer Yok ise, Option sürümü alanı 0'a seri hale getirilerek bir String CLValue olarak serileştirilir; Aksi takdirde, aşağıda açıklandığı gibi iç u32 değerini serileştirir.
vi: StoredVersionedContractByName trình tự hóa sao cho byte đầu tiên trong bộ đệm được trình tự hóa là 4u8. Tên và entry_point được tuần tự hóa dưới dạng Chuỗi CLValue, với trường Phiên bản tùy chọn được trình tự hóa thành 0 nếu giá trị là None; nếu không, nó trình tự hóa giá trị u32 bên trong như mô tả bên dưới.

source: Transfer serializes such that the first byte within the serialized buffer contains is 5u8, with the remaining bytes of the buffer containing the bytes contained within the args field of Transfer.
fr: Transfer est sérialisé de telle sorte que le premier octet du buffer sérialisé contient 5u8, les autres octets du buffer contenant les octets contenus dans le champ args de Transfer.
tr: Transfer, serileştirilmiş arabelleğin içerdiği ilk bayt 5u8 olacak ve arabelleğin kalan baytları Transfer'in args alanında bulunan baytları içerecek şekilde serileştirir.
vi: Chuyển (Transfer) trình tự hóa sao cho byte đầu tiên trong bộ đệm được trình tự hóa là 5u8, với các byte còn lại của bộ đệm, chứa các byte trong trường args của Transfer.

source: Approval
fr: Approbation (Approval)
tr: Onay
vi: Phê duyệt

source: Approval contains two fields:
fr: Approval contient deux champs :
tr: Onay iki alan içerir:
vi: Phê duyệt bao gồm hai trường:

source: ``signer``: The public key of the approvals signer. It serializes to the byte representation of the ``PublicKey``. If the ``PublicKey`` is an ``Ed25519`` key, then the first byte within the serialized buffer is 1 followed by the bytes of the key itself; else, in the case of ``Secp256k1``, the first byte is 2.
fr: ``signer``: La clé publique du signataire des approbations. Elle se sérialise en la représentation en octets de la ``PublicKey``. Si la ``PublicKey`` est une clé ``Ed25519``, alors le premier octet dans le tampon sérialisé est 1 suivi des octets de la clé elle-même ; sinon, dans le cas de ``Secp256k1``, le premier octet est 2.
tr: ``signer``: Onayları imzalayanın ortak anahtarı. ``PublicKey``'in bayt gösterimine serileşir. ``PublicKey`` bir ``Ed25519`` anahtarıysa, serileştirilmiş arabellek içindeki ilk bayt 1'dir ve ardından anahtarın baytları gelir; Aksi takdirde, ``Secp256k1`` durumunda ilk bayt 2'dir.
vi: ``signer``: Khóa công khai của người ký phê duyệt. Nó trình tự hóa thành biểu diễn byte của ``PublicKey``. Nếu ``PublicKey`` là khóa ``Ed25519``, thì byte đầu tiên trong bộ đệm trình tự hóa là 1, tiếp theo là các byte của chính khóa đó; khác, trong trường hợp của ``Secp256k1``, byte đầu tiên là 2.

source: ``signature``: The approval signature, which serializes as the byte representation of the ``Signature``. The fist byte within the signature is 1 in the case of an ``Ed25519`` signature or 2 in the case of ``Secp256k1``.
fr: ``signature``: La signature de l'approbation, qui se sérialise comme la représentation en octets de la ``Signature``. Le premier octet de la signature est 1 dans le cas d'une signature ``Ed25519`` ou 2 dans le cas de ``Secp256k1``.
tr: ``signature``: ``signature``'nın bayt temsili olarak seri hale getirilen onay imzası. İmza içindeki ilk bayt, ``Ed25519```imzası olması durumunda 1 veya ``Secp256k1`` olması durumunda 2'dir.
vi: ``signature``: Chữ ký phê duyệt, được trình tự hóa dưới dạng biểu diễn byte của ``Signature``. Byte có chữ ký là 1 trong trường hợp chữ ký ``Ed25519`` hoặc 2 trong trường hợp ``Secp256k1``.

source: Deploy Serialization at High Level
fr: Déployer la sérialisation à haut niveau
tr: Yüksek Düzeyde Dağıtım Serileştirme
vi: Triển khai trình tự hóa ở mức cao

source: Consider the following deploy:
fr: Considérez le déploiement suivant :
tr: Aşağıdaki dağıtımı göz önünde bulundurun:
vi: Hãy xem xét triển khai sau:

source: The above deploy will serialize to:
fr: Le déploiement ci-dessus sera sérialisé en :
tr: Yukarıdaki dağıtım şu şekilde seri hale getirilecektir:
vi: Triển khai ở trên sẽ trình tự thành:

source: Values
fr: Valeurs
tr: Değerler
vi: Giá trị

source: A value stored in the global state is a ``StoredValue``. A ``StoredValue`` is one of three possible variants:
fr: Une valeur stockée dans l'état global est une ``StoredValue``. Une ``StoredValue`` est l'une des trois variantes possibles :
tr: Küresel durumda depolanan bir değer, bir ``StoredValue``'dur. Bir ``StoredValue``, üç olası değişkenden biridir:
vi: Giá trị được lưu trữ ở trạng thái toàn cục là ``StoredValue``. ``StoredValue`` có thể là một trong ba kiểu:

source: A ``CLValue``
fr: Une ``CLValue``
tr: Bir ``CLValue``
vi: ``CLValue``

source: A contract
fr: Un contrat
tr: Bir kontrat
vi: Hợp đồng (contract)

source: An account
fr: Un compte
tr: Bir hesap
vi: Tài khoản (account)

source: We discuss ``CLValue`` and contract in more detail below. Details about accounts can be found in :ref:`accounts-head`.
fr: Nous discutons de ``CLValue`` et du contrat plus en détail ci-dessous. Les détails sur les comptes peuvent être trouvés dans :ref:`accounts-head`.
tr: ``CLValue`` ve sözleşmeyi aşağıda daha ayrıntılı olarak tartışıyoruz. Hesaplarla ilgili ayrıntılar :ref:`accounts-head` içinde bulunabilir.

source: Each ``StoredValue`` is serialized when written to the global state. The serialization format consists of a single byte tag, indicating which variant of ``StoredValue`` it is, followed by the serialization of that variant. The tag for each variant is as follows:
fr: Chaque ``StoredValue`` est sérialisée lorsqu'elle est écrite dans l'état global. Le format de sérialisation consiste en un tag d'un seul octet, indiquant de quelle variante de ``StoredValue`` il s'agit, suivi de la sérialisation de cette variante. Le tag de chaque variante est comme suit :
tr: Her ``StoredValue``, küresel duruma yazıldığında serileştirilir. Serileştirme formatı, hangi ``StoredValue`` varyantı olduğunu gösteren tekil bir bayt etiketinden oluşur ve ardından bu varyantın serileştirilmesi gelir. Her varyant için etiket aşağıdaki gibidir:
vi: Mỗi ``StoredValue`` được `trình tự hóa khi được ghi vào trạng thái toàn cục. Định dạng trình tự hóa bao gồm một byte tag đơn, cho biết đó là biến thể nào của ``StoredValue``, tiếp theo là trình tự hóa biến thể đó. Tag cho mỗi biến thể như sau:

source: ``CLValue`` is ``0``
fr: ``CLValue`` est ``0``
tr: ``CLValue``, ``0``'dır
vi: ``CLValue`` là ``0``

source: ``Account`` is ``1``
fr: ``Account`` est ``1``
tr: ``Account``, ``1``'dir
vi: ``Account`` là ``1``

source: ``Contract`` is ``2``
fr: ``Contract`` est ``2``
tr: ``Contract``, ``2``'dir
vi: ``Contract`` là ``2``

source: The details of ``CLType`` serialization are in the following section. Using the serialization format for ``CLValue`` as a basis, we can succinctly write the serialization rules for contracts and accounts:
fr: Les détails de la sérialisation de ``CLType`` sont dans la section suivante. En utilisant le format de sérialisation pour ``CLValue`` comme base, nous pouvons écrire succinctement les règles de sérialisation pour les contrats et les comptes :
tr: ``CLType`` serileştirme detayları aşağıdaki bölümdedir. ``CLValue`` için serileştirme formatını temel alarak, kontratlar ve hesaplar için serileştirme kurallarını kısaca yazabiliriz:
vi: Chi tiết về tuần tự hóa ``CLType`` có trong phần sau. Sử dụng định dạng trình tự hóa cho ``CLValue`` làm cơ sở, chúng tôi có thể viết ngắn gọn các quy tắc trình tự hóa cho các hợp đồng và tài khoản:

source: contracts serialize in the same way as data with ``CLType`` equal to ``Tuple3(List(U8), Map(String, Key), Tuple3(U32, U32, U32))``;
fr: les contrat se sérialisent de la même manière que les données dont le ``CLType`` est égal à ``Tuple3(List(U8), Map(String, Key), Tuple3(U32, U32, U32))`` ;
tr: kontratlar, ```CLType``, ``Tuple3(List(U8), Map(String, Key), Tuple3(U32, U32, U32))``'ye eşit olduğu verilerle aynı şekilde serileştirilir;
vi: hợp đồng trình tự hóa theo cách tương tự như dữ liệu với ``CLType`` bằng ``Tuple3(List(U8), Map(String, Key), Tuple3(U32, U32, U32))``;
