Repository: casper-network/docs-archive
Catalog: locale/*/LC_MESSAGES/implementation/tokens.po
Languages: fr, tr, vi

source: Tokens
fr: Jetons
tr: Tokenler
vi: Token

source: Introduction
tr: Giriş
vi: Giới thiệu

source: The Casper Network is a decentralized blockchain platform based on a Proof-of-Stake consensus algorithm called `Highway <https://github.com/CasperLabs/highway>`_. Having a unit of value is required to make this system work because users must pay for computation, and validators must have `stake <https://docs.casperlabs.io/en/latest/staking/index.html>`_ to bond. In the blockchain space, this unit of value is a *token*.
fr: Le réseau Casper est une plateforme blockchain décentralisée basée sur un algorithme de consensus Proof-of-Stake appelé `Highway <https://github.com/CasperLabs/highway>`_. Avoir une unité de valeur est nécessaire pour faire fonctionner ce système car les utilisateurs doivent payer pour le calcul, et les validateurs doivent avoir un `stake <https://docs.casperlabs.io/fr/latest/staking/index.html>`_ pour participer à l'enchère (to bond). Dans l'espace blockchain, cette unité de valeur est un *jeton*.
tr: Casper Network, `Highway <https://github.com/CasperLabs/highway>`_ adı verilen bir Hisse Kanıtı mutabakat algoritmasına dayanan merkeziyetsiz bir blokzincir platformudur. Bu sistemin çalışması için bir değer birimine sahip olunması gerekir, çünkü kullanıcıların hesaplama için ödeme yapması ve doğrulayıcıların bağ kurmak için `hisseye <https://docs.casperlabs.io/en/latest/staking/index.html>`_ sahip olması gerekir. Blokzincir alanında bu değer birimi bir *token*dir.

source: This chapter describes how we define tokens and how one can use them on the Casper platform.
fr: Ce chapitre décrit comment nous définissons les jetons et comment on peut les utiliser sur la plateforme Casper.
tr: Bu bölüm, tokenleri nasıl tanımladığımızı ve bunları Casper platformunda nasıl kullanabileceğimizi açıklar.
vi: Chương này mô tả cách chúng tôi định nghĩa toekn và cách người ta có thể sử dụng chúng trên nền tảng Casper.

source: Token Generation and Distribution
fr: Génération et distribution de jetons
tr: Token Üretimi ve Dağıtımı
vi: Tạo và phân phối token

source: A blockchain system generally needs to have a supply of tokens available to pay for computation and reward validators for processing transactions on the network. A great deal of effort has been taken to ensure that no single individual or entity acquires more than 1% of the tokens from the onset.
fr: Un système de blockchain doit généralement disposer d'une réserve de jetons pour payer les calculs et récompenser les validateurs pour le traitement des transactions sur le réseau. De nombreux efforts ont été déployés pour s'assurer qu'aucun individu ou entité n'acquiert plus de 1 % des jetons dès le départ.
tr: Bir blokzincir sisteminin genellikle hesaplama için ödeme yapmak ve ağdaki işlemleri işlemek amacıyla doğrulayıcıları ödüllendirmek için kullanılabilir bir token kaynağına sahip olması gerekir. Tek bir kişinin veya kuruluşun, başlangıçtan itibaren tokenlerin %1'inden fazlasını elde etmemesini sağlamak için çok çaba sarf edilmiştir.

source: In addition to the initial supply, the system will have a low rate of inflation, the results of which will be paid out to validators in the form of seigniorage.
fr: En plus de l'approvisionnement initial, le système aura un faible taux d'inflation, dont les résultats seront versés aux validateurs sous forme de seigneuriage.
tr: İlk arza ek olarak, sistem düşük bir enflasyon oranına sahip olacak ve sonuçları onaylayıcılara senyoraj şeklinde ödenecek.

source: The number of tokens used as a basis for calculating seigniorage is 10 billion.
fr: Le nombre de jetons servant de base au calcul du seigneuriage est de 10 milliards.
tr: Senyorajın hesaplanmasında temel alınan token sayısı 10 milyardır.
vi: Số lượng token được sử dụng làm cơ sở để tính toán seigniorage là 10 tỷ.

source: Divisibility of Tokens
fr: Divisibilité des jetons
tr: Tokenlerin Bölünebilirliği
vi: Sự phân chia của token

source: Typically, a *token* is divisible into some number of parts. We call the indivisible units which make up the CSPR token *motes*. Each CSPR is divisible into :math:`10^{9}` motes. To avoid rounding errors, it is essential to always represent token balances in motes. In comparison, Ether is divisible into :math:`10^{18}` parts called Wei.
fr: Généralement, un *jeton* est divisible en un certain nombre de parties. Nous appelons les unités indivisibles qui composent le jeton CSPR *motes*. Chaque CSPR est divisible en :math:`10^{9}` motes. Pour éviter les erreurs d'arrondi, il est essentiel de toujours représenter les soldes des jetons en motes. En comparaison, l'Ether est divisible en :math:`10^{18}` parties appelées Wei.
tr: Tipik olarak, bir *token* birkaç parçaya bölünebilir. CSPR tokenini oluşturan bölünmez birimlere *motes* diyoruz. Her CSPR, :math:`10^{9}` hareketlerine bölünebilir. Tur hatalarından kaçınmak için token bakiyelerini her zaman mote olarak göstermek önemlidir. Buna karşılık, Ether, Wei adı verilen :math:`10^{18}` kısımlarına bölünebilir.
vi: Thông thường, một *token* có thể chia thành một số phần. Chúng tôi gọi các đơn vị không thể phân chia tạo nên mã thông báo CSPR *motes*. Mỗi CSPR chia hết thành :math:`10^{9}` mote. Để tránh lỗi làm tròn, điều cần thiết là phải luôn biểu thị số dư mã thông báo bằng mote. Để so sánh, Ether có thể chia thành :math:`10^{18}` phần được gọi là Wei.

source: Mints and Purses
fr: Minages (mints ) et portes-monnaie (purses)
tr: Mint'ler ve Cüzdanlar
vi: Mint và ví

source: A *mint* is a contract that can produce new motes of a particular type. We allow for multiple mote types (each of which would have its mint contract) because we anticipate the existence of a large ecosystem of different tokens, similar to the way Etherum works with ERC20 tokens. Casper will deploy a specific mint contract, and it will manage the CSPR utility token (used for paying for computation and bonding onto the network). The mint also maintains all the balances for its type of mote. Each balance is associated with a ``URef``, which acts as a key to instruct the mint to perform actions on that balance (e.g., transfer motes). Informally, we will refer to these balances as *purses* and conceptually represent a container for motes. The ``URef`` is how a purse is referenced externally, outside the mint.
fr: Un *mint* est un contrat qui peut produire de nouveaux motes d'un type particulier. Nous autorisons plusieurs types de mote (chacune d'entre elles ayant son propre contrat mint) car nous prévoyons l'existence d'un vaste écosystème de jetons différents, de la même manière qu'Etherum fonctionne avec les jetons ERC20. Casper déploiera un contrat de mint spécifique, et gérera le jeton utilitaire CSPR (utilisé pour payer les calculs et l'accès au réseau). Le mint maintient également tous les soldes pour son type de mote. Chaque solde est associé à un ``URef``, qui agit comme une clé pour instruire le mint d'effectuer des actions sur ce solde (par exemple, transférer des mottes). De manière informelle, nous nous référerons à ces soldes en tant que *purses* et représentent conceptuellement un conteneur pour les motes. Le ``URef`` est la façon dont un porte-monnaie est référencé à l'extérieur du mint.
tr: Bir *mint*, belirli bir türde yeni mote'lar üretebilen bir kontrattır. Etherum'un ERC20 tokenleriyle çalışma şekline benzer şekilde, farklı tokenlerden oluşan geniş bir ekosistemin varlığını tahmin ettiğimiz için (her biri kendi mint kontratına sahip olacak) birden fazla mote türüne izin veriyoruz. Casper, belirli bir mint kontratı dağıtacak ve CSPR yardımcı programı tokenini yönetecek (hesaplama için ödeme yapmak ve ağa bağlanmak için kullanılır). Mint ayrıca mote türü için tüm bakiyeleri korur. Her bakiye, mint'e o bakiye üzerinde eylemler gerçekleştirmesi talimatını vermek için bir anahtar görevi gören bir ``URef`` ile ilişkilendirilir (örneğin, transfer hamleleri). Gayri resmi olarak, bu bakiyelere *cüzdan* olarak atıfta bulunacağız ve kavramsal olarak mote için bir konteyneri temsil edeceğiz. ``URef``, bir cüzdanın mint dışında harici olarak nasıl referans verildiğidir.
vi: *Mint* là một hợp đồng có thể tạo ra mote mới của một kiểu cụ thể. Chúng tôi cho phép nhiều kiểu mote (mỗi loại sẽ có hợp đồng mint) vì chúng tôi dự đoán sự tồn tại của một hệ sinh thái lớn gồm các token khác nhau, tương tự như cách Etherum hoạt động với mã thông báo ERC20. Casper sẽ triển khai một hợp đồng mint cụ thể và nó sẽ quản lý token tiện ích CSPR (được sử dụng để thanh toán cho việc tính toán và liên kết với mạng). Mint cũng duy trì tất cả số dư bằng kiểu mote của nó. Mỗi số dư được liên kết với một ``URef``, hoạt động như một chìa khóa để hướng dẫn mint thực hiện các hành động trên số dư đó (ví dụ: chuyển mote). Một cách không chính thức, chúng tôi sẽ gọi những số dư này là *ví* và đại diện về mặt khái niệm một khối chứa mote. ``URef`` là cách một chiếc ví được tham chiếu ra bên ngoài, ngoài việc mint.

source: The ``AccessRights`` of the :ref:`URefs <global-state-urefs-permissions>` permissions model determine what actions are allowed to be performed when using a ``URef`` associated with a purse.
fr: Les ``AccessRights`` du modèle de permissions des :ref:`URefs <global-state-urefs-permissions>` détermine quelles actions sont autorisées lors de l'utilisation d'un ``URef`` associé à une porte-monnaie (purse).
tr: :ref:`URefs <global-state-urefs-permissions>` izin modelinin ``AccessRights`` erişim hakları bir cüzdanla ilişkili bir ``URef`` kullanırken hangi işlemlerin gerçekleştirilmesine izin verildiğini belirler.
vi: ``AccessRights`` của :ref:`URefs <global-state-urefs-permissions>` mô hình phân quyền xác định những hành động nào được phép thực hiện khi sử dụng ``URef`` được liên kết với một ví.

source: As all ``URef``\ s are unforgeable, so the only way to interact with a purse is for a ``URef`` with appropriate ``AccessRights`` to be given to the current context in a valid way (see :ref:`URefs <global-state-urefs-permissions>` permissions for details).
fr: Comme tous les ``URef`` sont infalsifiables, la seule façon d'interagir avec un porte-monnaie est qu'un ``URef`` avec les ``AccessRights`` appropriés soit donné au contexte actuel de façon valide (voir permissions des :ref:`URefs <global-state-urefs-permissions>` pour plus de details).
tr: Tüm ``URef``ler taklit edilemez olduğundan, bir cüzdanla etkileşim kurmanın tek yolu, uygun ``AccessRights``lara sahip bir ``URef``in mevcut bağlama geçerli bir şekilde verilmesidir (ayrıntılar için :ref`URefs <global-state-urefs-permissions>` izinlerine bakın).
vi: Vì tất cả các ``URef`` đều không thể thay đổi được, do đó, cách duy nhất để tương tác với ví là cung cấp ``URef`` với ``AccessRights`` phù hợp cho ngữ cảnh hiện tại một cách hợp lệ (xem :ref:`URefs <global-state-urefs-permissions>` quyền để biết thêm chi tiết).

source: The basic global state options map onto more standard monetary operations according to the table below:
fr: Les options de base de l'état global sont mapées sur des opérations monétaires plus standard selon le tableau ci-dessous.
tr: Temel küresel durum seçenekleri, aşağıdaki tabloya göre daha standart parasal işlemlerle eşleşir:
vi: Các tùy chọn trạng thái toàn cục cơ bản sẽ ánh xạ với các hoạt động tài khoản theo bảng dưới đây:

source: Global State Action
tr: Küresel Durum Eylemi
vi: Hành động của trạng thái toàn cục

source: Monetary Action
fr: Action monétaire
tr: Parasal Eylem
vi: Hành động với tài khoản

source: Add
fr: Ajouter
tr: Ekle

source: Deposit (i.e. transfer to)
fr: Dépôt (i.e. transférer à)
tr: Yatırma (yani para yatırma)
vi: Nạp vào (tức là chuyển tới)

source: Write
fr: Ecriture
tr: Yaz

source: Withdraw (i.e. transfer from)
fr: Retrait (i.e. transférer de)
tr: Geri çekme (yani para çekme)
vi: Rút ra (tức là chuyển đi)

source: Read
fr: Lecture
tr: Oku

source: Balance check
fr: Vérification du solde
tr: Bakiye kontrolü
vi: Kiểm tra tài khoản

source: We will use these definitions throughout this chapter to describe the implementation and usage of tokens on the Casper system.
fr: Nous utiliserons ces définitions tout au long de ce chapitre pour décrire la mise en œuvre et l'utilisation des jetons sur le système Casper.
tr: Bu tanımları, bu bölümde, tokenlerin Casper sisteminde uygulanmasını ve kullanımını açıklamak için kullanacağız.
vi: Chúng tôi sẽ sử dụng các định nghĩa này trong suốt chương này để mô tả việc triển khai và sử dụng token trên hệ thống Casper.

source: The mint Contract Interface
fr: L'interface du contrat mint
tr: Mint Kontrat Arayüzü
vi: Giao diện Hợp đồng mint

source: A valid mint contract exposes the following methods (recall that many mint implementations may exist, each corresponding to a different currency):
fr: Un contrat mint valide expose les méthodes suivantes (rappelons qu'il peut exister plusieurs implémentations mint, chacune correspondant à une monnaie différente) :
tr: Geçerli bir mint kontratı aşağıdaki yöntemleri ortaya çıkarır (her biri farklı bir para birimine karşılık gelen birçok mint uygulamasının mevcut olabileceğini hatırlayın):
vi: Một hợp đồng mint hợp lệ cho thấy các phương pháp sau (nhớ lại rằng có thể có nhiều phương pháp triển khai mint, mỗi phương pháp tương ứng với một loại tiền tệ khác nhau):

source: ``source`` must have at least ``Write`` access rights, ``target`` must have at least ``Add`` access rights
fr: ``source`` doit au moins avoir les droits d'accès ``Write`` , ``target`` doit au moins avoir les droits d'accès``Add`` .
tr: ``source`` en az ``Yaz`` erişim haklarına sahip olmalı, ``target`` en az ``Ekle`` erişim haklarına sahip olmalıdır
vi: ``source`` phải có ít nhất quyền ``Write``, ``đích`` phải có ít nhất quyền ``Add``

source: ``TransferResult`` may be a success acknowledgment or an error in the case of invalid ``source`` or ``target`` or insufficient balance in the ``source`` purse
fr: ``TransferResult`` peut être un accusé de réception de succès ou une erreur dans le cas d'une ``source`` ou d'un ``target`` invalide ou d'un solde insuffisant dans le porte-monnaie ``source``
tr: ``TransferResult`` bir başarı bildirimi ya da geçersiz ``source`` veya ``target`` veya ``source`` cüzdanda yetersiz bakiye olması durumunda bir hata olabilir
vi: ``TransferResult`` có thể là một thông báo thành công hoặc một lỗi trong trường hợp ``nguồn`` hoặc ``đích`` không hợp lệ hoặc không đủ số dư trong ví ``nguồn``

source: ``MintResult`` either gives the created ``URef`` (with full access rights), which now has a balance equal to the given ``amount``; or an error due to the minting of new motes not being allowed
fr: ``MintResult`` donne soit le ``URef`` créé (avec tous les droits d'accès), qui a maintenant un solde égal au ``amount`` donné ; soit une erreur due au fait que la création de nouvelles motes n'est pas autorisée.
tr: ``MintResult`` ya şimdi verilen ``amount``a eşit bakiyeye sahip oluşturulan``URef``i (tam erişim haklarına sahip); ya da yeni mote'ların basılmasına izin verilmemesi nedeniyle bir hata verir
vi: ``MintResult`` hoặc cung cấp cho ``URef`` đã tạo (với đầy đủ quyền truy cập) hiện có số dư bằng với ``amount`` đã cho; hoặc lỗi do không được phép mint các mote mới

source: In the Casper mint, only the system account can call ``mint``, and it has no private key to produce valid cryptographic signatures, which means only the software itself can execute contracts in the context of the system account
fr: Dans le minage (mint) Casper, seul le compte système peut appeler ``mint``, et il n'a pas de clé privée pour produire des signatures cryptographiques valides, ce qui signifie que seul le logiciel lui-même peut exécuter des contrats dans le contexte du compte système.
tr: Casper mint'te yalnızca sistem hesabı ``mint``i çağırabilir ve geçerli kriptografik imzalar üretmek için özel anahtarı yoktur, bu da sistem hesabı bağlamında yalnızca yazılımın kontratları yürütebileceği anlamına gelir.
vi: Trong mint của Casper, chỉ tài khoản hệ thống mới có thể gọi lệnh ``mint`` và nó không có khóa riêng tư để tạo ra các chữ ký mật mã hợp lệ, có nghĩa là chỉ bản thân phần mềm mới có thể thực hiện các hợp đồng trong ngữ cảnh tài khoản hệ thống

source: a convenience function for ``mint(0)`` which cannot fail because it is always allowed to create an empty purse
fr: une fonction de commodité pour ``mint(0)`` qui ne peut pas échouer car elle est toujours autorisée à créer un porte-monnaie vide
tr: ``mint(0)`` için her zaman boş bir cüzdan oluşturmaya izin verildiği için başarısız olamayacak bir kolaylık işlevi
vi: một chức năng tiện lợi cho ``mint(0)`` không thể bị lỗi vì nó luôn được phép tạo một ví trống

source: ``purse`` must have at least ``Read`` access rights
fr: ``purse`` doit avoir au moins droit d'accès ``Read``
tr: ``purse`` en az ``Oku`` erişim yetkisine sahip olmalıdır
vi: ``Ví`` phải có ít nhất quyền ``Read``

source: ``BalanceResult`` either returns the number of motes held by the ``purse``, or nothing if the ``URef`` is not valid
fr: ``BalanceResult`` renvoie soit le nombre de motes détenues par le ``purse``, soit rien si le ``URef`` n'est pas valide.
tr: ``BalanceResult``, ``purse`` tarafından tutulan mote sayısını döndürür veya ``URef`` geçerli değilse hiçbir şey vermez
vi: ``BalanceResult`` trả về số lượng mote được giữ bởi ``ví`` hoặc không có gì nếu ``URef`` không hợp lệ

source: Using purse ``URef``\ s
fr: Utilisation des ``URef`` du porte-monnaie
tr: Cüzdan ``URef``lerini kullanmak
vi: Sử dụng ví ``URef``

source: It is dangerous to pass a purse's ``URef`` with ``Write`` permissions to a contract. A malicious contract may use that access to take more tokens than were intended or share that ``URef`` with another contract that was not meant to have that access. Therefore, if a contract requires a purse with ``Write`` permissions, it is always recommended to use a “payment purse” -- a purse used for that single transaction and nothing else. This ensures that even if the ``URef`` becomes compromised, it does not contain any more funds than the user intended on giving.
fr: Il est dangereux de transmettre le ``URef`` d'un porte-monnaie avec les permissions ``Write`` à un contrat. Un contrat malveillant peut utiliser cet accès pour prendre plus de jetons que prévu ou partager ce ``URef`` avec un autre contrat qui n'est pas censé avoir cet accès. Par conséquent, si un contrat nécessite un porte-monnaie avec des droits d'écriture, il est toujours recommandé d'utiliser un "porte-monnaie de paiement", c'est-à-dire un porte-monnaie utilisé pour cette seule transaction et rien d'autre. Cela permet de s'assurer que, même si le ``URef`` est compromis, il ne contient pas plus de fonds que ce que l'utilisateur avait l'intention de donner.
tr: ``Yaz`` izinlerine sahip bir cüzdanın ``URef``ini bir kontrata geçirmek tehlikelidir. Kötü niyetli bir kontrat, bu erişimi amaçlanandan daha fazla token almak için kullanabilir veya bu ``URef``i, bu erişime sahip olması amaçlanmayan başka bir kontratla paylaşabilir. Bu nedenle, bir sözleşme ``Yaz`` izinlerine sahip bir cüzdan gerektiriyorsa, her zaman bir ``ödeme cüzdanı`` kullanılması önerilir - bu tek işlem için kullanılan bir cüzdan ve başka bir şey değil. Bu, ``URef`` tehlikeye girse bile, kullanıcının vermeyi amaçladığından daha fazla para içermemesini sağlar.
vi: Sẽ rất nguy hiểm khi chuyển ``URef`` của ví với quyền ``Write`` vào một hợp đồng. Một hợp đồng độc hại có thể sử dụng quyền truy cập đó để lấy nhiều token hơn dự định hoặc chia sẻ ``URef`` đó với một hợp đồng khác không có quyền truy cập đó. Do đó, nếu hợp đồng yêu cầu một ví có quyền ```Write``, bạn nên sử dụng “ví thanh toán” - ví được sử dụng cho một giao dịch duy nhất đó và không có gì khác. Điều này đảm bảo rằng ngay cả khi ``URef`` bị xâm phạm, nó không chứa bất kỳ khoản tiền nào nhiều hơn số tiền mà người dùng dự định chuyển.

source: To avoid this inconvenience, it is a better practice for application developers intending to accept payment on-chain to make a version of their own purse ``URef`` with ``Read`` access rights publicly available. This allows clients to pay via a transfer using their purse, without either party exposing ``Write`` access to any purse.
fr: Pour éviter ce désagrément, il est préférable que les développeurs d'applications qui ont l'intention d'accepter des paiements sur la chaîne mettent à la disposition du public une version de leur propre porte-monnaie ``URef`` avec des droits d'accès ``Read`` . Cela permet aux clients de payer par transfert en utilisant leur porte-monnaie, sans qu'aucune des parties n'expose l'accès ``Write`` à un porte-monnaie.
tr: Bu rahatsızlıktan kaçınmak için, zincir üzerinden ödemeyi kabul etmek isteyen uygulama geliştiricileri için kendi cüzdanlarının ``Uref`` sürümünü ``Oku`` erişim haklarıyla herkese açık hale getirmek daha iyi bir uygulamadır. Bu, müşterilerin herhangi bir cüzdana ``Yaz`` erişimini açığa çıkarmadan, cüzdanlarını kullanarak transfer yoluyla ödeme yapmalarını sağlar.

source: Purses and Accounts
fr: Porte-monnaie (purses) et comptes
tr: Cüzdanlar ve Hesaplar
vi: Ví và tài khoản
