Repository: casper-network/docs-archive
Catalog: locale/*/LC_MESSAGES/implementation/tokens.po
Languages: fr, tr, vi

source: All :ref:`accounts-head` on the Casper system have a purse associated with the Casper system mint, which we call the *main purse*. However, for security reasons, the ``URef`` of the main purse is only available to code running in the context of that account (i.e. only in payment or session code). Therefore, the mint’s ``transfer`` method which accepts ``URef``\ s is not the most convenient to use when transferring between account main purses. For this reason, Casper supplies a `transfer_to_account <https://docs.rs/casper-contract/latest/casper_contract/contract_api/system/fn.transfer_to_account.html>`_ function which takes the public key used to derive the :ref:`identity key <global-state-account-key>` of the account. This function uses the mint transfer function with the current account’s main purse as the ``source`` and the main purse of the account at the provided key as the ``target``.
fr: Tous les :ref:`accounts-head` du système Casper ont un porte-monnaie associé au mint du système Casper, que nous appelons le *porte-monnaie principal*. Cependant, pour des raisons de sécurité, le ``URef`` du porte-monnaie principal n'est disponible que pour le code s'exécutant dans le contexte de ce compte (c'est-à-dire uniquement dans le code de paiement ou de session). Par conséquent, la méthode ``transfer`` du mint qui accepte les ``URef`` n'est pas la plus pratique à utiliser pour transférer entre les porte-monnaie principaux des comptes. C'est pour cette raison que Casper fournit une fonction `transfer_to_account <https://docs.rs/casper-contract/latest/casper_contract/contract_api/system/fn.transfer_to_account.html>`_ qui prend la clé publique utilisée pour dériver l' :ref:`identity key <global-state-account-key>` du compte. Cette méthode utilise la fonction de transfert du mint avec le porte-monnaie principal du compte courant comme ``source`` et le porte-monnaie principal du compte à la clé fournie comme ``target``.
tr: Casper sistemindeki tüm :ref:`accounts-head`ların, *ana cüzdan* olarak adlandırdığımız Casper sistemi mint'iyle ilişkili bir cüzdanı vardır. Ancak, güvenlik nedenleriyle, ana cüzdanın ``URef``i yalnızca o hesap bağlamında çalışan kod için kullanılabilir (yani yalnızca ödeme veya oturum kodunda). Bu nedenle, mint'in ``URefs``lerini kabul eden ``transfer`` yöntemi, hesap ana cüzdanları arasında aktarım yaparken kullanmak için en uygun yöntem değildir. Bu nedenle Casper, hesabın :ref:`identity key <global-state-account-key>`ini türetmek için kullanılan genel anahtarı alan bir `transfer_to_account <https://docs.rs/casper-contract/latest/casper_contract/contract_api/system/fn.transfer_to_account.html>`_ işlevi sağlar. Bu işlev, cari hesabın ana cüzdanını ``source`` olarak ve hesabın ana cüzdanını sağlanan anahtarda ``target`` olarak kullanarak mint transfer işlevini kullanır.
vi: Tất cả :ref:`accounts-head` trên hệ thống Casper có một ví được liên kết với hệ thống Casper, chúng ta gọi là *ví chính*. Tuy nhiên, vì lý do bảo mật, ``URef`` của ví chính chỉ có sẵn cho mã chạy trong ngữ cảnh của tài khoản đó (tức là chỉ trong thanh toán hoặc mã phiên). Do đó, phương thức ``chuyển giao`` mint chấp nhận ``URef`` không phải là phương thức thuận tiện nhất để sử dụng khi chuyển giữa các ví chính của tài khoản. Vì lý do này, Casper cung cấp hàm `transfer_to_account <https://docs.rs/casper-contract/latest/casper_contract/contract_api/system/fn.transfer_to_account.html>`_ lấy khóa công khai được sử dụng để lấy :ref:`identity key <global-state-account-key>` của tài khoản. Hàm này sử dụng chức năng chuyển giao mint với ví chính của tài khoản hiện tại là ``nguồn`` và ví chính của tài khoản tại khóa đã cung cấp làm ``đích``.

source: The Casper Network is a decentralized blockchain platform based on a Proof-of-Stake consensus algorithm called `Highway <https://github.com/casper-network/highway>`_. Having a unit of value is required to make this system work because users must pay for computation, and validators must have `stake <https://docs.casperlabs.io/en/latest/staking/index.html>`_ to bond. In the blockchain space, this unit of value is a *token*.
vi: Mạng Casper là một nền tảng blockchain phi tập trung dựa trên thuật toán đồng thuận Proof-of-Stake được gọi là `Highway <https://github.com/casper-network/highway>`_. Cần có một đơn vị giá trị để làm cho hệ thống này hoạt động vì người dùng phải trả tiền cho việc tính toán và trình xác thực phải có `tiền đặt cọc <https://docs.casperlabs.io/en/latest/staking/index.html>`_ để cổ phần . Trong không gian chuỗi khối, đơn vị giá trị này là *token*.

source: A blockchain system generally needs to have a supply of tokens available to pay for computation and reward validators for processing transactions on the network. The initial supply at the launch of Mainnet was 10 billion CSPR. The current supply is available `here <https://api.cspr.live/supply>`_. In addition to the initial supply, the system will have a low rate of inflation, the results of which will be paid out to validators in the form of seigniorage.
vi: Một hệ thống chuỗi khối thường cần phải có sẵn nguồn cung token để thanh toán cho các trình xác thực tính toán và thưởng để xử lý các giao dịch trên mạng. Nguồn cung ban đầu khi ra mắt Mainnet là 10 tỷ CSPR. Nguồn cung cấp hiện tại có sẵn `tại đây <https://api.cspr.live/supply>`_. Ngoài nguồn cung cấp ban đầu, hệ thống sẽ có tỷ lệ lạm phát thấp, kết quả sẽ được trả cho trình xác thực dưới dạng thu nhập từ việc phát hành.

source: To avoid this inconvenience, it is a better practice for application developers intending to accept payment on-chain to make a version of their own purse ``URef`` with ``Read`` and ``Add`` access rights publicly available. This allows clients to pay via a transfer using their purse, without either party exposing ``Write`` access to any purse.
vi: Để tránh sự bất tiện này, cách tốt hơn là các nhà phát triển ứng dụng có ý định chấp nhận thanh toán trên chuỗi là tạo phiên bản ví riêng của họ ``URef`` với các quyền truy cập ``Read`` và ``Add`` được công bố công khai. Điều này cho phép khách hàng thanh toán qua chuyển khoản bằng ví của họ mà không bên nào để lộ quyền truy cập ``Write`` vào bất kỳ ví nào.
