Repository: casper-network/docs-archive
Catalog: locale/*/LC_MESSAGES/implementation/uref.po
Languages: fr, tr

source: Unforgeable Reference (URef)
fr: Référence infalsifiable (URef) (Unforgeable Reference )
tr: Taklit Edilemez Referans (URef)

source: This key type is used for storing any type of value except ``Account``. Additionally, ``URef``\ s used in contracts carry permission information to prevent unauthorized usage of the value stored under the key. This permission information is tracked by the runtime, meaning that if a malicious contract attempts to produce a ``URef`` with permissions that the contract does not have, we say the contract has attempted to “forge” the unforgeable reference, and the runtime will raise a forged ``URef`` error. Permissions for a ``URef`` can be given across contract calls, allowing data stored under a ``URef`` to be shared in a controlled way. The 32-byte identifier representing the key is generated randomly by the runtime (see :ref:`Execution Semantics <execution-semantics-urefs>` for more information). The serialization for ``Access Rights`` that define the permissions for ``URefs`` is detailed in the :ref:`CLValues<serialization-standard-values>` section.
fr: Ce type de clé est utilisé pour stocker tout type de valeur, à l'exception de ``Account``. De plus, les ``URef``\ utilisés dans les contrats portent des informations de permission pour empêcher l'utilisation non autorisée de la valeur stockée dans la clé. Ces informations de permission sont traquées par le runtime, ce qui signifie que si un contrat malveillant tente de produire un ``URef`` avec des permissions que le contrat n'a pas, nous disons que le contrat a tenté de "forger" la référence infalsifiable, et le runtime lèvera une erreur ``URef`` forgé. Les permissions pour un ``URef`` peuvent être données à travers des appels de contrat, permettant aux données stockées sous un ``URef`` d'être partagées d'une manière contrôlée. L'identifiant de 32 octets représentant la clé est généré de manière aléatoire par le runtime (voir :ref:`Execution Semantics<execution-semantics-urefs>` pour plus d'informations). La sérialisation des ``Access Rights`` qui définissent les autorisations pour les ``URefs`` est détaillée dans la section :ref:`CLValues<serialization-standard-values>`.
tr: Bu anahtar türü, ``Account`` dışında herhangi bir değer türünü saklamak için kullanılır. Ayrıca kontratlarda kullanılan ``URef``ler, anahtarın altında saklanan değerin yetkisiz kullanımını engellemek için izin bilgisi taşır. Bu izin bilgisi çalışma zamanı tarafından izlenir, yani kötü niyetli bir kontrat, kontratın sahip olmadığı izinlere sahip bir ``URef`` üretmeye çalışırsa, kontratın taklit edilemez referansı “taklit etmeye” çalıştığını söylüyoruz ve çalışma zamanı taklit edilmiş bir ``URef`` hatası oluşturacaktır. Bir ``URef`` için izinler, kontrat çağrıları boyunca verilebilir ve ``URef`` altında saklanan verilerin kontrollü bir şekilde paylaşılmasına izin verir. Anahtarı temsil eden 32 baytlık tanımlayıcı, çalışma zamanı tarafından rastgele oluşturulur (daha fazla bilgi için :ref:`Execution Semantics <execution-semantics-urefs>`e bakın). ``URefs`` için izinleri tanımlayan ``Access Rights`` için serileştirme, :ref:`CLValues <serialization-standard-values>` kısmında detaylandırılmıştır.

source: Permissions for ``URef``\ s
fr: Autorisations pour ``URef``
tr: ``URef``ler için izinler

source: In the runtime, a ``URef`` carries its permissions called ``AccessRights``. Additionally, the runtime tracks what ``AccessRights`` would be valid for each ``URef`` to have in each context. As mentioned above, if a malicious contract attempts to use a ``URef`` with ``AccessRights`` that are not valid in its context, then the runtime will raise an error; this is what enforces the security properties of all URefs used as a key. By default, in all contexts, all ``URef``\ s are assumed invalid regardless of declared AccessRights and are checked against the executing context for validity upon each attempted usage in session or smart contract logic. A ``URef`` can only be added to a context by the host logic, in the following ways:
fr: Dans le runtime, un ``URef`` porte ses autorisations appelées ``AccessRights``. De plus, le runtime surveille les ``AccessRights`` qui seraient valables pour chaque ``URef`` dans chaque contexte. Comme mentionné plus haut, si un contrat malveillant tente d'utiliser un ``URef`` avec des ``AccessRights`` qui ne sont pas valides dans son contexte, alors le runtime lancera une erreur ; c'est ce qui permet d'appliquer les propriétés de sécurité de toutes les URefs utilisées comme clé. Par défaut, dans tous les contextes, toutes les ``URef`` sont considérées comme non valides, quels que soient les AccessRights déclarés, et leur validité est vérifiée dans le contexte d'exécution à chaque tentative d'utilisation dans la logique de session ou de contrat intelligent. Un ``URef`` ne peut être ajouté à un contexte que par la logique de l'hôte, de la manière suivante :
tr: Çalışma zamanında, bir ``URef``, ``AccessRights`` adlı izinlerini taşır. Ek olarak, çalışma zamanı, her bir bağlamda sahip olduğu her bir ``URef`` için hangi ``AccessRights``ın geçerli olacağını izler. Yukarıda belirtildiği gibi, kötü niyetli bir sözleşme, bağlamında geçerli olmayan ``AccessRights`` ile ``URef`` kullanmaya çalışırsa, çalışma zamanı bir hata verir; anahtar olarak kullanılan tüm URef'lerin güvenlik özelliklerini zorlayan budur. Varsayılan olarak, tüm bağlamlarda, tüm ``URef``\lerin beyan edilen AccessRights'a bakılmaksızın geçersiz olduğu varsayılır ve oturumda veya akıllı kontrat mantığında denenen her kullanımda geçerlilik için yürütme bağlamına göre kontrol edilir. Bir ``URef``, yalnızca aşağıdaki yollarla ana bilgisayar mantığı tarafından bir bağlama eklenebilir:

source: it can exist in a set of “known” ``URef``\ s
fr: il peut exister dans un ensemble de ``URef`` "connus".
tr: “bilinen” ``URef`` ler kümesi içerisinde var olabilir

source: it can be freshly created by the runtime via the ``new_uref`` function
fr: il peut être créé par le runtime via la fonction ``new_uref``.
tr: çalışma zamanı tarafından ``new_uref`` fonksiyonu aracılığıyla yeni oluşturulabilir

source: for called contracts, it can be passed in by the caller via the arguments to ``call_contract``
fr: pour les contrats appelés, il peut être passé par l'appelant via les arguments de ``call_contract``
tr: çağrılan sözleşmeler için, çağıran tarafından ``call_contract`` argümanları aracılığıyla iletilebilir

source: it can be returned to the caller from ``call_contract`` via the ``ret`` function
fr: il peut être retourné à l'appelant depuis ``call_contract`` via la fonction ``ret``.
tr: ``ret`` fonksiyonu aracılığıyla ``call_contract``tan çağıran kişiye döndürülebilir

source: Note: that only valid ``URef``\ s may be added to the known ``URef``\ s or cross call boundaries; this means the system cannot be tricked into accepting a forged ``URef`` by getting it through a contract or stashing it in the known ``URef``\ s.
fr: Remarque : seuls les ``URef`` valides peuvent être ajoutés aux ``URef`` connus ou traverser les frontières d'appel ; cela signifie que le système ne peut pas être amené à accepter un ``URef`` falsifié en l'obtenant par un contrat ou en le cachant dans les ``URef`` connus.
tr: Not: bilinen "URef"\ lere veya çapraz çağrı sınırlarına yalnızca geçerli ``URef``\ ler eklenebilir; bu, sistemin sahte bir ``URef``i bir sözleşme yoluyla alarak veya bilinen ``URef``\ lerde saklayarak kabul etmesi için kandırılamayacağı anlamına gelir.

source: The ability to pass ``URef``\ s between contexts via ``call_contract`` / ``ret``, allows them to be used to share state among a fixed number of parties while keeping it private from all others.
fr: La possibilité de passer des ``URef`` entre contextes via ``call_contract`` / ``ret``, permet de les utiliser pour partager un état entre un nombre fixe de parties tout en le gardant privé de toutes les autres.
tr: ``call_contract`` / ``ret`` aracılığıyla bağlamlar arasında ``URef``\ leri devretme yeteneği, durumu diğerlerinden özel tutarken sabit sayıda taraf arasında paylaşmalarına izin verir.
