Repository: casper-network/docs-archive
Catalog: locale/*/LC_MESSAGES/dapp-dev-guide/tutorials/multi-sig/client.po
Languages: fr, tr, vi

source: Client Example
fr: Exemple de client
tr: İstemci Örneği
vi: Ví dụ về Client

source: This section covers an example client that invokes a smart contract for key management. In addition to the main account, the client code will add two additional accounts to perform deployments. The two deployment accounts will perform deployments but will not be able to add another account.
fr: Cette section présente un exemple de client qui invoque un contrat intelligent pour la gestion des clés. En plus du compte principal, le code client ajoutera deux comptes supplémentaires pour effectuer des déploiements. Les deux comptes de déploiement effectueront des déploiements mais ne pourront pas ajouter un autre compte.
tr: Bu bölüm, anahtar yönetimi için akıllı bir kontrat başlatan örnek bir istemciyi kapsar. Ana hesaba ek olarak, istemci kodu, dağıtımları gerçekleştirmek için iki ek hesap ekleyecektir. İki dağıtım hesabı, dağıtımları gerçekleştirir ancak başka bir hesap ekleyemez.
vi: Phần này bao gồm một ví dụ client gọi một hợp đồng thông minh để quản lý khóa. Ngoài tài khoản chính, mã client sẽ thêm hai tài khoản phụ để thực hiện triển khai. Hai tài khoản triển khai sẽ thực hiện triển khai nhưng sẽ không thể thêm tài khoản khác.

source: You will test your client using `nctl <https://github.com/CasperLabs/casper-node/tree/master/utils/nctl>`_, and you will interact with your local blockchain.
tr: İstemcinizi `nctl <https://github.com/CasperLabs/casper-node/tree/master/utils/nctl>`_, kullanarak test edeceksiniz ve yerel blokzincirinizle etkileşime geçeceksiniz.
vi: Bạn sẽ kiểm tra client của mình bằng cách sử dụng `nctl <https://github.com/CasperLabs/casper-node/tree/master/utils/nctl>`_ và bạn sẽ tương tác với chuỗi khối cục bộ của mình.

source: Prerequisites
fr: Prérequis
tr: Önkoşullar
vi: Điều kiện cần

source: You have compiled the `example contract <https://github.com/casper-ecosystem/keys-manager>`_ for key management
fr: Vous avez compilé le `contrat exemple <https://github.com/casper-ecosystem/keys-manager>`_ pour la gestion des clés.
tr: Anahtar yönetimi için `örnek kontratı <https://github.com/casper-ecosystem/keys-manager>`_ derlediniz.
vi: Bạn đã biên dịch `hợp đồng mẫu <https://github.com/casper-ecosystem/keys-manager>`_ để quản lý khóa

source: You have set up the `NCTL <https://github.com/CasperLabs/casper-node/tree/master/utils/nctl>`_ tool according to the `NCTL guide <https://docs.casperlabs.io/en/latest/dapp-dev-guide/setup-nctl.html>`_
tr: `NCTL <https://github.com/CasperLabs/casper-node/tree/master/utils/nctl>`_ aracını `NCTL kılavuzu <https://docs.casperlabs.io/en/latest/dapp-dev-guide/setup-nctl.html>`_na göre ayarladınız
vi: Bạn đã thiết lập công cụ <https://github.com/CasperLabs/casper-node/tree/master/utils/nctl>`_ theo `Hướng dẫn NCTL <https://docs.casperlabs.io/en/latest/dapp-dev-guide/setup-nctl.html>`_

source: Setting up a local Casper Network
fr: Mise en place d'un réseau local Casper
tr: Yerel bir Casper Network oluşturmak
vi: Thiết lập mạng Casper cục bộ

source: Navigate to your ``casper-node`` folder and run the following NCTL commands.
fr: Naviguez dans votre dossier ``casper-node`` et exécutez les commandes NCTL suivantes.
tr: ``casper-node`` klasörünüze gidin ve aşağıdaki NCTL komutlarını çalıştırın.
vi: Chuyển đến thư mục ``casper-node`` của bạn và chạy các lệnh NCTL sau.

source: The network you created with the NCTL tool has a special account called a faucet account, which holds your tokens. You will need these tokens to interact with the network. If the network is up and running, you can see your faucet account details with the command below.
fr: Le réseau que vous avez créé à l'aide de l'outil NCTL possède un compte spécial appelé compte faucet, qui contient vos jetons. Vous aurez besoin de ces jetons pour interagir avec le réseau. Si le réseau est opérationnel, vous pouvez voir les détails de votre compte faucet avec la commande ci-dessous.
tr: NCTL aracıyla oluşturduğunuz ağ, tokenlerinizi tutan, musluk hesabı adı verilen özel bir hesaba sahiptir. Ağ ile etkileşim kurmak için bu tokenlere ihtiyacınız olacak. Ağ açık ve çalışıyorsa, aşağıdaki komutla musluk hesap detaylarınızı görebilirsiniz.
vi: Mạng bạn đã tạo bằng công cụ NCTL có một tài khoản đặc biệt được gọi là tài khoản chốt, tài khoản này chứa các token của bạn. Bạn sẽ cần những token này để tương tác với mạng. Nếu mạng đang hoạt động, bạn có thể xem chi tiết tài khoản vòi của mình bằng lệnh bên dưới.

source: Setting up the Client
fr: Configuration du Client
tr: Bir İstemci Oluşturmak
vi: Thiết lập Client

source: Navigate to your ``keys-manager/client/`` folder and create the ``.env`` file to specify the configuration needed for your client to communicate with the network.
fr: Naviguez vers votre dossier ``keys-manager/client/`` et créez le fichier ``.env`` pour spécifier la configuration nécessaire à votre client pour communiquer avec le réseau.
tr: ``keys-manager/client/`` klasörünüze gidin ve istemcinizin ağ ile iletişim kurması için gereken yapılandırmayı belirtmek için ``.env`` dosyasını oluşturun.
vi: Chuyển đến thư mục ``keys-manager/client/`` của bạn và tạo tệp ``.env`` để chỉ định cấu hình cần thiết cho client của bạn khi giao tiếp với mạng.

source: This client code, by default, expects a compiled WASM file in the ``contract`` folder and a local network called ``casper-net-1``. In this tutorial, you only need to configure the ``BASE_KEY_PATH``, the absolute path to your faucet account. So, your ``.env`` file will contain only one entry for the ``BASE_KEY_PATH`` and would look like this (replacing <ENTER_YOUR_PATH> with your path):
fr: Ce code client, par défaut, attend un fichier WASM compilé dans le dossier ``contract`` et un réseau local appelé ``casper-net-1``. Dans ce tutoriel, vous avez seulement besoin de configurer le ``BASE_KEY_PATH``, le chemin absolu vers votre compte faucet. Ainsi, votre fichier ``.env`` ne contiendra qu'une seule entrée pour le ``BASE_KEY_PATH`` et ressemblera à ceci (en remplaçant <ENTER_YOUR_PATH> avec votre chemin):
tr: Bu istemci kodu, varsayılan olarak, ``contract`` klasöründe derlenmiş bir WASM dosyası ve ``casper-net-1`` adlı yerel bir ağ bekler. Bu rebherde, yalnızca musluk hesabınızın mutlak yolu olan ``BASE_KEY_PATH`` yapılandırmanız gerekir. Böylece, ``.env`` dosyanız ``BASE_KEY_PATH`` için yalnızca bir giriş içerecek ve şöyle görünecektir (<ENTER_YOUR_PATH>yolunuzla değiştirilerek):
vi: Mã client này, theo mặc định, yêu cầu một tệp WASM đã biên dịch trong thư mục ``contract`` và một mạng cục bộ có tên là ``casper-net-1``. Trong hướng dẫn này, bạn chỉ cần cấu hình ``BASE_KEY_PATH``, đây là đường dẫn tuyệt đối đến tài khoản chốt của bạn. Vì vậy, tệp ``.env`` của bạn sẽ chỉ chứa một mục nhập dữ liệu ``BASE_KEY_PATH`` và sẽ giống như thế này (thay thế <ENTER_YOUR_PATH> bằng đường dẫn của bạn):

source: You can set other environment variables described in the table below.
fr: Vous pouvez définir d'autres variables d'environnement décrites dans le tableau ci-dessous.
tr: Aşağıdaki tabloda açıklanan diğer ortam değişkenlerini ayarlayabilirsiniz.
vi: Bạn có thể đặt các biến khác được mô tả trong bảng bên dưới.

source: Variable
tr: Değişken
vi: Biến

source: Description
tr: Tanım
vi: Mô tả

source: Default value
tr: Varsayılan değer
vi: Giá trị mặc định

source: The URL of the first node in your local network.
fr: L'URL du premier nœud de votre réseau local.
tr: Yerel ağınızdaki ilk düğümün URL adresi.
vi: URL của nút đầu tiên trong mạng cục bộ của bạn.

source: The path of the compiled WASM contract.
fr: Le chemin du contrat WASM compilé.
tr: Derlenmiş WASM kontratının yolu.
vi: Đường dẫn của hợp đồng WASM đã biên dịch.

source: The name of your local network set up by NCTL.
fr: Le nom de votre réseau local mis en place par NCTL.
tr: NCTL tarafından kurulan yerel ağınızın adı.
vi: Tên mạng cục bộ của bạn do NCTL thiết lập.

source: Number of motes that accounts will be funded.
fr: Nombre de motes avec lesquels les comptes seront approvisionnés.
tr: Hesapların finanse edileceği mote sayısı.
vi: Số lượng mote sẽ nạp vào các tài khoản.

source: Number of motes that will be used as payment for deploys.
fr: Nombre de motes qui seront utilisés comme paiement pour les déploiements.
tr: Dağıtımlar için ödeme olarak kullanılacak mote sayısı.
vi: Số lượng mote mà sẽ sử dụng để trả cho việc triển khai

source: Number of motes that will be used for native test transfers.
fr: Nombre de motes qui seront utilisés pour les transferts de test natifs.
tr: Yerel test transferleri için kullanılacak mote sayısı.
vi: Số lượng motes sẽ được sử dụng để chuyển thử nghiệm gốc.

source: Next, close the ``.env`` file and install the JavaScript packages in the ``keys-manager/client`` folder with the following command.
fr: Ensuite, fermez le fichier ``.env`` et installez les packages JavaScript dans le dossier ``keys-manager/client`` avec la commande suivante.
tr: Sonra, ``.env`` dosyasını kapatın ve aşağıdaki komutla ``keys-manager/client`` klasöründeki JavaScript paketlerini kurun.
vi: Tiếp theo, đóng tệp ``.env`` và cài đặt các gói JavaScript trong thư mục ``keys-manager/client`` bằng lệnh sau.

source: Testing the Client
fr: Test du Client
tr: İstemciyi Test Etmek
vi: Kiểm thử Client

source: Navigate to your ``/keys-manager/client`` folder and run the ``keys-manager`` using ``npm``. Your WASM file's path is relative to the ``client`` folder, so you need to run the file from here.
tr: ``/keys-manager/client`` klasörünüze gidin ve ``npm``yi kullanarak ``keys-manager``ı çalıştırın. WASM dosyanızın yolu ``client`` klasörüne göredir, bu yüzden dosyayı buradan çalıştırmanız gerekir.
vi: Chuyển đến thư mục ``/keys-manager/client``của bạn và chạy ``keys-manager`` bằng cách sử dụng ``npm``. Đường dẫn tệp WASM của bạn có liên quan đến thư mục ``client``, vì vậy bạn cần chạy tệp từ đây.

source: If the code works, the beginning of the output will look like this:
fr: Si le code fonctionne, le début de la sortie ressemblera à ceci :
tr: Kod çalışıyorsa, çıktının başlangıcı şöyle görünecektir:
vi: Nếu mã hoạt động, phần đầu của đầu ra sẽ giống như sau:

source: An image of the beginning of the keys-manager output.
fr: Une image du début de la sortie du keys-manager.
tr: Anahtar yöneticisi çıktısının başlangıcının bir görüntüsü.
vi: Hình ảnh về phần đầu của đầu ra trình quản lý khóa.

source: You can match the output against the expected output described below.
tr: Çıktıyı aşağıda açıklanan beklenen çıktıyla eşleştirebilirsiniz.
vi: Bạn có thể so khớp đầu ra với đầu ra mong đợi được mô tả bên dưới.

source: Exploring the Client Code
fr: Exploration du code client
tr: İstemci Kodunu Keşfetmek
vi: Khám phá Client Code

source: If you would like to explore the client output and how the client code implements key management, open the client output and the ``keys-manager.js`` file side by side.
fr: Si vous voulez explorer la sortie du client et la façon dont le code du client implémente la gestion des clés, ouvrez la sortie du client et le fichier ``keys-manager.js`` côte à côte.
tr: İstemci çıktısını ve istemci kodunun anahtar yönetimini nasıl uyguladığını keşfetmek istiyorsanız, istemci çıktısını ve ``keys-manager.js`` dosyasını yan yana açın.
vi: Nếu bạn muốn khám phá đầu ra của client và cách mã client triển khai quản lý khóa, hãy mở đầu ra của client và tệp ``keys-manager.js`` cạnh nhau.

source: In the code, we set the weight for the primary account to 3.
fr: Dans le code, nous avons fixé le poids du compte primaire à 3.
tr: Kodda, birincil hesabın ağırlığını 3 olarak belirledik.
vi: Trong mã này, chúng ta đặt trọng số cho tài khoản chính là 3.

source: At this point, we expect an account structure similar to the following, with real account addresses replacing the sample addresses:
fr: À ce stade, nous prévoyons une structure de compte similaire à la suivante, avec des adresses de compte réelles remplaçant les adresses types :
tr: Bu noktada örnek adreslerin yerine gerçek hesap adresleri ile aşağıdakine benzer bir hesap yapısı bekliyoruz:
vi: Tại thời điểm này, chúng ta mong đợi cấu trúc tài khoản giống như sau, với địa chỉ tài khoản thực thay thế địa chỉ mẫu:

source: Next, we set the key management threshold for the main account to 3. With this threshold, you can manage other keys and have control over the entire account.
fr: Ensuite, nous définissons le seuil de gestion des clés pour le compte principal à 3. Avec ce seuil, vous pouvez gérer d'autres clés et avoir le contrôle sur l'ensemble du compte.
tr: Sonra ana hesap için anahtar yönetimi eşiğini 3 olarak belirledik. Bu eşik ile diğer anahtarları yönetebilir ve tüm hesap üzerinde kontrol sahibi olabilirsiniz.
vi: Tiếp theo, chúng ta đặt ngưỡng quản lý khóa cho tài khoản chính là 3. Với ngưỡng này, bạn có thể quản lý các khóa khác và có quyền kiểm soát toàn bộ tài khoản.

source: We expect an account structure similar to this:
fr: Nous nous attendons à une structure de compte similaire à celle-ci :
tr: Şuna benzer bir hesap yapısı bekliyoruz:
vi: Chúng ta mong đợi một cấu trúc tài khoản tương tự như sau:

source: Next, the client code sets the deployment threshold to 2 for this account.
fr: Ensuite, le code client fixe le seuil de déploiement à 2 pour ce compte.
tr: Sonra, istemci kodu bu hesap için dağıtım eşiğini 2 olarak ayarlar.
vi: Tiếp theo, mã client đặt ngưỡng triển khai là 2 cho tài khoản này.

source: The next step is to add a new key with weight 1. You cannot do anything with this key alone since all the action thresholds are higher than 1.
fr: L'étape suivante consiste à ajouter une nouvelle clé avec un poids de 1. Vous ne pouvez rien faire avec cette seule clé puisque tous les seuils d'action sont supérieurs à 1.
tr: Bir sonraki adım ağırlık 1 olan yeni bir anahtar eklemektir. Tüm işlem eşikleri 1'den büyük olduğu için bu anahtarla tek başına hiçbir şey yapamazsınız.
vi: Bước tiếp theo là thêm khóa mới có trọng số 1. Bạn không thể làm bất cứ điều gì với khóa này một mình vì tất cả các ngưỡng tác vụ đều cao hơn 1.

source: We expect this account structure, with a new associated key and account address:
fr: Nous nous attendons à cette structure de compte, avec une nouvelle clé associée et une adresse de compte :
tr: Yeni bir ilişkili anahtar ve hesap adresiyle bu hesap yapısını bekliyoruz:
vi: Chúng ta mong đợi cấu trúc tài khoản như thế này, với một địa chỉ tài khoản và khóa được liên kết mới:

source: We will add another key with weight 1. If you use this key with the second key, you can deploy, since the weights add up to 2.
fr: Nous allons ajouter une autre clé avec un poids de 1. Si vous utilisez cette clé avec la deuxième clé, vous pouvez déployer, puisque les poids s'additionnent pour atteindre 2.
tr: Ağırlıkları 1 olan başka bir anahtar ekleyeceğiz. Bu anahtarı ikinci anahtarla kullanırsanız, ağırlıklar 2'ye kadar eklendiğinden dağıtabilirsiniz.
vi: Chúng ta sẽ thêm một khóa khác có trọng số 1. Nếu bạn sử dụng khóa này với khóa thứ hai, bạn có thể triển khai, vì trọng số cộng lại là 2.

source: We expect an account structure similar to the following:
fr: Nous nous attendons à une structure de compte similaire à celle-ci :
tr: Aşağıdakine benzer bir hesap yapısı bekliyoruz:
vi: Chúng ta mong đợi một cấu trúc tài khoản tương tự như sau:

source: Next, we will transfer tokens from the main account and perform a deployment. When the deployment accounts sign the transaction, they can transfer funds from the faucet account since their combined weight is 2, which meets the deployment threshold.
fr: Ensuite, nous allons transférer des jetons depuis le compte principal et effectuer un déploiement. Lorsque les comptes de déploiement signent la transaction, ils peuvent transférer des fonds depuis le compte faucet puisque leur poids combiné est de 2, ce qui correspond au seuil de déploiement.
tr: Sonra, ana hesaptan tokenleri aktaracağız ve bir dağıtım gerçekleştireceğiz. Dağıtım hesapları işlemi imzaladığında, toplam ağırlıkları dağıtım eşiğini karşılayan 2 olduğundan, musluk hesabından fon aktarabilirler.
vi: Tiếp theo, chúng ta sẽ chuyển token từ tài khoản chính và thực hiện triển khai. Khi tài khoản triển khai ký giao dịch, họ có thể chuyển tiền từ tài khoản chốt vì trọng số tổng hợp của chúng là 2, đáp ứng ngưỡng triển khai.

source: Image showing the output of the funds transfer.
fr: Image montrant la sortie du transfert de fonds.
tr: Para transferinin çıktısını gösteren resim.
vi: Hình ảnh hiển thị đầu ra của việc chuyển tiền.

source: If you dive into the `transferDeploy` function, you will see the transfer of funds.
fr: Si vous parcourez en détail la fonction `transferDeploy`, vous verrez le transfert de fonds.
tr: `transferDeploy` işlevine girerseniz, para transferini göreceksiniz.
vi: Nếu bạn đi sâu vào hàm `transferDeploy`, bạn sẽ thấy việc chuyển tiền.

source: After the above transfer of funds, the client code removes both deployment accounts.
fr: Après le transfert de fonds ci-dessus, le code client supprime les deux comptes de déploiement.
tr: Yukarıdaki para transferinden sonra, istemci kodu her iki dağıtım hesabını da kaldırır.
vi: Sau khi chuyển tiền ở trên, mã client sẽ xóa cả hai tài khoản triển khai.

source: At this point, we expect the following account structure:
fr: Après le transfert de fonds ci-dessus, le code client supprime les deux comptes de déploiement.
tr: Bu noktada aşağıdaki hesap yapısını bekliyoruz:
vi: Tại thời điểm này, chúng tôi mong đợi cấu trúc tài khoản sau:

source: Congratulations! You have completed the tutorial.
tr: Tebrikler! Eğitimi tamamladınız.
vi: Xin chúc mừng! Bạn đã hoàn thành phần hướng dẫn.

source: You can now employ a similar strategy to set up your account using multiple keys.
fr: Vous pouvez maintenant employer une stratégie similaire pour configurer votre compte en utilisant plusieurs clés.
tr: Artık hesabınızı birden çok anahtar kullanarak kurmak için benzer bir strateji uygulayabilirsiniz.
vi: Giờ đây, bạn có thể sử dụng một cách tương tự để thiết lập tài khoản của mình bằng nhiều khóa.

source: We offer some additional examples of account management in the next section.
fr: Nous proposons quelques exemples supplémentaires de gestion de compte dans la section suivante.
tr: Bir sonraki bölümde bazı ek hesap yönetimi örnekleri sunuyoruz.
vi: Chúng tôi cung cấp một số ví dụ bổ sung về quản lý tài khoản trong phần tiếp theo.

source: You will test your client using `nctl <https://github.com/casper-network/casper-node/tree/master/utils/nctl>`_, and you will interact with your local blockchain.
fr: Vous testerez votre client en utilisant `nctl <https://github.com/casper-network/casper-node/tree/master/utils/nctl>`_, et vous interagirez avec votre blockchain locale.

source: You have set up the `NCTL <https://github.com/casper-network/casper-node/tree/master/utils/nctl>`_ tool according to the `NCTL guide <https://docs.casperlabs.io/en/latest/dapp-dev-guide/setup-nctl.html>`_
fr: Vous avez configuré l'outil `NCTL <https://github.com/casper-network/casper-node/tree/master/utils/nctl>`_ selon le guide `NCTL <https://docs.casperlabs.io/fr/latest/dapp-dev-guide/setup-nctl.html>`_

source: Navigate to your ``/keys-manager/client`` folder and run the `keys-manager` using `npm`. Your WASM file's path is relative to the ``client`` folder, so you need to run the file from here.
fr: Naviguez vers votre dossier ``/keys-manager/client`` et exécutez ``keys-manager`` en utilisant ``npm``. Le chemin de votre fichier WASM est relatif au dossier ``client``, donc vous devez exécuter le fichier à partir d'ici.

source: **Note**: You may have to wait some time after entering the above command until you see a result.
fr: **Note** : Il se peut que vous deviez attendre un certain temps après avoir entré la commande ci-dessus avant de voir un résultat.

source: You can match the rest of the output against the expected output described in the next section while exploring the client code.
fr: Vous pouvez comparer le reste de la sortie avec la sortie attendue décrite dans la section suivante tout en explorant le code client.

source: Congratulations! You have completed this tutorial.
fr: Félicitations ! Vous avez terminé le tutoriel.
