Repository: casper-network/docs-archive
Catalog: locale/*/LC_MESSAGES/dapp-dev-guide/tutorials/multi-sig/contract.po
Languages: fr, tr, vi

source: Contract Example
fr: Exemple de contrat
tr: Kontrat Örneği
vi: Ví dụ về hợp đồng

source: This section covers an example smart contract used for key management.
fr: Cette section présente un exemple de contrat intelligent utilisé pour la gestion des clés.
tr: Bu bölüm anahtar yönetimi için kullanılan bir akıllı kontratı kapsar.
vi: Phần này bao gồm một hợp đồng thông minh mẫu được sử dụng để quản lý khóa.

source: Implementing the Smart Contract
fr: Mise en œuvre du contrat intelligent
tr: Akıllı Kontrat Uygulama
vi: Triển khai Hợp đồng thông minh

source: First, download `the example contract and client <https://github.com/casper-ecosystem/keys-manager>`_ for key management.
fr: Tout d'abord, télécharger `l'exemple de contrat et de client <https://github.com/casper-ecosystem/keys-manager>`_ pour la gestion des clés.
tr: İlk olarak, anahtar yönetimi için `örnek kontrat ve istemciyi <https://github.com/casper-ecosystem/keys-manager>`_ indirin.
vi: Đầu tiên, hãy tải xuống `hợp đồng mẫu và ứng dụng client <https://github.com/casper-ecosystem/keys-manager>`_ để quản lý khóa.

source: The smart contract above can help you manage your account. You can add keys and remove keys from your account, define weights for each key, and set thresholds for key management and network deployments.
fr: Le contrat intelligent ci-dessus peut vous aider à gérer votre compte. Vous pouvez ajouter des clés et supprimer des clés de votre compte, définir des pondérations pour chaque clé et fixer des seuils pour la gestion des clés et les déploiements sur le réseau.
tr: Yukarıdaki akıllı kontrat, hesabınızı yönetmenize yardımcı olabilir. Hesabınıza anahtarlar ekleyebilir ve anahtarları kaldırabilir, her anahtar için ağırlık tanımlayabilir ve anahtar yönetimi ve ağ dağıtımları için eşikler belirleyebilirsiniz.
vi: Hợp đồng thông minh ở trên có thể giúp bạn quản lý tài khoản của mình. Bạn có thể thêm khóa và xóa khóa khỏi tài khoản của mình, xác định trọng số cho từng khóa và đặt ngưỡng cho quản lý khóa và triển khai mạng.

source: You could also refer to this smart contract as the `account code`. Note that once you deploy this smart contract, you cannot change it. As a result, you can rely on its behavior and state as if it were a binding agreement.
fr: Vous pouvez également appeler ce contrat intelligent le `account code`. Notez qu'une fois que vous avez déployé ce contrat intelligent, vous ne pouvez plus le modifier. Par conséquent, vous pouvez vous fier à son comportement et à son état comme s'il s'agissait d'un accord contraignant.
tr: Bu akıllı kontratı `account code` olarakta adlandırabilirsiniz. Bu akıllı kontratı dağıttıktan sonra değiştiremeyeceğinizi unutmayın. Sonuç olarak, davranışına güvenebilir ve bağlayıcı bir anlaşmaymış gibi belirtebilirsiniz.
vi: Bạn cũng có thể gọi hợp đồng thông minh này là `mã tài khoản`. Lưu ý rằng khi bạn triển khai hợp đồng thông minh này, bạn không thể thay đổi nó. Do đó, bạn có thể dựa vào hành vi và trạng thái của nó như thể đó là một thỏa thuận ràng buộc.

source: The account code execution starts in ``main.rs``, where the ``call`` function calls the ``execute`` function. This code is similar to a script that executes and implements your account behavior. Remember that when you send a contract (WASM file) to the network, the contract execution engine will invoke the ``call`` function. You will find the details of the ``execute`` function in ``lib.rs``, which defines the smart contract behavior and its functions.
fr: L'exécution du ' account code' commence dans ``main.rs``, où la fonction ``call`` appelle la fonction ``execute``. Ce code est similaire à un script qui s'exécute et met en œuvre le comportement de votre compte. Rappelez-vous que lorsque vous envoyez un contrat (fichier WASM) au réseau, le moteur d'exécution du contrat invoquera la fonction ``call``. Vous trouverez les détails de la fonction ``execute`` dans ``lib.rs``, qui définit le comportement du contrat intelligent et ses fonctions.
tr: Hesap kodu yürütmesi, ``call`` işlevinin ``execute`` işlevini çağırdığı ``main.rs``de başlar. Bu kod, hesap davranışınızı yürüten ve uygulayan bir betiğe benzerdir. Ağa bir kontrat (WASM dosyası) gönderdiğinizde, kontrat yürütme motorunun ``call`` işlevini çağıracağını unutmayın. ``execute`` işlevinin ayrıntılarını, akıllı kontrat davranışını ve işlevlerini tanımlayan ``lib.rs`` içinde bulacaksınız.
vi: Quá trình thực thi mã tài khoản bắt đầu trong ``main.rs``, trong đó hàm ``call`` gọi hàm ``execute`` . Mã này tương tự như script thực thi và triển khai hoạt động tài khoản của bạn. Hãy nhớ rằng khi bạn gửi một hợp đồng (tệp WASM) đến mạng, công cụ thực thi hợp đồng sẽ gọi hàm ``call``. Bạn sẽ tìm thấy chi tiết về hàm ``execute`` trong ``lib.rs`` mà xác định hành vi hợp đồng thông minh và các chức năng của nó.

source: Function
fr: Fonction
tr: İşlev
vi: Hàm

source: Description
tr: Tanım
vi: Mô tả

source: execute
tr: yürütmek

source: Read arguments and set key weights and action thresholds.
fr: Lire les arguments et fixer les poids des clés et les seuils d'action.
tr: Argümanları okuyun ve anahtar ağırlıkları ve eylem eşiklerini ayarlayın.
vi: Đọc các đối số, đặt các trọng số và ngưỡng hành động chính.

source: Set a weight for a specific key.
fr: Définir un poids pour une clé spécifique.
tr: Bir belirli anahtar için bir ağırlık ayarlayın.
vi: Đặt trọng lượng cho một khóa cụ thể.

source: Add or update a key, given the key and the weight.
fr: Ajouter ou mettre à jour une clé, étant donné la clé et le poids.
tr: Bir anahtar ekleyin ya da anahtar ve ağırlık verilerek güncelleyin.
vi: Thêm hoặc cập nhật một khóa mà đã có khóa và trọng số.

source: Add a specific key.
fr: Ajouter une clé spécifique.
tr: Bir belirli anahtar ekleyin.
vi: Thêm một khóa cụ thể.

source: Remove a key if it exists.
fr: Supprime une clé si elle existe.
tr: Varsa bir anahtarı kaldırın.
vi: Xóa bỏ khóa nếu nó tồn tại.

source: Set the threshold for key management and deployments, given the permission level and associated weight.
fr: Définir le seuil pour la gestion et le déploiement des clés, compte tenu du niveau de permission et du poids associé.
tr: Anahtar yönetimi ve izin düzeyi ile ilgili ağırlık verilerek dağıtımlar için eşiği ayarlayın.
vi: Đặt ngưỡng cho việc triển khai và quản lý khóa, dựa trên cấp độ quyền và trọng số liên quan.

source: You will find a construct to handle the contract arguments in ``api.rs``. Also, possible errors can arise and are defined in ``errors.rs``. You will see that ``lib.rs`` uses both of these libraries:
fr: Vous trouverez un 'construct' pour gérer les arguments du contrat dans ``api.rs``. De plus, des erreurs possibles peuvent survenir et sont définies dans ``errors.rs``. Vous verrez que ``lib.rs`` utilise ces deux librairies :
tr: ```api.rs`` içinde kontrat argümanlarını ele alabilmek için bir yapı bulacaksınız. Ayrıca olası hatalar ortaya çıkabilir ve ``errors.rs`` içinde tanımlanır. ``lib.rs`` dosyasının bu kütüphanelerin her ikisini de kullandığını göreceksiniz:
vi: Bạn sẽ tìm thấy một cấu trúc để xử lý các đối số hợp đồng trong ``api.rs``. Ngoài ra, có các lỗi có thể phát sinh và sẽ được định nghĩa trong ``errors.rs``. Bạn sẽ thấy rằng ``lib.rs`` sử dụng cả hai thư viện này:

source: In the next section, you will build and prepare the smart contract for deployment.
fr: Dans la section suivante, vous allez construire et préparer le contrat intelligent pour le déploiement.
tr: Bir sonraki bölümde, dağıtım için akıllı kontrat derleyecek ve hazırlayacaksınız.
vi: Trong phần tiếp theo, bạn sẽ xây dựng và chuẩn bị hợp đồng thông minh để triển khai.

source: Building the Smart Contract
fr: Construire le contrat intelligent
tr: Akıllı Kontrat Derleme
vi: Xây dựng Hợp đồng thông minh

source: Before building the smart contract for this tutorial, you need to install the `Rust Contract SDK <https://docs.casperlabs.io/en/latest/dapp-dev-guide/setup-of-rust-contract-sdk.html>`_. Make sure you have the `development environment set up <https://docs.casperlabs.io/en/latest/dapp-dev-guide/setup-of-rust-contract-sdk.html#development-environment-setup>`_ before proceeding.
fr: Avant de construire le contrat intelligent pour ce tutoriel, vous devez installer le `Rust Contract SDK <https://docs.casperlabs.io/fr/latest/dapp-dev-guide/setup-of-rust-contract-sdk.html>`_. Assurez-vous que vous avez `l'environnement de développement configuré <https://docs.casperlabs.io/fr/latest/dapp-dev-guide/setup-of-rust-contract-sdk.html#development-environment-setup>`_ avant de continuer.
tr: Bu eğitim için akıllı kontrat oluşturmadan önce, `Rust Kontrat SDKsını <https://docs.casperlabs.io/en/latest/dapp-dev-guide/setup-of-rust-contract-sdk.html>`_ yüklemeniz gerekir. Devam etmeden önce, `geliştirme ortam kurulumuna <https://docs.casperlabs.io/en/latest/dapp-dev-guide/setup-of-rust-contract-sdk.html#development-environment-setup>`_ sahip olduğunuzdan emin olun.
vi: Trước khi xây dựng hợp đồng thông minh theo hướng dẫn này, bạn cần cài đặt `Rust Contract SDK <https://docs.casperlabs.io/en/latest/dapp-dev-guide/setup-of-rust-contract-sdk.html>`_. Đảm bảo rằng bạn đã `thiết lập môi trường phát triển <https://docs.casperlabs.io/en/latest/dapp-dev-guide/setup-of-rust-contract-sdk.html#development-environment-setup>`_ trước khi tiến hành.

source: Navigate to the ``keys-manager`` folder and set up the WASM compilation Rust toolchain, which will give you access to all the tools needed for developing smart contracts.
fr: Naviguez dans le dossier ``keys-manager`` et configurez la chaîne d'outils Rust de compilation WASM, qui vous donnera accès à tous les outils nécessaires au développement de contrats intelligents.
tr: ``keys-manager`` klasörüne gidin ve akıllı kontratlar geliştirmek için gereken tüm araçlara erişmenizi sağlayacak WASM derlemesi Rust araç zincirini kurun.
vi: Chuyển đến thư mục ``keys-manager`` và thiết lập chuỗi công cụ Rust biên dịch WASM, sẽ cung cấp cho bạn quyền truy cập vào tất cả các công cụ cần thiết để phát triển hợp đồng thông minh.

source: Next, open the ``contract`` folder and notice that it contains a ``Cargo.toml`` file, which defines a smart contract called ``keys-manager``. The ``cargo build`` command will invoke this file to generate the corresponding WASM file.
fr: Ensuite, ouvrez le dossier ``contract`` et remarquez qu'il contient un fichier ``Cargo.toml``, qui définit un contrat intelligent appelé ``keys-manager``. La commande ``cargo build`` invoquera ce fichier pour générer le fichier WASM correspondant.
tr: Ardından, ``contract`` klasörünü açın ve ``keys-manager`` adlı bir akıllı kontrat tanımlayan bir ``Cargo.toml`` dosyası içerdiğine dikkat edin. ``cargo build`` komutu, ilgili WASM dosyasını oluşturmak için bu dosyayı çağıracaktır.
vi: Tiếp theo, mở thư mục ``contract`` và sẽ thấy nó chứa tệp ``Cargo.toml`` để định nghĩa một hợp đồng thông minh được gọi là ``keys-manager``. Lệnh ``cargo build`` sẽ gọi tệp này để tạo tệp WASM tương ứng.

source: Compile the smart contract and create the WASM file using these commands:
fr: Compiler le contrat intelligent et créer le fichier WASM en utilisant ces commandes :
tr: Akıllı kontratı derleyin ve şu komutları kullanarak WASM dosyasını oluşturun:
vi: Biên dịch hợp đồng thông minh và tạo tệp WASM bằng các lệnh sau:

source: If the command were successful, you would find a ``keys-manager.wasm`` file in the following directory structure:
fr: Si la commande réussit, vous trouverez un fichier ``keys-manager.wasm`` dans la structure de répertoire suivante :
tr: Eğer komut başarılıysa, aşağıdaki dizin yapısında bir `keys-manager.wasm`` dosyası bulabilirsiniz:
vi: Nếu lệnh thành công, bạn sẽ thấy tệp ``keys-manager.wasm`` trong cấu trúc thư mục sau:

source: The contract directory structure contains a keys-manager-wasm file.
fr: La structure du répertoire du contrat contient un fichier keys-manager-wasm.
tr: Kontrat dizin yapısı keys-manager-wasm dosyasını içerir.
vi: Cấu trúc thư mục hợp đồng chứa một tệp key-manager-wasm.

source: Next, we will review the sample client that invokes this contract to setup the account and perform key management.
fr: Ensuite, nous allons examiner l'exemple de client qui invoque ce contrat pour configurer le compte et effectuer la gestion des clés.
tr: Ardından, hesabı kurmak ve anahtar yönetimini gerçekleştirmek için bu kontratı talep eden örnek istemciyi inceleyeceğiz.
vi: Tiếp theo, chúng tôi sẽ xem mẫu client gọi hợp đồng này để thiết lập tài khoản và thực hiện quản lý khóa.
