Repository: casper-network/docs-archive
Catalog: locale/*/LC_MESSAGES/dapp-dev-guide/tutorials/multi-sig/examples.po
Languages: fr, tr, vi

source: Additional Scenarios
fr: Scénarios supplémentaires
tr: Ek Senaryolar
vi: Các tình huống bổ sung

source: This section walks you through additional scenarios where accounts have multiple associated keys for signing transactions at various thresholds.
fr: Cette section vous guide à travers des scénarios supplémentaires où les comptes ont plusieurs clés associées pour signer des transactions à différents seuils.
tr: Bu bölüm, hesapların çeşitli eşiklerde işlemleri imzalamak için birden çok ilişkili anahtarı olduğu ek senaryolarda size yol gösterir.
vi: Phần này sẽ hướng dẫn bạn qua các tình huống bổ sung trong đó tài khoản có nhiều khóa được liên kết để ký giao dịch ở các ngưỡng khác nhau.

source: Scenario 1: signing transactions with a single key
fr: Scénario 1 : signature des transactions avec une seule clé
tr: Senaryo 1: işlemleri tek bir anahtarla imzalama
vi: Tình huống 1: ký giao dịch bằng một khóa duy nhất

source: In this example, only one key can sign transactions in the name of this account. The key is "account-hash-a1…" under the `associated_keys`. If you sign the transaction using "account-hash-a1…", the signed transaction will have a `weight` equal to 1. For deployments or key management, the weight required is also 1. Therefore, the associated key meets the deployment and key management thresholds and can perform both actions.
fr: Dans cet exemple, une seule clé peut signer les transactions au nom de ce compte. La clé est "account-hash-a1..." sous `associated_keys`. Si vous signez la transaction en utilisant "account-hash-a1...", la transaction signée aura un `poids` égal à 1. Pour les déploiements ou la gestion des clés, le poids requis est également de 1. Par conséquent, la clé associée répond aux seuils de déploiement et de gestion des clés et peut effectuer les deux actions.
tr: Bu örnekte, bu hesap adına işlemleri yalnızca bir anahtar imzalayabilir. Anahtar, `associated_keys` altında "account-hash-a1…" dir. İşlemi "account-hash-a1…" kullanarak imzalarsanız, imzalanan işlemin 1'e eşit bir "ağırlığı" olacaktır. Dağıtımlar veya anahtar yönetimi için gereken ağırlık da 1'dir. Bu nedenle, ilişkili anahtar dağıtımı karşılar ve anahtar yönetim eşikleri ve her iki eylemi de gerçekleştirebilir.
vi: Trong ví dụ này, chỉ một khóa có thể ký các giao dịch bằng tên của tài khoản này. Khóa là "account-hash-a1…" trong `associated_keys`. Nếu bạn ký giao dịch bằng "account-hash-a1…", giao dịch đã ký sẽ có `weight` bằng 1. Đối với triển khai hoặc quản lý khóa, trọng số bắt buộc cũng là 1. Do đó, khóa được liên kết đáp ứng việc triển khai và ngưỡng quản lý chính và có thể thực hiện cả hai hành động.

source: **Faucet account in scenario 1:**
fr: **Compte 'Faucet' dans le scénario 1:**
tr: **Senaryo 1'deki musluk hesabı:**
vi: **Tài khoản chốt trong trường hợp 1:**

source: Scenario 2: deploying with special keys
fr: Scénario 2 : déploiement avec des clés spéciales
tr: Senaryo 2: özel anahtarlarla dağıtma
vi: Tình huống 2: triển khai với các khóa đặc biệt

source: In this example, you have two keys. One key can only perform deployments, while the second key can perform key management and deployments. The key with account address *a1* can deploy and make account changes, but the second key with account address *b2* can only deploy.
fr: Dans cet exemple, vous avez deux clés. Une clé ne peut effectuer que des déploiements, tandis que la seconde clé peut effectuer la gestion des clés et des déploiements. La clé avec l'adresse de compte *a1* peut effectuer des déploiements et des modifications de compte, mais la seconde clé avec l'adresse de compte *b2* peut uniquement effectuer des déploiements.
tr: Bu örnekte iki anahtarınız var. Bir anahtar yalnızca dağıtımları gerçekleştirebilirken, ikinci anahtar anahtar yönetimi ve dağıtımlarını gerçekleştirebilir. *a1* hesap adresine sahip anahtar dağıtabilir ve hesap değişiklikleri yapabilir, ancak *b2* hesap adresine sahip ikinci anahtar yalnızca dağıtabilir.
vi: Trong ví dụ này, bạn có hai khóa. Một khóa chỉ có thể thực hiện triển khai, trong khi khóa thứ hai có thể thực hiện quản lý và triển khai khóa. Khóa có địa chỉ tài khoản *a1* có thể triển khai và thực hiện thay đổi tài khoản, nhưng khóa thứ hai có địa chỉ tài khoản *b2* chỉ có thể triển khai.

source: **Faucet account in scenario 2:**
fr: **Compte 'Faucet' dans le scénario 2:**
tr: **Senaryo 2'deki musluk hesabı:**
vi: **Tài khoản chốt trong trường hợp 2:**

source: Scenario 3: signing transactions with multiple keys
fr: Scénario 3 : signature de transactions avec des clés multiples
tr: Senaryo 3: işlemleri birden çok anahtarla imzalama
vi: Tình huống 3: ký giao dịch bằng nhiều khóa

source: Sometimes you will require multiple associated keys to execute a transaction. In this example, we have two associated keys with a weight equal to 1. To make changes to the account, you need to use both keys to sign the transaction. However, for deployment, each key can sign separately and perform deployments independently.
fr: Parfois, vous aurez besoin de plusieurs clés associées pour exécuter une transaction. Dans cet exemple, nous avons deux clés associées avec un poids égal à 1. Pour apporter des modifications au compte, vous devez utiliser les deux clés pour signer la transaction. Cependant, pour le déploiement, chaque clé peut signer séparément et effectuer les déploiements indépendamment.
tr: Bazen bir işlemi yürütmek için birden fazla ilişkili anahtara ihtiyacınız olacaktır. Bu örnekte, ağırlığı 1'e eşit olan iki ilişkili anahtarımız var. Hesapta değişiklik yapmak amacıyla, işlemi imzalamak için her iki anahtarı da kullanmanız gerekir. Ancak dağıtım için her anahtar ayrı olarak imzalayabilir ve dağıtımları bağımsız olarak gerçekleştirebilir.
vi: Đôi khi bạn sẽ yêu cầu nhiều khóa được liên kết để thực hiện một giao dịch. Trong ví dụ này, chúng tôi có hai khóa được liên kết với trọng số bằng 1. Để thực hiện các thay đổi đối với tài khoản, bạn cần sử dụng cả hai khóa để ký giao dịch. Tuy nhiên, để triển khai, mỗi khóa có thể ký riêng và thực hiện các triển khai một cách độc lập.

source: **Faucet account in scenario 3:**
fr: **Compte 'Faucet' dans le scénario 3:**
tr: **Senaryo 3'teki musluk hesabı:**
vi: **Tài khoản chốt trong trường hợp 3:**

source: Scenario 4: managing lost or stolen keys
fr: Scénario 4 : gestion des clés perdues ou volées
tr: Senaryo 4: kayıp veya çalınan anahtarları yönetme
vi: Tình huống 4: quản lý khóa bị mất hoặc bị đánh cắp

source: In this example, you need two out of three associated keys to sign a transaction. Consider a transaction where you have one key in your browser, one key on your mobile phone, and one key in your safe. To do a transaction, first, you sign it with your browser extension (for example, Metamask). Afterward, a notification appears on your mobile phone requesting you to approve the transaction. With these two keys, you can complete the transaction. However, what if you lose the two keys on your browser and phone? Or, what if someone steals your browser and phone? In this case, you can use the safe key to remove the lost or stolen keys from the account. Notice that the safe key's weight is 3, which gives you the option to manage your account and add or remove keys. Also, the stolen or lost keys can only enable deployments, and in this case, no one can use them to change your account.
fr: Dans cet exemple, vous avez besoin de deux des trois clés associées pour signer une transaction. Envisagez une transaction pour laquelle vous disposez d'une clé dans votre navigateur, d'une clé sur votre téléphone portable et d'une clé dans votre coffre-fort. Pour effectuer une transaction, vous la signez d'abord avec l'extension de votre navigateur (par exemple, Metamask). Ensuite, une notification apparaît sur votre téléphone mobile vous demandant d'approuver la transaction. Avec ces deux clés, vous pouvez effectuer la transaction. Cependant, que se passe-t-il si vous perdez les deux clés sur votre navigateur et votre téléphone ? Ou si quelqu'un vous vole votre navigateur et votre téléphone ? Dans ce cas, vous pouvez utiliser la clé de sécurité pour supprimer les clés perdues ou volées du compte. Notez que le poids de la clé de sécurité est de 3, ce qui vous donne la possibilité de gérer votre compte et d'ajouter ou de supprimer des clés. De plus, les clés perdues ou volées ne peuvent qu'activer les déploiements, et dans ce cas, personne ne peut les utiliser pour modifier votre compte.
tr: Bu örnekte, bir işlemi imzalamak için ilişkili üç anahtardan ikisine ihtiyacınız var. Tarayıcınızda bir anahtar, cep telefonunuzda bir anahtar ve kasanızda bir anahtar olduğu bir işlemi düşünün. Bir işlem yapmak için önce tarayıcı eklentinizle (örneğin Metamask) imzalarsınız. Ardından cep telefonunuzda işlemi onaylamanızı isteyen bir bildirim belirir. Bu iki tuş ile işlemi tamamlayabilirsiniz. Ancak, tarayıcınızdaki ve telefonunuzdaki iki anahtarı kaybederseniz ne olur? Ya birisi tarayıcınızı ve telefonunuzu çalarsa? Bu durumda, kayıp veya çalınan anahtarları hesaptan çıkarmak için kasa anahtarını kullanabilirsiniz. Kasa anahtarının ağırlığının 3 olduğuna dikkat edin; bu, size hesabınızı yönetme ve anahtar ekleme veya çıkarma seçeneği sunar. Ayrıca çalınan veya kaybolan anahtarlar yalnızca dağıtımları etkinleştirebilir ve bu durumda hiç kimse bunları hesabınızı değiştirmek için kullanamaz.
vi: Trong ví dụ này, bạn cần hai trong ba khóa được liên kết để ký một giao dịch. Hãy xem xét một giao dịch mà bạn có một chìa khóa trong trình duyệt, một chìa khóa trên điện thoại di động và một chìa khóa trong két an toàn. Để thực hiện một giao dịch, trước tiên, bạn ký nó bằng tiện ích mở rộng trình duyệt của mình (ví dụ: Metamask). Sau đó, một thông báo xuất hiện trên điện thoại di động của bạn yêu cầu bạn chấp thuận giao dịch. Với hai chìa khóa này, bạn có thể hoàn tất giao dịch. Tuy nhiên, nếu bạn bị mất hai khoá trên trình duyệt và điện thoại thì sao? Hoặc, điều gì sẽ xảy ra nếu ai đó đánh cắp trình duyệt và điện thoại của bạn? Trong trường hợp này, bạn có thể sử dụng khóa an toàn để xóa các khóa bị mất hoặc bị đánh cắp khỏi tài khoản. Lưu ý rằng trọng số của khóa an toàn là 3, điều này cung cấp cho bạn tùy chọn quản lý tài khoản của mình và thêm hoặc xóa khóa. Ngoài ra, các khóa bị đánh cắp hoặc bị mất chỉ có thể cho phép triển khai và trong trường hợp này, không ai có thể sử dụng chúng để thay đổi tài khoản của bạn.

source: **Faucet account in scenario 4:**
fr: **Compte 'Faucet' dans le scénario 4:**
tr: **Senaryo 4'teki musluk hesabı:**
vi: **Tài khoản chốt trong tình huống 4:**

source: Scenario 5: managing accounts with multiple keys
fr: Scénario 5 : gérer des comptes avec des clés multiples
tr: Senaryo 5: birden çok anahtarla hesapları yönetme
vi: Tình huống 5: quản lý tài khoản bằng nhiều khóa

source: This example builds upon the previous example, where you can set up multiple safe keys for account management. In this scenario, the safe keys have the weight required to manage your keys and account.
fr: Cet exemple s'appuie sur l'exemple précédent, dans lequel vous pouvez configurer plusieurs clés de sécurité pour la gestion du compte. Dans ce scénario, les clés de sécurité ont le poids nécessaire pour gérer vos clés et votre compte.
tr: Bu örnek, hesap yönetimi için birden çok güvenli anahtar ayarlayabileceğiniz önceki örneğe dayanmaktadır. Bu senaryoda, kasa anahtarları, anahtarlarınızı ve hesabınızı yönetmek için gereken ağırlığa sahiptir.
vi: Ví dụ này dựa trên ví dụ trước, nơi bạn có thể thiết lập nhiều khóa an toàn để quản lý tài khoản. Trong trường hợp này, các khóa an toàn có trọng số cần thiết để quản lý các khóa và tài khoản của bạn.

source: **Faucet account in scenario 5:**
fr: **Compte 'Faucet' dans le scénario 5:**
tr: **Senaryo 5'teki musluk hesabı:**
vi: **Tài khoản chốt trong trường hợp 5:**

source: Scenario 6: losing your primary account key
fr: Scénario 6 : perte de la clé de compte primaire
tr: Senaryo 6: birincil hesap anahtarınızı kaybetmek
vi: Tình huống 6: mất khóa tài khoản chính của bạn

source: Suppose you lose your account key; in this case, "account-hash-00…", you can set up other keys to execute transactions. Although not recommended, you can throw away the private key of your account or set its weight to zero, and you would still be able to execute transactions if your faucet account has backup keys that can perform key management.
fr: Supposons que vous perdiez la clé de votre compte ; dans ce cas, "account-hash-00...", vous pouvez configurer d'autres clés pour exécuter des transactions. Bien que cela ne soit pas recommandé, vous pouvez jeter la clé privée de votre compte ou mettre son poids à zéro, et vous seriez toujours en mesure d'exécuter des transactions si votre compte robinet dispose de clés de secours qui peuvent effectuer la gestion des clés.
tr: Hesap anahtarınızı kaybettiğinizi varsayalım; bu durumda, "account-hash-00...", işlemleri yürütmek için diğer anahtarları ayarlayabilirsiniz. Tavsiye edilmese de, hesabınızın özel anahtarını atabilir veya ağırlığını sıfıra ayarlayabilirsiniz ve musluk hesabınızda anahtar yönetimi yapabilen yedek anahtarlar varsa yine de işlem yapabilirsiniz.
vi: Giả sử bạn bị mất chìa khóa tài khoản; trong trường hợp này, "account-hash-00…", bạn có thể thiết lập các khóa khác để thực hiện giao dịch. Mặc dù không được khuyến nghị, bạn có thể vứt bỏ khóa cá nhân của tài khoản hoặc đặt trọng số của nó thành 0 và bạn vẫn có thể thực hiện các giao dịch nếu tài khoản chốt của bạn có khóa dự phòng có thể thực hiện quản lý khóa.

source: **Faucet account in scenario 6:**
fr: **Compte 'Faucet' dans le scénario 6:**
tr: **Senaryo 6'daki musluk hesabı:**
vi: **Tài khoản chốt trong tình huống 6:**
