Repository: casper-network/docs-archive
Catalog: locale/*/LC_MESSAGES/dapp-dev-guide/tutorials/multi-sig/introduction.po
Languages: tr, vi

source: Concepts
tr: Kavramlar
vi: Các khái niệm

source: The Casper implementation of multiple signatures is unique and allows you to set up and customize access to your account and deployments.
tr: Casper'ın çoklu imzalar uygulaması kendine özgüdür ve hesabınıza ve dağıtımlarınıza erişimi ayarlamanıza ve özelleştirmenize olanak tanır.
vi: Việc Casper triển khai nhiều chữ ký là duy nhất và cho phép bạn thiết lập, tùy chỉnh quyền truy cập vào tài khoản và triển khai của mình.

source: Many companies handle large transactions and use smart contracts to manage tokens. However, these contracts need to be audited and secure and require a significant investment in setup and maintenance.
tr: Birçok şirket, tokenleri yönetmek için büyük işlemler yapar ve akıllı kontratlar kullanır. Bununla birlikte, bu kontratların denetlenmesi ve güvenliğinin sağlanması gerekir ve kurulum ve bakım için ciddi miktarda yatırıma ihtiyaç duyulur.
vi: Nhiều công ty xử lý các giao dịch lớn và sử dụng hợp đồng thông minh để quản lý token. Tuy nhiên, các hợp đồng này cần phải được kiểm toán và bảo mật, yêu cầu đầu tư đáng kể vào việc thiết lập và bảo trì.

source: Casper enables you to sign anything with its multi-signature (multi-sig) implementation. For example, you do not need a multi-sig wallet to call a feature from a smart contract. Instead, you can use the multi-sig feature at the account level and sign your account with multiple keys.
tr: Casper, çoklu imza (multi-sig) uygulaması ile her şeyi imzalayabilmenize imkan tanır. Örneğin, bir akıllı kontrattaki özelliği çağırmak için multi-sig bir cüzdana ihtiyacınız yoktur. Bunun yerine, multi-sig özelliğini hesap düzeyinde kullanabilir ve hesabınızı birden çok anahtarla imzalayabilirsiniz.
vi: Casper cho phép bạn ký bất cứ thứ gì bằng cách triển khai đa chữ ký (multi-sig). Ví dụ: bạn không cần ví multi-sig để gọi một tính năng từ hợp đồng thông minh. Thay vào đó, bạn có thể sử dụng tính năng multi-sig ở cấp tài khoản và ký tài khoản của mình bằng nhiều khóa.

source: Your `Account <https://docs.casperlabs.io/en/latest/implementation/accounts.html>`_ is a cryptographically secured gateway into the CasperLabs system, and you can set it up using `the Casper Permissions Model <https://docs.casperlabs.io/en/latest/implementation/accounts.html#permissions-model>`_.
tr: `Hesabınız <https://docs.casperlabs.io/en/latest/implementation/accounts.html>`_, CasperLabs sistemine açılan, kriptografik olarak güvenliği sağlanmış bir kapıdır ve bunu `Casper İzin Modelini <https://docs.casperlabs.io/en/latest/implementation/accounts.html#permissions-model>`_ kullanarak ayarlayabilirsiniz.

source: The account contains associated keys and action thresholds:
tr: Hesap, ilişkili anahtarları ve eylem eşiklerini içerir:
vi: Tài khoản chứa các khóa được liên kết và các ngưỡng hành động:

source: The **associated keys** of an account are the set of public keys allowed to provide signatures on account actions.
tr: Bir hesabın **ilişkili anahtarları**, hesap eylemleri üzerinde imzalama izni olan genel anahtarların kümesidir.
vi: **Các khóa được liên kết** của tài khoản là tập hợp các khóa công khai được phép cung cấp chữ ký cho các hành động của tài khoản.

source: An account can perform two types of actions: **deployment** and **key management**.
tr: Bir hesap, iki tür eylem gerçekleştirebilir: **dağıtım** ve **anahtar yönetimi**.
vi: Một tài khoản có thể thực hiện hai loại hành động: **triển khai** và **quản lý khóa**.

source: The **action thresholds** in the account data structure set a **weight**, which you must meet to perform an action.
tr: Hesap veri yapısı içindeki **eylem eşikleri**, bir eylemi gerçekleştirmek için karşılanması gereken **ağırlığı** belirler.
vi: **Ngưỡng hành động** trong cấu trúc dữ liệu tài khoản đặt **trọng số** mà bạn cần đáp ứng để thực hiện một hành động.

source: For more information, please review the `Blockchain Design <https://docs.casperlabs.io/en/latest/implementation/accounts.html>`_.
tr: Daha fazla bilgi için, lütfen `Blokzincir Tasarımı <https://docs.casperlabs.io/en/latest/implementation/accounts.html>`_'nı inceleyiniz.
vi: Để biết thêm thông tin, vui lòng xem lại `` Thiết kế chuỗi khối <https://docs.casperlabs.io/en/latest/implementation/accounts.html>`_.

source: Your `Account <https://docs.casperlabs.io/en/latest/implementation/accounts.html>`_ is a cryptographically secured gateway into the Casper Network, and you can set it up using `the Casper Permissions Model <https://docs.casperlabs.io/en/latest/implementation/accounts.html#permissions-model>`_.
vi: `Tài khoản <https://docs.casperlabs.io/en/latest/implementation/accounts.html>` của bạn_ là một cổng được bảo mật bằng mật mã vào Mạng Casper và bạn có thể thiết lập nó bằng cách sử dụng `Mô hình quyền của Casper <https://docs.casperlabs.io/en/latest/implementation/accounts.html#permissions-model>`_.
