Repository: casper-network/docs-archive
Catalog: locale/*/LC_MESSAGES/theory/abstract-consensus.po
Languages: fr, tr, vi

source: In this section we sketch a "reference" implementation of Abstract Casper Consensus. We use Scala syntax for the code, but we limit ourselves to elementary language features (so it is readable for any developer familiar with contemporary programming languages).
fr: Dans cette section, nous esquissons une implémentation "de référence" du 'Abstract Casper Consensus'. Nous utilisons la syntaxe Scala pour le code, mais nous nous limitons aux caractéristiques élémentaires du langage (afin qu'il soit lisible pour tout développeur familier des langages de programmation contemporains).
tr: Bu bölümde, Soyut Casper Mutabakat'ının bir ''başvuru'' uygulamasının taslağını çiziyoruz. Kod için Scala sözdizimini kullanıyoruz, ancak kendimizi temel dil özellikleriyle sınırlandırıyoruz (bu nedenle, çağdaş programlama dillerine aşina olan herhangi bir geliştirici tarafından okunabilir).
vi: Trong phần này, chúng tôi phác thảo một triển khai "tham chiếu" của Tóm tắt Đồng thuận Casper. Chúng tôi sử dụng cú pháp Scala cho mã, nhưng chúng tôi giới hạn bản thân ở các tính năng ngôn ngữ cơ bản (vì vậy nó có thể đọc được đối với bất kỳ nhà phát triển nào quen thuộc với các ngôn ngữ lập trình hiện đại).

source: Scala primer for non-scala developers:
fr: Une introduction à Scala pour les développeurs non-Scala :
tr: Scala bilmeyen geliştiriciler için Scala şablonu:
vi: Scala đơn giản cho các nhà phát triển không phải quen thuộc scala:

source: Common abstractions
fr: Abstractions courantes
tr: Genel soyutlama
vi: Trừu tượng hoá chung

source: We use the following type aliases:
fr: Nous utilisons les alias de type suivants :
tr: Aşağıdaki tür takma adlarını kullanıyoruz:
vi: Chúng tôi sử dụng các kiểu alias sau:

source: We are using the following abstraction of mutable 2-argument relation:
fr: Nous utilisons l'abstraction suivante de relation mutable à 2 arguments (mutable 2-argument relation):
tr: Değişken 2-argüman ilişkisinin aşağıdaki soyutlamasını kullanıyoruz:
vi: Chúng tôi đang sử dụng phần trừu tượng sau của quan hệ 2 đối số có thể thay đổi:

source: ... and directed acyclic graph:
fr: .. et un graphe acyclique dirigé :
tr: ... yönlendirilmiş çevrimsiz grafiği:
vi: ... và đồ thị xoay chiều có hướng:

source: We say nothing about hashing in use, we just assume that hashes can be seen as binary arrays:
fr: Nous ne disons rien sur le hachage en cours d'utilisation, nous supposons simplement que les hashs peuvent être vus comme des tableaux binaires :
tr: Kullanımda özet alımı (hashing) hakkında hiçbir şey söylemiyoruz, yalnızca özetlerin ikili kod dizileri olarak görülebileceğini varsayıyoruz:
vi: Chúng tôi không nói gì về băm đang được sử dụng, chúng tôi chỉ giả định rằng băm có thể được coi là mảng nhị phân:

source: Message structure:
fr: Structure du message
tr: Mesaj yapısı:
vi: Cấu trúc thông điệp:

source: ``id: MessageId`` unique identifier - hash of other fields
fr: ``id : MessageId`` identifiant unique - hash d'autres champs
tr: ``id: MessageId`` benzersiz tanımlayıcı - diğer alanların özeti (hash)
vi: ``id: MessageId`` mã định danh duy nhất - băm của các trường khác

source: ``creator: Int`` id of the validator that created this message
fr: ``creator: Int`` id du validateur qui a créé ce message
tr: ``creator: Int`` bu mesajı oluşturan doğrulayıcının kimliği
vi: ``creator: Int`` id của trình xác thực đã tạo thông điệp này

source: ``previous: Option[MessageId]`` distinguished justification that points to previous message published by creator
fr: ``previous: Option[MessageId]`` justification distinguée qui pointe vers un message précédent publié par le créateur
tr: ``previous: Option[MessageId]`` içerik oluşturucu tarafından yayınlanan önceki mesaja işaret eden seçkin gerekçe
vi: ``previous: Option[MessageId]`` lời biện minh phân biệt trỏ đến thông điệp trước đó do người sáng tạo xuất bản

source: ``justifications: Seq[MessageId]`` collection of messages that the creator acknowledges as seen at the moment of creation of this message; this collection may possibly be empty; only message identifiers are kept here
fr: ``justifications: Seq[MessageId]`` collection de messages que le créateur reconnaît comme vus au moment de la création de ce message ; cette collection peut éventuellement être vide ; seuls les identifiants des messages sont conservés ici
tr: ``justifications: Seq[MessageId]`` bu mesajın oluşturulduğu anda görüldüğü gibi oluşturanın onayladığı mesajların koleksiyonu; bu koleksiyon muhtemelen boş olabilir; sadece mesaj tanımlayıcıları burada tutulur
vi: ``justifications: Seq[MessageId]`` tập hợp các thông điệp mà người tạo thừa nhận như đã thấy tại thời điểm tạo ra thông điệp này; bộ sưu tập này có thể trống; chỉ có định danh thông điệp được giữ ở đây

source: ``vote: Option[Con]`` consensus value this message is voting for; the value is optional, because we allow empty votes
fr: ``Vote : Option[Con]`` valeur de consensus pour laquelle ce message vote ; la valeur est facultative, car nous autorisons les votes vides.
tr: ``vote: Option[Con]`` bu mesajın oy verdiği mutabakat değeri; değer isteğe bağlıdır, çünkü boş oylara izin veriyoruz
vi: ``vote: Option[Con]`` giá trị đồng thuận mà thông điệp này đang bỏ phiếu; giá trị là tùy chọn, vì chúng tôi cho phép các phiếu bầu trống

source: ``daglevel: Int`` height of this message in justifications DAG
fr: ``daglevel : Int`` hauteur de ce message dans le DAG des justifications
tr: ``daglevel: Int`` gerekçeler DAG'da bu mesajın yüksekliği
vi: ``daglevel: Int`` chiều cao của thông điệp này trong biện minh DAG

source: Serialization of messages joins the logical layer and transport layer:
fr: La sérialisation des messages relie la couche logique et la couche transport :
tr: Mesajların seri hale getirilmesi, mantıksal ve taşıma katmanını birleştirir:
vi: Việc tuần tự hóa các thông điệp tham gia lớp logic và lớp truyền tải:

source: Network abstraction
fr: Abstraction du réseau
tr: Ağ soyutlama
vi: Trừu tượng hoá mạng

source: Broadcasting messages:
fr: Diffusion des messages :
tr: Yayınlanan mesajlar:
vi: Gửi thông điệp:

source: Receiving messages:
fr: Réception des messages :
tr: Alınan mesajlar:
vi: Nhận thông điệp:

source: Panoramas
tr: Panorama'lar
vi: Toàn cảnh

source: We use panoramas to encode the "perspective on the j-dag as seen from given message".
fr: Nous utilisons des panoramas pour encoder la "perspective sur le j-dag vu depuis un message donné".
tr: "Verilen mesajdan görüldüğü gibi j-dag perspektifini" kodlamak için panoramaları kullanıyoruz.
vi: Chúng tôi sử dụng ảnh toàn cảnh để mã hóa "phối cảnh trên j-dag như được nhìn thấy từ thông điệp đã cho".

source: Validator
fr: Validateur
tr: Doğrulayıcı
vi: Trình xác thực

source: The abstraction of the estimator:
fr: L'abstraction de l'estimateur :
tr: Tahmincinin soyutlanması:
vi: Tính trừu tượng của công cụ ước tính:

source: ... and finality detector (implementing the "summit theory" finality criterion):
fr: ... et détecteur de finalité (mise en œuvre du critère de finalité de la "théorie des sommets") :
tr: … ve kesinlik algılayıcı (“zirve teorisi” kesinlik kriterini uygulayarak):
vi: ... và máy dò phát hiện cuối cùng (thực hiện tiêu chuẩn cuối cùng của "lý thuyết đỉnh"):

source: The implementation of a validator is complex so we split it into sections.
fr: L'implémentation d'un validateur est complexe, c'est pourquoi nous la divisons en plusieurs sections.
tr: Bir doğrulayıcının uygulanması karmaşık olduğu için bölümlere ayırdık.
vi: Việc triển khai trình xác thực rất phức tạp vì vậy chúng tôi chia nó thành các phần.

source: **Validator configuration**
fr: **Configuration du validateur**
tr: **Doğrulayıcı yapılandırması**
vi: **Cấu hình trình xác thực**

source: ``weightsOfValidators: Map[ValidatorId, Int]`` - weights of validators
fr: ``weightsOfValidators: Map[ValidatorId, Int]`` - poids des validateurs
tr: ``weightsOfValidators: Map[ValidatorId, Int]`` - doğrulayıcıların ağırlıkları
vi: ``weightsOfValidators: Map[ValidatorId, Int]`` - trọng số của trình xác thực

source: ``finalizer: Finalizer`` - finality detector
fr: ``finalizer : Finalizer`` - détecteur de finalité
tr: ``finalizer: Finalizer`` - kesinlik algılayıcı
vi: ``finalizer: Finalizer`` - bộ dò cuối cùng

source: ``gossipService: GossipService`` - communication layer API used to broadcast messages
fr: ``gossipService : GossipService`` - API de la couche de communication utilisée pour diffuser des messages
tr: ``gossipService: GossipService`` - mesajları yayınlamak için kullanılan iletişim katmanı API'si
vi: ``gossipService: GossipService`` - API lớp giao tiếp được sử dụng để phát thông điệp

source: **Protocol state**
fr: **Etat du protocole**
tr: **Protokol durumu**
vi: **Trạng thái giao thức**

source: ``messagesBuffer: Relation[Message,MessageId]`` - a buffer of messages received, but not incorporated into ``jdag`` yet; a pair :math:`(m,j)` in this relation represents buffered message :math:`m` waiting for not-yet-received message with id :math:`j`
fr: ``messagesBuffer : Relation[Message,MessageId]`` - un buffer de messages reçus, mais pas encore incorporés dans ``jdag`` ; une paire :math:`(m,j)` dans cette relation représente le message bufferisé :math:`m` en attente du message pas encore reçu d'id :math:`j`.
tr: ``messagesBuffer: Relation[Message,MessageId]`` - alınan, ancak henüz "jdag" 'a dahil edilmemiş mesajların arabelleği; bu ilişkideki bir :math:`(m,j)` çifti, :math:`j` kimliği ile henüz alınmamış mesajı bekleyen, arabelleğe alınmış :math:`m` mesajını temsil eder.
vi: ``messagesBuffer: Relation[Message,MessageId]`` - một bộ đệm các tin nhắn đã nhận, nhưng chưa được kết hợp vào ``jdag``; một cặp :math:`(m,j)` trong quan hệ này đại diện cho thông điệp được đệm :math:`m` đang chờ thông điệp chưa nhận được với id :math:`j`

source: ``jdagGraph`` - representation of :math:`jDag(M)`, where :math:`M` is the set of all messages known, such that their dependencies are fulfilled; in other words, before a message :math:`m` can be added to ``jdag``, all justifications of :math:`m` must be already present in ``jdag``
fr: ``jdagGraph`` - représentation de :math:`jDag(M)`, où :math:`M` est l'ensemble de tous les messages connus, tels que leurs dépendances sont remplies ; en d'autres termes, avant qu'un message :math:`m` puisse être ajouté à ``jdag``, toutes les justifications de :math:`m` doivent être déjà présentes dans ``jdag``
tr: ``jdagGraph`` - :math:`jDag(M)` gösterimi, burada :math:`M` bağımlılıkları yerine getirilecek şekilde bilinen tüm mesajların kümesidir; başka bir deyişle, ``jdag`` 'a bir :math:`m` mesajı eklenmeden önce, :math:`m`'nin tüm gerekçeleri ``jdag`` 'da zaten mevcut olmalıdır.
vi: ``jdagGraph`` - đại diện của :math:`jDag(M)`, trong đó :math:`M` là tập hợp tất cả các thông điệp đã biết, sao cho các phụ thuộc của chúng được đáp ứng; nói cách khác, trước một thông điệp :math:`m` có thể được thêm vào ``jdag``, tất cả các biện minh của :math:`m` phải có trong ``jdag``

source: ``jdagIdToMessage: mutable.Map[MessageId, Message]`` - indexing of messages by id
fr: ``jdagIdToMessage: mutable.Map[MessageId, Message]`` - indexation des messages par id
tr: ``jdagIdToMessage: mutable.Map[MessageId, Message]`` - id ile mesajların indekslenmesi
vi: ``jdagIdToMessage: mutable.Map[MessageId, Message]`` - lập chỉ mục các thông điệp theo id

source: **Handling of incoming messages**
fr: **Traitement des messages entrants**
tr: **Gelen mesajların yönetimi**
vi: **Xử lý các tin nhắn đến**

source: **Publishing of new messages**
fr: **Publication de nouveaux messages**
tr: **Yeni mesajların yayınlanması**
vi: **Xuất bản thông điệp mới**

source: **Abstract methods** - i.e. extension points (things outside of this protocol spec)
fr: **Méthodes abstraites** - c'est-à-dire points d'extension (choses en dehors de la spécification du protocole)
tr: **Soyut yöntemler** - yani uzatma noktaları (bu protokol belirtimlerinin dışındaki şeyler)
vi: **Các phương thức trừu tượng** - tức là các điểm mở rộng (những thứ nằm ngoài giao thức kỹ thuật này)

source: **Validation of incoming messages**
fr: **Validation des messages entrants**
tr: **Gelen mesajların doğrulanması**
vi: **Xác thực các thông điệp đến**

source: **Updating of local j-dag**
fr: **Mise à jour du j-dag local**
tr: **Yerel j-dag'ın güncellenmesi**
vi: **Cập nhật j-dag cục bộ**

source: **Calculating panoramas**
fr: **Calcul des panoramas**
tr: **Panorama hesaplanması**
vi: **Tính toán ảnh toàn cảnh**

source: Finality detector
fr: Détecteur de finalité
tr: Kesinlik algılayıcı
vi: Máy dò cuối cùng

source: Representation of a j-dag trimmer:
fr: Représentation d'un j-dag trimmer:
tr: Bir j-dag düzelticinin temsili:
vi: Đại diện của một máy xén j-dag:

source: Representation of a summit:
fr: Représentation d'un sommet :
tr: Bir zirvenin temsili:
vi: Mô tả của một đỉnh:

source: Implementation of the "summit theory" finality criterion:
fr: Mise en œuvre du critère de finalité de la "théorie des sommets" :
tr: "Zirve teorisi" kesinlik kriterinin uygulanması:
vi: Thực hiện tiêu chuẩn cuối cùng của "lý thuyết đỉnh":
