Repository: casper-network/docs-archive
Catalog: locale/*/LC_MESSAGES/theory/abstract-consensus.po
Languages: fr, tr, vi

source: The first step in finding a summit is to apply the estimator to the whole j-dag. This way the consensus value that gets most votes (by weight) is found, where the total ordering on :math:`Con` is used as a tie-breaker.
fr: La première étape pour trouver un sommet est d'appliquer l'estimateur à l'ensemble du j-dag. De cette façon, la valeur de consensus qui obtient le plus de votes (par poids) est trouvée, où l'ordre total sur :math:`Con` est utilisé comme un tie-breaker pour départager.
tr: Bir zirve bulmanın ilk adımı, tahminciyi tüm j-dag'a uygulamaktır. Bu şekilde, en çok oyu alan (ağırlıkça) mutabakat değeri bulunur, burada :math:`Con` 'daki toplam sipariş, bir beraberlik kırıcı olarak kullanılır.
vi: Bước đầu tiên để tìm đỉnh là áp dụng công cụ ước tính cho toàn bộ j-dag. Bằng cách này, giá trị đồng thuận nhận được nhiều phiếu bầu nhất (theo trọng số) được tìm thấy, trong đó tổng thứ tự trên :math:`Con` được sử dụng như một quyết định.

source: Say the value returned by the estimator is :math:`c`. When the total weight of votes for :math:`c` is less than quorum size, we do not have a summit yet, so this terminates the summit search .
fr: Disons que la valeur renvoyée par l'estimateur est :math:`c`. Lorsque le poids total des votes pour :math:`c` est inférieur à la taille du quorum, nous n'avons pas encore de sommet, ce qui met fin à la recherche du sommet.
tr: Tahminci tarafından döndürülen değerin :math:`c` olduğunu söyleyin. :math:`c` için toplam oy ağırlığı yeter sayının altında olduğunda, henüz bir zirvemiz yoktur, bu da zirve aramasını sonlandırır.
vi: Giả sử giá trị được trả về bởi bộ ước lượng là :math:`c`. Khi tổng số phiếu bầu cho :math:`c` nhỏ hơn số đại biểu, chúng tôi chưa có đỉnh, vì vậy điều này sẽ chấm dứt tìm kiếm đỉnh.

source: Step 3: Find 0-level messages
fr: Étape 3 : Trouver les messages de niveau 0 (0-level messages)
tr: 3. Adım: 0 seviyeli mesajları bulun
vi: Bước 3: Tìm thông điệp cấp 0

source: **0-level messages for an honest validator v** is a subset of :math:`swimlane(v)` formed by taking all messages voting for :math:`c` which have no later message by :math:`v` voting for consensus value other than :math:`c`. Please notice that empty votes are considered a continuation of last non-empty vote.
fr: **Messages de niveau 0 pour un validateur honnête v** est un sous-ensemble de :math:`swimlane(v)` formé en prenant tous les messages votant pour :math:`c` qui n'ont pas de message ultérieur par :math:`v` votant pour une valeur de consensus autre que :math:`c`. Veuillez noter que les votes vides sont considérés comme une continuation du dernier vote non vide.
tr: **Dürüst bir doğrulayıcı v için 0-seviyeli mesajlar**, c'ye oy veren ve :math:`c` 'den başka mutabakat oylama yapan :math:`v` tarafından daha sonra herhangi bir mesajı olmayan :math:`c` için oy kullanan tüm mesajların alınmasıyla oluşturulan :math:`swimlane(v)` kulvarının bir alt kümesidir. Lütfen boş oyların, boş olmayan son oyların devamı olarak kabul edildiğini unutmayın.
vi: **Thông điệp cấp 0 cho trình xác thực trung thực v** là một tập con của :math:`swimlane(v)` được hình thành bằng cách lấy tất cả các thông điệp bỏ phiếu cho :math:`c` mà không có thông điệp nào sau này bởi :math:`v `bỏ phiếu cho giá trị đồng thuận khác với :math:`c`. Xin lưu ý rằng phiếu bầu trống được coi là sự tiếp nối của phiếu bầu không trống cuối cùng.

source: **0-level messages** is a sum of zero level messages for all hones validators.
fr: **0-level messages** est une somme de messages de niveau 0 pour tous les validateurs honnêtes.
tr: **0-seviyeli mesajlar**, tüm dürüst doğrulayıcılar için sıfır seviyeli mesajların toplamıdır.
vi: **Thông điệp cấp 0** là tổng các thông điệp cấp 0 cho tất cả các trình xác thực trung thực.

source: Let us look again at the example summit:
fr: Reprenons l'exemple du sommet :
tr: Örnek zirveye tekrar bakalım:
vi: Chúng ta hãy nhìn lại ví dụ đỉnh:

source: All latest messages vote for consensus value "white", so it is clear that white is the value picked by the estimator.
fr: Tous les derniers messages votent pour la valeur de consensus "white", il est donc clair que 'white' est la valeur choisie par l'estimateur.
tr: En son mesajların tümü "beyaz" mutabakat değeri için oy kullanır, bu nedenle beyazın tahminci tarafından seçilen değer olduğu açıktır.
vi: Tất cả các thông điệp mới nhất đều bỏ phiếu cho giá trị đồng thuận là "trắng", vì vậy rõ ràng màu trắng là giá trị được chọn bởi công cụ ước tính.

source: In the swimlane of validator 2, messages 3 and 9 vote for white, but are not 0-level, because 2 changed mind later. Also messages 11 and 15 are not 0-level, because they vote for orange. Only messages 19 and 26 are 0-level.
fr: Dans le swimlane du validateur 2, les messages 3 et 9 votent pour 'white', mais ne sont pas de niveau 0, car 2 a changé d'avis plus tard. Les messages 11 et 15 ne sont pas non plus de niveau 0, car ils votent pour 'orange'. Seuls les messages 19 et 26 sont de niveau 0.
tr: Doğrulayıcı 2'nin kulvarında, mesaj 3 ve 9 beyaz için oy kullanır, ancak 2 daha sonra fikir değiştirdiği için 0 düzeyinde değildir. Ayrıca 11 ve 15 numaralı mesajlar 0 düzeyinde değildir, çünkü turuncuya oy verirler. Yalnızca 19 ve 26 mesajlar 0 düzeyindedir.
vi: Trong vòng của trình xác thực 2, thông điệp 3 và 9 bỏ phiếu cho màu trắng, nhưng không phải là mức 0, vì sau đó 2 đã đổi ý. Ngoài ra, các thông điệp 11 và 15 không phải là mức 0, vì chúng bỏ phiếu cho màu cam. Chỉ có tin nhắn 19 và 26 là 0 cấp.

source: In the swimlane of validator 1, all messages are 0-level: 2, 13, 22, 23.
fr: Dans le swimlane du validateur 1, tous les messages sont de niveau 0 : 2, 13, 22, 23.
tr: Doğrulayıcı 1'in kulvarında, tüm mesajlar 0 düzeyindedir: 2, 13, 22, 23.
vi: Trong vùng hiển thị của trình xác thực 1, tất cả các thông điệp đều ở mức 0: 2, 13, 22, 23.

source: In the swimlane of validator 0 no message is 0-level, because validator 0 is an equivocator. This becomes clear when we highlight the j-past-cone of message 25:
fr: Dans le swimlane du validateur 0, aucun message n'est de niveau 0, car le validateur 0 est un équivocateur. Cela devient clair lorsque nous mettons en évidence le j-past-cone du message 25 :
tr: Doğrulayıcı 0'ın kulvarında hiçbir mesaj 0 düzeyinde değildir, çünkü doğrulayıcı 0 bir şüphelidir. Mesaj 25'in j-geçmiş-konisini vurguladığımızda bu durum netleşir:
vi: Trong vùng hiển thị của trình xác thực 0, không có thông điệp nào là cấp 0, vì trình xác thực 0 là không rõ ràng. Điều này trở nên rõ ràng khi chúng ta làm nổi bật j-past-cone của thông điệp 25:

source: Message 18 is not included in j-past-cone of message 25. Hence - messages 18 and 25 form an equivocation.
fr: Le message 18 n'est pas inclus dans le j-past-cone du message 25. Par conséquent - les messages 18 et 25 forment une équivoque.
tr: Mesaj 18, mesaj 25'in j-geçmiş-konisine dahil değildir. Dolayısıyla - mesaj 18 ve 25 bir çelişkili davranış oluşturur.
vi: Thông điệp 18 không được bao gồm trong j-past-cone của thông điệp 25. Do đó - các thông điệp 18 và 25 tạo thành một sự không rõ ràng.

source: J-dag trimmer
tr: J-dag düzeltici
vi: Máy xén J-dag (trimmer)

source: We will be working in the context of local j-dag of a fixed validator :math:`v_0 \in V`. Let :math:`M` be the set of all messages in the local j-dag of :math:`v_0`.
fr: Nous allons travailler dans le contexte du j-dag local d'un validateur fixe :math:`v_0 \in V`. Soit :math:`M` l'ensemble de tous les messages dans le j-dag local de :math:`v_0`.
tr: Sabit bir doğrulayıcı :math:`v_0 \in V` 'nin yerel j-dag bağlamında çalışacağız. :math:`M`, :math:`v_0` 'ın yerel j-dag'ındaki tüm mesajların kümesi olsun.
vi: Chúng tôi sẽ làm việc trong bối cảnh j-dag cục bộ của trình xác thực cố định :math:`v_0 \in V`. Đặt :math:`M` là tập hợp tất cả các thông điệp trong j-dag cục bộ của :math:`v_0`.

source: Definition: Let :math:`S \subset V` be some subset of the validators set. By **j-dag trimmer** we mean any function :math:`p:S \to M` such that :math:`\forall{v \in S}, p(v).\textit{creator} = v`
fr: Définition : Soit :math:`S \subset V` un certain sous-ensemble de l'ensemble des validateurs. Par **j-dag trimmer**, on entend toute fonction :math:`p:S \to M` telle que :math:`\forall{v \in S}, p(v).\textit{creator} = v`
tr: Tanım: :math:`S \subset V`, doğrulayıcılar kümesinin bir alt kümesi olsun. **j-dag düzeltici** ile :math:`\forall{v \in S}, p(v).\textit{creator} = v` olacak şekilde herhangi bir :math:`p:S \to M` fonksiyonunu kastediyoruz.
vi: Định nghĩa: Cho :math:`S \subset V` là một số tập hợp con của tập hợp các trình xác thực. Bởi **j-dag trimmer** chúng ta muốn nói đến bất kỳ hàm nào :math:`p:S \to M` sao cho :math:`\forall{v \in S}, p(v).\textit{creator} = v`

source: If you think of swimlanes as being "fibers" or "hair" then having a trimmer means:
fr: Si vous considérez les swimlanes comme des "fibres" ou des "cheveux", le fait d'avoir une tondeuse (trimmer) signifie.. :
tr: Yüzme kulvarlarını “iplik” veya “kıl” olarak düşünüyorsanız, o zaman bir düzelticiye sahip olmak şu anlama gelir:
vi: Nếu bạn nghĩ rằng các vùng là "sợi" hoặc "tóc" thì việc có một máy xén có nghĩa là:

source: selecting a subset of swimlanes
fr: sélection d'un sous-ensemble de swimlanes
tr: kulvarların bir alt kümesini seçme
vi: chọn một tập hợp con các vùng

source: picking a "cutting point" for every selected swimlane
fr: choisir un "point de coupe" pour chaque swimlane sélectionné
tr: seçilen her kulvar için bir "kesme noktası" seçmek
vi: chọn một "điểm cắt" cho mỗi vùng đã chọn

source: When having a trimmer, we will be interested in the all the messages "cut" by the trimmer:
fr: Lorsqu'on fait appel à un trimmer, on s'intéresse à tous les messages "coupés" par le trimmer :
tr: Bir düzelticiye sahipken, düzeltici tarafından "kesilen" tüm mesajlarla ilgileneceğiz:
vi: Khi sở hữu một máy xén, chúng ta sẽ thích thú với tất cả những thông điệp mà chiếc máy xén “cắt” được:

source: Definition: For a j-dag trimmer :math:`p` we introduce the set of messages **p-messages**:
fr: Définition : Pour un j-dag trimmer :math:`p`, nous introduisons l'ensemble des messages **p-messages** :
tr: Tanım: Bir j-dag düzeltici :math:`p` için, **p-mesajları** dizisini tanıtıyoruz:
vi: Định nghĩa: Đối với máy xén j-dag :math:`p`, chúng tôi giới thiệu bộ thông điệp **p-messages**:

source: Observe that a function assigning to any honest validator its oldest 0-level message is a jdag trimmer. We will call it **the base trimmer** or just **base**.
fr: Observez qu'une fonction assignant à tout validateur honnête son plus ancien message de niveau 0 est un jdag trimmer. Nous l'appellerons **le trimmer de base** ou simplement **base**.
tr: Herhangi bir dürüst doğrulayıcıya en eski 0-seviye mesajını atayan bir işlevin bir jdag düzeltici olduğunu gözlemleyin. Biz ona **baz düzeltici** veya sadece **baz** diyeceğiz.
vi: Quan sát rằng một hàm gán cho bất kỳ trình xác thực trung thực nào thì thông báo cấp 0 cũ nhất của nó là một máy xén jdag. Chúng tôi sẽ gọi nó là **đế máy xén** hoặc chỉ **đế**.

source: Committee
fr: Comité
tr: Kurul
vi: Ủy ban

source: Definition: Let :math:`p` be some j-dag trimmer.
fr: Définition : Soit :math:`p` un j-dag trimmer quelconque.
tr: Tanım: :math:`p` bir j-dag düzeltici olsun.
vi: Định nghĩa: Cho :math:`p` là một số máy xén j-dag.

source: By :math:`weight(S)` we mean the sum of weights of validators in :math:`S`.
fr: Par :math:`weight(S)`, nous entendons la somme des poids des validateurs dans :math:`S`.
tr: :math:`weight(S)` ile, :math:`S` kümesindeki doğrulayıcıların ağırlıklarının toplamını kastediyoruz.
vi: Theo :math:`weight(S)` chúng ta có nghĩa là tổng trọng số của các trình xác thực trong :math:`S`.

source: **Support of message m in context p** is a subset :math:`R \subset S` obtained by taking all validators :math:`v \in S` such that :math:`\textit{panorama}_m(v) \in \textit{p-messages}`.
fr: **Le support du message m dans le contexte p** est un sous-ensemble :math:`R \subset S` obtenu en prenant tous les validateurs :math:`v \in S` tels que :math:`\textit{panorama}_m(v) \in \textit{p-messages}`.
tr: **m mesajının p bağlamında desteklenmesi**, tüm doğrulayıcılar :math:`v \in S` alınarak elde edilen bir :math:`R \subset S` alt kümesidir öyle ki :math:`\textit{panorama}_m(v) \in \textit{p-messages}`.
vi: **Hỗ trợ của thông báo m trong ngữ cảnh** là một tập con :math:`R \subset S` thu được bằng cách lấy tất cả các trình xác thực :math:`v \in S` sao cho :math:`\textit{panorama}_m(v) \in \textit{p-messages}`.

source: **1-level message in context p** is a p-message :math:`m` such that the weight of support of :math:`m` in context :math:`p` is at least :math:`\textit{quorum}`.
fr: **Message de niveau 1 (1-level message) dans le contexte p** est un p-message :math:`m` tel que le poids de support de :math:`m` dans le contexte :math:`p` est au moins :math:`\textit{quorum}`.
tr: **p bağlamındaki 1-seviyeli mesaj** bir p-mesaj :math:`m` 'dir, öyle ki :math:`p` bağlamında :math:`m` desteğinin ağırlığı en az :math:`\textit{quorum}`.
vi: **Thông điêp 1 cấp trong ngữ cảnh p** là một thông điệp p :math:`m` sao cho trọng số hỗ trợ của :math:`m` trong ngữ cảnh :math:`p` ít nhất là :math:`\textit{quorum}`.

source: Definition: **Committee in context p** is a j-dag trimmer :math:`comm:S \to M` such that:
fr: Définition : **Comité (Committee) dans le contexte p** est un j-dag trimmer :math:`comm:S \to M` tel que :
tr: Tanım: **p bağlamında komite** bir j-dag düzelticidir :math:`comm:S \to M` öyle ki:
vi: Định nghĩa: **Ủy ban trong ngữ cảnh p** là một máy xén j-dag :math:`comm:S \to M` sao cho:

source: every value :math:`comm(v)` is a 1-level message in context :math:`p|_S` (i.e. we restrict here :math:`p` to subdomain :math:`S`
fr: chaque valeur :math:`comm(v)` est un message de niveau 1 dans le contexte :math:`p|_S` (c'est-à-dire que nous restreignons ici :math:`p` au sous-domaine :math:`S`)
tr: her değer :math:`comm(v)`, :math:`p|_S` bağlamında 1 seviyeli bir mesajdır (yani burada :math:`p` 'yi alt etki alanı :math:`S` ile sınırlandırıyoruz
vi: mọi giá trị :math:`comm(v)` là một thông điệp cấp 1 trong ngữ cảnh :math:`p|_S` (tức là chúng tôi giới hạn ở đây :math:`p` thành miền phụ :math:`S`

source: **Example:**
fr: **Exemple:**
tr: **Örnek:**
vi: **Ví dụ:**

source: In the example below, all validators have equal weight 1, and :math:`ftt=1`. We have the following 1-level committee here:
fr: Dans l'exemple ci-dessous, tous les validateurs ont un poids égal à 1, et :math:`ftt=1`. Nous avons ici le comité à 1 niveau suivant :
tr: Aşağıdaki örnekte, tüm doğrulayıcılar eşit ağırlık 1 ve :math:`ftt=1` değerine sahiptir. Burada aşağıdaki 1 seviyeli kurulumuz var:
vi: Trong ví dụ dưới đây, tất cả các trình xác thực đều có trọng số bằng nhau 1 và :math:`ftt=1`. Chúng tôi có ủy ban 1 cấp sau đây:

source: Step 4: Find k-level summit
fr: Étape 4 : Trouver le sommet du niveau k (k-level summit)
tr: Adım 4: k seviyesindeki zirveyi bulun
vi: Bước 4: Tìm đỉnh cấp k

source: Definition: **k-level summit** is a sequence :math:`(\textit{comm}_1, \textit{comm}_2, ..., \textit{comm}_k)` such that:
fr: Definition: **k-level summit** est une séquence :math:`(\textit{comm}_1, \textit{comm}_2, ..., \textit{comm}_k)` telle que :
tr: Tanım: **k seviyesi zirve** bir dizidir math:`(\textit{comm}_1, \textit{comm}_2, ..., \textit{comm}_k)` öyle ki:
vi: Định nghĩa: **đỉnh mức k** là một dãy :math:`(\textit{comm}_1, \textit{comm}_2, ..., \textit{comm}_k)` sao cho:

source: :math:`\textit{comm}_1` is a committee in context of the base trimmer
fr: :math:`\textit{comm}_1` est un comité dans le contexte du trimmer de base
tr: :math:`\textit{comm}_1`, temel düzeltici bağlamında bir kuruldur
vi: :math:`\textit{comm}_1` là một ủy ban trong ngữ cảnh của đế máy xén

source: :math:`\textit{comm}_i` is a committee in context :math:`\textit{comm}_{i-1}` for :math:`i=2, ..., k`
fr: :math:`\textit{comm}_i` est un comité dans le contexte :math:`\textit{comm}_{i-1}` pour :math:`i=2, ..., k`
tr: :math:`\textit{comm}_i`, :math:`i=2, ..., k` için :math:`\textit{comm}_{i-1}` bağlamında bir kuruldur
vi: :math:`\textit{comm}_i` là một ủy ban trong bối cảnh :math:`\textit{comm}_{i-1}` cho :math:`i=2, ..., k`

source: In particular - a committee in context of the base trimmer is 1-level summit.
fr: En particulier - un comité dans le contexte du trimmer de base est un sommet à 1 niveau.
tr: Özellikle - baz düzeltici bağlamında bir komite 1 seviyeli zirvedir.
vi: Đặc biệt - một ủy ban trong bối cảnh của đế máy xén là đỉnh mức độ 1.

source: Below is an example of 4-level summit for 8 validators (all having equal weights 1) with :math:`ftt=2`.
fr: Voici un exemple de sommet de niveau 4 pour 8 validateurs (ayant tous le même poids 1) avec :math:`ftt=2`.
tr: Aşağıda, :math:`ftt=2` ile 8 doğrulayıcı (hepsi eşit ağırlıkta 1) için 4 seviyeli bir zirve örneği verilmiştir.
vi: Dưới đây là ví dụ về đỉnh 4 cấp cho 8 trình xác thực (tất cả đều có trọng số 1 bằng nhau) với :math:`ftt=2`.

source: Similarly to summits, messages also have "acknowledgement levels". We will say **K-level message** for a message with acknowledgement level K. Acknowledgement level for a message is optional. We will use the term **plain-message** to reference messages that do not have acknowledgement level.
fr: Tout comme les sommets, les messages ont également des "niveaux d'accusé de réception". Nous dirons **message de niveau K** pour un message avec un niveau d'accusé de réception K. Le niveau d'accusé de réception d'un message est facultatif. Nous utiliserons le terme **plain-message** pour désigner les messages qui n'ont pas de niveau d'accusé de réception.
tr: Zirvelere benzer şekilde mesajların da “onay seviyeleri” vardır. Onay seviyesi K olan bir mesaj için **K-seviyesi mesaj** diyeceğiz. Bir mesaj için onay seviyesi isteğe bağlıdır. Onay seviyesi olmayan mesajlara atıfta bulunmak için **düz mesaj** terimini kullanacağız.
vi: Tương tự như các đỉnh, các thông điệp cũng có "mức độ xác nhận". Chúng ta sẽ nói **Thông điệp cấp độ K** đối với thông điệp có cấp độ xác nhận K. Cấp độ xác nhận đối với thông điệp là tùy chọn. Chúng tôi sẽ sử dụng thuật ngữ **thông điệp thuần túy** để tham chiếu các thông điệp không có mức xác nhận.

source: The border of a message signals the following information:
fr: La bordure d'un message signale les informations suivantes :
tr: Bir mesajın sınırı aşağıdaki bilgileri gösterir:
vi: Đường viền của thông điệp báo hiệu thông tin sau:

source: black border: plain message
fr: bordure noire : message simple
tr: siyah kenar: düz mesaj
vi: viền đen: thông điệp đơn giản

source: red border: 0-level message
fr: bordure rouge : message de niveau 0
tr: kırmızı kenar: 0 seviyeli mesaj
vi: viền đỏ: thông điệp cấp 0

source: yellow border: :math:`\textit{comm}_1-\textit{messages}` that are not :math:`\textit{comm}_1 \textit{values}`
fr: bordure jaune: :math:`\textit{comm}_1-\textit{messages}` qui ne sont pas :math:`\textit{comm}_1 \textit{values}`
tr: sarı kenar: :math:`\textit{comm}_1 \textit{values}` olmayan :math:`\textit{comm}_1-\textit{messages}`
vi: viền vàng: :math:`\textit{comm}_1-\textit{messages}` mà không phải :math:`\textit{comm}_1 \textit{values}`

source: green border: :math:`\textit{comm}_2-\textit{messages}` that are not :math:`\textit{comm}_2 \textit{values}`
fr: bordure verte: :math:`\textit{comm}_2-\textit{messages}` qui ne sont pas :math:`\textit{comm}_2 \textit{values}`
tr: yeşil kenar: :math:`\textit{comm}_2 \textit{values}` olmayan :math:`\textit{comm}_2-\textit{messages}`
vi: viền xanh là cây: :math:`\textit{comm}_2-\textit{messages}` mà không phải :math:`\textit{comm}_2 \textit{values}`

source: lime border: :math:`\textit{comm}_3-\textit{messages}` that are not :math:`\textit{comm}_3 \textit{values}`
fr: bordure de couleur chaux : :math:`\textit{comm}_3-\textit{messages}` qui ne sont pas :math:`\textit{comm}_3 \textit{values}`
tr: kireç rengi kenar: :math:`\textit{comm}_3 \textit{values}` olmayan :math:`\textit{comm}_3-\textit{messages}`
vi: viền màu vôi: :math:`\textit{comm}_3-\textit{messages}` mà không phải :math:`\textit{comm}_3 \textit{values}`

source: blue border: :math:`\textit{comm}_4-\textit{messages}` that are not :math:`\textit{comm}_4 \textit{values}`
fr: bordure bleue : :math:`\textit{comm}_4-\textit{messages}` qui ne sont pas :math:`\textit{comm}_4 \textit{values}`
tr: mavi kenar: :math:`\textit{comm}_4 \textit{values}` olmayan :math:`\textit{comm}_4-\textit{messages}`
vi: viền xanh: :math:`\textit{comm}_4-\textit{messages}` mà không phải :math:`\textit{comm}_4 \textit{values}`

source: dashed border: this message has not arrived yet to validator 0; it is not part of j-dag as seen by validator 0
fr: bordure en pointillés : ce message n'est pas encore arrivé au validateur 0 ; il ne fait pas partie du j-dag vu par le validateur 0
tr: kesikli kenar: bu mesaj henüz doğrulayıcı 0'a ulaşmadı; doğrulayıcı 0 tarafından görüldüğü gibi j-dag'ın bir parçası değil
vi: đường viền đứt nét: thông điệp này chưa đến trình xác thực 0; nó không phải là một phần của j-dag như được thấy bởi trình xác thực 0

source: Looking at border colors, it is easy to find subsequent committees.
fr: En regardant les couleurs des frontières, il est facile de trouver les comités suivants.
tr: Kenar renklerine bakıldığında, sonraki kurulları bulmak kolaydır.
vi: Nhìn vào màu sắc đường viền, có thể dễ dàng tìm thấy các ủy ban tiếp theo.

source: :math:`\textit{comm}_1` is formed by leftmost yellow messages
fr: :math:``textit{comm}_1` est formé par les messages jaunes les plus à gauche
tr: :math:`\textit{comm}_1` en soldaki sarı mesajlardan oluşur
vi: :math:`\textit{comm}_1` được hình thành bởi các thông điệp màu vàng ngoài cùng bên trái

source: :math:`\textit{comm}_2` is formed by leftmost green messages
fr: :math:``textit{comm}_2` est formé par les messages verts les plus à gauche
tr: :math:`\textit{comm}_2` en soldaki yeşil mesajlardan oluşur
vi: :math:`\textit{comm}_2` được hình thành bởi các thông điệp màu xanh lá cây ngoài cùng bên trái

source: :math:`\textit{comm}_3` is formed by leftmost lime messages
fr: :math:``textit{comm}_3`` est formé par les messages de couleur chaux les plus à gauche
tr: :math:`\textit{comm}_3` en soldaki kireç rengi mesajlardan oluşur
vi: :math:`\textit{comm}_3` được hình thành bởi các thông điệp vôi ngoài cùng bên trái

source: :math:`\textit{comm}_4` is formed by leftmost blue messages
fr: :math:``textit{comm}_4`` est formé par les messages bleus les plus à gauche
tr: :math:`\textit{comm}_4` en soldaki mavi mesajlardan oluşur
vi: :math:`\textit{comm}_4` được hình thành bởi các thông điệp màu xanh lam ngoài cùng bên trái

source: Leftmost red border messages form the base-trimmer.
fr: Les messages de la bordure rouge la plus à gauche forment le base-trimmer.
tr: En soldaki kırmızı kenar mesajları baz düzelticiyi oluşturur.
vi: Thông điệp viền đỏ ngoài cùng bên trái tạo thành đế máy xén.

source: Caution: search for "leftmost messages" separately for every swimlane.
fr: Attention : recherchez les "messages les plus à gauche" (leftmost messages) séparément pour chaque swimlane.
tr: Dikkat: "en soldaki mesajlar"ı her kulvar için ayrı ayrı arayın.
vi: Lưu ý: tìm kiếm "thông điệp ngoài cùng bên trái" riêng biệt cho mỗi vùng.

source: Reference implementation
fr: Implémentation de référence
tr: Başvuru uygulaması
vi: Tham khảo triển khai
