Repository: casper-network/docs-archive
Catalog: locale/*/LC_MESSAGES/theory/abstract-consensus.po
Languages: fr, tr, vi

source: Case (3) can really be considered a sub-case of (2), and (2) can be evaded by assuming that validators reject malformed messages on reception. So, the only real problems come from (1) and (4):
fr: Le cas (3) peut réellement être considéré comme un sous-cas de (2), et (2) peut être éludé en supposant que les validateurs rejettent les messages malformés à la réception. Ainsi, les seuls vrais problèmes viennent de (1) et (4) :
tr: Durum (3) gerçekten (2)'nin bir alt durumu olarak kabul edilebilir ve (2)'den, doğrulayıcıların alım sırasında hatalı biçimlendirilmiş mesajları reddettiği varsayılarak kaçınılabilir. Yani, tek gerçek problem (1) ve (4)'ten gelir:
vi: Trường hợp (3) thực sự có thể được coi là một trường hợp phụ của (2) và (2) có thể được tránh bằng cách giả định rằng trình xác thực từ chối các thông điệp không đúng định dạng khi tiếp nhận. Vì vậy, vấn đề thực sự duy nhất đến từ (1) và (4):

source: Problem (1) is something we are not addressing within ACC.
fr: Le problème (1) est un problème que nous ne traitons pas au sein de l'ACC.
tr: Problem (1), ACC içinde ele almadığımız bir şeydir.
vi: Vấn đề (1) là vấn đề mà chúng tôi không giải quyết trong ACC.

source: Problem (4) is something we control explicitly in the finality calculation.
fr: Le problème (4) est quelque chose que nous contrôlons explicitement dans le calcul de la finalité.
tr: Problem (4), kesinlik hesaplamasında açıkça kontrol ettiğimiz bir şeydir.
vi: Vấn đề (4) là vấn đề chúng tôi kiểm soát rõ ràng trong tính toán cuối cùng.

source: Closer look at equivocations
fr: Regardons de plus près les équivoques
tr: Çelişkili davranışlara daha yakından bakın
vi: Xem xét kỹ hơn các điểm không rõ ràng

source: Equivocations do break consensus. Intuition for this is clear - if everybody cheats by concurrently voting for different values, validators will never come up with a decision the value is finally agreed upon.
fr: Les équivoques rompent le consensus. L'intuition pour cela est claire - si tout le monde triche en votant simultanément pour différentes valeurs, les validateurs ne parviendront jamais à une décision sur laquelle la valeur est finalement acceptée.
tr: Çelişkili davranışlar mutabakatı bozar. Bu açıkça sezilebilir - herkes aynı anda farklı değerler için oy vererek hile yaparsa, doğrulayıcılar asla değer üzerinde nihai olarak üzerinde anlaşmaya varılan bir karara varamazlar.
vi: Sự không rõ ràng phá vỡ sự đồng thuận. Trực giác cho điều này là rõ ràng - nếu mọi người gian lận bằng cách bỏ phiếu đồng thời cho các giá trị khác nhau, người xác thực sẽ không bao giờ đưa ra quyết định cho giá trị cuối cùng đã được đồng ý.

source: It may be not immediately obvious how equivocations are possible in the context of the rule that the estimator function determines the consensus value to vote for. It is worth noticing that:
fr: Il n'est peut-être pas immédiatement évident de comprendre comment les équivoques sont possibles dans le contexte de la règle selon laquelle la fonction d'estimation détermine la valeur de consensus pour laquelle il faut voter. Il convient de noter que :
tr: Tahmin işlevinin oy verilecek mutabakat değerini belirlediği kural bağlamında çelişkili davranışların nasıl mümkün olduğu hemen anlaşılmayabilir. Şuna dikkat etmekte fayda var:
vi: Có thể không rõ ràng ngay lập tức về cách sự không rõ có thể thực hiện được trong bối cảnh quy tắc là chức năng ước tính xác định giá trị đồng thuận để bỏ phiếu. Cần lưu ý rằng:

source: The essence of an equivocation is not about voting for different consensus values; it is about behaving in a “schizophrenic” way by pretending that “I have not seen my previous message”.
fr: L'essence d'une équivoque ne consiste pas à voter pour des valeurs de consensus différentes ; elle consiste à se comporter de manière "schizophrène" en prétendant que "je n'ai pas vu mon message précédent".
tr: Bir çelişkili davranışın özü, farklı mutabakat değerlerine oy vermekle ilgili değil; “Önceki mesajımı görmemişim” gibi yaparak “şizofrenik” davranmakla ilgilidir.
vi: Bản chất của sự không rõ rang không phải là bỏ phiếu cho các giá trị đồng thuận khác nhau; nó là về hành vi theo cách "phân liệt" bằng cách giả vờ rằng "Tôi chưa thấy thông điệp trước đây của mình".

source: A Validator does not have to reveal all messages actually received. “Revealing” happens at the creation of a new message - by listing justifications of this message. The protocol does not prevent a validator from hiding knowledge, i.e. listing as justifications "old" messages.
fr: Un validateur n'est pas obligé de révéler tous les messages réellement reçus. La "révélation" a lieu lors de la création d'un nouveau message - en énumérant les justifications de ce message. Le protocole n'empêche pas un validateur de cacher des connaissances, c'est-à-dire d'énumérer comme justifications d'"anciens" messages.
tr: Bir doğrulayıcı, alınan tüm mesajları göstermek zorunda değildir. “Açıklama”, yeni bir mesajın oluşturulmasında - bu mesajın gerekçelerini listeleyerek gerçekleşir. Protokol, bir doğrulayıcının bilgiyi gizlemesini, yani "eski" mesajların gerekçeleri olarak listelemesini engellemez.
vi: Trình xác thực không phải tiết lộ tất cả các tin nhắn thực sự nhận được. “Tiết lộ” xảy ra khi tạo một tin nhắn mới - bằng cách liệt kê các lý do của tin nhắn này. Giao thức không ngăn trình xác thực che giấu thông tin, tức là liệt kê dưới dạng các thông báo "cũ" để biện minh.

source: Technically, to create an equivocation is very easy - all one have to do is to create a branch own the swimlane. Such a branch is created every time when for a message :math:`m` its transitive justifications :math:`jPastCone(m)` do not include previous message by :math:`m.creator`.
fr: Techniquement, créer une équivoque est très facile - il suffit de créer une branche propre au swimlane. Une telle branche est créée à chaque fois que pour un message :math:`m` ses justifications transitives :math:`jPastCone(m)` n'incluent pas le message précédent de :math:`m.creator`.
tr: Teknik olarak, bir çelişkili davranış oluşturmak çok kolaydır - tek yapmanız gereken kulvara ait bir dal oluşturmaktır. Böyle bir dal her zaman bir mesaj :math:`m` için geçişli gerekçeleri :math:`jPastCone(m)` :math:`m.creator` tarafından önceki mesajı içermediğinde oluşturulur.
vi: Về mặt kỹ thuật, để tạo ra một sự không rõ ràng là rất dễ dàng - tất cả những gì người ta phải làm là tạo ra một nhánh sở hữu vùng. Nhánh như vậy được tạo mỗi khi cho một thông điệp :math:`m` biện minh bắc cầu của nó :math:`jPastCone(m)` không bao gồm thông báo trước bởi :math:`m.creator`.

source: Finality criteria
fr: Critère de finalité
tr: Kesinlik kriterleri
vi: Tiêu chí cuối cùng

source: Let :math:`\mathcal{M}` be the set of all possible formally correct messages. Let :math:`\textit{Snapshots}(\mathcal{M})` be the set of all justifications-closed subsets of :math:`\mathcal{M}`.
fr: Soit :math:`\mathcal{M}` l'ensemble de tous les messages formellement corrects possibles. Soit :math:`\textit{Snapshots}(\mathcal{M})` l'ensemble de tous les sous-ensembles fermés par des justifications de :math:`\mathcal{M}`.
tr: :math:`\mathcal{M}` olası tüm biçimsel olarak doğru mesajların kümesi olsun. :math:`\textit{Snapshots}(\mathcal{M})` tüm gerekçelerin kümesi olsun - :math:`\mathcal{M}` kümesinin kapalı alt kümeleri.
vi: Đặt :math:`\mathcal{M}` là tập hợp tất cả các thông điệp có thể đúng về mặt hình thức. Đặt :math:`\textit{Snapshots}(\mathcal{M})` là tập hợp của tất cả các tập hợp con đã đóng của biện minh của :math:`\mathcal{M}`.

source: Because of equivocations, finality really means “consensus value :math:`c` being locked as long as the fraction of honest nodes is sufficiently high”. We express the “sufficiently high” part by introducing the concept of **faults tolerance threshold**, or **FTT** in short. This leads us to the improved definition of finality:
fr: En raison des équivoques, la finalité signifie en réalité "la valeur du consensus :math:`c` étant verrouillée tant que la fraction de nœuds honnêtes est suffisamment élevée". Nous exprimons la partie "suffisamment élevée" en introduisant le concept de **seuil de tolérance aux fautes**, ou **FTT** en abrégé. Cela nous conduit à la définition améliorée de la finalité :
tr: Çelişkili davranışlar nedeniyle, kesinlik gerçekten “dürüst düğümlerin oranı yeterince yüksek olduğu sürece, mutabakat değeri :math:`c` kilitlenmesi” anlamına gelir. “Yeterince yüksek” kısmı, **hata tolerans eşiği** veya kısaca **FTT** kavramını tanıtarak ifade ediyoruz. Bu bizi kesinliğin geliştirilmiş tanımına götürür:
vi: Do tính không rõ ràng, tính cuối cùng thực sự có nghĩa là “giá trị đồng thuận :math:`c` bị khóa miễn là một phần của các nút trung thực đủ cao”. Chúng tôi thể hiện phần “đủ cao” bằng cách đưa ra khái niệm về **ngưỡng chịu lỗi**, hay ngắn gọn là ** FTT **. Điều này dẫn chúng ta đến định nghĩa được sự cải thiện về tính cuối cùng:

source: A value :math:`c \in Con` is finalized in a snapshot :math:`S \in \textit{Snapshots}(\mathcal{M})` with fault tolerance :math:`t` if:
fr: Une valeur :math:`c \in Con` est finalisée dans un snapshot :math:`S \in \textit{Snapshots}(\mathcal{M})` avec une tolérance aux fautes :math:`t` si :
tr: Bir :math:`c \in Con` değeri, aşağıdaki durumlarda hata toleransı :math:`t` ile bir anlık görüntü :math:`S \in \textit{Snapshots}(\mathcal{M})` içinde sonlandırılır:
vi: Giá trị :math:`c \in Con` được hoàn thành trong một ảnh chụp nhanh :math:`S \in \textit{Snapshots}(\mathcal{M})` với khả năng chịu lỗi :math:`t` nếu:

source: For every snapshot :math:`S \in \mathit{Snapshots}(\mathcal{M})` such that :math:`S \subset R` one of the following is true:
fr: Pour chaque snapshot :math:`S \in \mathit{Snapshots}(\mathcal{M})` tel que :math:`S \subset R` l'une des choses suivantes est vraie :
tr: :math:`S \subset R` aşağıdakilerden biri doğru olacak şekilde her bir :math:`S \in \mathit{Snapshots}(\mathcal{M})` anlık görüntüsü için:
vi: Đối với mọi ảnh chụp nhanh :math:`S \in \mathit{Snapshots}(\mathcal{M})` sao cho :math:`S \subset R` một trong những điều sau là đúng:

source: total weights of equivocators visible in :math:`R` is bigger than :math:`t`
fr: le poids total des équivoques visibles dans :math:`R` est plus grand que :math:`t`
tr: :math:`R` içinde görünen çelişkili davranışların toplam ağırlıkları :math:`t` değerinden büyük
vi: tổng trọng lượng của sự không rõ ràng hiển thị trong :math:`R` lớn hơn :math:`t`

source: **Finality criterion** is any function :math:`fc: \mathit{Snapshots}(\mathcal{M}) \times Int \to C \cup {EMPTY}` such that if :math:`fc(S,t) = c` then :math:`c` is finalized in :math:`S` with fault tolerance :math:`t`.
fr: **Critère de finalité** est toute fonction :math:`fc : \mathit{Snapshots}(\mathcal{M}) \times Int \to C \cup {EMPTY}` telle que si :math:`fc(S,t) = c` alors :math:`c` est finalisée dans :math:`S` avec une tolérance aux fautes :math:`t`.
tr: **Kesinlik kriteri**, herhangi bir :math:`fc: \mathit{Snapshots}(\mathcal{M}) \times Int \to C \cup {EMPTY}` fonksiyonudur, öyle ki :math:`fc(S,t) = c` ise, o zaman :math:`c`, hata toleransı :math:`t` ile :math:`S` ögesinde kesinleştirilir.
vi: **Tiêu chí cuối cùng** là bất kỳ hàm nào :math:`fc: \mathit{Snapshots}(\mathcal{M}) \times Int \to C \cup {EMPTY}` sao cho nếu :math:`fc(S,t) = c` thì :math:`c` được hoàn thiện trong :math:`S` với khả năng chịu lỗi :math:`t`.

source: Intuitively, finality is something that is easy to define mathematically but potentially hard to discover by an efficient calculation. Therefore in general we discuss various finality criteria, which are approximations of finality. Finality criteria may differ by sensitivity (= how they are not overlooking existing finality) and computational efficacy.
fr: Intuitivement, la finalité est quelque chose qui est facile à définir mathématiquement mais potentiellement difficile à découvrir par un calcul efficace. C'est pourquoi, en général, nous discutons de divers critères de finalité, qui sont des approximations de la finalité. Les critères de finalité peuvent différer par leur sensibilité (= comment ils ne négligent pas la finalité existante) et par leur efficacité de calcul.
tr: Kesinlik, sezgisel bir biçimde matematiksel olarak tanımlanması kolay ancak verimli bir hesaplama ile keşfedilmesi potansiyel olarak zor olan bir şeydir. Bu nedenle, genel olarak, kesinliğin yaklaşımları olan çeşitli kesinlik kriterlerini tartışıyoruz. Kesinlik kriterleri, hassasiyete (= mevcut kesinliği nasıl gözden kaçırmadıklarına) ve hesaplama etkinliğine göre farklılık gösterebilir.
vi: Về mặt trực quan, tính cuối cùng là thứ dễ xác định bằng toán học nhưng có khả năng khó phát hiện bằng một phép tính hiệu quả. Do đó, nói chung, chúng tôi thảo luận về các tiêu chí cuối cùng khác nhau, là những tiêu chí gần đúng về độ cuối cùng. Các tiêu chí về tính cuối cùng có thể khác nhau theo độ nhạy (= cách chúng không bỏ qua tính cuối cùng hiện có) và hiệu quả tính toán.

source: Calculating finality
fr: Calcul de la finalité
tr: Kesinlik hesaplama
vi: Tính toán cuối cùng

source: Introduction
tr: Giriş
vi: Giới thiệu

source: We describe here the criterion of finality codenamed “Summit theory ver 2”. This criterion has two parameters:
fr: Nous décrivons ici le critère de finalité dont le nom de code est "théorie des sommets ver 2". Ce critère comporte deux paramètres :
tr: Burada “Zirve teorisi sürüm 2” kod adlı kesinlik kriterini tanımlıyoruz. Bu kriterin iki parametresi vardır:
vi: Chúng tôi mô tả ở đây tiêu chí về tính cuối cùng có tên mã là "Lý thuyết đỉnh phiên bản 2". Tiêu chí này có hai tham số:

source: **ftt: Int** - “absolute” fault tolerance threshold (expressed as total weight)
fr: **ftt : Int** - seuil "absolu" de tolérance aux fautes (exprimé en poids total)
tr: **ftt: Int** - "mutlak" hata tolerans eşiği (toplam ağırlık olarak ifade edilir)
vi: **ftt: Int** - Ngưỡng chịu lỗi “tuyệt đối” (được biểu thị bằng tổng trọng số)

source: **ack_level: Int** - acknowledgement level; an integer value bigger than zero
fr: **ack_level : Int** - niveau d'accusé de réception (acknowledgement level) ; une valeur entière supérieure à zéro.
tr: **ack_level: Int** - onay seviyesi; sıfırdan büyük bir tam sayı değeri
vi: **ack_level: Int** - mức độ nhận biết; một giá trị số nguyên lớn hơn 0

source: The criterion is centered about the concept of "summit". Summits are subgraphs of j-dag fulfilling certain properties. We will use the term **k-summit** for a summit formed with acknowledgement level k.
fr: Le critère est centré sur le concept de "sommet". Les sommets sont des sous-graphes de j-dag remplissant certaines propriétés. Nous utiliserons le terme **k-sommet** (k-summit) pour un sommet formé avec le niveau d'accusé de réception k.
tr: Kriter, “zirve” kavramı etrafında toplanmıştır. Zirveler, belirli özellikleri yerine getiren j-dag'ın alt grafikleridir. k onay seviyesi ile oluşturulmuş bir zirve için **k-summit** terimini kullanacağız.
vi: Tiêu chí tập trung vào khái niệm "đỉnh". Đỉnh là các biểu đồ con của j-dag đáp ứng các thuộc tính nhất định. Chúng tôi sẽ sử dụng thuật ngữ **đỉnh-k** cho một đỉnh với cấp độ xác nhận k.

source: Once a k-level summit is found, the consensus is achieved.
fr: Une fois qu'un sommet de niveau k est trouvé, le consensus est atteint.
tr: Bir k-level zirvesi bulunduğunda, mutabakat sağlanır.
vi: Sau khi thấy một đỉnh mức k, sự đồng thuận sẽ đạt được.

source: Visual notation
fr: Notation visuelle
tr: Görsel gösterim
vi: Ký hiệu trực quan

source: To investigate the summit theory we developed a simulator and a visual notation. Pictures in this chapter are produced with this simulator.
fr: Pour étudier la théorie du sommet, nous avons développé un simulateur et une notation visuelle. Les images de ce chapitre sont produites avec ce simulateur.
tr: Zirve teorisini incelemek için bir simülatör ve görsel bir gösterim geliştirdik. Bu bölümdeki resimler bu simülatör ile üretilmiştir.
vi: Để nghiên cứu lý thuyết về đỉnh, chúng tôi đã phát triển một trình mô phỏng và ký hiệu trực quan. Hình ảnh trong chương này được tạo bằng trình mô phỏng này.

source: This is an example of 1-summit:
fr: C'est un exemple de 1-summit :
tr: Bu bir 1-summit örneğidir:
vi: Đây là một ví dụ về 1 đỉnh:

source: The graph corresponds to local j-dag of validator 0 and is visually aligned by daglevel (so time goes from left to right).
fr: Le graphe correspond au j-dag local du validateur 0 et est aligné visuellement par 'daglevel' (le temps va donc de gauche à droite).
tr: Grafik, doğrulayıcı 0'ın yerel j-dag'ına karşılık gelir ve görsel olarak daglevel ile hizalanır (böylece zaman soldan sağa doğru gider).
vi: Biểu đồ tương ứng với j-dag cục bộ của trình xác thực 0 và được căn chỉnh trực quan bởi daglevel (vì vậy thời gian đi từ trái sang phải).

source: Rectangles on the left represent validators. Swimlane of a validator is aligned horizontally, so for example swimlane of validator 3 contains messages 4, 14, 20 and 24. Message 28 is marked with a dashed border - this means this message was created somewhere in the network but at the moment of taking the snapshot of local state of validator 0 was not yet delivered to validator 0.
fr: Les rectangles à gauche représentent les validateurs. Le swimlane d'un validateur est aligné horizontalement. Par exemple, le swimlane du validateur 3 contient les messages 4, 14, 20 et 24. Le message 28 est marqué d'une bordure en pointillés - cela signifie que ce message a été créé quelque part dans le réseau mais qu'au moment de la prise du snapshot de l'état local du validateur 0, il n'a pas encore été délivré au validateur 0.
tr: Soldaki dikdörtgenler doğrulayıcıları temsil eder. Bir doğrulayıcının kulvarı yatay olarak hizalanır, bu nedenle örneğin doğrulayıcı 3'ün kulvarı 4, 14, 20 ve 24 mesajlarını içerir. Mesaj 28 kesikli bir kenarlıkla işaretlenmiştir - bu, bu mesajın ağda bir yerde oluşturulduğu, ancak doğrulayıcı 0'ın yerel durumunun anlık görüntüsünün alma anında henüz doğrulayıcı 0'a teslim edilmediği anlamına gelir.
vi: Hình chữ nhật bên trái đại diện cho trình xác thực. Vùng của trình xác thực được căn chỉnh theo chiều ngang, vì vậy, ví dụ: Vùng của trình xác thực 3 chứa các thông báo 4, 14, 20 và 24. Thông điệp 28 được đánh dấu bằng đường viền đứt nét - điều này có nghĩa là thông điệp này đã được tạo ở đâu đó trong mạng nhưng tại thời điểm lấy ảnh chụp nhanh trạng thái cục bộ của trình xác thực 0 chưa được gửi đến trình xác thực 0.

source: Validator colors are also meaningful:
fr: Les couleurs des validateurs sont également significatives :
tr: Doğrulayıcı renkleri de anlamlıdır:
vi: Màu của trình xác thực cũng có ý nghĩa:

source: white - this validator is not part of the summit
fr: blanc - ce validateur ne fait pas partie du sommet
tr: beyaz - bu doğrulayıcı zirvenin bir parçası değil
vi: màu trắng - trình xác thực này không phải là một phần của đỉnh

source: green - this validator is part of the summit
fr: vert - ce validateur fait partie du sommet
tr: yeşil - bu doğrulayıcı zirvenin bir parçası
vi: màu xanh lá cây - trình xác thực này là một phần của đỉnh

source: red - this is an equivocator
fr: rouge - c'est un équivoque
tr: kırmızı - bu doğrulayıcı çelişkili davranmaktadır
vi: màu đỏ - đây là một phần không rõ ràng

source: The color inside of each message represents the consensus value this message is voting for.
fr: La couleur à l'intérieur de chaque message représente la valeur de consensus pour laquelle ce message vote.
tr: Her mesajın içindeki renk, bu mesajın oy verdiği mutabakat değerini temsil eder.
vi: Màu bên trong của mỗi thông điệp thể hiện giá trị đồng thuận mà thông điệp này đang bỏ phiếu.

source: The color outside represents the information related to summit structure (explained later in this chapter).
fr: La couleur à l'extérieur représente les informations relatives à la structure du sommet (expliquées plus loin dans ce chapitre).
tr: Dıştaki renk, zirve yapısıyla ilgili bilgileri temsil eder (bu bölümün ilerleyen kısımlarında açıklanacaktır).
vi: Màu sắc bên ngoài đại diện cho thông tin liên quan đến cấu trúc đỉnh (sẽ giải thích ở phần sau của chương này).

source: Step 1: Calculate quorum size
fr: Étape 1 : Calculer la taille du quorum
tr: Adım 1: Çekirdek boyutunu hesaplayın
vi: Bước 1: Tính toán quy mô đại diện

source: Quorum size is an integer value calculated as:
fr: La taille du quorum est une valeur entière calculée comme suit :
tr: Çekirdek boyutu şu şekilde hesaplanan bir tamsayı değeridir:
vi: Kích thước tối đa là một giá trị số nguyên được tính như sau:

source: … where:
fr: … où:
tr: ... burada:
vi: … khi:

source: :math:`ftt` - absolute fault tolerance threshold
fr: :math:`ftt` - seuil absolu de tolérance aux fautes
tr: :math:`ftt` - mutlak hata tolerans eşiği
vi: :math:`ftt` - ngưỡng chịu lỗi tuyệt đối

source: :math:`w` - sum of weights of validators
fr: :math:`w` - somme des poids des validateurs
tr: :math:`w` - doğrulayıcıların ağırlıklarının toplamı
vi: :math:`w` - tổng trọng số của các trình xác nhận

source: :math:`k` - desired acknowledgement level of a summit we are trying to find
fr: :math:`k` - niveau d'accusé de réception (acknowledgement level) souhaité d'un sommet que nous essayons de trouver
tr: :math:`k` - bulmaya çalıştığımız bir zirvenin istenen onay seviyesi
vi: :math:`k` - mức độ xác nhận mong muốn của một đỉnh mà chúng tôi đang cố gắng tìm kiếm

source: :math:`ceiling` - rounding towards positive infinity
fr: :math:`ceiling` - arrondi vers l'infini positif
tr: :math:`ceiling` - pozitif sonsuza yuvarlama
vi: :math:`ceiling` - làm tròn về phía dương vô cùng

source: The formula can be rephrased to use relative ftt instead of absolute ftt:
fr: La formule peut être remaniée pour utiliser le ftt relatif au lieu du ftt absolu :
tr: Formül, mutlak ftt yerine göreli ftt kullanacak şekilde yeniden ifade edilebilir:
vi: Công thức có thể được diễn đạt lại để sử dụng ftt tương đối thay vì ftt tuyệt đối:

source: :math:`rftt` - relative fault tolerance threshold (fractional value between 0 and 1); represents the maximal accepted total weight of malicious validators - as fraction of :math:`w`
fr: :math:`rftt` - seuil de tolérance relative aux fautes (valeur fractionnaire comprise entre 0 et 1) ; représente le poids total maximal accepté des validateurs malveillants - en tant que fraction de :math:`w`.
tr: :math:`rftt` - bağıl hata tolerans eşiği (0 ile 1 arasında kesirli değer); kötü niyetli doğrulayıcıların maksimum kabul edilen toplam ağırlığını temsil eder - :math:`w` kesri olarak
vi: :math:`rftt` - ngưỡng chịu lỗi tương đối (giá trị phân số từ 0 đến 1); đại diện cho tổng trọng số tối đa được chấp nhận của các trình xác thực độc hại - như một phần của :math:`w`

source: Step 2: Find consensus candidate value
fr: Étape 2 : Trouver la valeur candidate de consensus
tr: 2. Adım: Mutabakat adayı değerini bulun
vi: Bước 2: Tìm giá trị ứng viên đồng thuận
