Repository: casper-network/docs-archive
Catalog: locale/*/LC_MESSAGES/theory/abstract-consensus.po
Languages: fr, tr, vi

source: Abstract Casper Consensus
tr: Soyut Casper Mutabakatı
vi: Tóm tắt Đồng thuận Casper

source: Stating the problem
fr: Énoncé du le problème
tr: Sorunun ortaya konması
vi: Nêu rõ vấn đề

source: We are considering a collection of processes - **validators** - communicating over a message-passing network. Every validator has a **weight** -- a non-zero integer value representing the "voting power".
fr: Nous considérons une collection de processus - **validateurs** - communiquant sur un réseau de transmission de messages. Chaque validateur a un **poids** - une valeur entière non nulle représentant le "pouvoir de vote".
tr: Mesaj ileten bir ağ üzerinden iletişim kuran bir dizi süreç - **doğrulayıcılar** - düşünüyoruz. Her doğrulayıcının "oylama gücünü" temsil eden sıfır olmayan bir tam sayı değeri, bir **ağırlığı** vardır.
vi: Chúng tôi đang xem xét một tập hợp các tiến trình - **trình xác thực** - giao tiếp qua mạng truyền thông điệp. Mọi trình xác thực đều có **trọng số** - một giá trị số nguyên khác 0 đại diện cho "quyền biểu quyết".

source: The goal validators collectively pursue is to pick a single value from a finite set :math:`Con` we call the set of **consensus values**. Once the agreement is achieved, the problem is considered solved (i.e. validators terminate their operation). We require that :math:`Con` is totally ordered.
fr: Le but que poursuivent collectivement les validateurs est de choisir une valeur unique dans un ensemble fini :math:`Con` que nous appelons l'ensemble des **valeurs de consensus**. Une fois l'accord obtenu, le problème est considéré comme résolu (c'est-à-dire que les validateurs mettent fin à leur opération). Nous exigeons que :math:`Con` soit totalement ordonné.
tr: Doğrulayıcıların toplu olarak takip ettiği hedef, sonlu bir kümeden tek bir değer seçmektir :math:`Con`, biz buna **mutabakat değerleri** kümesi diyoruz. Anlaşma sağlandıktan sonra sorun çözülmüş olarak kabul edilir (yani doğrulayıcılar işlemlerini sonlandırırlar). :math:`Con` değerinin tamamen sıralı olmasını istiyoruz.
vi: Mục tiêu mà các trình xác thực chung theo đuổi là chọn một giá trị duy nhất từ một tập hợp hữu hạn :math:`Con` mà chúng tôi gọi là tập hợp **giá trị đồng thuận**. Sau khi đạt được thỏa thuận, vấn đề được coi là đã được giải quyết (tức là trình xác thực chấm dứt hoạt động của họ). Chúng tôi yêu cầu rằng :math:`Con` là hoàn toàn có thứ tự.

source: The resulting solution of this problem is not a blockchain yet. It is however a core building block of our blockchain design. The way abstract consensus is used for building a blockchain is explained in subsequent chapters.
fr: La solution à ce problème n'est pas encore une blockchain. Il s'agit toutefois d'un élément de base de notre conception de la blockchain. La manière dont le consensus abstrait est utilisé pour construire une blockchain est expliquée dans les chapitres suivants.
tr: Bu sorunun ortaya çıkan çözümü henüz bir blokzincir değil. Bununla birlikte, blokzincir tasarımımızın temel yapı taşıdır. Bir blokzincir oluşturmak için soyut mutabakatın nasıl kullanıldığı sonraki bölümlerde açıklanmaktadır.
vi: Giải pháp kết quả của vấn đề này chưa phải là một chuỗi khối. Tuy nhiên, nó là một khối xây dựng cốt lõi của thiết kế chuỗi khối của chúng tôi. Cách tóm tắt sự đồng thuận sử dụng để xây dựng một chuỗi khối được giải thích trong các chương tiếp theo.

source: Caution: we use **ACC** as the shortcut for **Abstract Casper Consensus**.
fr: Attention : nous utilisons **ACC** comme raccourci pour **Abstract Casper Consensus**.
tr: Dikkat: **Soyut Casper Mutabakatı** için kısayol olarak **ACC** kullanıyoruz.
vi: Chú ý: chúng tôi sử dụng **ACC** làm viết tắt cho **Abstract Casper Consensus**.

source: Network model
fr: Modèle de réseau
tr: Ağ modeli
vi: Mô hình mạng

source: We assume a fully asynchronous network model with delivery guarantee and a single primitive: `broadcast(m)`. Precisely speaking:
fr: Nous supposons un modèle de réseau entièrement asynchrone avec garantie de livraison (des messages) et une seule primitive : `broadcast(m)`. De manière précise :
tr: Teslimat garantisi ve tek bir temel değer ile tamamen asenkron bir ağ modeli varsayıyoruz: "yayın(m)". Kesin konuşmak gerekirse:
vi: Chúng tôi giả định có một mô hình mạng hoàn toàn không đồng bộ với việc đảm bảo phân phối và một thời kỳ nguyên thủy duy nhất :`broadcast(m)`. Nói một cách chính xác:

source: Communication between validators is based on the “broadcast” primitive: at any time, a validator can broadcast a message :math:`m`.
fr: La communication entre les validateurs est basée sur la primitive "broadcast" : à tout moment, un validateur peut diffuser un message :math:`m`.
tr: Doğrulayıcılar arasındaki iletişim "yayın" ilkesine dayanır: herhangi bir zamanda bir doğrulayıcı bir :math:`m` mesajı yayınlayabilir.
vi: Giao tiếp giữa các trình xác thực dựa trên cơ sở "gửi đi" thông điệp: bất kỳ lúc nào, trình xác thực có thể phát một thông điệp :math:`m`.

source: Once broadcast, the message :math:`m` will be eventually delivered to every other validator in the network. The delivery will happen exactly once but with arbitrary delay.
fr: Une fois diffusé, le message :math:`m` sera finalement livré à tous les autres validateurs du réseau. La livraison se fera exactement une fois mais avec un délai arbitraire.
tr: Yayınlandıktan sonra, :math:`m` mesajı nihayetinde ağdaki diğer tüm doğrulayıcılara iletilecektir. Teslimat tam olarak bir kez, ancak keyfi bir gecikmeyle gerçekleşecektir.
vi: Sau khi gửi đi, thông điệp :math:`m` cuối cùng sẽ được gửi đến mọi trình xác thực khác trong mạng. Việc gửi sẽ diễn ra chính xác một lần nhưng có sự chậm trễ tùy ý.

source: Given the assumptions above, it follows that the order of delivery generally is not going to be preserved. In other words when a validator :math:`A` broadcast sequence of messages :math:`(m_1, m_2, ... m_k)` then another validator :math:`B` will receive all the messages in the sequence, but with delivery chronology following arbitrary permutation :math:`p:(1,..,k) \rightarrow (1,..,k)`, i.e. :math:`(m_{p(1)}, m_{p(2)}, ... m_{p(k)})`.
fr: Compte tenu des hypothèses ci-dessus, il s'ensuit que l'ordre de livraison ne sera généralement pas préservé. En d'autres termes, lorsqu'un validateur :math:`A` diffuse une séquence de messages :math:`(m_1, m_2, .... m_k)`, un autre validateur :math:`B` recevra tous les messages de la séquence, mais avec une chronologie de remise suivant une permutation arbitraire :math:`p :(1,...,k) \rightarrow (1,...,k)`, c'est-à-dire :math:`(m_{p(1)}, m_{p(2)}, ... m_{p(k)})`.
tr: Yukarıdaki varsayımlar göz önüne alındığında, teslimat sırasının genel olarak muhafaza edilmeyeceğini takip eder. Başka bir deyişle, bir doğrulayıcı :math:`A` mesaj dizisi yayınladığında :math:`(m_1, m_2, ... m_k)` daha sonra başka bir doğrulayıcı :math:`B` sırayla tüm mesajları alacaktır, ancak :math:`p:(1,..,k) \rightarrow (1,..,k)` rastgele permütasyonunu takip eden kronoloji ile, yani :math:`(m_{p(1)}, m_{p(2)}, ... m_{p(k)})` ile teslim alacaktır.
vi: Với các giả định ở trên, thứ tự gửi nói chung sẽ không được giữ nguyên. Nói cách khác khi trình xác thực :math:`A` truyền phát chuỗi thông điệp :math:`(m_1, m_2, ... m_k)` thì một trình xác thực khác :math:`B` sẽ nhận được tất cả các thông điệp trong chuỗi, nhưng với trình tự thời gian gửi sau hoán vị tùy ý :math:`p:(1,..,k) \rightarrow (1,..,k)`, tức là :math:`(m_{p(1)}, m_{p(2)}, ... m_{p(k)})`.

source: Messages
tr: Mesajlar
vi: Thông điệp

source: All the messages broadcast by validators have the same structure. Every message :math:`m`:
fr: Tous les messages diffusés par les validateurs ont la même structure. Chaque message :math:`m` :
tr: Doğrulayıcılar tarafından yayınlanan tüm mesajlar aynı yapıya sahiptir. Her mesaj :math:`m`:
vi: Tất cả các thông điệp được phát bởi trình xác nhận có cấu trúc giống nhau. Mọi thông điệp :math:`m`:

source: has unique identifier - :math:`m.id`
fr: a un identifiant unique - :math:`m.id`.
tr: benzersiz tanımlayıcıya sahip - :math:`m.id`
vi: có định danh duy nhất - :math:`m.id`

source: includes the identifier of the validator who created :math:`m.creator`
fr: inclut l'identifiant du validateur qui a créé :math:`m.creator`.
tr: :math:`m.creator` oluşturan doğrulayıcının tanımlayıcısını içerir
vi: bao gồm định danh của trình xác thực đã tạo :math:`m.creator`

source: references messages the creator confirms as seen at the moment of creating :math:`m` - we call this list "justifications" - :math:`m.justifications`
fr: référence les messages que le créateur confirme comme vu au moment de la création de :math:`m` - nous appelons cette liste "justifications" - :math:`m.justifications`
tr: :math:`m` mesajının oluşturulduğu anda görüldüğü gibi oluşturanın onayladığı mesajlara başvurur - bu listeye "gerekçeler" diyoruz - :math:`m.justifications`
vi: tham chiếu đến các thông điệp mà người tạo xác nhận như đã thấy tại thời điểm tạo :math:`m` - chúng tôi gọi danh sách này là "biện minh" - :math:`m.justifications`

source: has a vote:
fr: a un droit de vote :
tr: oy hakkı var:
vi: có một phiếu bầu:

source: this means pointing to a some consensus value, or
fr: cela signifie pointer vers une certaine valeur de consensus, ou
tr: bu, bir mutabakat değerine işaret etmek anlamına gelir veya
vi: điều này có nghĩa là trỏ đến một giá trị đồng thuận nào đó, hoặc

source: picking no consensus value (i.e. this is "empty vote")
fr: ne choisissant aucune valeur de consensus (c'est un "vote vide")
tr: bir mutabakat değeri seçmemek (yani "boş oy")
vi: không chọn giá trị đồng thuận (tức là đây là "phiếu trống")

source: is cryptographically signed by the creator
fr: est signé cryptographiquement par le créateur
tr: oluşturan tarafından kriptografik olarak imzalanmıştır
vi: được ký bằng mật mã bởi người tạo

source: The consensus value included in the message is however optional - it is OK to broadcast an "empty vote" message. The semantics of such empty vote is "I support my previous vote, unchanged". If the previous vote is empty, it counts as "vote for nothing".
fr: La valeur du consensus incluse dans le message est toutefois facultative - il est possible de diffuser un message de "vote vide". La sémantique d'un tel vote vide est "Je soutiens mon vote précédent, sans modification". Si le vote précédent est vide, il est considéré comme un "vote pour rien".
tr: Bununla birlikte, mesaja dahil edilen mutabakat değeri isteğe bağlıdır - bir "boş oy" mesajı yayınlamak sorun değildir. Böyle bir boş oylamanın anlamı, "Önceki oyumu değişmeden destekliyorum". Bir önceki oy boşsa, "boş oy" olarak sayılır.
vi: Tuy nhiên, giá trị đồng thuận được bao gồm trong thông điệp là tùy chọn - có thể phát thông điệp "phiếu trống". Ngữ nghĩa của cuộc bỏ phiếu trống như vậy là "Tôi ủng hộ phiếu bầu trước đó của tôi, không thay đổi". Nếu phiếu bầu trước đó trống, nó được tính là "không bầu cho gì cả".

source: This is the pseudo-code definition of a message structure (taken from the reference implementation, which is presented in detail later in this chapter):
fr: Il s'agit de la définition en pseudo-code d'une structure de message (tirée de l'implémentation de référence, qui est présentée en détail plus loin dans ce chapitre) :
tr: Bu, bir mesaj yapısının sözde kod tanımıdır (bu bölümün ilerleyen kısımlarında ayrıntılı olarak sunulan referans uygulamasından alınmıştır):
vi: Đây là định nghĩa mã giả của cấu trúc thông điệp (lấy từ triển khai tài liệu tham khảo, được trình bày chi tiết ở phần sau của chương này):

source: We use the term **snapshot** for a set of messages :math:`M` that is closed under taking justifications, i.e. such that:
fr: Nous utilisons le terme **snapshot** pour un ensemble de messages :math:`M` qui est fermé en prenant des justifications, c'est-à-dire tel que :
tr: **Anlık görüntü** terimini, gerekçeler alınarak kapatılan bir dizi mesaj :math:`M` için kullanıyoruz, yani:
vi: Chúng tôi sử dụng thuật ngữ **ảnh chụp** cho một tập hợp các thông điệp :math:`M` được gói lại dưới sự biện minh, tức là như sau:

source: Let us consider arbitrary snapshot :math:`M`. We will define the following acyclic directed graph :math:`jDag(M)`:
fr: Considérons un snapshot arbitraire :math:`M`. Nous définirons le graphe dirigé acyclique suivant :math:`jDag(M)` :
tr: Rastgele :math:`M` anlık görüntüsünü ele alalım. Aşağıdaki çevrimsiz yönlendirilmiş :math:`jDag(M)` grafiğini tanımlayacağız:
vi: Chúng ta hãy xem xét ảnh chụp tùy ý :math:`M`. Chúng ta sẽ xác định đồ thị có hướng xoay chiều sau :math:`jDag(M)`:

source: vertices = all elements of :math:`M`;
fr: sommets (vertices) = tous les éléments de :math:`M`;
tr: köşeler = :math:`M` öğesinin tüm elemanları;
vi: vertices = tất cả phần tử của :math:`M`;

source: edges = all pairs :math:`m_1 \rightarrow m_2` such that :math:`m_2 \in m_1.justifications`.
fr: bords (edges) = toutes les paires :math:`m_1 \rightarrow m_2` telles que :math:`m_2 \in m_1.justifications`.
tr: kenarlar = tüm çiftler :math:`m_1 \rightarrow m_2` öyle ki :math:`m_2 \in m_1.justifications`.
vi: edge = tất cả các cặp :math:`m_1 \rightarrow m_2` sao cho :math:`m_2 \in m_1.justifications`.

source: Why we claim this graph is acyclic ? Well, because a cycle in this graph would mean that either time-traveling is possible or a validator managed to guess an id of some message before that message was actually created. Time-traveling we preclude on the basis of physics, while guessing of future message id must be made close-to-impossible via smart implementation of message identifiers (using message hash should be good enough).
fr: Pourquoi prétendons-nous que ce graphe est acyclique ? Eh bien, parce qu'un cycle dans ce graphe signifierait que soit le voyage dans le temps est possible, soit un validateur a réussi à deviner l'identifiant d'un message avant que ce message ne soit réellement créé. Nous excluons le voyage dans le temps sur la base de la physique, tandis que l'identification d'un message futur doit être rendue presque impossible par une implémentation intelligente des identifiants de message (l'utilisation d'un hash de message devrait suffire).
tr: Neden bu grafiğin çevrimsiz olduğunu iddia ediyoruz? Eh, çünkü bu grafikteki bir döngü, ya zaman yolculuğunun mümkün olduğu ya da bir doğrulayıcının, o mesaj gerçekten oluşturulmadan önce bir mesajın kimliğini tahmin etmeyi başardığı anlamına gelir. Fizik bazında önlediğimiz zaman yolculuğunu, gelecekteki mesaj kimliğinin tahmin edilmesi, mesaj tanımlayıcılarının akıllıca uygulanması yoluyla imkansıza yakın hale getirilmelidir (mesaj özetini (hash) kullanmak yeterince iyi olmalıdır).
vi: Tại sao chúng tôi lại khẳng định đồ thị này là dòng không gian? Chà, bởi vì một chu kỳ trong biểu đồ này có nghĩa là hoặc có thể du hành thời gian hoặc trình xác thực quản lý để đoán một id của một số thông điệp trước khi thông báo đó thực sự được tạo. Việc du hành thời gian được chúng tôi loại trừ dựa trên cơ sở vật lý, trong khi việc đoán id thông điệp trong tương lai gần như không thể (sử dụng mã băm thông báo phải đủ tốt).

source: We require that every validator maintains a representation of :math:`jDag(M)` reflecting the most up to date knowledge on the ongoing consensus establishing process. Observe that :math:`jDag(M)` may be equivalently seen as a POSET because of the well-known equivalence between transitively closed DAGs and POSETs. In the remainder of this chapter we blur the difference between :math:`jDag(M)` seen as a DAG and its transitive closure seen as a POSET. We will use the relation symbols :math:`<` and :math:`\leqslant` for the implied partial order of :math:`jDag(M)`, where for two messages :math:`a` and :math:`b` a justification :math:`a \to b` implies :math:`b < a`.
fr: Nous exigeons que chaque validateur maintienne une représentation de :math:`jDag(M)` reflétant les connaissances les plus récentes sur le processus d'établissement du consensus en cours. Observez que :math:`jDag(M)` peut être vu de manière équivalente comme un POSET en raison de l'équivalence bien connue entre les DAGs transitivement fermés et les POSETs. Dans la suite de ce chapitre, nous estomperons la différence entre :math:`jDag(M)` vu comme un DAG et sa closure transitive vue comme un POSET. Nous utiliserons les symboles de relation :math:`<` et :math:`\leqslant` pour l'ordre partiel implicite de :math:`jDag(M)`, où pour deux messages :math:`a` et :math:`b` une justification :math:`a \to b` implique :math:`b < a`.
tr: Her doğrulayıcının, devam eden mutabakat oluşturma süreciyle ilgili en güncel bilgileri yansıtan bir :math:`jDag(M)` temsilini tutmasını şart koşuyoruz. Geçişli olarak kapalı DAG'ler ve POSET'ler arasındaki iyi bilinen eşdeğerlik nedeniyle :math:`jDag(M)` öğesinin bir POSET olarak eşit bir şekilde görülebileceğini gözlemleyin. Bu bölümün geri kalanında, DAG olarak görülen :math:`jDag(M)` ile POSET olarak görülen geçişli kapanması arasındaki farkı bulanıklaştırıyoruz. :math:`jDag(M)` ögesinin ima edilen kısmi sırası için :math:`<` ve :math:`\leqslant` ilişki sembollerini kullanacağız, burada :math:`a` ve :math: "b" iki mesaj için gerekçe :math:`a \to b` :math:`b < a` anlamına gelmektedir.
vi: Chúng tôi yêu cầu mọi trình xác thực phải duy trì biểu diễn của :math:`jDag(M)` phản ánh thông tin cập nhật nhất về quá trình thiết lập sự đồng thuận đang diễn ra. Hãy quan sát rằng :math:`jDag(M)` có thể được xem tương đương như một POSET vì sự tương đương giữa DAG và POSET đã đóng tạm thời. Trong phần còn lại của chương này, chúng tôi làm mờ sự khác biệt giữa :math:`jDag(M)` được xem như một DAG và kết thúc bắc cầu việc xem nó là một POSET. Chúng tôi sẽ sử dụng các ký hiệu quan hệ :math:`<` và :math:`\leqslant` cho thứ tự từng phần ngụ ý của :math:`jDag(M)`, trong đó cho hai thông điệp :math:`a` và :math:`b` biện minh :math:`a \to b` ngụ ý :math:`b < a`.

source: When :math:`m \in M`, we define:
fr: Quand :math:`m \in M`, on définit :
tr: :math:`m \in M` olduğunda, şunları tanımlarız:
vi: Khi :math:`m \in M`, chúng tôi xác định:

source: :math:`jPast(m)` as :math:`\{x \in M: x < m \}`.
fr: :math:`jPast(m)` comme :math:`\{x \in M : x < m \}`.
tr: :math:`\{x \in M: x < m \}` olarak :math:`jPast(m)`.
vi: :math:`jPast(m)` như :math:`\{x \in M: x < m \}`.

source: :math:`jPastCone(m)` as :math:`\{x \in M: x \leqslant m \}`.
fr: :math:`jPastCone(m)` comme :math:`{x \in M : x \leqslant m \}`.
tr: :math:`\{x \in M: x \leqslant m \}` olarak :math:`jPastCone(m)`.
vi: :math:`jPastCone(m)` như :math:`\{x \in M: x \leqslant m \}`.

source: Of course both :math:`jPast(m)` and :math:`jPastCone(m)` are snapshots.
fr: Bien sûr, les deux :math:`jPast(m)` et :math:`jPastCone(m)` sont des snapshots.
tr: Elbette hem :math:`jPast(m)` hem de :math:`jPastCone(m)` anlık görüntülerdir.
vi: Tất nhiên cả hai :math:`jPast(m)` và :math:`jPastCone(m)` đều là ảnh chụp nhanh.

source: In the context of any snapshot :math:`M` we introduce the following concepts:
fr: Dans le contexte de tout snapshot :math:`M`, nous introduisons les concepts suivants :
tr: :math:`M` ögesinin herhangi bir anlık görüntü bağlamında aşağıdaki kavramları tanıtıyoruz:
vi: Trong ngữ cảnh của bất kỳ ảnh chụp nhanh nào :math:`M`, chúng tôi giới thiệu các khái niệm sau:

source: **transitive justification of message m**
fr: **justification transitive du message m**
tr: **m mesajının geçişli gerekçesi**
vi: **biện minh bắc cầu của thông điệp m**

source: is any message :math:`x` such that :math:`x < m`; we also say that ":math:`m` has seen :math:`x`"
fr: est tout message :math:`x` tel que :math:`x < m` ; nous disons aussi que ":math:`m` a vu :math:`x`".
tr: :math:`x` mesajı öyleki :math:`x < m` mesajıdır; ayrıca ":math:`m` :math:`x` mesajını gördü" deriz.
vi: là bất kỳ thông điệp nào :math:`x` sao cho :math:`x < m`; chúng tôi cũng nói rằng ":math:`m` đã thấy :math:`x`"

source: **swimlane of validator v**
fr: **swimlane du validateur v**
tr: **v doğrulayıcının kulvarı**
vi: **vùng của trình xác thực v**

source: or just :math:`swimlane(v,M)` is :math:`\{m \in M: m.creator = v\}`; a swimlane usually is not a snapshot, nevertheless it inherits the ordering from :math:`jDag(M)`, so it can be seen as a DAG and a POSET
fr: ou simplement :math:`swimlane(v,M)` est :math:`\{m \in M : m.creator = v\}` ; un swimlane n'est généralement pas un snapshot, néanmoins il hérite de l'ordonnancement de :math:`jDag(M)`, il peut donc être vu comme un DAG et un POSET
tr: veya sadece :math:`swimlane(v,M)` :math:`\{m \in M: m.creator = v\}` olur; bir kulvar genellikle bir anlık görüntü değildir, yine de sıralamayı :math:`jDag(M)` ögesinde devralır, bu yüzden bir DAG ve bir POSET olarak görülebilir.
vi: hoặc chỉ :math:`swimlane(v,M)` là :math:`\{m \in M: m.creator = v\}`; một vùng thường không phải là một ảnh chụp nhanh, tuy nhiên nó kế thừa thứ tự từ :math:`jDag(M)`, vì vậy nó có thể được xem như một DAG và một POSET

source: **tip**
fr: **tip** (pointe)
tr: **ipucu**
vi: **thêm nữa**

source: is a maximal element in :math:`jDag(M)`; of course :math:`jDag(M)` can contain more than one maximal element
fr: est un élément maximal dans :math:`jDag(M)` ; bien sûr, :math:`jDag(M)` peut contenir plus d'un élément maximal
tr: :math:`jDag(M)` içindeki bir en büyük elemandır; tabii ki :math:`jDag(M)` birden fazla en büyük eleman içerebilir
vi: là một phần tử lớn nhất trong :math:`jDag (M)`; tất nhiên :math:`jDag (M)` có thể chứa nhiều hơn một phần tử lớn nhất

source: **validator v is honest in M**
fr: **le validateur v est honnête dans M**
tr: **doğrulayıcı v M ögesinde dürüsttür**
vi: **trình xác thực v là đúng trong M**

source: means :math:`swimlane(v,M)` is empty or it is a nonempty chain; in POSET language in translates to :math:`swimlane(v,M)` being a (possibly empty) linear order
fr: signifie que :math:`swimlane(v,M)` est vide ou que c'est une chaîne non vide ; en langage POSET, cela signifie que :math:`swimlane(v,M)` est un ordre linéaire (éventuellement vide).
tr: :math:`swimlane(v,M)` boş veya boş olmayan bir zincir anlamına gelir; POSET dilinde :math:`swimlane(v,M)` (muhtemelen boş) doğrusal bir düzen olarak çevrilir
vi: có nghĩa là :math:`Swimlane (v, M)` trống hoặc nó là một chuỗi rỗng; trong ngôn ngữ POSET có nghĩa là :math:`swimlane(v,M)` là một thứ tự tuyến tính (có thể trống)

source: **validator v is an equivocator in M**
fr: **validateur v est un equivocator en M**
tr: **doğrulayıcı v M ögesinde çelişkilidir**
vi: ** validator v là một sự không rõ ràng trong M **

source: if :math:`v` is not honest in :math:`M`
fr: si :math:`v` n'est pas honnête dans :math:`M`
tr: :math:`v` mesajı :math:`M` ögesinde doğru değilse
vi: Nếu :math:`v` là không đúng trong :math:`M`

source: **equivocation by v**
fr: **équivoque par v** (equivocation by v)
tr: **v tarafından çelişkili davranış**
vi: **sự không rõ ràng bởi v**

source: is a proof that a validator :math:`v` is not honest; in other words it is a pair of messages :math:`a,b \in M`, both created by :math:`v`, such that :math:`\neg (a < b)` and :math:`\neg (b < a)`
fr: est une preuve qu'un validateur :math:`v` n'est pas honnête ; en d'autres termes, c'est une paire de messages :math:`a,b \in M`, tous deux créés par :math:`v`, tels que :math:`\neg (a < b)` et :math:`\neg (b < a)`
tr: bir :math:`v` doğrulayıcısının dürüst olmadığının bir kanıtıdır; başka bir deyişle, her ikisi de :math:`v` tarafından oluşturulan :math:`a,b \in M` bir çift mesajdır, öyle ki :math:`\neg (a < b)` ve :math:` \neg (b < a)`
vi: là bằng chứng cho thấy trình xác thực :math:`v` không trung thực; nói cách khác, nó là một cặp thông điệp :math:`a,b \in M`, cả hai đều được tạo bởi :math:`v`, sao cho :math:`\neg (a < b)` và :math:`\neg (b < a)`
