Repository: casper-network/docs-archive
Catalog: locale/*/LC_MESSAGES/theory/abstract-consensus.po
Languages: fr, tr, vi

source: **latest message of a validator v in M**
fr: **dernier message d'un validateur v dans M**
tr: **doğrulayıcı v'nin M ögesindeki son mesajı**
vi: **thông điệp cuối cùng của trình xác thực v trong M**

source: is any tip in :math:`swimlane(v,M)`; if :math:`v` is honest in :math:`M` then it has at most one latest message in :math:`M`
fr: est une pointe (tip) quelconque dans :math:`swimlane(v,M)` ; si :math:`v` est honnête dans :math:`M` alors il a au plus un dernier message dans :math:`M`
tr: :math:`swimlane(v,M)` kulvarındaki herhangi bir mesajdır; eğer :math:`v`, :math:`M` içinde dürüstse, o zaman :math:`M` içinde en son bir mesajı vardır
vi: là bất kỳ phần thêm nào nào trong :math:swimlane(v,M)`; nếu :math:`v` là đúng trong :math:`M` thì nó có nhiều nhất một thông điệp mới nhất trong :math:`M`

source: **honest validators in M**
fr: **les validateurs honnêtes dans M**
tr: **M ögesindeki dürüst doğrulayıcılar**
vi: **trình xác thực trung thực trong M**

source: :math:`\{v \in \textit{Validators}: \textit{v is honest in M}\}`
tr: :math:`\{v \in \textit{Validators}: \textit{v M içinde dürüsttür}\}`
vi: :math:`\{v \in \textit{Validators}: \textit{v là đúng trong M}\}`

source: **panorama of M**
fr: **panorama de M**
tr: **M ögesinin panoraması**
vi: **toàn cảnh của M**

source: is a partial function :math:`\textit{panorama(M)}: \textit{Validators} \rightarrow M`, defined for every validator which is honest in M and swimlane(v,M) is nonempty, :math:`panorama(M)(v) = \textit{tip of the swimlane of v}`
fr: est une fonction partielle :math:`\textit{panorama(M)} : \textit{Validators} \rightarrow M`, définie pour chaque validateur qui est honnête dans M et swimlane(v,M) est non vide, :math:`panorama(M)(v) = \textit{tip of the swimlane of v}`
tr: :math:`\textit{panorama(M)}: \textit{Validators} \rightarrow M` kısmi bir işlevdir, M'de dürüst olan her doğrulayıcı için tanımlanır ve swimlane(v,M) boş değildir, :math:`panorama(M)(v) = \textit{v kulvarının ucu}`
vi: là một hàm một phần :math:`\textit{panorama(M)}: \textit{Validators} \rightarrow M`, được định nghĩa cho mọi trình xác thực là trung thực trong M và vùng (v, M) là không trống, :math:`panorama(M)(v) = \textit{phần thêm của vùng của v}`

source: These concepts are illustrated below. Messages are represented with circles. Justifications are represented with arrows. Colors inside a circle represents consensus values.
fr: Ces concepts sont illustrés ci-dessous. Les messages sont représentés par des cercles. Les justifications sont représentées par des flèches. Les couleurs à l'intérieur d'un cercle représentent les valeurs de consensus.
tr: Bu kavramlar aşağıda gösterilmiştir. Mesajlar dairelerle temsil edilir. Gerekçeler oklarla gösterilir. Bir daire içindeki renkler, mutabakat değerlerini temsil eder.
vi: Những khái niệm này được minh họa dưới đây. Thông điệp được thể hiện bằng các vòng tròn. Các biện minh được thể hiện bằng các mũi tên. Màu sắc bên trong một vòng tròn thể hiện các giá trị đồng thuận.

source: Estimator
fr: Estimateur (Estimator)
tr: Tahminci
vi: Công cụ ước tính

source: Upon creation of a new message :math:`m`, a validator must decide which consensus value :math:`m` will vote for. We limit the freedom here by enforcing that the selected consensus value is constrained by the function called **estimator**:
fr: Lors de la création d'un nouveau message :math:`m`, un validateur doit décider pour quelle valeur de consensus :math:`m` va voter. Nous limitons ici la liberté en imposant que la valeur de consensus sélectionnée soit contrainte par la fonction appelée **estimator** :
tr: Yeni bir :math:`m` mesajı oluşturulduktan sonra, bir doğrulayıcı hangi :math:`m` mutabakat değerine oy vereceğine karar vermelidir. Buradaki özgürlüğü, seçilen mutabakat değerinin **tahminci** adlı işlev tarafından sınırlandırılmasını zorunlu kılarak sınırlandırıyoruz:
vi: Khi tạo một thông báo mới :math:`m`, trình xác thực phải quyết định giá trị đồng thuận nào :math:`m` sẽ bỏ phiếu cho. Chúng tôi giới hạn quyền tự do ở đây bằng cách thực thi rằng giá trị đồng thuận đã chọn bị hạn chế bởi hàm có tên **estimator**:

source: For any message :math:`m` we say **estimated vote for m** for :math:`\textit{estimator}(jPast(m))`.
fr: Pour tout message :math:`m`, on dit **vote estimée pour m** pour :math:`\textit{estimator}(jPast(m))`.
tr: Herhangi bir :math:`m` mesajı için :math:`\textit{tahminatör}(jPast(m))` için **m için tahmini oy** deriz.
vi: Đối với bất kỳ thông điệp nào :math:`m` chúng tôi nói **phiếu bầu ước tính cho m** cho :math:`\textit{estimator}(jPast(m))`.

source: We enforce the votes by the following rule:
fr: Nous appliquons les votes par la règle suivante :
tr: Oyları aşağıdaki kurala göre uygularız:
vi: Chúng tôi thực hiện các phiếu bầu theo quy tắc sau:

source: if estimated vote for :math:`m` is not None then must vote for the estimated vote
fr: si le vote estimé pour :math:`m` n'est pas None, alors il faut voter pour le vote estimé
tr: Eğer :math:`m` için tahmini oy None değilse, o zaman tahmini oy için oy kullanmalıdır
vi: nếu phiếu bầu ước tính cho :math:`m` không là None thì phải bỏ phiếu cho phiếu bầu ước tính

source: otherwise, :math:`m` is allowed to vote for any value in :math:`Con`
fr: sinon, :math:`m` est autorisé à voter pour n'importe quelle valeur de :math:`Con`.
tr: aksi halde, :math:`m`, :math:`Con` içindeki herhangi bir değer için oy kullanabilir
vi: nếu không, :math:`m` được phép bỏ phiếu cho bất kỳ giá trị nào trong :math:`Con`

source: Let us consider any snapshot :math:`M`. The way :math:`estimator(M)` is calculated goes as follows:
fr: Considérons un snapshot :math:`M` quelconque. La façon dont :math:`estimator(M)` est calculé est la suivante :
tr: Herhangi bir :math:`M` anlık görüntüsünü ele alalım. :math:`estimator(M)` şu şekilde hesaplanır:
vi: Chúng ta hãy xem xét bất kỳ ảnh chụp nhanh nào :math:`M`. Cách :math:`estimator(M)` được tính như sau:

source: Take the collection :math:`H` of all honest validators in :math:`M`.
fr: Prenez la collection :math:`H` de tous les validateurs honnêtes dans :math:`M`.
tr: :math:`M` ögesindeki tüm dürüst doğrulayıcıların :math:`H` koleksiyonunu al.
vi: Lấy bộ sưu tập :math:`H` của tất cả các trình xác thực trung thực trong :math:`M`.

source: Restrict :math:`H` to collection of validators that created at least one message with non-empty vote - :math:`H'`
fr: Restreindre :math:`H` à la collection de validateurs qui ont créé au moins un message avec un vote non vide - :math:`H'`.
tr: :math:`H` öğesini, boş oyu olmayan en az bir mesaj oluşturan doğrulayıcılar koleksiyonuyla sınırlayın - :math:`H'`
vi: Hạn chế :math:`H` đối với tập hợp các trình xác thực đã tạo ít nhất một thông báo với phiếu không trống - :math:`H'`

source: If :math:`H'` is empty - return :math:`None`, otherwise - continue calculation.
fr: Si :math:`H'` est vide - retournez :math:`None`, sinon - continuez le calcul.
tr: Eğer :math:`H'` boş ise - :math:`None` döndürür, aksi halde - hesaplama devam eder.
vi: Nếu :math:`H'` trống - trả lại :math:`None`, nếu không - tiếp tục tính toán.

source: For every validator in :math:`H'` - find its latest message with non-empty vote.
fr: Pour chaque validateur dans :math:`H'` - trouver le dernier message avec un vote non vide.
tr: :math:`H'` içindeki her doğrulayıcı için - boş olmayan oya sahip en son mesajını bulun.
vi: Đối với mọi trình xác thực trong :math:`H'` - tìm thông điệp mới nhất của nó với phiếu bầu không trống.

source: Sum latest messages by weight; this will end up with a mapping :math:`\textit{totalVotes}: Con \to Int`, for every consensus value :math:`c` it returns the sum of weights of validators voting for :math:`c`.
fr: Additionnez les derniers messages par poids ; cela aboutira à une map :math:`\textit{totalVotes} : Con \to Int`, pour chaque valeur de consensus :math:`c` elle retourne la somme des poids des validateurs votant pour :math:`c`.
tr: En son mesajları ağırlığa göre toplayın; bu, bir :math:`\textit{totalVotes}: Con \to Int` eşleme ile sonuçlanacaktır, her mutabakat değeri :math:`c` için, :math:`c` için oy veren doğrulayıcıların ağırlıklarının toplamını döndürür.
vi: Tổng số tin nhắn mới nhất theo trọng số; điều này sẽ kết thúc bằng một ánh xạ :math:`\textit{totalVotes}: Con \to Int`, đối với mọi giá trị đồng thuận :math:`c`. nó trả về tổng trọng số của các trình xác thực bỏ phiếu cho :math:`c`.

source: Find all points :math:`c \in Con` such that :math:`\textit{totalVotes}` has maximum value at :math:`c`.
fr: Trouvez tous les points :math:`c \in Con` tels que :math:`\textit{totalVotes}` a une valeur maximale à : math:`c`.
tr: :math:`\textit{totalVotes}` :math:`c` değerinde en yüksek değere sahip olacak şekilde tüm :math:`c \in Con` noktalarını bulun.
vi: Tìm tất cả các điểm :math:`c \in Con` sao cho :math:`\textit{totalVotes}` có giá trị lớn nhất tại :math:`c`.

source: From elements found in the previous step pick maximum element :math:`cmax \in Con`. This is where we use the fact that :math:`Con` is finite and totally ordered.
fr: Parmi les éléments trouvés à l'étape précédente, choisissez l'élément maximum :math:`cmax \in Con`. C'est ici que nous utilisons le fait que :math:`Con` est finie et totalement ordonnée.
tr: Önceki adımda bulunan elemanlardan maksimum :math:`cmax \in Con` elemanını seçin. Burada :math:`Con` değerinin sonlu ve tamamen düzenli olduğu gerçeğini kullanıyoruz.
vi: Từ các phần tử được tìm thấy ở bước trước, hãy chọn phần tử tối đa :math:`cmax \in Con`. Đây là nơi chúng ta sử dụng thực tế rằng :math:`Con` là hữu hạn và hoàn toàn có thứ tự.

source: The result of the estimator is :math:`cmax`.
fr: Le résultat de l'estimateur (estimator) est :math:`cmax`.
tr: Tahmincinin sonucu :math:`cmax`.
vi: Kết quả của bộ ước tính là :math:`cmax`.

source: Validity conditions
fr: Conditions de validité
tr: Geçerlilik koşulları
vi: Điều kiện hợp lệ

source: On reception of a message, every validator must check certain conditions. Messages not compliant with these conditions are considered invalid and hence ignored.
fr: À la réception d'un message, chaque validateur doit vérifier certaines conditions. Les messages qui ne respectent pas ces conditions sont considérés comme non valides et donc ignorés.
tr: Bir mesaj alındığında, her doğrulayıcı belirli koşulları kontrol etmelidir. Bu koşullara uymayan mesajlar geçersiz kabul edilir ve bu nedenle yok sayılır.
vi: Khi nhận được một thông điệp, mọi trình xác thực phải kiểm tra các điều kiện nhất định. Thông điệp không tuân thủ các điều kiện này được coi là không hợp lệ và do đó bị bỏ qua.

source: Formal validation is:
fr: La validation formelle est :
tr: Resmi doğrulama:
vi: Xác thực chính thức là:

source: message must be correctly structured, following the transport (= binary) representation
fr: le message doit être correctement structuré, suivant la représentation de transport (= binaire)
tr: mesaj, aktarım (= binary) gösterimini takip ederek doğru şekilde yapılandırılmalıdır.
vi: thông điệp phải được cấu trúc chính xác, tuân theo biểu diễn truyền tải (= nhị phân)

source: checking of the cryptographic signature of message creator
fr: vérification de la signature cryptographique du créateur du message
tr: mesaj oluşturucunun kriptografik imzasının kontrolü
vi: kiểm tra chữ ký mật mã của người tạo thông điệp

source: Semantic validation is:
fr: La validation sémantique est :
tr: Semantik doğrulama:
vi: Xác thực ngữ nghĩa là:

source: consensus value :math:`m.vote` must be compliant with applying the estimator to :math:`jPast(m)`
fr: la valeur du consensus :math:`m.vote` doit être conforme à l'application de l'estimateur à :math:`jPast(m)`
tr: mutabakat değeri :math:`m.vote` tahmincinin :math:`jPast(m)` ögesine uygulanması ile uyumlu olmalıdır
vi: giá trị đồng thuận :math:`m.vote` phải tuân thủ với việc áp dụng công cụ ước tính cho :math:`jPast(m)``

source: justifications :math:`m.justifications` must reference messages belonging to distinct swimlanes, i.e. if :math:`j_1`, :math:`j_2` are two justifications in :math:`m`, then :math:`creator(j_1) \ne creator(j_2)`
fr: les justifications :math:`m.justifications` doivent faire référence à des messages appartenant à des swimlanes distincts, c'est-à-dire que si :math:`j_1`, :math:`j_2` sont deux justifications dans :math:`m`, alors :math:`creator(j_1) \ne creator(j_2)`
tr: gerekçeler :math:`m.justifications` farklı kulvarlara ait mesajlara atıfta bulunmalıdır, yani :math:`j_1`, :math:`j_2`, :math:`m` içinde iki gerekçe ise, :math:`creator(j_1) \ne creator(j_2)`
vi: biện minh :math:`m.justifications` phải tham chiếu đến các thông báo thuộc các đường bơi riêng biệt, tức là nếu :math:`j_1`, :math:`j_2` là hai biện minh trong :math:`m`, thì :math:`creator(j_1) \ne creator(j_2)`

source: We explain the concept of "estimator" later in this chapter.
fr: Nous expliquons le concept d'"estimateur" (estimator) plus loin dans ce chapitre.
tr: "Tahminci" kavramını bu bölümün ilerleyen kısımlarında açıklayacağız.
vi: Chúng tôi giải thích khái niệm "công cụ ước lượng" ở phần sau của chương này.

source: Operation of a validator
fr: Fonctionnement d'un validateur
tr: Bir doğrulayıcının çalışması
vi: Hoạt động của trình xác thực

source: A validator continuously runs two activities:
fr: Un validateur exécute en permanence deux activités :
tr: Bir doğrulayıcı sürekli olarak iki etkinlik yürütür:
vi: Trình xác thực liên tục chạy hai hoạt động:

source: **listening loop** - handling messages arriving from the network
fr: **boucle d'écoute** (listening loop) - traitement des messages arrivant du réseau
tr: **dinleme döngüsü** - ağdan gelen mesajları işleme
vi: **vòng lặp lắng nghe** - xử lý các tin nhắn đến từ mạng

source: **publishing loop** - creating and broadcasting new messages
fr: **boucle de publication** (publishing loop) - création et diffusion de nouveaux messages
tr: **yayınlama döngüsü** - yeni mesajlar oluşturma ve yayınlama
vi: **vòng lặp xuất bản** - tạo và phát tin nhắn mới

source: **Listening loop**
fr: **Boucle d'écoute**
tr: **Dinleme döngüsü**
vi: **Vòng lặp nghe**

source: When a message :math:`m` arrived:
fr: Quand un message :math:`m` est arrivé :
tr: Bir mesaj :math:`m` ulaştığında:
vi: Khi một thông báo :math:`m` đến:

source: Formal validation of :math:`m` is performed.
fr: La validation formelle de :math:`m` est effectuée.
tr: :math:`m` mesajının resmi doğrulaması gerçekleştirilir.
vi: Xác thực chính thức của :math:`m` được thực hiện.

source: If :math:`textit{m.justifications}` are already present in the local representation of j-dag then:
fr: Si :math:`textit{m.justifications}` sont déjà présents dans la représentation locale de j-dag alors :
tr: j-dag'ın yerel temsilinde :math:`textit{m.justifications}` zaten varsa:
vi: Nếu :math:`textit{m.justifications}` đã có mặt trong biểu diễn cục bộ của j-dag thì:

source: semantic validation of :math:`m` is performed
fr: la validation sémantique de :math:`m` est effectuée
tr: :math:`m` mesajının semantik doğrulaması gerçekleştirilir
vi: xác thực ngữ nghĩa của :math:`m` được thực hiện

source: :math:`m` is added to the j-dag
fr: :math:`m` est ajouté au j-dag
tr: :math:`m` mesajı j-dag'a eklenir
vi: :math:`m` được thêm vào j-dag

source: otherwise:
fr: sinon:
tr: aksi halde:
vi: nếu không thì:

source: :math:`m` is added to the messages buffer, where it waits until all justifications it references are present in the j-dag
fr: :math:`m` est ajouté au buffer des messages, où il attend que toutes les justifications auxquelles il fait référence soient présentes dans le j-dag
tr: :math:`m` mesaj arabelleğine eklenir, burada atıfta bulunduğu tüm gerekçeler j-dag'da bulunana kadar bekler
vi: :math:`m`được thêm vào bộ đệm tin nhắn, nơi nó đợi cho đến khi tất cả các biện minh mà nó tham chiếu có trong j-dag

source: On every message added to the local j-dag:
fr: Sur chaque message ajouté au j-dag local :
tr: Yerel j-dag'a eklenen her mesajda:
vi: Trên mỗi tin nhắn được thêm vào j-dag cục bộ:

source: Messages buffer is checked for messages that have now all justifications present in the j-dag and so can be removed from the buffer.
fr: Le buffer de messages est vérifié pour les messages qui ont maintenant toutes les justifications présentes dans le j-dag et qui peuvent donc être retirés du buffer.
tr: Mesaj arabelleği, artık tüm gerekçeleri j-dag'da bulunan ve bu nedenle arabellekten kaldırılabilen mesajlar için kontrol edilir.
vi: Bộ đệm thông điệp được kiểm tra đối với các thông điệp mà hiện có biện minh trong j-dag và do đó có thể được xóa khỏi bộ đệm.

source: Finality detector analyzes local j-dag to check if the consensus has already been reached.
fr: Le détecteur de finalité (Finality detector) analyse le j-dag local pour vérifier si le consensus a déjà été atteint.
tr: Kesinlik algılayıcı, mutabakat sağlanıp sağlanmadığını kontrol etmek için yerel j-dag'ı analiz eder.
vi: Bộ dò trạng thái cuối cùng đang phân tích j-dag cục bộ để kiểm tra xem đã đạt được sự đồng thuận chưa.

source: **Publishing loop**
fr: **Boucle de publication** (Publishing loop)
tr: **Yayınlama döngüsü**
vi: **Vòng lặp xuất bản**

source: We do not determine when exactly a validator decides to create and broadcast a new message. This is pluggable part of ACC. As soon as a validator, following its publishing strategy, decides to publish a message, it builds a new message with:
fr: Nous ne déterminons pas quand exactement un validateur décide de créer et de diffuser un nouveau message. Il s'agit d'une partie pluggable de l'ACC. Dès qu'un validateur, suivant sa stratégie de publication, décide de publier un message, il construit un nouveau message avec :
tr: Doğrulayıcının yeni bir mesaj oluşturmaya ve yayınlamaya tam olarak ne zaman karar vereceğini belirlemeyiz. Bu, ACC'nin takılabilir parçasıdır. Doğrulayıcı, yayınlama stratejisini izleyerek bir mesaj yayınlamaya karar verir vermez, aşağıdakilerle yeni bir mesaj oluşturur:
vi: Chúng tôi không xác định chính xác thời điểm trình xác thực quyết định tạo và phát một thông điệp mới. Đây là phần có thể gắn thêm được của ACC. Ngay sau khi trình xác thực tuân theo chiến lược xuất bản, quyết định xuất bản một thông điệp, nó sẽ xây dựng một thông điệp mới với:

source: justifications set to tips of all swimlanes, according to local j-dag; in case of equivocators, i.e. when the corresponding swimlane has more than one tip - validator picks just one tip (any)
fr: les justifications sont fixées aux pointes (tips) de tous les swimlanes, selon le j-dag local ; en cas d'équivoque, c'est-à-dire quand le swimlane correspondant a plus d'une pointe - le validateur choisit une seule pointe (n'importe laquelle)
tr: yerel j-dag'a göre tüm kulvarların uçlarına ayarlanmış gerekçeler; şüpheli durumda, yani ilgili kulvarda birden fazla ipucu olduğunda - doğrulayıcı sadece bir ipucu (herhangi birini) seçer
vi: sự biện minh được đặt thành phần thêm của tất cả các vùng, theo j-dag địa phương; trong trường hợp có phần không rõ ràng, tức là khi vùng tương ứng có nhiều hơn một đầu - trình xác nhận chỉ chọn một đầu (bất kỳ)

source: consensus value determined by estimator, as applied to the justifications
fr: valeur de consensus déterminée par l'estimateur, appliquée aux justifications
tr: gerekçelere uygulandığı şekliyle, tahminci tarafından belirlenen mutabakat değeri
vi: giá trị đồng thuận được xác định bởi công cụ ước tính, như được áp dụng cho các biện minh

source: The concept of finality
fr: Le concept de finalité
tr: Kesinlik kavramı
vi: Khái niệm về tính cuối cùng

source: When the consensus is reached
fr: Lorsque le consensus est atteint
tr: Mutabakata varıldığında
vi: Khi đạt được sự đồng thuận

source: A validator :math:`v` constantly analyzes its local j-dag to observe a value :math:`c \in Con` becoming "locked" in the following sense:
fr: Un validateur :math:`v` analyse constamment son j-dag local pour observer une valeur :math:`c \in Con` devenir "verrouillée" dans le sens suivant :
tr: Bir doğrulayıcı :math:`v`, aşağıdaki anlamda "kilitli" hale gelen bir :math:`c \in Con` değerini gözlemlemek için yerel j-dag'ını sürekli olarak analiz eder:
vi: Trình xác thực :math:`v` liên tục phân tích j-dag cục bộ của nó để quan sát một giá trị :math:`c \in Con` trở thành "bị khóa" theo ý nghĩa sau:

source: from now on, the estimator applied to local j-dag tips will always return :math:`c`
fr: Désormais, l'estimateur (estimator) appliqué aux pointes locales de j-dag retournera toujours :math:`c`.
tr: bundan sonra, yerel j-dag ipuçlarına uygulanan tahminci her zaman :math:`c` değerini döndürecektir.
vi: kể từ bây giờ, công cụ ước tính được áp dụng cho các phần thêm j-dag cục bộ sẽ luôn trả về :math:`c`

source: the same phenomenon is guaranteed to happen also for other validators (eventually)
fr: le même phénomène est garanti pour d'autres validateurs (éventuellement).
tr: aynı olgunun diğer doğrulayıcılar için de gerçekleşmesi garanti edilir (neticede)
vi: hiện tượng tương tự cũng được đảm bảo sẽ xảy ra đối với các trình xác thực khác (cuối cùng)

source: If such locking happens, we say that **consensus value c is now finalized**, i.e. the consensus was reached with value :math:`c \in Con` being the winner.
fr: Si un tel verrouillage se produit, nous disons que **la valeur du consensus c est maintenant finalisée**, c'est-à-dire que le consensus a été atteint et que la valeur :math:`c \in Con` est la gagnante.
tr: Böyle bir kilitleme gerçekleşirse, **mutabakat değeri c'nin artık kesinleştiğini**, yani :math:`c \in Con' değerinin kazanan olduğu konusunda mutabakata varıldığını söyleriz.
vi: Nếu việc khóa như vậy xảy ra, chúng tôi nói rằng **giá trị đồng thuận c hiện đã được hoàn tất**, tức là đã đạt được sự đồng thuận với giá trị :math:`c \in Con` đã thành công.

source: Malicious validators
fr: Validateurs malveillants
tr: Kötü amaçlı doğrulayıcılar
vi: Trình xác thực độc hại

source: In general - malicious validators can stop consensus from happening. We need to adjust the concept of finalization so to account for this problem.
fr: En général - les validateurs malveillants peuvent empêcher le consensus de se produire. Nous devons ajuster le concept de finalisation afin de tenir compte de ce problème.
tr: Genel olarak - kötü niyetli doğrulayıcılar mutabakatın gerçekleşmesini engelleyebilir. Bu sorunu hesaba katmak için kesinleştirme kavramını ayarlamamız gerekiyor.
vi: Nói chung - trình xác nhận độc hại có thể ngăn chặn sự đồng thuận xảy ra. Chúng ta cần điều chỉnh khái niệm để giải quyết vấn đề này.

source: There are 4 ways a validator can expose malicious behaviour:
fr: Un validateur peut exposer un comportement malveillant de 4 manières différentes :
tr: Bir doğrulayıcının kötü niyetli davranışı ortaya çıkarabilmesinin 4 yolu vardır:
vi: Có 4 cách trình xác thực có thể vạch chỉ ra vi độc hại:

source: Be silent (= stop producing messages)
fr: Se taire (= cesser de produire des messages)
tr: Sessiz olmak (= mesaj üretmeyi bırakır)
vi: Im lặng (= ngừng tạo thông điệp)

source: Produce malformed messages.
fr: Produire des messages malformés.
tr: Hatalı biçimlendirilmiş mesajlar üretir.
vi: Tạo thông điệp không đúng định dạng.

source: Violate the condition that a message must vote on a value derived from justifications via the estimator.
fr: Violer la condition selon laquelle un message doit voter sur une valeur dérivée des justifications via l'estimateur.
tr: Bir mesajın, tahminci aracılığıyla gerekçelerden türetilen bir değere oy vermesi koşulunu ihlal eder.
vi: Vi phạm điều kiện rằng một thông điệp phải bỏ phiếu cho một giá trị có được từ các biện minh thông qua công cụ ước tính.

source: Equivocate.
fr: Equivoquer
tr: Çelişkili davranır.
vi: Sự không rõ ràng
