Repository: casper-network/docs-archive
Catalog: locale/*/LC_MESSAGES/theory/highway.po
Languages: fr, tr, vi

source: So, effectively, rounds live in sort of parallel worlds (“lanes of the highway”), where all validators with same round exponent :math:`n` have the same schedule of rounds. On the other hand, if we compare two validators, **Alice** and **Bob**, **Alice** using round exponent :math:`n`, **Bob** using round exponent :math:`m`, and assuming :math:`n < m`, then:
fr: Ainsi, en réalité, les tours vivent dans une sorte de mondes parallèles ("voies de l'autoroute"), où tous les validateurs ayant le même *round exponent* :math:`n` ont le même calendrier de tours. D'un autre côté, si nous comparons deux validateurs, **Alice** et **Bob**, **Alice** utilisant le 'round exponent' :math:`n`, **Bob** utilisant le 'round exponent' :math:`m`, et en supposant que :math:`n < m`, alors :
tr: Bu nedenle, turlar, aynı tur üssü :math:`n` 'ye sahip tüm doğrulayıcıların aynı tur programına sahip olduğu bir tür paralel dünyalarda (“otoyolun şeritleri”) yaşar. Diğer taraftan iki doğrulayıcı **Alice** ve **Bob**\ 'u karşılaştırırsak, **Alice**\ 'in tur üzeri :math:`n`, **Bob**\ 'un tur üzeri :math:`m` kullandığını ve :math:`n < m` olduğunu varsayalım;
vi: Vì vậy, một cách hiệu quả, các vòng hoạt động trong một loại thế giới song song (“làn đường của đường cao tốc”), nơi tất cả các nhà xác thực có cùng số mũ vòng :math:`n` có cùng lịch trình của các vòng. Mặt khác, nếu chúng ta so sánh hai trình xác thực, **Alice** và **Bob**, **Alice** sử dụng số mũ tròn :math:`n`, **Bob** sử dụng số mũ tròn :math:`m` và giả sử :math:`n < m`, thì:

source: **Alice** is :math:`2^{m-n}` faster than **Bob**
fr: **Alice** est :math:`2^{m-n}` plus rapide que **Bob**
tr: **Alice**, **Bob**\ 'tan :math:`2^{m-n}` daha hızlıdır
vi: **Alice** là :math:`2^{m-n}` nhanh hơn **Bob**

source: **Alice** participates in all rounds that **Bob** knows about
fr: **Alice** participe à tous les tours que **Bob** connaît.
tr: **Alice**, **Bob**\ 'un bildiği tüm turlara katılıyor
vi: **Alice** tham gia tất cả các vòng mà **Bob** biết

source: **Bob** participates only in some rounds that **Alice** knows about - once
fr: **Bob** ne participe qu'à certains tours dont **Alice** est au courant - une fois.
tr: **Bob** yalnızca **Alice**\ 'in bildiği bazı turlara katılır - bir kez
vi: **Bob** chỉ tham gia một số vòng mà **Alice** biết - một lần

source: every :math:`2^{m-n}` **Alice**\ ’s rounds
fr: chaque :math:`2^{m-n}` tours d' **Alice**
tr: her :math:`2^{m-n}` **Alice**\ 'in turudur
vi: mỗi :math:`2^{m-n}` vòng của **Alice**

source: A round is identified by the tick at which it starts. Of course validators with different round exponents will differ in perspective on the length of this round.
fr: Un tour est identifié par le tic auquel il commence. Bien entendu, les validateurs ayant des 'round exponents' différents auront des points de vue différents sur la durée de ce tour.
tr: Bir tur, başladığı tik ile tanımlanır. Elbette, farklı tur üslerine sahip doğrulayıcılar, bu turun uzunluğuna ilişkin perspektif açısından farklılık gösterecektir.
vi: Một vòng được xác định bằng đánh dấu mà nó bắt đầu. Tất nhiên các nhà xác thực có số mũ của vòng khác nhau sẽ khác nhau về quan điểm độ dài của vòng này.

source: **Example:** Alice has round exponent 5. Bob has round exponent 7. So, in Alice’s world, rounds have length 32 ticks, while in Bob’s world rounds have length 128 ticks. Timepoint 2019-09-13T13:13:13.088Z corresponds with tick 1568380393088 and is the beginning of a round for both Alice and Bob. But, in Alice’s world, this round will only last for 32 milliseconds, while for Bob this round will last for 128 milliseconds.
fr: **Exemple:** Alice a un 'round exponent' de 5. Bob a un 'round exponent' de 7. Ainsi, dans le monde d'Alice, les tours ont une longueur de 32 ticks, tandis que dans le monde de Bob, les tours ont une longueur de 128 ticks. Le point temporel 2019-09-13T13:13:13.088Z correspond au tic-tac 1568380393088 et constitue le début d'un tour pour Alice et Bob. Mais, dans le monde d'Alice, ce tour ne durera que 32 millisecondes, alors que pour Bob, il durera 128 millisecondes.
tr: **Örnek:** Alice'in tur üssü 5'tir. Bob'un tur üssü 7'dir. Yani, Alice'in dünyasında, turların uzunluğu 32 tike sahipken, Bob'un dünyasında turların uzunluğu 128 tike sahiptir. Zaman noktası 2019-09-13T13:13:13.088Z, 1568380393088 tikine karşılık gelir ve hem Alice hem de Bob için bir turun başlangıcıdır. Ancak Alice'in dünyasında bu tur yalnızca 32 milisaniye sürerken, Bob için bu tur 128 milisaniye sürer.
vi: **Ví dụ:** Alice có số mũ tròn 5. Bob có số mũ tròn 7. Vì vậy, trong thế giới của Alice, các vòng có chiều dài 32 dấu, trong khi trong vòng thế giới của Bob có chiều dài 128 dấu. Thời điểm 2019-09-13T13: 13: 13.088Z tương ứng với đánh dấu 1568380393088 và là thời điểm bắt đầu một vòng cho cả Alice và Bob. Tuy nhiên, trong thế giới của Alice, vòng này sẽ chỉ kéo dài 32 mili giây, trong khi đối với Bob, vòng này sẽ kéo dài 128 mili giây.

source: Validator operation
fr: Opération du validateur
tr: Doğrulayıcı işlemi
vi: Hoạt động của nhà xác thực

source: Contrary to NCB, the way ballots are used in Highway is more sophisticated.
fr: Contrairement à NCB, la manière dont les scrutins (ballots) sont utilisés dans l'autoroute est plus sophistiquée.
tr: NCB'nin tersine, Highway'de oy pusulalarının kullanılma şekli daha karmaşıktır.
vi: Trái ngược với NCB, cách thức sử dụng phiếu bầu ở Highway phức tạp hơn.

source: In NCB a validator only produces ballots to continue participation in **b-game** after doing unbonding. In Highway, only the round leader is allowed to produce blocks. So if I am not the leader of current round, I am going to produce only ballots.
fr: Dans NCB, un validateur ne produit des blocs que pour continuer à participer au **b-game** après avoir effectué le 'unbonding'. Dans Highway, seul le leader du tour est autorisé à produire des blocs. Donc, si je ne suis pas le leader du tour actuel, je vais produire uniquement des scrutins.
tr: NCB'de bir doğrulayıcı, yalnızca bağları çözdükten sonra **b-oyununa** katılmaya devam etmek için oy pusulaları üretir. Highway'de, sadece tur liderinin blok üretmesine izin verilir. Bu nedenle, eğer mevcut turda lider olmazsam, sadece oy pusulası üreteceğim.
vi: Trái ngược với NCB, cách thức sử dụng phiếu bầu ở Highway phức tạp hơn.

source: In details, local state and operation of a validator is similar to NCB. The only difference is that we impose very precise rules on when and how to create new messages.
fr: Dans le détail, l'état local et le fonctionnement d'un validateur sont similaires à ceux de la BCN. La seule différence est que nous imposons des règles très précises sur quand et comment créer de nouveaux messages.
tr: Ayrıntılarda, bir doğrulayıcının yerel durumu ve çalışması NCB'ye benzer. Tek fark, yeni mesajların ne zaman ve nasıl oluşturulacağına dair çok kesin kurallar koymamızdır.
vi: Về chi tiết, trạng thái cục bộ và hoạt động của nhà xác thực tương tự như NCB. Sự khác biệt duy nhất là chúng tôi áp đặt các quy tắc rất chính xác về thời điểm và cách thức tạo thông điệp mới.

source: Rule 1: ignore rounds you cannot see
fr: Règle 1 : ignorez les tours que vous ne pouvez pas voir
tr: Kural 1: göremediğiniz turları görmezden gelin
vi: Quy tắc 1: Bỏ qua các vòng bạn không thể nhìn thấy

source: I operate as if the world is simple and everybody uses the same round exponent as I am using. Which means that I completely ignore the existence of rounds starting at ticks not divisible by :math:`2^n`, where :math:`n` is my round exponent.
fr: Je fonctionne comme si le monde était simple et que tout le monde utilisait le même 'round exponent' que moi. Ce qui signifie que j'ignore complètement l'existence de tours commençant à des tics non divisibles par :math:`2^n`, où :math:`n` est mon 'round exponent'.
tr: Sanki dünya basitmiş gibi çalışıyorum ve herkes benim kullandığım tur üssü kullanıyor. Bu, :math:`2^n` ile bölünemeyen tiklerden başlayan turların varlığını tamamen görmezden geldiğim anlamına geliyor, burada :math:`n` benim tur üssüm.
vi: Tôi vận hành như thể thế giới đơn giản và mọi người đều sử dụng số mũ tròn giống như tôi đang sử dụng. Có nghĩa là tôi hoàn toàn bỏ qua sự tồn tại của các vòng bắt đầu với đánh dấu không chia hết cho :math:`2^n`, trong đó :math:`n` là số mũ tròn của tôi.

source: Rule 2: follow the leader sequence
fr: Règle 2 : suivre la séquence du leader
tr: Kural 2: lider sırasını takip edin
vi: Quy tắc 2: tuân theo trình tự của người lãnh đạo

source: For every round I use the leader's pseudorandom sequence to figure out the id
fr: Pour chaque tour, j'utilise la séquence pseudo aléatoire du leader pour déterminer l'id.
tr: Her tur için, kimliği bulmak maksadıyla liderin sözde rastgele sırasını kullanıyorum,
vi: Đối với mỗi vòng, tôi sử dụng chuỗi định trước của người lãnh đạo để tìm ra id

source: of a validator which is the leader of this round.
fr: d'un validateur qui est le leader de ce tour.
tr: bu turun lideri olan bir doğrulayıcının.
vi: của nhà xác thực là người dẫn đầu của vòng này.

source: Rule 3: lambda message
fr: Règle 3 : message lambda
tr: Kural 3: lambda mesajı
vi: Quy tắc 3: Thông điệp lambda

source: If I am the leader of current round, I produce new block :math:`b`, using all
fr: Si je suis le leader de la tour en cours, je produis un nouveau bloc :math:`b`, en utilisant tous
tr: Mevcut turun lideriysem, yerel j-dag'ımın tüm ipuçlarını :math:`b`\ 'nin gerekçeleri olarak kullanarak
vi: Nếu tôi là người dẫn đầu của vòng hiện tại, tôi tạo ra khối mới :math:`b`, sử dụng tất cả

source: tips of my local j-dag as justifications of :math:`b`. Then I broadcast
fr: des pointes de mon j-dag local comme justifications de :math:`b`. Ensuite, je diffuse
tr: yeni :math:`b` bloğu üretirim. Sonra
vi: mẹo của j-dag địa phương của tôi như là lời biện minh của :math:`b`. Sau đó, tôi gửi

source: :math:`b` to all validators.
fr: :math:`b` à tous les validateurs.
tr: :math:`b`\ 'yi tüm doğrulayıcılara yayınlarım.
vi: :math:`b` cho tất cả các nhà xác thực.

source: We call this message **the lambda message**. There is only one lambda message
fr: Nous appelons ce message **le message lambda** (the lambda message). Il n'existe qu'un seul message lambda
tr: Bu mesaja lambda mesajı diyoruz. Her turda sadece bir lambda mesajı
vi: Chúng tôi gọi thông điệp này là **thông điệp lambda**. Chỉ có một thông điệp lambda

source: in every round. Every block :math:`b` is a lambda message of some round, namely round :math:`b.round\_id`.
fr: dans chaque tour. Chaque bloc :math:`b` est un message lambda d'un certain tour, à savoir le tour :math:`b.round\_id`.
tr: vardır. Her blok :math:`b`, bir turun lambda mesajıdır, yani tur :math:`b.round\_id`.
vi: trong mỗi vòng. Mọi khối :math:`b` là một thông báo lambda của một số vòng, cụ thể là vòng :math:`b.round\_id`.

source: Rule 4: lambda response message
fr: Règle 4 : message de réponse lambda
tr: Kural 4: lambda yanıt mesajı
vi: Quy tắc 4: Thông điệp phản hồi lambda

source: If I am not the leader of the current round, I set up a handler for receiving the lambda message from this round’s leader. This handler waits for the lambda message but only up to the end of the current round. If the lambda message arrives before the end of the current round, I create a ballot taking as its justifications only the lambda message and my last message (if I have one).
fr: Si je ne suis pas le leader de la tour actuelle, je mets en place un gestionnaire pour recevoir le message lambda du leader de ce tour. Ce gestionnaire attend le message lambda mais seulement jusqu'à la fin du tour actuel. Si le message lambda arrive avant la fin du tour en cours, je crée un bulletin de vote (ballot) en prenant comme justifications uniquement le message lambda et mon dernier message (si j'en ai un).
tr: Mevcut turun lideri değilsem, bu turun liderinden lambda mesajını almak için bir işleyici kurarım. Bu işleyici yalnızca mevcut turun sonuna kadar lambda mesajını bekler. Eğer lambda mesajı mevcut tur bitmeden gelirse, gerekçesi olarak sadece lambda mesajını ve (eğer varsa) son mesajımı alarak bir oy pusulası oluştururum.
vi: Nếu tôi không phải là người dẫn đầu của vòng hiện tại, tôi đã thiết lập một trình xử lý để nhận thông điệp lambda từ người đứng đầu của vòng này. Trình xử lý này chờ thông điệp lambda nhưng chỉ đến cuối vòng hiện tại. Nếu thông điệp lambda đến trước khi kết thúc vòng hiện tại, tôi sẽ tạo một lá phiếu lấy lý do chỉ là thông điệp lambda và thông điệp cuối cùng của tôi (nếu tôi có).

source: Rule 5: omega message
fr: Règle 5 : message oméga
tr: Kural 5: omega mesajı
vi: Quy tắc 5: Thông điệp omega

source: Let :math:`j` be the id of current round. At tick :math:`j + omega\_delay \cdot 2^n` I create a ballot :math:`b` using all tips of my local j-dag as justifications of :math:`b`.
fr: Soit :math:`j` l'id du tour actuel. Au tic :math:`j + omega\_delay \cdot 2^n` je crée un bulletin de vote :math:`b` en utilisant toutes les pointes de mon j-dag local comme justifications de :math:`b`.
tr: Mevcut turun kimliği:math:`j` olsun. :math:`j + omega\_delay \cdot 2^n`\ 'de :math:`b`\ 'nin gerekçeleri olarak yerel j-dag'ımın tüm ipuçlarını kullanarak bir :math:`b` oy pusulası oluşturdum.
vi: Đặt :math:`j` là id của vòng hiện tại. Khi đánh dấu vào :math:`j + omega\_delay \cdot 2^n` Tôi tạo một lá phiếu :math:`b` bằng cách sử dụng tất cả các mẹo của j-dag cục bộ của tôi để biện minh cho :math:`b`.

source: :math:`omega\_delay \in(0,1)` is a blockchain parameter - to be picked by simulation and then hardcoded.
fr: :math:`omega\_delay \in(0,1)` est un paramètre de la blockchain - à choisir par simulation et ensuite codé en dur.
tr: :math:`omega\_delay \in(0,1)` bir blokzincir parametresidir - simülasyon tarafından seçilecek ve daha sonra sabit kodlanacak.
vi: :math:`omega\_delay \in(0,1)` là một tham số của chuỗi khối - được chọn bằng mô phỏng và sau đó được mã hóa cứng.

source: Adjusting round exponent
fr: Ajustement du 'round exponent'
tr: Tur üssü ayarlama
vi: Điều chỉnh số mũ tròn

source: We need to make it clear what the semantics is of adjusting the round exponent. First, we want to say that the mechanics of messages creation requires that a validator knows what exponent he was using at any tick. This can be formalized by saying that for any validator :math:`v` there is a function :math:`n_v: Int \to Int`, assigning an exponent to be used by :math:`v` in any given tick.
fr: Nous devons préciser la sémantique de l'ajustement du 'round exponent' Tout d'abord, nous voulons dire que la mécanique de création des messages exige qu'un validateur sache quel exponent il utilisait à tout moment (tic). Cela peut être formalisé en disant que pour tout validateur :math:`v`, il existe une fonction :math:`n_v : Int \to Int`, assignant un exponent à utiliser par :math:`v` à chaque tic.
tr: Tur üssü ayarlamanın semantiğinin ne olduğunu netleştirmemiz gerekiyor. İlk olarak, mesaj oluşturma mekaniğinin, bir doğrulayıcının herhangi bir tikde hangi üssü kullandığını bilmesini gerektirdiğini söylemek istiyoruz. Bu, herhangi bir doğrulayıcı :math:`v` için bir :math:`n_v: Int \to Int` işlevi olduğu ve herhangi bir tikte v tarafından kullanılacak bir üs atandığı söylenerek resmileştirilebilir.
vi: Chúng ta cần làm rõ ngữ nghĩa của việc điều chỉnh số mũ tròn là gì. Trước tiên, chúng tôi muốn nói rằng cơ chế tạo thông điệp yêu cầu nhà xác thực biết số mũ mà anh ta đang sử dụng tại bất kỳ thời điểm nào. Điều này có thể được chính thức hóa bằng cách nói rằng đối với bất kỳ nhà xác thực nào :math:`v` có một hàm :math:`n_v: Int \to Int`, gán một số mũ được sử dụng bởi :math:`v` trong bất kỳ đánh dấu định trước nào.

source: When a validator wants to adjust its round exponent, this must be done at a tick that happens to be the boundary of both the old-length round and the new-length round. Mathematically this transforms into saying that :math:`n_v (i) = n_v(i-1)` unless :math:`i` is a multiple of both :math:`2^{n_v(i)}` and :math:`2^{n_v(i-1)}`.
fr: Lorsqu'un validateur souhaite ajuster son 'round exponent', cela doit être fait à un tic qui se trouve être la limite de l'ancien tour et du nouveau tour. Mathématiquement, cela revient à dire que :math:`n_v (i) = n_v(i-1)` sauf si :math:`i` est un multiple de :math:`2^{n_v(i)}` et :math:`2^{n_v(i-1)}`
tr: Doğrulayıcı, tur üssünü ayarlamak istediğinde, bu, hem eski uzunluktaki turun hem de yeni uzunluktaki turun sınırı olan bir tikde yapılmalıdır. Matematiksel olarak bu, :math:`i` :math:`2^{n_v(i)}` hem de :math:`2^{n_v(i-1)}` değerinin bir katı olmadıkça nv(i)=nv(i−1) olduğu söylenir.
vi: Khi nhà xác thực muốn điều chỉnh số mũ làm tròn, điều này phải được thực hiện vào thời điểm đánh dấu là ranh giới của cả vòng độ dài cũ và vòng có độ dài mới. Về mặt toán học, điều này biến đổi thành :math:`n_v (i) = n_v(i-1)` trừ khi :math:`i` là bội số của cả hai :math:`2^{n_v(i)}` và :math:`2^{n_v(i-1)}`.

source: Auto-adjusting of round lengths is based on an internal finalizer which every
fr: L'ajustement automatique de la longueur des tours est basé sur un finalisateur interne qui chaque
tr: Tur uzunluklarının otomatik ayarlanması, her doğrulayıcının sürdürmesi gereken
vi: Tự động điều chỉnh độ dài vòng dựa trên một công cụ hoàn thiện nội bộ mà mọi

source: validator must maintain. This finalizer would run with the fault tolerance threshold :math:`ftt` set as blockchain-wide constant (:math:`ftt=1\%` sounds like a good candidate value here) and :math:`acknowledgement\_level=1`.
fr: validateur doit maintenir. Ce finalisateur fonctionnerait avec le seuil de tolérance aux pannes :math:`ftt` défini comme une constante à l'échelle de la blockchain (:math:`ftt=1\%` semble être une bonne valeur candidate ici) et :math:`acknownowledgement\_level=1`.
tr: dahili bir sonlandırıcıya dayanır. Bu sonlandırıcı, blokzincir çapında sabit (:math:`ftt=1\%` burada iyi bir aday değeri gibi görünüyor) ve :math:`acknowledgement\_level=1` olarak ayarlanmış hata tolerans eşiği :math:`ftt` ile çalışır.
vi: nhà xác thực phải duy trì. Trình hoàn thiện này sẽ chạy với ngưỡng chịu lỗi :math:`ftt` được đặt là hằng số trên toàn chuỗi khối (:math:`ftt=1\%` có lẽ là một giá trị ứng cử viên tốt ở đây) và :math:`acknowledgement\_level=1`.

source: Now, we finally can define the strategy of auto-adjusting round exponents.
fr: Maintenant, nous pouvons enfin définir la stratégie d'auto-ajustement des ' round exponents'.
tr: Şimdi, nihayet, otomatik ayarlamalı yuvarlak üsler stratejisini tanımlayabiliriz.
vi: Bây giờ, cuối cùng chúng ta có thể xác định chiến lược tự động điều chỉnh số mũ tròn.

source: We assume there are two blockchain-wide integer constants, both expressing the number of rounds:
fr: Nous supposons qu'il existe deux constantes entières à l'échelle de la blockchain, exprimant toutes deux le nombre de tours :
tr: Her ikisi de tur sayısını ifade eden blokzincir çapında iki tamsayı sabiti olduğunu varsayıyoruz:
vi: Chúng tôi giả sử có hai hằng số nguyên trên toàn bộ chuỗi khối, cả hai đều thể hiện số vòng:

source: **round-acceleration-period** - every that-many-rounds a validator
fr: **round-acceleration-period** - nombre de tours au bout desquels un validateur
tr: **tur-hızlandırma-aralığı** - her o-çoklu-turda bir doğrulayıcı
vi: **round-acceleration-period** - cứ sau nhiều vòng đó là một nhà xác thực

source: decreases its round exponent by :math:`1` (unconditionally) - **round-slowdown-period** - if a validator observes that many consecutive rounds with the lambda message from the round leader not getting finalized, it increases its round exponent by 1
fr: diminue son 'round exponent' par :math:`1` (sans condition) - **round-slowdown-period** - si un validateur observe un grand nombre de tours consécutifs où le message lambda du leader du tour n'est pas finalisé, il augmente son 'round exponent' de 1
tr: tur üssünü 1 (koşulsuz olarak) azaltır - **tur-yavaşlama-süresi** - eğer bir doğrulayıcı, tur liderden gelen lambda mesajıyla birlikte birçok ardışık turun sonuçlanmadığını gözlemlerse, tur üssünü 1 arttırır
vi: giảm số mũ vòng của nó bằng :math:`1` (vô điều kiện) - **round-slowdown-period** - nếu nhà xác thực nhận thấy rằng nhiều vòng liên tiếp với thông điệp lambda từ người dẫn đầu vòng không được hoàn thành, nó sẽ tăng số mũ của vòng đó lên 1

source: Eras
fr: Eres
tr: Dönemler
vi: Kỷ nguyên

source: The need for eras
fr: Le besoin d'Eres
tr: Dönemlere duyulan ihtiyaç
vi: Sự cần thiết của kỷ nguyên

source: The idea of of eras is to keep the validator weights map constant for a longer period of time (e.g., a week). Otherwise, it is rather difficult to establish a pseudorandom leaders sequence all validators agree on. Eras also plays a crucial role in making the leader selection resistant to attack.
fr: L'idée des ères est de garder la map des poids des validateurs constante pendant une longue période de temps (par exemple une semaine). Sinon, il est assez difficile d'établir une séquence de leaders pseudo-aléatoire sur laquelle tous les validateurs sont d'accord. Les eras jouent également un rôle crucial en rendant la sélection des leaders résistante aux attaques.
tr: Dönemlerin fikri, doğrulayıcı ağırlık haritasını daha uzun bir süre boyunca (örneğin bir hafta) sabit tutmaktır. Aksi takdirde, tüm doğrulayıcıların üzerinde anlaştığı bir sözde rasgele liderler dizisi oluşturmak oldukça zordur. Dönemler, lider seçiminin saldırılara karşı dirençli hale getirilmesinde de önemli bir rol oynar.
vi: Ý tưởng về kỷ nguyên là giữ cho bản đồ trọng số của nhà xác thực không đổi trong một khoảng thời gian dài hơn (ví dụ: một tuần). Nếu không, khá khó để thiết lập một chuỗi các nhà lãnh đạo định trước mà tất cả những nhà xác thực đều đồng ý. Kỷ nguyên cũng đóng một vai trò quan trọng trong việc lựa chọn thủ lĩnh có khả năng chống lại cuộc tấn công.

source: Boundary of an era
fr: Frontière d'une Ere
tr: Bir dönemin sınırı
vi: Ranh giới của một kỷ nguyên

source: **Era length** is just a parameter of the blockchain - expressed as a number of ticks. We expect a reasonable era length might be 604800000, which is one week.
fr: **La durée d'une ère** est simplement un paramètre de la blockchain, exprimé en nombre de tics. Nous pensons qu'une longueur d'ère raisonnable pourrait être de 604800000, ce qui correspond à une semaine.
tr: **Dönem uzunluğu**, blokzincirin yalnızca bir parametresidir - bir dizi tik olarak ifade edilir. Makul bir dönem uzunluğunun bir hafta olan 604800000 olabileceğini bekliyoruz.
vi: **Era length** chỉ là một tham số của chuỗi khối - được biểu thị bằng một số đánh dấu. Chúng tôi dự đoán độ dài kỷ nguyên hợp lý có thể là 604800000, tức là một tuần.

source: A message :math:`m` belongs to an era deduced by knowing the era length and looking at :math:`m.round\_id`.
fr: Un message :math:`m` appartient à une ère déduite en connaissant la longueur de l'ère et en regardant :math:`m.round\_id`.
tr: Bir :math:`m` mesajı, dönem uzunluğu bilinerek ve :math:`m.round\_id`\ 'ye bakılarak çıkarılan bir döneme aittir.
vi: Thông điệp :math:`m` thuộc về một kỷ nguyên được suy ra bằng cách biết độ dài kỷ nguyên và nhìn vào :math:`m.round\_id`.

source: Critical blocks
fr: Blocs critiques
tr: Kritik bloklar
vi: Các khối quan trọng

source: Round ids are really Unix timestamps, so main-tree can be now imagined with time-axis overlayed.
fr: Les ids des tours sont en fait des timestamps Unix, donc l'arbre principal peut maintenant être imaginé avec l'axe du temps superposé.
tr: Tur kimlikleri gerçekten Unix zaman damgalarıdır, bu nedenle ana ağaç artık zaman ekseni bindirmeli olarak düşünülebilir.
vi: Id vòng là dấu thời gian Unix, vì vậy cây chính hiện có thể được hình dung với trục thời gian được bao trùm lên.
