Repository: casper-network/docs-archive
Catalog: locale/*/LC_MESSAGES/theory/highway.po
Languages: fr, tr, vi

source: Motivation
tr: Motivasyon
vi: Động lực

source: For a practically useful decentralized consensus protocol, proofs of two theorems must be provided:
fr: Pour qu'un protocole de consensus décentralisé soit utile en pratique, les preuves de deux théorèmes doivent être fournies :
tr: Pratik olarak kullanışlı bir merkeziyetsiz mutabakat protokolü için, iki teoremin kanıtı sağlanmalıdır:
vi: Trên thực tế, một giao thức đồng thuận phi tập trung cần thể hiện được hai định lý:

source: **safety:** a theorem saying that nodes cannot come up with conflicting decisions
fr: **sécurité:** (safety) un théorème disant que les nœuds ne peuvent pas prendre de décisions contradictoires.
tr: **güvenlik:** düğümlerin çakışan kararlarla gelemeyeceğini ifade eden bir teoremdir
vi: **an toàn (safety):** lý nói rằng các nút không thể đưa ra các quyết định mâu thuẫn

source: **liveness:** a theorem saying that nodes will keep making decisions
fr: **liveness:** un théorème disant que les noeuds vont continuer à prendre des décisions
tr: **canlılık:** düğümlerin karar vermeye devam edeceğini söyleyen bir teoremdir
vi: **hoạt động (liveness):** định lý nói rằng các nút sẽ tiếp tục đưa ra quyết định

source: forever (so, that the blockchain will grow forever)
fr: pour toujours (afin que la blockchain s'étende pour toujours)
tr: sonsuzluk (böylece blokzincir sonsuza kadar büyüyecek)
vi: mãi mãi (để chuỗi khối sẽ phát triển mãi mãi)

source: The First theorem is just another name for the machinery of finality detectors. And it is the easy one. The Second theorem tends to be substantially harder to prove and these difficulties are showing up in pretty much any blockchain design studied.
fr: Le premier théorème est juste un autre nom pour la machinerie des détecteurs de finalité. Et c'est le plus facile. Le deuxième théorème tend à être sensiblement plus difficile à prouver et ces difficultés apparaissent dans presque toutes les conceptions de blockchain étudiées.
tr: Birinci teorem, kesinlik algılayıcılarının mekanizması için sadece başka bir isimdir. Ve bu kolay olanıdır. İkinci teoremi kanıtlamak büyük ölçüde daha zor olma eğilimindedir ve bu zorluklar, çalışılan hemen hemen her blokzincir tasarımında ortaya çıkmaktadır.
vi: Định lý thứ nhất chỉ là một tên gọi khác của việc tính toán cuối cùng và nó là một trong những việc dễ dàng. Định lý thứ hai có xu hướng khó chứng minh hơn đáng kể và những khó khăn này đang xuất hiện trong khá nhiều thiết kế chuỗi khối được nghiên cứu.

source: Despite the fact that the “naive” design of a blockchain described in the previous chapter can actually be implemented and its observed behavior is promising, so far we were not successful trying to prove the liveness theorem for it.
fr: Bien que la conception "naïve" d'une blockchain décrite dans le chapitre précédent puisse être mise en œuvre et que son comportement observé soit prometteur, nous n'avons, jusqu'à présent, pas réussi à prouver le théorème de vivacité (liveness) pour elle.
tr: Önceki bölümde açıklanan bir blokzincirin “naif” tasarımının gerçekten uygulanabilmesine ve gözlemlenen davranışı umut verici olmasına rağmen, şimdiye kadar bunun için canlılık teoremini kanıtlamaya çalışmakta başarılı olamadık.
vi: Mặc dù thực tế là thiết kế "ngây thơ" của một chuỗi khối được mô tả trong chương trước có thể thực sự được triển khai và hành vi quan sát được của nó là đầy hứa hẹn, cho đến nay chúng tôi đã không thành công khi cố gắng chứng minh định lý liveness cho nó.

source: As part of this effort, we were actively looking for some hardening of assumptions that would lead to a provably live protocol while maintaining our key goals intact; i.e. to have a permissionless, fully decentralized, Casper-based blockchain that is compatible with broadcast-based message passing and a partially synchronous network.
fr: Dans le cadre de cet effort, nous recherchions activement un durcissement des hypothèses qui permettrait d'obtenir un protocole prouvé vivant tout en maintenant nos objectifs clés intacts, c'est-à-dire une blockchain sans permission, entièrement décentralisée, basée sur Casper et compatible avec le passage de messages par diffusion et un réseau partiellement synchrone.
tr: Bu çabanın bir parçası olarak, temel hedeflerimizi olduğu gibi korurken - yani, yayın tabanlı mesaj geçişi ve kısmen senkronize bir ağ ile uyumlu, izinsiz, tamamen merkeziyetsiz, Casper tabanlı bir blokzincire sahip olmak - canlı bir protokole yol açacak varsayımlarda bazı sıkılaştırmaları aktif olarak arıyorduk.
vi: Là một phần của nỗ lực này, chúng tôi đã tích cực tìm kiếm một số giả định vững chắc sẽ dẫn đến một giao thức hoạt động có thể chứng minh được trong khi vẫn duy trì nguyên vẹn các mục tiêu chính của chúng tôi; nghĩa là có một chuỗi khối dựa trên Casper không cần cấp phép, hoàn toàn phi tập trung, tương thích với việc gửi các thông báo và một mạng đồng bộ một phần.

source: **Highway** is one of such attempts we found particularly promising. This is a variant of Casper where the liveness theorem is achieved via constraining message production with a pseudorandomly generated sequence of leaders that, in effect leads to a predictable structure of the emerging blockdag.
fr: **Highway** est l'une de ces tentatives que nous avons trouvée particulièrement prometteuse. Il s'agit d'une variante de Casper où le théorème de vivacité (liveness) est réalisé en contraignant la production de messages avec une séquence de leaders générée de manière pseudo-aléatoire qui, en fait, conduit à une structure prévisible du blockdag émergent.
tr: **Highway**, özellikle umut verici bulduğumuz bu tür girişimlerden biridir. Bu, canlılık teoreminin, sözde rasgele oluşturulmuş bir liderler dizisi ile mesaj üretimini kısıtlayarak elde edildiği ve aslında ortaya çıkan blockdag'ın tahmin edilebilir bir yapısına yol açan bir Casper çeşididir.
vi: **Highway** là một trong những nỗ lực mà chúng tôi thấy đặc biệt hứa hẹn. Đây là một biến thể của Casper trong đó định lý liveness đạt được thông qua việc hạn chế gửi thông báo với việc tạo có chủ đích một chuỗi các nhà lãnh đạo, trên thực tế dẫn đến một cấu trúc dự đoán trước được của blockdag.

source: Innovations in a nutshell
fr: Les innovations en bref
tr: Kısaca yenilikler
vi: Tóm tắt về đổi mới

source: We generally see Highway as an evolution from Naive Casper Blockchain (later abbreviated as NCB), where key modifications are:
fr: Nous considérons généralement Highway comme une évolution de Naive Casper Blockchain (plus tard abrégé en NCB), où les modifications clés sont :
tr: Highway'i genel olarak Naif Casper Blokzincirden (daha sonra NBC olarak kısaltılacak) bir evrim olarak görüyoruz, buradaki değişiklikler:
vi: Nhìn chung, chúng tôi coi Highway là một sự phát triển từ Naive Casper Blockchain (sau này được viết tắt là NCB), nơi các sửa đổi chính là:

source: Organize blocks creation around a pseudorandomly generated sequence of
fr: Organiser la création de blocs autour d'une séquence générée de manière pseudo-aléatoire de
tr: Sözde rastgele oluşturulmuş bir liderler dizisi etrafında blok oluşturmayı organize
vi: Tổ chức tạo khối xung quanh một chuỗi được tạo có chủ đích của

source: leaders. Only a leader can produce a block. - Use variable length of rounds based on the :math:`2^n` round length idea so that the blockchain network can self-adjust to achieve optimal performance. - Replace continuous bonding/unbonding with an era-based solution. This is necessary to keep the solution secure (so that attackers cannot tamper with the leader sequence generator).
fr: leaders. Seul un leader peut produire un bloc. - Utiliser une longueur variable des tours (round) basée sur :math:`2^n` afin que le réseau blockchain puisse s'auto-ajuster pour atteindre une performance optimale. - Remplacer le bonding/unbonding continu par une solution basée sur l'ère. Cela est nécessaire pour que la solution reste sécurisée (afin que les attaquants ne puissent pas altérer le générateur de séquence leader).
tr: edin. Sadece bir lider blok üretebilir. - Blokzincir ağının optimum performansı elde etmek maksadıyla kendi kendini ayarlayabilmesi için :math:`2^n` halka uzunluk fikrine dayalı olarak değişken halka uzunluğu kullanın. - Sürekli bağlamayı/çözmeyi çağa dayalı bir çözümle değiştirin. Bu, çözümü güvenli tutmak için gereklidir (böylece saldırganlar lider dizi oluşturucuyu kurcalayamazlar).
vi: các nhà lãnh đạo. Chỉ một nhà lãnh đạo mới có thể tạo ra một khối. - Sử dụng chiều dài vòng thay đổi dựa trên ý tưởng chiều dài vòng :math:`2^n` để mạng blockchain có thể tự điều chỉnh nhằm đạt được hiệu suất tối ưu. - Thay thế việc cổ phần / hủy cổ phần liên tục bằng giải pháp mang tính thời đại. Điều này là cần thiết để giữ cho giải pháp an toàn (để những kẻ tấn công không thể giả mạo tạo trình tự lãnh đạo).

source: New requirements
fr: Nouvelles exigences
tr: Yeni gereksinimler
vi: Yêu cầu mới

source: Interestingly, in comparison to NCB, we need only one new assumption, although a tough one - we need that validators have well synchronized real time clocks.
fr: Il est intéressant de noter que, par rapport à la BCN, nous n'avons besoin que d'une seule nouvelle hypothèse, bien qu'elle soit difficile : il faut que les validateurs aient des horloges bien synchronisées en temps réel .
tr: İlginç bir şekilde, NCB ile karşılaştırıldığında, zor olmasına rağmen yalnızca bir yeni varsayıma ihtiyacımız var - doğrulayıcıların iyi senkronize edilmiş gerçek zamanlı saatlere sahip olmalarına ihtiyacımız var.
vi: Thật thú vị, so với NCB, chúng tôi chỉ cần một giả định mới, mặc dù một giả định khó - chúng tôi cần các nhà xác thực có đồng hồ thời gian thực được đồng bộ hóa tốt.

source: How to achieve such real-time clocks and how to secure the network against intended or unintended clock drift is, in general, beyond the scope of this specification. However, we give some hints on certain simple precautions to be taken.
fr: La manière d'obtenir de telles horloges en temps réel et de sécuriser le réseau contre la dérive intentionnelle ou non de l'horloge dépasse, en général, le cadre de cette spécification. Toutefois, nous donnons quelques indications sur certaines précautions simples à prendre.
tr: Bu tür gerçek zamanlı saatlerin nasıl elde edileceği ve ağın amaçlanan veya istenmeyen saat kaymalarına karşı nasıl güvence altına alınacağı genel olarak bu belirtimin kapsamı dışındadır. Bununla birlikte, alınması gereken bazı basit önlemler hakkında bazı ipuçları veriyoruz.
vi: Nói chung, làm thế nào để đạt được đồng hồ thời gian thực như vậy và cách bảo mật mạng chống lại sự lệch đồng hồ có chủ ý hoặc không chủ ý, nằm ngoài phạm vi của đặc điểm kỹ thuật này. Tuy nhiên, chúng tôi đưa ra một số gợi ý về một số biện pháp phòng ngừa đơn giản cần được thực hiện.

source: Why “Highway”
fr: Pourquoi "Highway" ?
tr: Neden “Highway”
vi: Tại sao “Highway”

source: To intuitively capture the key idea of the :math:`2^n` round length trick, we once imagined a highway, well - a mathematical highway with infinitely many lanes. Lanes are numbered with integers (all integers, also negative).
fr: Pour saisir intuitivement l'idée clé de l'astuce :math:`2^n` de la longueur d'un rond, nous avons un jour imaginé une autoroute, enfin - une autoroute mathématique avec une infinité de voies. Les voies sont numérotées avec des nombres entiers (tous les nombres entiers, même négatifs).
tr: :math:`2^n` halka uzunluk püf noktasının ana fikrini sezgisel olarak yakalamak için, bir zamanlar sonsuz şeritli matematiksel bir otoyol hayal etmiştik. Şeritler tamsayılarla numaralandırılır (tüm tamsayılar, negatif sayılar dahil).
vi: Để nắm bắt trực quan được ý tưởng chính của chiều dài vòng :math:`2^n`, chúng tôi đã từng tưởng tượng ra một đường cao tốc - một đường cao tốc toán học với vô số làn đường. Làn đường được đánh số bằng số nguyên (tất cả các số nguyên, cả số âm).

source: This highway is different because movement on it takes place in the form of hops, while the speed of all cars is constant. In any given lane :math:`n`, a car has to make :math:`2^n` hops to cover a unit distance.
fr: Cette autoroute est différente car les déplacements s'y font sous forme de sauts, alors que la vitesse de toutes les voitures est constante. Sur une voie :math:`n` donnée, une voiture doit faire :math:`2^n` sauts pour couvrir une distance unitaire.
tr: Bu otoyol farklıdır, çünkü tüm arabaların hızı sabitken, üzerindeki hareket atlama şeklinde gerçekleşir. Herhangi bir şeritte :math:`n`, bir arabanın bir birim mesafeyi kat etmesi için :math:`2^n` atlama yapması gerekir.
vi: Đường cao tốc này khác vì chuyển động trên đó diễn ra dưới dạng bước nhảy, trong khi tốc độ của tất cả các ô tô là không đổi. Trong bất kỳ làn đường nhất định :math:`n`, một chiếc ô tô phải thực hiện :math:`2^n` bước nhảy để bao phủ một khoảng cách đơn vị.

source: Therefore, if you switch to the lane on your left-hand side, you increase the frequency of your hopping by a factor of 2. If you switch to your right-hand side, you decrease the frequency by a factor of 2.
fr: Par conséquent, si vous passez sur la voie de gauche, vous augmentez la fréquence de vos sauts par un facteur de 2. Si vous passez sur votre droite, vous diminuez la fréquence par un facteur de 2.
tr: Bu nedenle, sol tarafınızdaki şeride geçerseniz, atlama sıklığınızı 2 kat artırırsınız. Sağ tarafınıza geçerseniz, frekansı 2 kat azaltırsınız.
vi: Do đó, nếu bạn chuyển sang làn đường bên tay trái, bạn sẽ tăng tần suất nhảy lên hệ số 2. Nếu bạn chuyển sang làn đường bên tay phải, bạn giảm tần số đi theo hệ số 2.

source: You meet cars from the lane on your left-hand side on every jump you make. For cars on your right-hand side, you meet only every second hop.
fr: Vous rencontrez les voitures de la voie située à votre gauche à chaque saut que vous effectuez. Pour les voitures de votre côté droit, vous ne rencontrez qu'un saut sur deux.
tr: Yaptığınız her atlamada sol tarafınızdaki şeritten arabalarla karşılaşıyorsunuz. Sağ tarafınızdaki arabalar için, yalnızca her ikinci atlamada bir karşılaşıyorsunuz.
vi: Bạn gặp ô tô từ làn đường bên tay trái của bạn trong mỗi bước nhảy bạn thực hiện. Đối với ô tô ở phía bên tay phải của bạn, bạn chỉ gặp ở mỗi bước nhảy thứ hai.

source: Messages structure
fr: Structure des messages
tr: Mesaj yapısı
vi: Cấu trúc thông điệp

source: While we generally keep messages structure established in NCB, we require the
fr: Bien que nous conservions généralement la structure des messages établie dans la PNE, nous exigeons les
tr: Genelde NCB'de kurulu mesaj yapısını korurken,
vi: Mặc dù chúng tôi thường giữ cấu trúc thông điệp được thiết lập trong NCB, chúng tôi yêu cầu

source: following additional fields:
fr: champs supplémentaires suivants :
tr: Aşağıdaki ek alanlara ihtiyaç duyarız:
vi: các trường bổ sung sau:

source: for every message:
fr: pour chaque message :
tr: her mesaj için:
vi: cho mỗi thông điệp:

source: **round-id: Int** - keeps the round id that this message belongs to
fr: **round-id: Int** - conserve l'id du tour (ronde) à auquel ce message appartient
tr: **round-id: Int** - bu mesajın ait olduğu halka kimliği tutar
vi: **round-id: Int** - giữ id vòng mà thông điệp này thuộc về

source: **real-time-stamp: Int** - keeps the actual time of creating this message
fr: **real-time-stamp: Int** - conserve la date réelle de création de ce message
tr: **real-time-stamp: Int** - bu mesajın oluşturulduğu gerçek zamanını tutar
vi: **real-time-stamp: Int** - giữ thời gian thực tế của việc tạo thông điệp này

source: taken from the real-time clock of the sender (must be creation as opposed to sending because all fields are sealed with a digital signature)
fr: prise dans l'horloge en temps réel de l'expéditeur (il doit s'agir d'une création par opposition à l'envoi car tous les champs sont scellés par une signature numérique)
tr: gönderenin gerçek zamanlı saatinden alınır (tüm alanlar dijital bir imza ile mühürlendiğinden, göndermenin tersi olarak oluşturulmalıdır)
vi: được lấy từ đồng hồ thời gian thực của người gửi (phải được tạo chứ không phải gửi vì tất cả các trường đều được niêm phong bằng chữ ký điện tử)

source: for blocks only:
fr: pour les blocs uniquement :
tr: sadece bloklar için:
vi: chỉ dành cho các khối:

source: **magic-bit: Bit** - this is one bit field needed for leaders pseudorandom
fr: **magic-bit: Bit** - Il s'agit d'un champ de bits nécessaire pour les leaders pseudo-aléatoires.
tr: **magic-bit: Bit** - bu, sözde rastgele liderler için gereken bir bitlik alandır
vi: **magic-bit: Bit** - đây là một trường bit cần thiết cho các nhà lãnh đạo định trước

source: generator seed
fr: graine de générateur (generator seed)
tr: üretici anahtar kelimesi (seed)
vi: tạo hạt giống (seed)

source: for ballots only:
fr: pour les scrutins (ballots) uniquement :
tr: sadece oy pusulası için:
vi: chỉ dành cho phiếu bầu:

source: **message-type: Enum** - one of: LAMBDA_RESPONSE, OMEGA
fr: **message-type: Enum** - une valeur parmi : LAMBDA_RESPONSE, OMEGA
tr: **message-type: Enum** - şunlardan biri: LAMBDA_RESPONSE, OMEGA
vi: **message-type: Enum** - một trong số: LAMBDA_RESPONSE, OMEGA

source: Note: The semantics of these fields is explained later in this document.
fr: Note : La sémantique de ces champs est expliquée plus loin dans ce document.
tr: Not: Bu alanların semantiği bu belgenin ilerleyen kısımlarında açıklanmıştır.
vi: Lưu ý: Ngữ nghĩa của các trường này sẽ được giải thích sau trong tài liệu này.

source: Liveness strategy
fr: Stratégie de vivacité (liveness)
tr: Canlılık stratejisi
vi: Chiến lược hoạt động (liveness)

source: Ticks
fr: Tics
tr: Tikler
vi: Đánh dấu

source: Validators see time in a discrete way, namely - as the number of ticks since some hardcoded point of real time. For simplicity, we assume that ticks are just milliseconds since “epoch” -- the Unix time representation standard.
fr: Les validateurs voient le temps d'une manière discrète, c'est-à-dire comme le nombre de tics depuis un certain point codé en dur du temps réel. Pour simplifier, nous supposons que les ticks ne sont que des millisecondes depuis "epoch" -- la norme Unix de représentation du temps.
tr: Doğrulayıcılar zamanı ayrı bir şekilde görürler, yani - gerçek zamanın sabit kodlanmış bir noktasından bu yana tik sayısı olarak. Basit olması için, tiklerin, Unix zaman gösterim standardı olan "dönem"den bu yana yalnızca milisaniyeler olduğunu varsayıyoruz.
vi: Nhà xác thực xem thời gian theo cách rời rạc, cụ thể là số lượng đánh dấu kể từ một số điểm được mã hóa cứng của thời gian thực. Để đơn giản, chúng tôi giả định rằng số đánh dấu chỉ là mili giây kể từ “kỷ nguyên” - tiêu chuẩn biểu diễn thời gian Unix.

source: Leaders
tr: Liderler
vi: Nhà lãnh đạo

source: There is a **leader** assigned to every tick. A leader is always one from the
fr: Il y a un **leader** assigné à chaque tic. Un leader est toujours un des
tr: Her tik için atanmış bir **lider** vardır. Bir lider her zaman
vi: Có một **lãnh đạo** được chỉ định cho mỗi lần đánh dấu. Một nhà lãnh đạo luôn luôn là một trong những

source: currently staked validators.
fr: des validateurs actuels.
tr: mevcut durumdaki doğrulayıcılardan biridir.
vi: nhà xác thực đã đặt cọc hiện tại.

source: The precise algorithm of calculating who is the leader of given tick is pretty convoluted and needs a machinery that we will establish step-by-step. For now, it is enough to say that a validator has a recipe to calculate the leader of every tick.
fr: L'algorithme précis permettant de calculer qui est le leader d'un tic est assez alambiqué et nécessite une machinerie que nous allons établir étape par étape. Pour l'instant, il suffit de dire qu'un validateur a une recette pour calculer le leader de chaque tic.
tr: Verilen tik liderinin kim olduğunu hesaplamanın tam algoritması oldukça karmaşıktır ve adım adım kuracağımız bir makineye ihtiyaç duyar. Şimdilik bir doğrulayıcının her tik liderini hesaplamak için bir tarifi olduğunu söylemek yeterlidir.
vi: Thuật toán chính xác để tính xem ai là người dẫn đầu của tíc tắc nhất định khá phức tạp và cần một công cụ mà chúng tôi sẽ thiết lập từng bước. Hiện tại, đủ để nói rằng nhà xác thực có một công thức để tính toán người dẫn đầu của mỗi lần đánh dấu.

source: Rounds
fr: Tour (ronde)
tr: Turlar
vi: Vòng

source: In a leader based system, rounds are inevitable, because a leader cannot lead
fr: Dans un système basé sur un leader, les tours (rondes) sont inévitables, car un leader ne peut pas diriger
tr: Lider tabanlı bir sistemde turlar kaçınılmazdır çünkü bir lider sonsuza kadar liderlik
vi: Trong một hệ thống dựa trên nhà lãnh đạo, các vòng là không thể tránh khỏi, bởi vì một nhà lãnh đạo không thể lãnh đạo

source: forever. Hence, it is supposed to lead during a single round.
fr: pour toujours. Par conséquent, il est censé mener pendant un seul tour.
tr: yapamaz. Bu nedenle, tek bir turda lider olması gerekiyordu.
vi: mãi mãi. Do giả thiết rằng nó dẫn đầu trong một vòng.

source: Picking a fixed round length obviously leads to scaling issues. On the other hand, adjusting round length on-the-fly is tricky.
fr: Le choix d'une longueur de tour fixe entraîne évidemment des problèmes de mise à l'échelle. D'autre part, l'ajustement de la longueur du tour à la volée est délicat.
tr: Sabit bir tur uzunluğu seçmek, açıkçası ölçeklendirme sorunlarına yol açar. Öte yandan, hareket halindeyken tur uzunluğu ayarlamak zordur.
vi: Chọn một chiều dài vòng cố định rõ ràng dẫn đến các vấn đề về tỷ lệ. Mặt khác, việc điều chỉnh độ dài vòng khi đang chạy rất phức tạp.

source: In Highway, we approach the problem of automatic adjustment of round length in a unique and unusual way. Every validator selects a private value :math:`n \in Int`, which we call **round exponent**. Over time, a validator will be automatically adjusting this value to optimize its performance and the performance of the blockchain.
fr: Dans Highway, nous abordons le problème de l'ajustement automatique de la longueur des tours d'une manière unique et inhabituelle. Chaque validateur sélectionne une valeur privée :math:`n \in Int`, que nous appelons **round exponent**. Au fil du temps, un validateur ajustera automatiquement cette valeur pour optimiser ses performances et celles de la blockchain.
tr: Highway'de, tur uzunluğunun otomatik olarak ayarlanması sorununa benzersiz ve alışılmadık bir şekilde yaklaşıyoruz. Her doğrulayıcı, **tur üs** olarak adlandırdığımız özel bir :math:`n \in Int` değeri seçer. Zamanla, bir doğrulayıcı, performansını ve blokzincirin performansını optimize etmek için bu değeri otomatik olarak ayarlayacaktır.
vi: Trong Highway, chúng tôi tiếp cận vấn đề tự động điều chỉnh độ dài vòng một cách độc đáo và khác thường. Mọi nhà xác nhận đều chọn một giá trị riêng :math:`n \in Int`, chúng tôi gọi là **số mũ tròn**. Theo thời gian, nhà xác thực sẽ tự động điều chỉnh giá trị này để tối ưu hóa hiệu suất của nó và hiệu suất của chuỗi khối.

source: Given a round exponent :math:`n`, the length of a round that a validator uses
fr: Étant donné un *round exponent* :math:`n`, la longueur d'un tour qu'un validateur utilise
tr: Bir tur üs :math:`n` verildiğinde, doğrulayıcının işlemi için kullandığı turun uzunluğu
vi: Cho một số mũ tròn :math:`n`, độ dài của một vòng mà nhà xác thực sử dụng

source: for its operation is :math:`2^n` ticks.
fr: pour son fonctionnement est de :math:`2^n` tics.
tr: :math:`2^n` tiktir.
vi: cho hoạt động của nó là :math:`2^n` đánh dấu
