Repository: casper-network/docs-archive
Catalog: locale/*/LC_MESSAGES/theory/highway.po
Languages: fr, tr, vi

source: In every era, there are two ticks (with a distance fixed relative to the beginning of an era):
fr: Dans chaque ère, il y a deux tics (avec une distance fixe par rapport au début d'une ère) :
tr: Her dönemde iki tik vardır (bir dönemin başlangıcına göre sabit bir mesafe ile):
vi: Trong mọi kỷ nguyên, có hai đánh dấu (với khoảng cách cố định so với thời kỳ đầu của kỷ nguyên):

source: These points are blockchain parameters and **key-point** must be strictly bigger than **booking-point**.
fr: Ces points sont des paramètres de la blockchain et **key-point** doit être strictement plus grand que **booking-point**.
tr: Bu noktalar blokzincir parametreleridir ve **key-point**, **booking-point**\ 'ten kesinlikle daha büyük olmalıdır.
vi: Những điểm này là các thông số chuỗi khối và **key-point** phải lớn hơn **booking-point**.

source: Let :math:`era\_start: Int \to Int` be a function that assigns to every tick the beginning of an era this tick belongs to. This function can easily be calculated as:
fr: Soit :math:`era\_start : Int \to Int` est une fonction qui attribue à chaque tic le début d'une ère à laquelle ce tic appartient. Cette fonction peut facilement être calculée comme suit :
tr: :math:`era\_start: Int \to Int`, her tik işaretine bu tik işaretinin ait olduğu bir çağın başlangıcını atayan bir fonksiyon olsun. Bu fonksiyon kolayca şu şekilde hesaplanabilir:
vi: Hãy để :math:`era\_start: Int \to Int` là một hàm gán cho mỗi lần đánh dấu vào đầu kỷ nguyên mà có đánh dấu này. Hàm này có thể dễ dàng được tính toán như sau:

source: … where the division is integer division.
fr: ... où la division est une division entière.
tr: … bölme tamsayı bölmedir.
vi: … Trong đó phép chia là phép chia số nguyên.

source: **Booking block** is any block :math:`b` such that both following conditions hold:
fr: **Booking block** est tout bloc :math:`b` tel que les deux conditions suivantes soient remplies :
tr: **Rezervasyon bloğu**, aşağıdaki koşulların her ikisinin de geçerli olduğu herhangi bir :math:`b` bloğudur:
vi: **Booking block** là bất kỳ khối nào :math:`b` sao cho cả hai điều kiện sau đều giữ nguyên:

source: It can be explained as the idea that on any path of the main-tree, booking block is the first block to cross the time defined by **booking-point**, where we consider “time of a block” to be the tick of the beginning of its era.
fr: Cela peut s'expliquer par l'idée que sur n'importe quel chemin de l'arbre principal, le bloc de réservation est le premier bloc à franchir le temps défini par **booking-point**, où nous considérons que le "temps d'un bloc" est le tic du début de son ère.
tr: Ana ağacın herhangi bir yolunda, rezervasyon bloğunun, **booking-point** tarafından tanımlanan zamanı geçen ilk blok olduğu fikri olarak açıklanabilir; burada “bir bloğun zamanını” onun döneminin başlangıç tiki olarak kabul ediyoruz.
vi: Có thể được giải thích ý tưởng là trên bất kỳ con đường nào của cây chính, khối đã đặt chỗ là khối đầu tiên vượt qua thời gian được xác định bởi **booking-point**, nơi chúng tôi coi “thời gian của khối” là đánh dấu đầu kỷ nguyên của nó.

source: By analogy, we are defining a **key block** concept.
fr: Par analogie, nous définissons un concept de **bloc clé** (key block).
tr: Benzetme yoluyla, bir **anahtar blok** kavramı tanımlıyoruz.
vi: Bằng cách tương tự, chúng tôi đang định nghĩa một khái niệm**key block**.

source: Leaders sequence
fr: Séquence des leaders
tr: Liderler sıralaması
vi: Trình tự lãnh đạo

source: To have the sequence of leaders that all validators calculate in the same way, we only need:
fr: Pour avoir la séquence de leaders que tous les validateurs calculent de la même manière, il suffit :
tr: Tüm doğrulayıcıların aynı şekilde hesapladığı liderler dizisine sahip olmak için sadece şunlara ihtiyacımız var:
vi: Để có chuỗi các nhà lãnh đạo mà tất cả các nhà xác thực tính toán theo cùng một cách, chúng ta chỉ cần:

source: 1. Canonical sorting of validators so that a weights map can be converted to an array of validators in the canonical way. 2. Agreement on pseudorandom number generator to be used by all validators. 3. Pseudorandom generator seed.
fr: 1. Tri canonique des validateurs afin qu'une map de poids puisse être convertie en un tableau de validateurs de manière canonique. 2. Accord sur le générateur de nombres pseudo-aléatoires à utiliser par tous les validateurs. 3. Graine (seed) du générateur pseudo-aléatoire.
tr: 1. Bir ağırlık haritasının kurallı bir şekilde bir dizi doğrulayıcıya dönüştürülebilmesi için doğrulayıcıların kurallı olarak sıralanması. 2. Tüm doğrulayıcılar tarafından kullanılacak sözde rasgele sayı üreteci üzerinde anlaşma. 3. Sözde rasgele üreteci anahtar kelimesi.
vi: 1. Sắp xếp hợp quy các nhà xác thực để bản đồ trọng số có thể được chuyển đổi thành một mảng nhà xác thực theo cách chuẩn. 2. Thỏa thuận về trình tạo số được định trước và được sử dụng bởi tất cả các nhà xác thực. 3. Định trước tạo hạt giống (seed).

source: For (1) sorting by validator ids can be used. (2) can be hardcoded. So it is all about the way we pick the seed.
fr: Pour (1), le tri par les ids des validateurd peut être utilisé. (2) peut être codé en dur. Tout dépend donc de la façon dont on choisit la graine (seed).
tr: (1) için doğrulayıcı kimliklerine göre sıralama kullanılabilir. (2) sabit kodlanabilir. Yani her şey anahtar kelimeyi nasıl topladığımızla ilgili.
vi: Để (1) sắp xếp theo id nhà xác thực có thể được sử dụng. (2) có thể được mã hóa cứng. Vì vậy, còn lại là về cách chúng ta chọn hạt giống.

source: The mechanics of an era
fr: Les mécaniques d'une ère
tr: Bir dönemin mekaniği
vi: Cơ chế của một kỷ nguyên

source: The vision
fr: La vision
tr: Vizyon
vi: Tầm nhìn

source: Eras constitute the platform on which two mechanisms work:
fr: Les ères constituent la plate-forme sur laquelle fonctionnent deux mécanismes :
tr: Dönemler, iki mekanizmanın üzerinde çalıştığı platformu oluşturur:
vi: Kỷ nguyên tạo thành nền tảng mà trên đó hai cơ chế hoạt động:

source: validators rotation (= bonding/unbonding)
tr: doğrulayıcı rotasyonu (= bağlama/çözülme)
vi: xoay vòng nhà xác thực (= cổ phần/hủy cổ phần)

source: leaders sequence
fr: Séquence des leaders
tr: liderler sırası
vi: trình tự lãnh đạo

source: Within a single era:
fr: Dans une même ère :
tr: Tek bir dönemde:
vi: Trong một kỷ nguyên duy nhất:

source: the weights map is fixed
fr: la map des poids est fixe
tr: ağırlık haritası düzeltildi
vi: cố định bản đồ trọng số

source: the leaders selection functions (assigning a leader to every tick) is fixed
fr: les fonctions de sélection des leaders (assignation d'un leader à chaque tic) sont fixes
tr: lider seçim işlevleri (her tik işaretine bir lider atama) düzeltildi
vi: cố định các chức năng lựa chọn người lãnh đạo (chỉ định một người lãnh đạo cho mỗi lần đánh dấu)

source: An era starts at fixed point of real time (fixed tick). We generally expect that:
fr: Une ère commence à un point fixe du temps réel (tic fixe). Nous nous y attendons généralement :
tr: Bir dönem, gerçek zamanın sabit noktasında (sabit tik) başlar. Genelde şunları bekleriz:
vi: Một kỷ nguyên bắt đầu tại một thời điểm cố định của thời gian thực (đánh dấu cố định). Chúng tôi thường kỳ vọng rằng:

source: 1. The weights map to be used in this era is defined by a booking block from :math:`era\_delay` rounds ago. 2. The random seed to be used in this era is defined by a key block from :math:`era\_delay` rounds ago.
fr: 1. La map de poids à utiliser dans cette ère est définie par un bloc de réservation datant de :math:`era\_delay` tours. 2. La graine (seed) aléatoire à utiliser à cette ère est définie par un bloc de clés datant de :math:`era\_delay` tours.
tr: 1. Bu dönemde kullanılacak ağırlık haritası, :math:`era\_delay` turları öncesinden bir rezervasyon bloğu tarafından tanımlanır. 2. Bu dönemde kullanılacak rastgele anahtar kelime, :math:`era\_delay` turlarından bir anahtar blok tarafından tanımlanır.
vi: 1. Bản đồ trọng số sẽ được sử dụng trong kỷ nguyên này được xác định bởi một khối đã đặt chỗ từ :math:`era\_delay` vòng trước. 2. Hạt giống ngẫu nhiên được sử dụng trong kỷ nguyên này được xác định bởi một khối khóa từ :math:`era\_delay` vòng trước.

source: Both :math:`era\_delay` is a blockchain parameter. We expect that reasonable value for :math:`era\_delay` is 2.
fr: :math:`era\_delay` est un paramètre de la blockchain. Nous pensons que la valeur raisonnable pour :math:`era_delay` est 2.
tr: Her ikisi de :math:`era\_delay` bir blokzincir parametresidir. :math:`era\_delay` için makul değerin 2 olmasını bekliyoruz.
vi: Cả hai :math:`era\_delay` là một tham số của chuỗi khối. Chúng tôi kỳ vọng giá trị hợp lý cho :math:`era\_delay` is 2.

source: Setting the weights map
fr: Définition de la map des poids
tr: Ağırlık haritasını ayarlama
vi: Thiết lập bản đồ trọng số

source: Just take weights map as defined in the post-state of the corresponding booking block.
fr: Il suffit de prendre la map des poids telle que définie dans le post-state du bloc de réservation correspondant.
tr: İlgili rezervasyon bloğunun son durumunda tanımlandığı gibi ağırlık haritasını almanız yeterlidir.
vi: Chỉ cần lấy bản đồ trọng số như được xác định ở trạng thái sau của khối đã đặt chỗ tương ứng.

source: Setting the random seed for leaders sequence generator
fr: Définition de la graine (seed) aléatoire pour le générateur de la séquence leaders
tr: Lider dizi oluşturucu için rastgele anahtar kelime ayarlama
vi: Thiết lập hạt giống ngẫu nhiên cho trình tạo chuỗi nhà lãnh đạo

source: Take the hash of corresponding key-block, then add all magic bits from main-tree path-of-blocks between the booking block and the key block (both from the same era).
fr: Prenez le hash du bloc-clé (key-block) correspondant, puis ajoutez tous les 'bits magiques' du chemin des blocs de l'arbre principal entre le bloc de réservation et le bloc-clé (tous deux de la même ère).
tr: Karşılık gelen anahtar bloğunun özetini (hash) alın, ardından ana ağaç blok yolundan tüm sihirli bitleri rezervasyon bloğu ile anahtar bloğu (her ikisi de aynı dönemden) arasına ekleyin.
vi: Lấy băm của khối khóa (key-block) tương ứng, sau đó thêm tất cả các bit từ đường dẫn cây chính ở giữa khối đã đặt chỗ và khối khóa (cả hai đều từ cùng một kỷ nguyên).

source: Disparation of eras
fr: Séparation des ères
tr: Dönemlerin dağılımı
vi: Sự mất đi của kỷ nguyên

source: In an era we typically will observe many booking blocks and key blocks, just because the main-tree is typically not a chain. The expectation here is that the combination of :math:`era\_delay` and :math:`key\_point` together make enough time between the key block and the beginning of the era it defines, that the LFB chain of a reasonably strong finalizer will do the selection of only one “official” key block.
fr: Dans une ère, nous observerons typiquement de nombreux blocs de réservation et blocs clés, simplement parce que l'arbre principal n'est typiquement pas une chaîne. On s'attend ici à ce que la combinaison de :math:`era\_delay` et :math:`key\_point` donne suffisamment de temps entre le bloc-clé et le début de l'ère qu'il définit, pour que la chaîne LFB d'un finalisateur raisonnablement fort ne fasse la sélection que d'un seul bloc-clé "officiel".
tr: Bir dönemde, ana ağaç tipik olarak bir zincir olmadığı için, tipik olarak birçok rezervasyon bloğunu ve anahtar bloğunu gözlemleyeceğiz. Buradaki beklenti, :math:`era\_delay` ve :math:`key\_point` kombinasyonunun, anahtar blok ile tanımladığı dönemin başlangıcı arasında yeterli zaman oluşturması, oldukça güçlü bir sonlandırıcının LFB zincirinin yalnızca bir "resmi" anahtar bloğunun seçimini yapmasıdır.
vi: Trong một kỷ nguyên, chúng ta thường sẽ quan sát nhiều khối đã đặt chỗ và khối chính, chỉ vì cây chính thường không phải là một chuỗi. Kỳ vọng ở đây là sự kết hợp của :math:`era\_delay` và :math:`key\_point` với nhau tạo ra đủ thời gian giữa khối khóa và đầu kỷ nguyên mà nó xác định, rằng chuỗi LFB của một người hoàn thành sẽ thực hiện việc lựa chọn để chỉ một khối khóa "chính thức".

source: Let us do a simple calculations:
fr: Faisons un calcul simple :
tr: Basit bir hesaplama yapalım:
vi: Hãy để chúng tôi thực hiện một phép tính đơn giản:

source: Assuming the era length is set to one week - starting Monday and ending Sunday - and the key point is set to Thursday noon. Also, assume that “era\_delay” is 2. This means that key blocks created just after Thursday noon will control the era that will start 10.5 days later. This is plenty of time and by that time it is “almost sure” that the progressing LFB chain will
fr: Supposons que la durée de l'ère soit fixée à une semaine - commençant le lundi et se terminant le dimanche - et que le point clé soit fixé au jeudi midi. Supposons également que "era\_delay" soit égal à 2, ce qui signifie que les blocs clés créés juste après le jeudi midi contrôleront l'ère qui commencera 10,5 jours plus tard. C'est beaucoup de temps et, à ce moment-là, il est "presque sûr" que la chaîne LFB en progression
tr: Dönem uzunluğunun bir haftaya ayarlandığını varsayarsak - Pazartesi başlayıp Pazar sona erer - ve kilit nokta Perşembe öğlen olarak ayarlanır. Ayrıca, “era_delay”in 2 olduğunu varsayın. Bu, Perşembe öğleden hemen sonra oluşturulan anahtar blokların 10.5 gün sonra başlayacak olan dönemi kontrol edeceği anlamına gelir. Bu çok uzun bir süre ve o zamana kadar ilerleyen LFB zincirinin
vi: Giả sử độ dài kỷ nguyên được đặt là một tuần - bắt đầu từ Thứ Hai và kết thúc Chủ Nhật - và thời điểm quan trọng được đặt là trưa Thứ Năm. Ngoài ra, giả sử rằng “era\_delay” là 2. Điều này có nghĩa là các khối khóa được tạo ngay sau trưa Thứ Năm sẽ kiểm soát kỷ nguyên sẽ bắt đầu 10,5 ngày sau đó. Đây là rất nhiều thời gian và đến thời điểm đó, "gần như chắc chắn" rằng chuỗi LFB đang phát triển sẽ

source: pick the “right” key block to be used.
fr: choisira le "bon" bloc-clé à utiliser.
tr: kullanılacak “doğru” anahtar bloğu seçeceğinden “neredeyse emin”dir.
vi: chọn khối khoá "bên phải" để sử dụng.

source: In the extreme case, however, the finality of the key block might not be there at the moment of starting the era to be controlled by this block. This
fr: Dans le cas extrême, cependant, la finalité du bloc-clé pourrait ne pas être présente au moment du démarrage de l'ère à contrôler par ce bloc. C'est
tr: Ancak en uç durumda, anahtar bloğun kesinliği, bu blok tarafından kontrol edilecek dönemin başladığı anda orada olmayabilir. Bu
vi: Tuy nhiên, trong trường hợp cực đoan, tính chất cuối cùng của khối khóa có thể không có ở thời điểm bắt đầu kỷ nguyên được kiểm soát bởi khối này. Điều này

source: is an interesting situation that actually can be handled, although this is to happen in a “shocking” way. The way to go is to run in parallel all possible eras - accordingly to all key blocks that are “on the table”. Of course, these parallel eras must be run as if they are completely independent blockchains (= separate P2p networks). Eventually, the progressing LFB chain will materialize only one reality, and so all the other virtual eras must disappear, so validators will just forget they ever existed. This is exactly like in quantum mechanics, where at some point only one version of reality is materializing.
fr: est une situation intéressante qui peut être traitée, même si cela doit se faire de manière "choquante". La solution consiste à exécuter en parallèle toutes les périodes possibles, en fonction de tous les blocs clés qui sont "sur la table". Bien sûr, ces périodes parallèles doivent être exécutées comme s'il s'agissait de blockchains complètement indépendantes (= réseaux P2P séparés). Finalement, la chaîne LFB en progression ne matérialisera qu'une seule réalité, et donc toutes les autres ères virtuelles doivent disparaître, de sorte que les validateurs oublieront simplement qu'elles ont existé. C'est exactement comme en mécanique quantique, où à un moment donné, une seule version de la réalité se matérialise.
tr: “şok edici” bir şekilde gerçekleşmesine rağmen, aslında ele alınabilecek ilginç bir durumdur. Gidilecek yol, tüm olası dönemlerde paralel olarak çalıştırmaktır - buna göre “masadaki” tüm anahtar bloklara. Tabii ki, bu paralel dönemler, tamamen bağımsız blokzincirler (= ayrı P2p ağları) gibi çalıştırılmalıdır. Sonunda, ilerleyen LFB zinciri yalnızca bir gerçekliği gerçekleştirecek ve bu nedenle diğer tüm sanal dönemler ortadan kalkmalı, böylece doğrulayıcılar var olduklarını unutacak. Bu, bir noktada gerçekliğin yalnızca bir sürümünün gerçekleştiği kuantum mekaniğindeki gibidir.
vi: là một tình huống thú vị thực sự có thể được xử lý, mặc dù điều này xảy ra theo một cách "gây sốc". Cách thực hiện là chạy song song tất cả các kỷ nguyên có thể - tương ứng với tất cả các khối chính nằm “trên bàn”. Tất nhiên, các kỷ nguyên song song này phải được chạy như thể chúng là các blockchains hoàn toàn độc lập (= các mạng P2p riêng biệt). Cuối cùng, chuỗi LFB đang phát triển sẽ chỉ hiện thực hóa một thực tế và do đó, tất cả các kỷ nguyên ảo khác phải biến mất, vì vậy người xác thực sẽ quên chúng từng tồn tại. Điều này giống hệt như trong cơ học lượng tử, ở một thời điểm nào đó chỉ có một phiên bản của thực tế đang hiện thực hóa.
