Repository: casper-network/docs-archive
Catalog: locale/*/LC_MESSAGES/theory/index.po
Languages: fr, tr, vi

source: Introduction
tr: Giriş
vi: Giới thiệu

source: Theory
fr: Théorie
tr: Teori
vi: Lý thuyết

source: This is version 3.0 of technical specification and it corresponds to April 2020 release of our platform ("Alpha Testnet").
fr: Il s'agit de la version 3.0 des spécifications techniques et elle correspond à la version d'avril 2020 de notre plateforme ("Alpha Testnet").
tr: Bu, teknik özelliklerin 3.0 sürümüdür ve platformumuzun ("Alpha Testnet") Nisan 2020 sürümüne karşılık gelmektedir.
vi: Đây là phiên bản 3.0 và đặc điểm kỹ thuật của nó tương ứng với bản phát hành vào tháng 4 năm 2020 của nền tảng của chúng tôi ("Alpha Testnet").

source: To build a proof-of-stake blockchain, one must follow this general recipe:
fr: Pour construire une blockchain proof-of-stake, il faut suivre cette recette générale :
tr: Hisse kanıtı blokzinciri oluşturmak için şu genel tarifi takip etmek gerekir:
vi: Để xây dựng một chuỗi khối bằng chứng cổ phần, người ta phải tuân theo công thức chung sau:

source: Pick the core consensus protocol (a machinery that allows to do distributed selection of one element from a finite set).
fr: Choisissez le protocole de consensus de base (une machine qui permet de faire une sélection distribuée d'un élément dans un ensemble fini).
tr: Çekirdek mutabakat protokolünü seçin (sonlu bir kümeden bir elemanın dağıtık seçimini yapmaya izin veren bir makine).
vi: Chọn giao thức đồng thuận cốt lõi (bằng máy móc cho phép thực hiện phân tán một phần tử từ một tập hợp hữu hạn).

source: Pick the model of transactions ledger (transactions and blocks structure show up here).
fr: Choisissez le modèle du registre des transactions (les transactions et la structure des blocs apparaissent ici).
tr: İşlem defteri modelini seçin (işlemler ve blok yapısı burada gösterilir).
vi: Chọn mô hình sổ cái giao dịch (giao dịch và cấu trúc khối hiển thị tại đây).

source: Apply the core consensus to the ledger, i.e. establish consensus-based way of extending the ledger by blockchain participants. Ensure that liveness theorem can be proven for the resulting design.
fr: Appliquer le consensus de base au registre, c'est-à-dire établir une manière consensuelle d'étendre le registre par les participants à la blockchain. S'assurer que le théorème de vivacité (liveness) peut être prouvé pour la conception résultante.
tr: Çekirdek mutabakatı deftere uygulayın, yani defteri blokzincir katılımcıları tarafından genişletmenin mutabakata dayalı bir yolunu oluşturun. Elde edilen tasarım için canlılık teoreminin kanıtlanabildiğinden emin olun.
vi: Áp dụng sự đồng thuận cốt lõi cho sổ cái, tức là thiết lập cách thức mở rộng sổ cái dựa trên sự đồng thuận của những người tham gia chuỗi khối. Đảm bảo rằng có thể chứng minh lý thuyết về sự tồn tại của hệ thống cho thiết kế đã có.

source: Plug-in stakes management solution.
fr: Brancher une solution de gestion des enjeux (stakes)
tr: Hisse yönetimi çözümünü ekleyin.
vi: Giải pháp quản lý cổ phần gắn vào (plug-in).

source: Plug-in the suitable computing model (i.e. smart contracts virtual machine).
fr: Branchez un modèle informatique approprié (c'est-à-dire une machine virtuelle pour les contrats intelligents).
tr: Uygun bilgi işlem modelini ekleyin (yani akıllı kontratlar sanal makinesi).
vi: Gắn vào mô hình máy tính phù hợp (tức là máy ảo hợp đồng thông minh).

source: The "Theory" chapter explains how we approached steps (1) ... (4) in the abstract way, while implementation-level details are specified in "CasperLabs Blockchain Design" chapter. The outline of material presented is:
fr: Le chapitre "Théorie" explique comment nous avons abordé les étapes (1) ... (4) de manière abstraite, tandis que les détails de mise en œuvre sont précisés dans le chapitre "Conception de la blockchain de CasperLabs". Le plan du contenu présenté est le suivant :
tr: "Teori" bölümü, (1) ... (4) adımlarına soyut bir şekilde nasıl yaklaştığımızı açıklarken, uygulama düzeyindeki ayrıntılar "CasperLabs Blokzincir Tasarımı" bölümünde belirtilmiştir. Sunulan belgenin ana hatları:
vi: Chương "Lý thuyết" giải thích cách chúng tôi tiếp cận các bước (1) ... (4) theo cách trừu tượng, trong khi chi tiết mức độ triển khai được nêu rõ trong chương "Thiết kế chuỗi khối CasperLabs". Đề cương của tài liệu được trình bày là:

source: **Abstract Casper Consensus** - presents the core consensus protocol we use; concepts such as estimator, finality and fault-tolerance threshold and summits are explained
fr: **Abstract Casper Consensus** - présente le protocole de consensus de base que nous utilisons ; des concepts tels que l'estimateur (estimator), la finalité (finality) et le seuil de tolérance aux pannes (fault-tolerance threshold) et les sommets (summits) sont expliqués.
tr: **Soyut Casper Mutabakatı** - kullandığımız temel mutabakat protokolünü sunar; tahmin edici, kesinlik ve hata tolerans eşiği ve zirveler gibi kavramlar açıklanır
vi: **Tóm tắt Đồng thuận của Casper** - trình bày giao thức đồng thuận cốt lõi mà chúng tôi sử dụng; giải thích khái niệm như công cụ ước tính, mức độ cuối cùng và ngưỡng chịu lỗi và các mức độ tối đa

source: **Brickdag** - introduces the transactions ledger structure - bricks, blocks, ballots, parents tree and justifications graph
fr: **Brickdag** - présente la structure du registre des transactions - briques, blocs, bulletins de vote, arbre des parents et graphique des justifications
tr: **Brickdag** - işlem defteri yapısını tanıtır - kalıplar, bloklar, oy pusulaları, ana ağaç ve gerekçeler grafiği
vi: **Brickdag** - giới thiệu cấu trúc sổ cái giao dịch - cơ sở, khối, phiếu bầu, cây lớp trên và biểu đồ diễn giải

source: **Leaders and rounds** - explains the mechanics of "Flat Highway", i.e. when the set of validators is fixed
fr: **Leaders et tours (rounds)** - explique les mécanismes de la "Flat Highway", c'est-à-dire lorsque l'ensemble des validateurs est fixe.
tr: **Liderler ve turlar** - "Flat Highway"in mekaniğini açıklar, mesela doğrulayıcı seti sabitlendiğinde
vi: **Các nhà lãnh đạo và các lượt** - giải thích cơ chế của "Flat Highway"", tức là khi nhóm các nhà xác thực được xác định trước

source: **Fork choice and finality** - applies the abstract Casper consensus to the brickdag
fr: **Fork choice and finality** - applique le consensus abstrait de Casper au brickdag
tr: **Çatal seçimi ve kesinlik** - soyut Casper mutabakatını brickdag'a uygular
vi: **Chọn nhánh và phần sau cùng ** - áp dụng tóm tắt đồng thuận của Casper cho brickdag

source: **Eras** - describes how we do stake management in Highway
fr: **Eres** - décrit comment nous gérons les enjeux dans Highway
tr: **Dönemler** - Hightway'de hisse yönetimini nasıl yaptığımızı açıklar
vi: **Eras** - mô tả cách chúng ta thực hiện quản lý cổ phần trong Highway

source: **Known limitations and features planned for ver 4.0** - sketches changes we anticipate to hit version 4.0 of this spec
fr: **Limitations connues et fonctionnalités prévues pour la version 4.0** - esquisse des changements que nous prévoyons pour la version 4.0 de cette spécification.
tr: **4.0 sürümü için bilinen sınırlamalar ve planlanan özellikler** - bu belirtimin 4.0 sürümüne ulaşmasını beklediğimiz taslaklar değişiklikler
vi: **Các giới hạn và tính năng đã biết được lên kế hoạch cho phiên bản 4.0** - các thay đổi phác thảo mà chúng tôi dự đoán sẽ đạt được trong phiên bản 4.0

source: Research trace
fr: Trace de recherche
tr: Araştırma izi
vi: Nghiên cứu truy vết

source: The consensus solution used in CasperLabs blockchain is a latest achievement of a research path that can be traced back to the 1980’s. Important milestones on this path are:
fr: La solution de consensus utilisée dans la blockchain de CasperLabs est la dernière réalisation de longues recherches qui remontent aux années 1980. Les étapes importantes de ce parcours sont les suivantes :
tr: CasperLabs blokzincirde kullanılan mutabakat çözümü, 1980'lere kadar izlenebilen bir araştırma yolunun en son başarısıdır. Bu yoldaki önemli kilometre taşları şunlardır:
vi: Giải pháp đồng thuận được sử dụng trong chuỗi khối CasperLabs là thành tựu mới nhất của một lộ trình nghiên cứu có thể bắt nguồn từ những năm 1980. Các mốc quan trọng trên con đường này là:

source: 1980: The problem of byzantine consensus defined (Lamport, Shostak)
fr: 1980 : Définition du problème du consensus byzantin (Lamport, Shostak)
tr: 1980: Byzantine mutabakatı sorunu tanımlandı (Lamport, Shostak)
vi: 1980: Xác định vấn đề của sự đồng thuận byzantine (Lamport, Shostak)

source: 1985: Impossibility of distributed consensus with one faulty process theorem (Fischer, Lynch, Paterson)
tr: 1985: Tek bir hatalı süreç teoremi ile dağıtılmış mutabakatın imkansızlığı (Fischer, Lynch, Paterson)
vi: 1985: Không thể đạt được sự đồng thuận phân tán với một lý thuyết quy trình lỗi (Fischer, Lynch, Paterson)

source: 1997: Proof-of-Work invented (Hashcash system)
fr: 1997: Proof-of-Work inventé (Hashcash system)
tr: 1997: İş Kanıtı icat edildi (Hashcash sistemi)
vi: 1997: Phát minh Proof-of-Work (Hệ thống Hashcash)

source: 1999: “Practical Byzantine Fault Tolerance” (PBFT) algorithm (Castro, Liskov)
fr: 1999: algorithm “Practical Byzantine Fault Tolerance” (PBFT) (Castro, Liskov)
tr: 1999: “Pratik Byzantine Hata Toleransı” (PBFT) algoritması (Castro, Liskov)
vi: 1999: Thuật toán “Practical Byzantine Fault Tolerance” (PBFT) (Castro, Liskov)

source: 2008: Bitcoin invented (Satoshi Nakamoto)
fr: 2008: Invention du Bitcoin (Satoshi Nakamoto)
tr: 2008: Bitcoin icat edildi (Satoshi Nakamoto)
vi: 2008: Phát minh ra Bitcoin (Satoshi Nakamoto)

source: 2012: First proof-of-stake cryptocurrency system created (Peercoin system)
fr: 2012: Création du premier système de crypto-monnaie à preuve d'enjeu POS(système Peercoin)
tr: 2012: İlk hisse kanıtı kripto para birimi sistemi oluşturuldu (Peercoin sistemi)
vi: 2012: Hệ thống tiền điện tử bằng chứng cổ phần đầu tiên được tạo (hệ thống Peercoin)

source: 2013: Ethereum invented - cryptocurrency idea generalized to a decentralized general-purpose computing platform (Vitalik Buterin)
fr: 2013: L'invention d'Ethereum - l'idée de la crypto-monnaie est généralisée à une plateforme informatique décentralisée et polyvalente (Vitalik Buterin).
tr: 2013: Ethereum icat edildi - merkezi olmayan genel amaçlı bir bilgi işlem platformuna genelleştirilmiş kripto para birimi fikri (Vitalik Buterin)
vi: 2013: Phát minh ra Ethereum - ý tưởng tiền điện tử được khái quát hóa thành một nền tảng máy tính có mục đích chung là phi tập trung (Vitalik Buterin)

source: 2013: “Greedy Heaviest Observed Subtree” (GHOST) algorithm introduced (Sompolinsky, Zohar)
fr: 2013: Introduction de l'algorithme (GHOST) “Greedy Heaviest Observed Subtree” (Sompolinsky, Zohar)
tr: 2013: “Greedy Heaviest Observed Subtree” (GHOST) algoritması tanıtıldı (Sompolinsky, Zohar)
vi: 2013: Giới thiệu thuật toán “Greedy Heaviest Observed Subtree” (GHOST) (Sompolinsky, Zohar)

source: 2015: Blockchain idea extended to “block DAG” - “Inclusive Block Chain Protocols” (Lewenberg, Sompolinsky, Zohar)
fr: 2015: L'idée de la blockchain étendue à “block DAG” - “Inclusive Block Chain Protocols” (Lewenberg, Sompolinsky, Zohar)
tr: 2015: Blokzincir fikri “blok DAG” - “Kapsayıcı Blok Zincir Protokolleri” (Lewenberg, Sompolinsky, Zohar) olarak genişletildi
vi: 2015: Ý tưởng chuỗi khối được mở rộng thành “block DAG” - “Inclusive Block Chain Protocols” (Lewenberg, Sompolinsky, Zohar)

source: 2017: First draft version of Casper protocol spec published (Ethereum research group, Vlad Zamfir)
fr: 2017: Publication de la première version de la spécification du protocole Casper (groupe de recherche Ethereum, Vlad Zamfir)
tr: 2017: Casper protokol spesifikasyonunun ilk taslak versiyonu yayımlandı (Ethereum araştırma grubu, Vlad Zamfir)
vi: 2017: Xuất bản phiên bản nháp đầu tiên của thông số kỹ thuật giao thức Casper (Nhóm nghiên cứu Ethereum, Vlad Zamfir)

source: Jul 2018: First implementation of proof-of-stake blockchain built on Casper-GHOST-Blockdag combination attempted
fr: Jul 2018: Première mise en œuvre d'une blockchain de type proof-of-stake construite sur la combinaison Casper-GHOST-Blockdag.d
tr: Temmuz 2018: Casper-GHOST-Blockdag kombinasyonu üzerine kurulu hisse kanıtı blokzincirin ilk uygulaması denendi
vi: Tháng 6 năm 2018: Đã thử triển khai lần đầu tiên chuỗi khối bằng chứng cổ phần được xây dựng trên tổ hợp Casper-GHOST-Blockdag

source: Dec 2018: CBC Casper protocol 1.0 specification (Ethereum research group, Vlad Zamfir)
tr: Aralık 2018: CBC Casper protokolü 1.0 belirtimi (Ethereum araştırma grubu, Vlad Zamfir)
vi: Tháng 12 năm 2018: Đặc tả giao thức CBC Casper 1.0 (Nhóm nghiên cứu Ethereum, Vlad Zamfir)

source: Sep 2019: Highway Protocol (Daniel Kane, Vlad Zamfir, Andreas Fackler)
tr: Eylül 2019: Highway Protokolü (Daniel Kane, Vlad Zamfir, Andreas Fackler)
vi: Tháng 9 năm 2019: Giao thức Highway (Daniel Kane, Vlad Zamfir, Andreas Fackler)
