Repository: casper-network/docs-archive
Catalog: locale/*/LC_MESSAGES/theory/naive-blockchain.po
Languages: fr, tr, vi

source: **equivocators** = empty set
tr: **equivocators** = boş küme
vi: **equivocators** = thiết lập là trống

source: current finality detector instance = new instance (according to configured type of finality detector to be used)
fr: instance actuelle du détecteur de finalité = nouvelle instance (selon le type configuré de détecteur de finalité à utiliser)
tr: mevcut kesinlik algılayıcı örneği = yeni örnek (kullanılacak yapılandırılmış kesinlik algılayıcı tipine göre)
vi: phiên bản của bộ dò độ cuối cùng hiện tại = phiên bản mới (theo loại bộ dò độ cuối cùng được cấu hình sẽ được sử dụng)

source: **LFB** = empty sequence
tr: **LFB** = boş sıra
vi: **LFB** = chuỗi trống

source: **initial-players** = one element sequence, with the single element being the set of ids of validators bonded at Genesis
fr: **initial-players** = une séquence d'un élément, l'élément unique étant l'ensemble des ids des validateurs liés à Genesis
tr: **initial-players** = tek eleman Genesis'e bağlı doğrulayıcıların kimlikleri kümesi olmak üzere, tek öge dizisi
vi: **initial-players** = một chuỗi phần tử, với phần tử duy nhất là tập hợp id của nhà xác thực được cổ phần tại Genesis

source: **excluded-players** = one element sequence, with the single element being the empty set
fr: **excluded-players** = une séquence d'un élément, dont l'élément unique est l'ensemble vide
tr: **excluded-players** = tek eleman boş küme olmak üzere, tek öge dizisi
vi: **excluded-players** = một chuỗi phần tử, với phần tử duy nhất là tập hợp rỗng

source: Behaviour - the general plan
fr: Comportement - le plan général
tr: Davranış - genel plan
vi: Hành vi - kế hoạch chung

source: The operation of a finalizer can be decomposed as the following, partially independent activities:
fr: Le fonctionnement d'un finalisateur peut être décomposé en plusieurs activités partiellement indépendantes :
tr: Kesinleştiricinin çalışması aşağıdaki şekilde kısmen bağımsız aktiviteler olarak parçalara ayrılabilir:
vi: Hoạt động của trình hoàn thiện có thể được phân tách thành các hoạt động sau đây, độc lập một phần:

source: Maintaining equivocators collection corresponding to current protocol state.
fr: Maintien de la collection d'équivoques correspondant à l'état actuel du protocole.
tr: Şu anki protokol durumuna karşılık çelişkililer toplamını korumak.
vi: Duy trì tập hợp tương ứng với trạng thái giao thức hiện tại.

source: Building the **LFB** chain
fr: Construire la chaîne **LFB**
tr: **LFB** zincirini inşa etmek
vi: Xây dựng chuỗi **LFB**

source: Propagating **LFB** chain finality via secondary parents (indirect finalization).
fr: Propagation de la finalité de la chaîne **LFB** via les parents secondaires (finalisation indirecte).
tr: **LFB** zinciri kesinliğinin ikincil üst ögeler aracılığıyla yayılması (dolaylı kesinleştirme).
vi: Gửi đi **LFB** cuối cùng của chuỗi thông qua lớp thứ cấp (hoàn thiện gián tiếp).

source: Monitoring old games in **LFB** chain for the possibility of equivocation catastrophe.
fr: Surveillance des jeux anciens dans la chaîne **LFB** pour la possibilité d'une catastrophe de l'équivoque.
tr: Çelişkili davranış felaketi olasılığı için **LFB** zincirindeki eski oyunların izlenmesi.
vi: Theo dõi các trò chơi cũ trong chuỗi **LFB** để biết khả năng xảy ra lỗi tương đương.

source: Reacting to equivocation catastrophe (by recalculating the **LFB** chain).
fr: Réagir à la catastrophe d'equivocation (en recalculant la chaîne **LFB**).
tr: Çelişkili davranış felaketine tepki vermek (**LFB** zincirini tekrar hesaplayarak).
vi: Phản ứng với lỗi tương đương (bằng cách tính toán lại chuỗi **LFB**).

source: Publishing the stream of finalized blocks (over some streaming API) - this includes possibly also maintaining the collection of subscribers.
fr: Publier le flux de blocs finalisés (via une streaming API), ce qui inclut éventuellement la gestion de la collection d'abonnés.
tr: Kesinleşmiş blokların akışını yayınlamak (bazı akış API'ları üzerinden) - buna muhtemelen abone koleksiyonunun korunması da dahildir.
vi: Công bố luồng các khối đã hoàn thiện (qua một số API phát trực tuyến) - điều này có thể bao gồm cả việc duy trì tập hợp người đăng ký.

source: LFB chain
fr: Chaîne LFB
tr: LFB zinciri
vi: Chuỗi LFB

source: **LFB(i)** is supposed to be the “i-th last finalized block”. **LFB** chain is achieved in the following way:
fr: **LFB(i)** est censé être le "i-ème dernier bloc finalisé". La chaîne **LFB** est réalisée de la manière suivante :
tr: **LFB(i)** “i-inci son kesinleşmiş blok” manasına gelmektedir. **LFB** zinciri şu şekilde elde edilir:
vi: **LFB(i)** được cho là “khối được hoàn thiện cuối cùng thứ i”. Chuỗi **LFB** đạt được theo cách sau:

source: Take **LFB(0) = Genesis**
fr: Soit **LFB(0) = Genesis**
tr: **LFB(0) = Genesis** olarak al
vi: Lấy **LFB(0) = Genesis**

source: Let’s assume that LFB(m) is the last-so-far element of the chain. So in other words, it is the last finalized block.
fr: Supposons que LFB(m) soit le dernier élément de la chaîne jusqu'à présent. En d'autres termes, il s'agit du dernier bloc finalisé.
tr: LFB(m)'nin zincirin şimdiye kadarki son elemanı olduğunu varsayalım. Yani başka bir deyişle, son kesinleşmiş bloktur.
vi: Giả sử rằng LFB(m) là phần tử cuối cùng cho đến nay của chuỗi. Vì vậy, nói cách khác, nó là khối được hoàn thiện cuối cùng.

source: For deciding which main-tree child of LFB(m) should be taken as LFB(m+1) we need to start a new empty instance of finality detector.
fr: Pour décider quel enfant de l'arbre principal de LFB(m) doit être pris comme LFB(m+1), nous devons commencer une nouvelle instance vide du détecteur de finalité.
tr: LFB(m)'nin hangi ana ağaç alt öğesinin LFB(m+1) olarak alınması gerektiğine karar vermek için yeni bir boş kesinlik algılayıcı örneği başlatmamız gerekir.
vi: Để quyết định con của cây chính nào của LFB(m) nên được coi là LFB(m+1), chúng ta cần bắt đầu một phiên trống mới của bộ cuối cùng.

source: **initial-players(m)** = validators staked at post-state of **m**, excluding current contents of **equivocators**
fr: **initial-players(m)** = validateurs mis en enjeu (staked) au post-state de **m**, en excluant le contenu actuel de **equivocators**
tr: **çelişkililer**in şu anki içeriğini hariç tutarak, **initial-players(m)** = **m**'in durum sonrasında stake edilen doğrulayıcıları
vi: **initial-players(m)** = trình xác thực đặt cọc ở hậu trạng thái **m**, loại trừ nội dung hiện tại của **sự không rõ ràng**

source: **excluded-players(m)** = empty set
fr: **excluded-players(m)** = ensemble vide
tr: **excluded-players(m)** = boş küme
vi: **excluded-players(m)** = đặt là trống

source: Finality detector observes the LFB(m)-game, with:
fr: Le détecteur de finalité observe le jeu LFB(m)-game, avec :
tr: Kesinlik algılayıcı LFB(m)-game'i şununla gözlemler:
vi: Bộ dò cuối cùng quan sát trò chơi LFB (m), với:

source: game-level acknowledgement level **K** same as defined by parameters of this finalizer
fr: niveau de reconnaissance du jeu **K** identique à celui défini par les paramètres de ce finalisateur
tr: oyun seviyesi onay seviyesi **K** bu kesinleştiricinin parametreleri tarafından tanımlananla aynı
vi: mức xác nhận cấp trò chơi **K** giống như được xác định bởi các thông số của trình hoàn thiện này

source: **FTT(m) = ceiling(WP \* total-weight(post-state of m))**, where \**ceiling(_)*\* is integer rounding towards positive infinity.
fr: **FTT(m) = ceiling(WP \* total-weight(post-state of m))**, où \**ceiling(_)*\* est un arrondi entier vers l'infini positif.
tr: **FTT(m) = ceiling(WP \* total-weight(post-state of m))**, ki burada \**ceiling(_)*\* pozitif sonsuza doğru yuvarlanan tam sayıdır.
vi: **FTT(m) = ceiling(WP \* total-weight(post-state of m))**, khi \**ceiling(_)*\* là số nguyên làm tròn về phía dương vô cùng.

source: Once **LFB(m)**-game reaches finality, the next element of **LFB** chain is established.
fr: Une fois que le jeu **LFB(m)** atteint sa finalité, l'élément suivant de la chaîne **LFB** est établi.
tr: **LFB(m)**-game sona erdiğinde, **LFB** zincirinin bir sonraki öğesi kurulur.
vi: Sau khi **LFB (m)** - trò chơi đạt đến kết quả cuối cùng, phần tử tiếp theo của chuỗi **LFB** được thiết lập.

source: Indirect finalization
fr: Finalisation indirecte
tr: Dolaylı kesinleştirme
vi: Hoàn thiện gián tiếp

source: Once **LFB(m)** is established, we consider the whole **p-past-cone(LFB(m))** as finalized.
fr: Une fois que **LFB(m)** est établi, nous considérons l'ensemble de **p-past-cone(LFB(m))** comme finalisé.
tr: **LFB(m)** kurulduğunda, tüm **p-past-cone(LFB(m))** 'nin kesinleştiğini düşünürüz.
vi: Sau khi **LFB (m)** được thiết lập, chúng tôi coi toàn bộ **p-past-cone(LFB(m))** đã được hoàn thiện.

source: Equivocation catastrophe
tr: Çelişkili davranış felaketi
vi: Lỗi không rõ ràng

source: For any **LFB(m)**, the **LFB(m)-game** may “crash” by total weight of equivocators exceeding **FTT(m)**. Such situation we call **the equivocation catastrophe**.
fr: Pour tout **LFB(m)**, le **LFB(m)-game** peut "s'effondrer" si le poids total des équivocateurs dépasse **FTT(m)**. Une telle situation est appelée **la catastrophe de l'équivoque**.
tr: Herhangi bir **LFB(m)** için, **LFB(m)-game**, çelişkililerin **FTT(m)**'yi aşması ile "çökebilir". Bu duruma **çelişkili davranış felaketi** diyoruz.
vi: Đối với bất kỳ **LFB (m)** nào, trò chơi **LFB(m)** có thể "sập" do tổng trọng số của sự không rõ ràng vượt quá **FTT(m)**. Tình huống như vậy chúng tôi gọi là **lỗi không rõ ràng**.

source: Discovery of equivocation catastrophe works as follows. -- Whenever a new message **m** is added to a local blockdag, the following handling is done by the finalizer:
fr: La découverte de la catastrophe d'équivoque fonctionne comme suit. -- Chaque fois qu'un nouveau message **m** est ajouté à un blockdag local, la manipulation suivante est effectuée par le finalisateur :
tr: Çelişkili davranış felaketinin keşfi aşağıdaki gibi çalışır. -- Yerel bir blockdag'e yeni bir **m** mesajı eklendiğinde, kesinleştirici tarafından aşağıdaki işlemler yapılır:
vi: Việc phát hiện ra lỗi không rõ ràng hoạt động như sau. - Bất cứ khi nào một thông điệp mới **m** được thêm vào một blockdag cục bộ, việc xử lý sau sẽ được thực hiện bởi trình hoàn thiện:

source: If **m.creator** is already included in **equivocators** collection - do nothing.
fr: Si **m.creator** est déjà inclus dans la collection **equivocators** - ne rien faire.
tr: Eğer **m.creator**, zaten **çelişkililer* toplamında dahil ise - hiçbirşey yapma.
vi: Nếu **m.creator** đã được đưa vào tập hợp **không rõ ràng** - không làm gì cả.

source: Otherwise - check if m is not introducing a new equivocation. If yes - add **m.creator** to equivocators and:
fr: Sinon - vérifier si m n'introduit pas une nouvelle équivoque. Si oui - ajouter **m.creator** aux equivocators et :
tr: Değilse - m'in yeni bir çelişkili davranış getirmediğini kontrol et. Eğer cevap evet ise - **m.creator**'u çelişkililere ekle ve:
vi: Nếu không - hãy kiểm tra xem nếu m không giới thiệu một sự không rõ ràng mới. Nếu có - hãy thêm **m.creator** vào tập không rõ ràng và:

source: for every i such that m \in initial-players(i):
fr: pour chaque i tel que m \in initial-players(i) :
tr: m \in initial-players(i) şeklindeki her bir i için:
vi: đối với mỗi i như m \in initial-players(i):

source: add m to **excluded-players(i)**
fr: ajouter m à **excluded-players(i)**
tr: m'i **excluded-players(i)**'a ekle
vi: thêm m vào **excluded-players(i)**

source: using weights map from **LFB(i)** post-state, check if total weight of **excluded-players(i)** exceeds **FTT(i)**
fr: en utilisant la map des poids de **LFB(i)** post-state, vérifier si le poids total de **excluded-players(i)** dépasse **FTT(i)**.
tr: **LFB(i)** durum sonrasından ağırlık eşleştirmelerini kullanarak, **excluded-players(i)**'ın ağırlığının **FTT(i)**'ı aşıp aşmadığını kontrol et
vi: sử dụng bản đồ trọng số từ **LFB(i)** hậu trạng thái, kiểm tra xem tổng trọng số của **excluded-players(i)** có vượt quá **FTT(i)** không

source: if for some **LFB(i)** exceeding **FTT(i)** case happened - take the smallest such **i** - we will call the block **LFB(i)** **the catastrophic point**
fr: si pour un certain **LFB(i)** le cas de dépassement de **FTT(i)** s'est produit - prendre le plus petit de ces **i** - nous appellerons le bloc **LFB(i)** **le point catastrophique**.
tr: Eğer bazı **LFB(i)**'lar için **FTT(i)**'ı aşma durumu gerçekleşti ise - **i** için en düşüğü al - **LFB(i)** bloğuna **felaket noktası** diyeceğiz
vi: nếu đối với một số trường hợp **LFB(i)** vượt quá **FTT(i)** - hãy lấy **i** nhỏ nhất như vậy - chúng tôi sẽ gọi khối **LFB(i)** ** là lỗi điểm**

source: Once an equivocation catastrophe is discovered, the following handling must be applied:
fr: Une fois qu'une catastrophe d'équivoque est découverte, le traitement suivant doit être appliqué :
tr: Bir çelişkili davranış felaketi keşfedildiğinde, aşağıdaki işlem uygulanmalıdır:
vi: Sau khi phát hiện ra lỗi không rõ ràng, phải áp dụng các biện pháp xử lý sau:

source: Starting from the catastrophic point, re-calculate the **LFB chain** (initializing initial players accordingly to current contents of **equivocators**).
fr: En partant du point catastrophique, recalculez la **chaîne LFB** (en initialisant les joueurs initiaux en fonction du contenu actuel des **equivocators**).
tr: Felaket noktasından başlayarak, **LFB zincirini** yeniden hesapla (ilk oyuncuları mevcut **çelişkililer**in içeriğine göre başlatarak).
vi: Bắt đầu từ lỗi điểm, hãy tính toán lại **chuỗi LFB** (khởi chạy trình phát ban đầu tương ứng với nội dung hiện tại của **sự không rõ ràng**).

source: 2. Find the first **i** such that the new LFB-chain differs from old LFB chain at index **i**. Usually such **i** will be bigger than the catastrophic point. 2. Publish a rollback event at the level of external API. 4. Publish re-calculated LFB stream, starting from first difference.
fr: 1. Trouver le premier **i** tel que la nouvelle chaîne LFB diffère de l'ancienne chaîne LFB à l'indice **i**. Habituellement, cet **i** sera plus grand que le point catastrophique. 3. Publier un événement de retour en arrière au niveau de l'API externe. 4. Publier le flux LFB recalculé, en commençant par la première différence.
tr: 2. Yeni LFB zincirinin **i** dizininde eski LFB zincirinden farklı olacağı şekilde ilk **i**'yi bul. Genellikle böyle bir **i** felaket noktasından daha büyük olacaktır. 2. Harici API düzeyinde bir geri alma olayı yayınla. 4. İlk farktan başlayarak yeniden hesaplanan LFB akışını yayınla.
vi: 2. Tìm **i** đầu tiên sao cho chuỗi LFB mới khác với chuỗi LFB cũ ở chỉ mục **i**. Thường thì **i** như vậy sẽ lớn hơn lỗi điểm. 2. Xuất bản sự kiện khôi phục ở cấp API bên ngoài. 4. Xuất bản luồng LFB được tính toán lại, bắt đầu từ điểm khác biệt đầu tiên.

source: External API of a finalizer
fr: API externe d'un finalisateur
tr: Kesinleştiricinin harici API'ı
vi: API bên ngoài của trình hoàn thiện

source: The API should be stream-based. The decision on the actual streaming technology to use is beyond the scope of this specification.
fr: L'API doit être basée sur le streaming. La décision concernant la technologie de streaming à utiliser dépasse le cadre de cette spécification
tr: API akış tabanlı olmalıdır. Kullanılacak gerçek akış teknolojisinin kararı bu spesifikasyonun kapsamı dışındadır.
vi: API phải dựa trên luồng. Quyết định về công nghệ phát trực tuyến thực sự được sử dụng nằm ngoài phạm vi của tài liệu kỹ thuật này.

source: We only assume that:
fr: Nous supposons seulement que :
tr: Sadece şunu varsayıyoruz:
vi: Chúng tôi chỉ giả định rằng:

source: external software components may subscribe to the API (to be notified
fr: des composants logiciels externes peuvent s'abonner à l'API (pour être notifiés
tr: harici yazılım bileşenleri API'ye abone olabilir (bildirilecek
vi: các thành phần phần mềm bên ngoài có thể đăng ký API (để được thông báo

source: subscribed observers may unsubscribe
fr: les observateurs abonnés peuvent se désabonner
tr: abone olan gözlemciler abonelikten çıkabilir
vi: những người quan sát đã đăng ký có thể hủy đăng ký

source: what a subscribed observer receives is a sequence of events
fr: ce qu'un observateur inscrit reçoit est une séquence d'événements
tr: abone olmuş bir gözlemcinin aldığı şey bir dizi olaydır
vi: những gì một người quan sát đã đăng ký nhận được là một chuỗi các sự kiện

source: **Events:**
tr: **Olaylar:**
vi: **Sự kiện:**

source: Event type
tr: Olay türü
vi: Kiểu sự kiện

source: Contents
tr: İçerik
vi: Ngữ cảnh

source: Semantics
tr: Semantik
vi: Ngữ nghĩa

source: event idLFB(i).idisequence of indirectly finalized blocks
fr: événement idLFB(i).idisequence de blocs indirectement finalisés
tr: Dolaylı olarak kesinleşmiş blokların idLFB(i).idisequence olayı
vi: sự kiện idLFB(i).idisequence của các khối được hoàn thiện gián tiếp

source: published as soon as **LFB(i)** is finalized
fr: publié dès la finalisation de **LFB(i)**.
tr: **LFB(i)** kesinleştiği gibi yayınlanır
vi: xuất bản ngay sau khi **LFB(i)** được hoàn thiện

source: CATASTROPHY
tr: FELAKET

source: event idsequence id of catastrophy point
fr: idsequence de l'événement id du point de catastrophe
tr: felaket noktasının idsequence kimlik olayı
vi: sự kiện id idsequence của lỗi điểm (catastrophy point)

source: signal that equivocation catastrophe happened
fr: signal que la catastrophe de l'équivoque s'est produite
tr: çelişkili davranış felaketinin gerçekleştiğine dair sinyal
vi: báo hiệu rằng lỗi không rõ ràng đã xảy ra

source: Event
tr: Olay
vi: Sự kiện

source: Current snapshot of LFB chain
fr: Snapshot actuel de la chaîne LFB
tr: LFB zincirinin şu anki anlık görüntüsü
vi: Ảnh chụp nhanh hiện tại của chuỗi LFB

source: Fork choice
vi: Lựa chọn nhánh
