Repository: casper-network/docs-archive
Catalog: locale/*/LC_MESSAGES/theory/naive-blockchain.po
Languages: fr, tr, vi

source: Large investment (=money) is needed to revert/overtake the history of transactions using honest means.
fr: Un investissement important (= de l'argent) est nécessaire pour revenir sur l'histoire des transactions effectuées par des moyens honnêtes.
tr: Dürüst araçlar kullanarak işlemlerin geçmişini geri almak/ele geçirmek için büyük yatırım (=para) gereklidir.
vi: Đầu tư lớn (= tiền) là cần thiết để hoàn lại/theo kịp lịch sử của các giao dịch bằng cách sử dụng các khái niệm trung thực.

source: Malicious behavior (= hacking) implies that the stake will get slashed.
fr: Un comportement malveillant (= piratage) implique un slashing.
tr: Kötü niyetli davranış (= hackleme), hissenin kesileceği anlamına gelir.
vi: Hành vi độc hại (= hack) ngụ ý rằng tiền đặt cược sẽ bị cắt.

source: Therefore, we would like only bonded validators to be able to participate in blockchain evolution. The problem here is that - when a validator unbonds, some of the **b-games** he was a player of might not be completed (= finalized) yet. We would like to allow the validator to still participate in these games while not allowing him to join new games. This is where ballots come into play. Ballots make it possible for a validator that is no longer bonded to continue the consensus game.
fr: Par conséquent, nous aimerions que seuls les validateurs cautionnés (bonded) puissent participer à l'évolution de la blockchain. Le problème ici est que, lorsqu'un validateur se désengage (unbonds), certains des **b-games** auxquels il a participé peuvent ne pas être terminés (= finalisés). Nous aimerions permettre au validateur de continuer à participer à ces jeux tout en lui interdisant de rejoindre de nouveaux jeux. C'est là que les bulletins de vote (ballots) entrent en jeu. Les bulletins permettent à un validateur qui n'est plus lié de continuer le jeu de consensus.
tr: Bu nedenle, blokzincir evrimine yalnızca bağlı doğrulayıcıların katılabilmesini istiyoruz. Buradaki sorun şu ki - bir doğrulayıcı çözüldüğünde, oyuncusu olduğu bazı **b-oyunları** henüz tamamlanmamış (= kesinleşmemiş) olabilir. Doğrulayıcının yeni oyunlara katılmasına izin vermeden bu oyunlara katılmaya devam etmesine izin vermek istiyoruz. İşte burada oy pusulaları devreye giriyor. Oy pusulaları, artık bağlı olmayan bir doğrulayıcının mutabakat oyununa devam etmesini mümkün kılar.
vi: Do đó, chúng tôi chỉ muốn các nhà xác thực đã cổ phần có thể tham gia vào quá trình phát triển blockchain. Vấn đề ở đây là - khi nhà xác thực hủy cổ phần, một số **b-games** mà anh ta là người chơi có thể chưa hoàn thành (= finalized). Chúng tôi muốn cho phép nhà xác thực vẫn tham gia các trò chơi này trong khi không cho phép người đó tham gia các trò chơi mới. Đây là lúc phiếu bầu phát huy tác dụng. Các lá phiếu giúp nhà xác nhận không còn cổ phần có thể tiếp tục trò chơi đồng thuận.

source: Merging of histories
fr: Fusion des historiques
tr: Geçmişlerin birleştirilmesi
vi: Hợp nhất lịch sử

source: Topological sortings of p-past-cone
fr: Triages topologiques de p-past-cone
tr: p-past-cone topolojik sıralamaları
vi: Sắp xếp topo của p-past-cone

source: This is a previous example of a blockdag, reduced to **p-dag** only:
fr: C'est un exemple précédent de blockdag, réduit à **p-dag** seulement :
tr: Bu, yalnızca **p-dag**'a indirgenmiş önceki bir blockdag örneğidir:
vi: Đây là ví dụ trước đây về blockdag, được giảm xuống chỉ là **p-dag**:

source: We define **p-past-cone(b)** as the set of all blocks :math:`x` such that :math:`x \leqslant b` (in the POSET corresponding to p-dag, :math:`x \leqslant y \iff y \rightarrow x`).
fr: Nous définissons **p-past-cone(b)** comme l'ensemble de tous les blocs :math:`x` tels que :math:`x \leqslant b` (dans le POSET correspondant à p-dag, :math:`x \leqslant y \iff y \rightarrow x`).
tr: **p-past-cone(b)**'yi tüm :math:`x` blokların kümesi olarak tanımlarız, öyle ki :math:`x \leqslant b` (p-dag'a karşılık gelen POSET'te :math: `x \leqslant y \iff y \rightarrow x`).
vi: Chúng tôi định nghĩa **p-past-cone(b)** là tập hợp tất cả các khối :math:`x` sao cho :math:`x \leqslant b` (trong POSET tương ứng với p-dag, :math:`x \leqslant y \iff y \rightarrow x`).

source: **Example:** Let’s look at the block :math:`3`. Its p-past-cone is :math:`\{Genesis, 1, 2, 3\}`. Let’s look at the block :math:`9`. Its p-past-cone is :math:`\{Genesis, 1,2,3,4,5,9\}`.
fr: **Exemple:** Regardons le bloc :math:`3`. Son p-past-cone est :math:`\{Genesis, 1, 2, 3\}`. Observons le bloc :math:`9`. Son p-past-cone est :math:`{Genesis, 1,2,3,4,5,9\}`.
tr: **Örnek:** Blok :math:`3` 'e bakalım. p-past-cone değeri :math:`\{Genesis, 1, 2, 3\}` şeklindedir. Block :math:`9` 'a bakalım. p-past-cone değeri :math:`\{Genesis, 1,2,3,4,5,9\}` şeklindedir.
vi: **Ví dụ:** Hãy nhìn vào khối :math:`3`. p-past-cone của nó là :math:`\{Genesis, 1, 2, 3\}`. Chúng ta hãy nhìn vào khối :math:`9`. p-past-cone của nó là :math:`\{Genesis, 1,2,3,4,5,9\}`.

source: Of course, any **p-past-cone(b)** inherits the order from the whole **p-dag**, so it can be seen as a POSET as well.
fr: Bien sûr, tout **p-past-cone(b)** hérite de l'ordre de l'ensemble du **p-dag**, il peut donc être considéré comme un POSET également.
tr: Elbette, herhangi bir **p-past-cone(b)**, sırayı tüm **p-dag**'dan devralır, dolayısıyla bir POSET olarak da görülebilir.
vi: Tất nhiên, bất kỳ **p-past-cone (b)** nào cũng kế thừa thứ tự từ toàn bộ **p-dag**, vì vậy nó cũng có thể được xem như một POSET.

source: For :math:`\langle A,R\rangle` any POSET, topological sorting of :math:`\langle A,R\rangle` is any linear order :math:`\langle A,T\rangle` such that :math:`identity: \langle A,R\rangle \rightarrow \langle A,T\rangle` is monotonic. In other words, topological sorting is converting a POSET into a total order in a way that preserves the original order. For a given POSET, this can usually be done in many ways.
fr: Pour :math:`\langle A,R\rangle` tout POSET, le tri topologique de :math:`\langle A,R\rangle` est tout ordre linéaire :math:`\langle A,T\rangle` tel que :math:`identité : \langle A,R\rangle \rightarrow \langle A,T\rangle` est monotone. En d'autres termes, le tri topologique consiste à convertir un POSET en un ordre total d'une manière qui préserve l'ordre initial. Pour un POSET donné, cela peut généralement être fait de plusieurs façons.
tr: :math:`\langle A,R\rangle` için herhangi bir POSET, :math:`\langle A,R\rangle` 'nin topolojik sıralaması, :math:`identity: \langle A,R\rangle \rightarrow \langle A,T\rangle` 'nin monoton olduğu herhangi bir doğrusal sıralama :math:`\langle A,T\rangle` 'dir. Diğer bir deyişle, topolojik sıralama, bir POSET'i, orjiinal sıralamanın bir şekilde korunduğu, toplam sıralamaya dönüştürmektedir. Verilen bir POSET için bu genellikle pek çok yolla yapılabilir.
vi: Đối với :math:`\langle A,R\rangle` bất kỳ POSET nào, sắp xếp topological của :math:`\langle A,R\rangle` là bất kỳ thứ tự tuyến tính nào :math:`\langle A,T\rangle` sao cho :math:`identity: \langle A,R\rangle \rightarrow \langle A,T\rangle` là đơn. Nói cách khác, sắp xếp topological là chuyển đổi một POSET thành một tổng thứ tự theo cách duy trì thứ tự ban đầu. Đối với một POSET nhất định, điều này thường có thể được thực hiện theo nhiều cách.

source: \ **Example:**\ Let’s take the :math:`p\_past\_cone(3)` from our example. As a POSET it looks like this:
fr: \ **Exemple:**\ Prenons le :math:`p\_past\_cone(3)` de notre exemple. En tant que POSET, il ressemble à ceci :
tr: \ **Örnek:**\ Örneğimizdeki :math:`p\_past\_cone(3)` 'ü alalım. Bir POSET olarak şu şekilde görünecektir:
vi: \ **Example:**\ Hãy lấy :math:`p\_past\_cone(3)` từ ví dụ của chúng ta. Như một POSET, nó trông như thế này:

source: It can be topo-sorted in two ways only:
fr: Il ne peut être topo- trié (topo-sorted) que de deux façons :
tr: Yalnızca iki şekilde topo-sıralanabilir:
vi: Nó chỉ có thể được sắp xếp theo hai cách:

source: Example: Let’s take the p-past-cone(9) from our example. As a POSET it looks like this:
fr: Exemple : Prenons le p-past-cone(9) de notre exemple. En tant que POSET, il ressemble à ceci :
tr: Örnek: Örneğimizden p-past-cone(9)'u alalım. POSET olarak şöyle görünür:
vi: Ví dụ: Hãy lấy p-past-cone (9) từ ví dụ của chúng ta. Như một POSET, nó trông như thế này:

source: It can be topo-sorted in many ways. One such topo-sort is shown below:
fr: Il peut être topo-trié de plusieurs façons. L'une d'entre elles est présentée ci-dessous :
tr: Birçok yönden topo-sıralanabilir. Böyle bir topo-sıralama aşağıda gösterilmiştir:
vi: Nó có thể được sắp xếp theo nhiều cách. Một loại topo như vậy được hiển thị bên dưới:

source: The context of merging problem
fr: Le contexte du problème de la fusion
tr: Birleştirme sorunu bağlamı
vi: Bối cảnh của vấn đề hợp nhất

source: Let’s assume that current p-dag as seen by a validator **v** looks like this:
fr: Supposons que le p-dag actuel tel que vu par un validateur **v** ressemble à ceci :
tr: Bir **v** doğrulayıcısı tarafından görüldüğü şekliyle mevcut p-dag'ın şöyle göründüğünü varsayalım:
vi: Giả sử rằng p-dag hiện tại được nhà xác thực nhìn thấy **v** trông giống như sau:

source: To add a new block :math:`x`, validator :math:`V` needs to decide which blocks to take as parents of :math:`x`. In other words, decide which variants of a transactions history block :math:`x` will continue. Merging is all about defining what it means that **x** continues more than one version of the history:
fr: Pour ajouter un nouveau bloc :math:`x`, le validateur :math:`V` doit décider quels blocs prendre comme parents de :math:`x`. En d'autres termes, il doit décider quelles variantes d'un bloc de l'historique des transactions :math:`x` vont se poursuivre. La fusion consiste à définir ce que signifie le fait que **x** continue plus d'une version de l'historique :
tr: Yeni bir blok :math:`x` eklemek için, doğrulayıcı :math:`V` hangi blokların :math:`x` ögesinin üst ögesi olarak alınacağına karar vermelidir. Başka bir deyişle, bir işlem geçmişi bloğu :math:`x` 'in hangi varyantlarının devam edeceğine karar vermelidir. Birleştirme, **x**'in geçmişin birden fazla versiyonuna devam etmesinin ne anlama geldiğini tanımlamakla ilgilidir:
vi: Để thêm một khối mới :math:`x`, nhà xác thực :math:`V` cần quyết định khối nào sẽ nhận làm lớp trên của: math:`x`. Nói cách khác, hãy quyết định các biến thể của khối lịch sử giao dịch :math:`x` sẽ tiếp tục. Hợp nhất về việc xác định tất cả ý nghĩa của **x** sẽ tiếp tục nhiều hơn một phiên bản của lịch sử:

source: We have blocks 8, 9 and 10 as current tips of p-dag, so they are candidates for becoming parents of the new block. But usually, we won’t be able to take all such tips as parents because the versions of the transactions history they represent are in conflict.
fr: Nous avons les blocs 8, 9 et 10 comme pointes actuelles de p-dag, ils sont donc candidats pour devenir parents du nouveau bloc. Mais généralement, nous ne pourrons pas prendre toutes ces pointes comme parents car les versions de l'historique des transactions qu'ils représentent sont en conflit.
tr: Mevcut p-dag ipuçları olarak 8, 9 ve 10 numaralı bloklarımız var, bu nedenle yeni bloğun üst ögesi olmaya adaylar. Ancak genellikle, temsil ettikleri işlem geçmişinin sürümleri çelişkili olduğundan, üst ögeler olarak bu tür ipuçlarının hepsini alamayacağız.
vi: Chúng tôi có các khối 8, 9 và 10 là các tip hiện tại của p-dag, vì vậy chúng là ứng cử viên để trở thành cha của khối mới. Nhưng thông thường, chúng tôi sẽ không thể áp dụng tất cả các tip đó với tư cách là lớp trên vì các phiên bản lịch sử giao dịch mà họ đại diện xung đột với nhau.

source: Formal definition of merging
fr: Définition formelle de la fusion
tr: Birleştirmenin resmi tanımı
vi: Định nghĩa chính thức về hợp nhất

source: We say that a set of blocks :math:`B = \{b_1, b_2, ..., b_n\}` is **mergeable** (= **not in conflict**) when the following holds:
fr: Nous disons qu'un ensemble de blocs :math:`B = \{b_1, b_2, ..., b_n\}` est **fusionnable** (= **non conflictuel**) lorsque les conditions suivantes sont remplies :
tr: Aşağıdakiler geçerli olduğunda :math:`B = \{b_1, b_2, ..., b_n\}` blok kümesinin **birleştirilebilir** (= **çatışmasız**) olduğunu söyleriz:
vi: Chúng tôi nói rằng một tập hợp các khối :math:`B = \{b_1, b_2, ..., b_n\}` là **có thể hợp nhất** (= **không xung đột**) khi điều sau đây giữ nguyên:

source: take the sum :math:`S` of :math:`p\_past\_cone(b_i)` for :math:`i=1,..., n` - this is a sub-POSET of p-dag
fr: prendre la somme :math:`S` de :math:`p\_past\_cone(b_i)` pour :math:`i=1,..., n` - c'est un sub-POSET de p-dag
tr: :math:`i=1,..., n` için :math:`p\_past\_cone(b_i)`'nin :math:`S` toplamını alın - bu, p-dag'ın alt POSET'idir
vi: lấy tổng :math:`S` của :math:`p\_past\_cone(b_i)` cho :math:` i = 1, ..., n` - đây là một POSET con của p-dag

source: given any topo-sort :math:`T` of :math:`S`
fr: étant donné tout topo-tri :math:`T` de :math:`S`
tr: :math:`S` 'in herhangi bir :math:`T` topo-sıralaması verilir
vi: đã cho bất kỳ sắp xếp topo nào :math:`T` of :math:`S`

source: the execution of transactions in :math:`B` along :math:`T` give:
fr: l'exécution des transactions dans :math:`B` le long de :math:`T` donnent :
tr: :math:`B` ile birlikte :math:`T` içindeki işlemlerin yürütülmesi şunu verir:
vi: việc thực hiện các giao dịch trong :math:`B` cùng :math:`T` cho:

source: the same final global state (regardless of the selection of **T)**
fr: le même état global final (indépendamment de la sélection de **T)**.
tr: aynı nihai küresel durum (**T** seçiminden bağımsız olarak)
vi: cùng một trạng thái toàn cục cuối cùng (không liên quan tập hợp **T)**

source: the same subset of transactions that failed (regardless of the selection of **T**)
fr: le même sous-ensemble de transactions qui ont échoué (indépendamment de la sélection de **T**)
tr: başarısız olan işlemlerin aynı alt kümesi (**T** seçiminden bağımsız olarak)
vi: cùng một tập hợp con các giao dịch không thành công (không liên quan tập hợp **T**)

source: Operation of a validator
fr: Fonctionnement d'un validateur
tr: Doğrulayıcının çalışması
vi: Hoạt động của nhà xác thực

source: The spec is written from the perspective of a validator. We say it as **local validator** in order to reference the validator which is running the algorithm. Let **vid** be the id of the local validator.
fr: La spécification est écrite du point de vue d'un validateur. Nous l'appelons **validateur local** afin de faire référence au validateur qui exécute l'algorithme. Soit **vid** l'identifiant du validateur local.
tr: Belirtim (spesifikasyon), bir doğrulayıcının bakış açısından yazılmıştır. Algoritmayı çalıştıran doğrulayıcıyı belirtmek için **yerel doğrulayıcı** diyoruz. **vid** yerel doğrulayıcının kimliği olsun.
vi: Thông số kỹ thuật được viết từ quan điểm của một nhà xác nhận. Chúng tôi nói nó là **nhà xác thực cục bộ** để tham chiếu tới nhà xác thực đang chạy thuật toán. Đặt **vid** là id của nhà xác thực cục bộ.

source: Validators P2P protocol - messages
fr: Validateurs protocole P2P - messages
tr: Doğrulayıcılar P2P protokolü - mesajlar
vi: Nhà xác thực giao thức P2P - thông điệp

source: Validators exchange messages which can be of 2 types:
fr: Les validateurs échangent des messages qui peuvent être de 2 types :
tr: Doğrulayıcılar, 2 tipte olabilen mesaj alışverişi yapar:
vi: Nhà xác thực trao đổi thông điệp có thể có 2 loại:

source: **blocks**
fr: **blocs**
tr: **bloklar**
vi: **khối (block)**

source: **ballots**
tr: **oy pusulaları**
vi: **phiếu bầu (ballot)**

source: A **block** contains the following data:
fr: Un **bloc** contient les données suivantes :
tr: Bir **blok** aşağıdaki verileri içerir:
vi: Một **khối** chứa dữ liệu sau:

source: **block id**
tr: **blok kimliği**

source: **creator id** (= id of validator that created this block)
fr: **creator id** (= id du validateur qui a créé ce bloc)
tr: **oluşturan kimliği** (=bu bloğu oluşturan doğrulayıcının kimliği)
vi: **creator id** (= id của nhà xác thực tạo khối này)

source: **main parent** (id of another block)
fr: **main parent** (id d'un autre bloc)
tr: **ana üst öge** (bir başka bloğun kimliği)
vi: **main parent** (id của khối khác)

source: **secondary parents** (collection of block ids, may be empty)
fr: **secondary parents** (collection d'identifiants de blocs, peut être vide)
tr: **ikincil ana öge** (blok kimlikleri derlemesi, boş olabilir)
vi: **secondary parents** (tập hợp của id khối, có thể trống)

source: **justifications** (collection of message ids that the creator confirms as seen at the moment of creation of this block; excluding main parent and secondary parents; may be empty)
fr: **justifications** (collection d'identifiants de messages que le créateur confirme avoir vus au moment de la création de ce bloc ; à l'exclusion du parent principal et des parents secondaires ; peut être vide)
tr: **gerekçeler** (bu bloğun oluşturulduğu anda görülen oluşturucunun onayladığı mesaj kimliklerinin toplamı; ana üst öge ve ikincil üst ögeler hariç; boş olabilir)
vi: **justifications** (tập hợp các id thông điệp mà trình tạo xác thực đã thấy tại thời điểm tạo khối này; không bao gồm nhánh chính và nhánh phụ; có thể để trống)

source: **transactions list** (nonempty)
fr: **transactions list** (non vide)
tr: **işlemler listesi** (boş olamaz)
vi: **transactions list** (không trống)

source: **pre-state-hash** - hash of global state that represents state after executing all parents of this block
fr: **pre-state-hash** - hash de l'état global qui représente l'état après l'exécution de tous les parents de ce bloc
tr: **pre-state-hash** - bu bloğun tüm üst öğelerini yürüttükten sonra durumu temsil eden küresel durumun özeti
vi: **pre-state-hash** - băm của trạng thái toàn cục đại diện cho trạng thái sau khi thực thi tất cả các lớp trên của khối này

source: **post-state hash** - hash of global state achieved after executing transactions in this block (and all previous blocks, as implied by p-dag)
fr: **post-state hash** - hash de l'état global obtenu après l'exécution des transactions de ce bloc (et de tous les blocs précédents, comme impliqué par p-dag)
tr: **durum sonrası karma** - bu blokta (ve p-dag tarafından belirtildiği gibi önceki tüm bloklarda) işlemler yürütüldükten sonra elde edilen küresel durumun özet değeri
vi: **post-state hash** - băm của trạng thái toàn cục đạt được sau khi thực hiện các giao dịch trong khối này (và tất cả các khối trước đó, ngụ ý là p-dag)

source: For a block :math:`b` we define the collection :math:`b.all\_justifications` as main parent + secondary parents + justifications. This collection is always non-empty because **main parent** is a mandatory field.
fr: Pour un bloc :math:`b`, nous définissons la collection :math:`b.all\_justifications` comme parent principal + parents secondaires + justifications. Cette collection est toujours non vide car le **parent principal** est un champ obligatoire.
tr: Bir :math:`b` bloğu için, :math:`b.all\_justifications` toplamını ana üst öge + ikincil üst ögeler + gerekçeler olarak tanımlarız. Bu toplam her zaman boş olmayan kümedir çünkü **ana üst öge** zorunlu bir alandır.
vi: Đối với một khối :math:`b` chúng tôi xác định bộ sưu tập :math:`b.all\_justifications` là nhánh trên chính + nhánh phụ + biện minh. Bộ sưu tập này luôn không trống vì **nhánh chính** là trường bắt buộc.

source: A **ballot** contains the following data:
fr: Un **ballot** contient les données suivantes :
tr: Bir **oy pusulası** şu verileri içerir:
vi: **Phiếu bầu** chứa dữ liệu sau:

source: **creator id** (= id of validator that created this ballot)
fr: **creator id** (= id du validateur qui a créé ce bulletin)
tr: **oluşturan kimliği** (=bu oy pusulasını oluşturan doğrulayıcının kimliği)
vi: **creator id** (= id của nhà xác thực phiếu bầu này)

source: **target block** (id of a block)
fr: **target block** (id d'un bloc)
tr: **hedef blok** (bir bloğun kimliği)
vi: **target block** (id khối)

source: **justifications** (collection of message ids that the creator confirms as seen at the moment of creation of this ballot, excluding the target block; may be empty)
fr: **justifications** (collection d'identifiants de messages que le créateur confirme avoir vus au moment de la création de ce bulletin, à l'exclusion du bloc cible 'target block' ; peut être vide)
tr: **gerekçeler** (bu oy pusulasının oluşturulduğu anda görülen ouşturucunun onayladığı mesaj kimliklerinin toplamı, hedef blok hariç; boş olabilir)
vi: **justifications** (tập hợp các id thông điệp mà người tạo xác thực đã thấy tại thời điểm tạo phiếu bầu này, không bao gồm khối đích; có thể để trống)

source: For a ballot **b** we define the collection :math:`b.all\_justifications` as target block + additional justifications. This collection is always non-empty because target block is a mandatory field.
fr: Pour un scrutin (ballot) **b**, nous définissons la collection :math:`b.all\_justifications` comme le bloc cible + les justifications supplémentaires. Cette collection est toujours non vide car le bloc cible est un champ obligatoire.
tr: Bir **b** oy pusulası için :math:`b.all\_justifications` toplamını, hedef blok + ek gerekçeler olarak tanımlarız. Bu toplam her zaman boş olmayan küme şeklindedir, çünkü hedef blok, zorunlu alandır.
vi: Đối với một phiếu bầu **b**, chúng tôi xác định tập hợp :math:`b.all\_justifications` àm khối đích + biện minh bổ sung. Tập hợp này luôn không trống vì khối đích là trường bắt buộc.

source: From the definitions above it follows that for every message :math:`m` there is a **j-dag** path from :math:`m` to :math:`Genesis`.
fr: D'après les définitions ci-dessus, il s'ensuit que pour chaque message :math:`m`, il existe un chemin **j-dag** de :math:`m` à :math:`Genesis`.
tr: Yukarıdaki tanımlamalara bakarak, her bir :math:`m` mesajı için :math:`m`'den :math:`Genesis`'e bir **j-dag** yolu vardır.
vi: Từ các định nghĩa ở trên, nó cho thấy rằng đối với mỗi thông điệp :math:`m` có một đường dẫn **j-dag** từ :math:`m` đến :math:`Genesis`.

source: Validators P2P protocol - behavior
fr: Validateurs protocole P2P - comportement
tr: Doğrulayıcılar P2P protokolü - davranış
vi: Nhà xác thực giao thức P2P - hành vi

source: We use the same assumptions on a message-passing network as were stated in the Abstract Casper Consensus model. So, validators only exchange information by broadcasting messages where the broadcasting implementation provides an exactly-once delivery guarantee, but the delays and shuffling of messages are arbitrary.
fr: Nous utilisons les mêmes hypothèses sur un réseau de transmission de messages que celles énoncées dans le modèle 'Abstract Casper Consensus'. Ainsi, les validateurs échangent des informations uniquement en diffusant des messages où l'implémentation de la diffusion fournit une garantie de livraison exactement une fois, mais les délais et le brassage (shuffling) des messages sont arbitraires.
tr: Özet Casper Mutabakat modelinde belirtilen varsayımların aynısını bir mesaj ileten ağda kullanıyoruz. Bu nedenle, doğrulayılar, yalnızca mesajlar yayınlayarak bilgi alışverişinde bulunurlar ki orada uygulama yayınlamak tam olarak bir kerede teslimat garantisi sunar, ama mesaj ertelemeleri ve karıştırmaları gelişigüzeldir.
vi: Chúng tôi sử dụng các giả định tương tự trên mạng truyền thông điệp như đã được nêu trong mô hình Abstract Casper Consensus. Vì vậy, nhà xác thực chỉ trao đổi thông điệp bằng cách phát các thông điệp trong đó việc gửi triển khai cung cấp bảo đảm phân phối chính xác một lần, nhưng sự chậm trễ và xáo trộn thông điệp là tùy ý.
