Repository: casper-network/docs-archive
Catalog: locale/*/LC_MESSAGES/theory/naive-blockchain.po
Languages: fr, tr, vi

source: Naive Casper Blockchain
fr: Casper Blockchain naïve (Naive Casper Blockchain)
tr: Naif Casper Blokzinciri
vi: Bản chất chuỗi khối Casper

source: Introduction
tr: Giriş
vi: Giới thiệu

source: Blockchain is a P2P network where the collection of nodes (**validators**) concurrently update a decentralized, shared database. They do this by collectively building an ever-growing chain of **transactions**. For performance reasons transactions are bundled in **blocks**.
fr: Blockchain est un réseau P2P dans lequel la collection de nœuds (**validateurs**) met à jour simultanément une base de données décentralisée et partagée. Pour ce faire, ils construisent collectivement une chaîne de **transactions** qui ne cesse de croître. Pour des raisons de performance, les transactions sont regroupées en **blocs**.
tr: Blokzincir, düğümlerin (**doğrulayıcılar**), aynı anda merkeziyetsiz, paylaşılan bir veritabanını güncellediği bir P2P ağıdır. Bunu, sürekli büyüyen bir **işlemler** zinciri oluşturarak topluca yaparlar. Performans nedenleriyle işlemler **bloklar** halinde gruplandırılmıştır.
vi: Blockchain (chuỗi khối) là một mạng P2P nơi tập hợp các nút (**nhà xác thực**) đồng thời cập nhật cơ sở dữ liệu được chia sẻ, phi tập trung. Họ làm điều này bằng cách cùng nhau xây dựng một chuỗi **giao dịch** ngày càng phát triển. Vì lý do hiệu suất, các giao dịch được gói trong **khối**.

source: For the “outside world”, the blockchain looks like a computer. This blockchain computer has a memory (= shared database) and can execute programs (= transactions). Execution of a program changes the state of the memory. Anybody can send a program to the computer and the computer will do a best effort attempt to execute this program.
fr: Pour le "monde extérieur", la blockchain ressemble à un ordinateur. Cet ordinateur blockchain possède une mémoire (= base de données partagée) et peut exécuter des programmes (= transactions). L'exécution d'un programme change l'état de la mémoire. N'importe qui peut envoyer un programme à l'ordinateur et l'ordinateur fera tout son possible pour exécuter ce programme.
tr: “Dış dünya” için blokzincir bir bilgisayara benziyor. Bu blokzincir bilgisayarın bir hafızası vardır (= paylaşılan veritabanı) ve programları çalıştırabilir (= işlemler). Bir programın yürütülmesi belleğin durumunu değiştirir. Herhangi biri bilgisayara bir program gönderebilir ve bilgisayar bu programı yürütmek için elinden gelenin en iyisini yapacaktır.
vi: Đối với “thế giới bên ngoài”, blockchain trông giống như một máy tính. Máy tính chuỗi khối này có bộ nhớ (= cơ sở dữ liệu được chia sẻ) và có thể thực hiện các chương trình (= giao dịch). Việc thực thi một chương trình sẽ thay đổi trạng thái của bộ nhớ. Bất kỳ ai cũng có thể gửi một chương trình đến máy tính và máy tính sẽ cố gắng hết sức để thực thi chương trình này.

source: We say that a blockchain computer is **decentralized**, i.e. there is no single point of failure in the infrastructure. A significant portion of the network of validators could be suddenly destroyed and nevertheless the blockchain will continue to work. Also, the system is resistant to malicious validators (as long as the total weight of malicious validators is below 50% of the total weight of all validators).
fr: Nous disons qu'un ordinateur blockchain est **décentralisé**, c'est-à-dire qu'il n'y a pas de point de défaillance unique dans l'infrastructure. Une partie importante du réseau de validateurs peut être soudainement détruite et la blockchain continuera néanmoins à fonctionner. En outre, le système est résistant aux validateurs malveillants (tant que le poids total des validateurs malveillants est inférieur à 50 % du poids total de tous les validateurs).
tr: Bir blokzincir bilgisayarının **merkeziyetsiz** olduğunu söylüyoruz, yani altyapıda tek bir arıza noktası yok. Doğrulayıcılar ağının önemli bir kısmı aniden yok edilebilir ve yine de blokzincir çalışmaya devam edecektir. Ayrıca, sistem kötü niyetli doğrulayıcılara karşı dirençlidir (kötü niyetli doğrulayıcıların toplam ağırlığı, tüm doğrulayıcıların toplam ağırlığının %50'sinin altında olduğu sürece).
vi: Chúng tôi nói rằng một máy tính chuỗi khối là **phi tập trung**, tức là không có điểm lỗi nào trong cơ sở hạ tầng. Một phần đáng kể của mạng lưới nhà xác nhận có thể bị phá hủy đột ngột, tuy nhiên chuỗi khối sẽ tiếp tục hoạt động. Ngoài ra, hệ thống có khả năng chống lại các nhà xác thực độc hại (miễn là tổng trọng số của các nhà xác thực độc hại dưới 50% tổng trọng số của tất cả các nhà xác thực).

source: The core of blockchain mechanics is the continuous work of validators struggling to agree on a consistent history of programs executed on the blockchain computer. We describe this central idea as “achieving **consensus** on the chain of blocks”. Because every block contains a chain of transactions, this “consistent history” results in being a sequence of transactions.
fr: Le cœur de la mécanique de la blockchain est le travail continu des validateurs qui luttent pour se mettre d'accord sur un historique cohérent des programmes exécutés sur l'ordinateur de la blockchain. Nous décrivons cette idée centrale comme "l'obtention d'un **consensus** sur la chaîne de blocs". Comme chaque bloc contient une chaîne de transactions, cet "historique cohérent" est une séquence de transactions.
tr: Blokzincir mekaniğinin özü, blokzincir bilgisayarında yürütülen programların tutarlı bir geçmişi üzerinde anlaşmaya varmak için mücadele eden doğrulayıcıların sürekli çalışmasıdır. Bu ana fikri “bloklar zinciri üzerinde **mutabakata** ulaşmak” olarak tanımlıyoruz. Her blok bir işlem zinciri içerdiğinden, bu “tutarlı geçmiş” bir işlemler dizisi olarak sonuçlanır.
vi: Cốt lõi của cơ chế chuỗi khối là công việc liên tục của các nhà xác thực đấu tranh để thống nhất về lịch sử nhất quán của các chương trình được thực thi trên máy tính chuỗi khối. Chúng tôi mô tả ý tưởng trung tâm này là “đạt được **đồng thuận** trên chuỗi khối”. Bởi vì mọi khối đều chứa một chuỗi giao dịch, nên "lịch sử nhất quán" này dẫn đến việc trở thành một chuỗi giao dịch.

source: Note that in this spec we use the terms **shared database** and **blockchain computer memory** interchangeably.
fr: Notez que dans cette spécification, nous utilisons les termes **base de données partagée** (shared database) et **mémoire informatique de la blockchain** (blockchain computer memory) de manière interchangeable.
tr: Bu belirtimde **paylaşılan veritabanı** ve **blokzincir bilgisayar belleği** terimlerini birbirinin yerine kullandığımızı unutmayınız.
vi: Lưu ý rằng trong tài liệu kỹ thuật này, chúng tôi sử dụng các thuật ngữ **cơ sở dữ liệu được chia sẻ** và **bộ nhớ máy tính chuỗi khối** thay thế cho nhau.

source: Computing model
fr: Modèle informatique
tr: Bilgi işlem modeli
vi: Mô hình tính toán

source: Memory and programs
fr: Mémoire et programmes
tr: Bellek ve programlar
vi: Bộ nhớ và chương trình

source: We need to define the “computational semantics” of a blockchain computer; what programs are and how they execute. However, because the consensus protocol we introduce is compatible with a wide range of computing models, it is convenient to approach this abstractly. Therefore, we represent the “computational semantics” of a blockchain computer as a triple :math:`\langle GS, Zero, P\rangle` where:
fr: Nous devons définir la "sémantique informatique" d'un ordinateur blockchain ; ce que sont les programmes et comment ils s'exécutent. Cependant, comme le protocole de consensus que nous introduisons est compatible avec un large éventail de modèles informatiques, il est pratique d'aborder cette question de manière abstraite. Par conséquent, nous représentons la "sémantique informatique" d'un ordinateur blockchain comme un triple :math:`\langle GS, Zero, P\rangle` où :
tr: Bir blokzincir bilgisayarının “hesaplamalı semantiğini” tanımlamamız gerekiyor; programlar nedir ve nasıl yürütülür. Ancak, tanıttığımız mutabakat protokolü çok çeşitli hesaplama modelleriyle uyumlu olduğundan, buna teorik olarak yaklaşmak uygundur. Bu nedenle, bir blokzincir bilgisayarının "hesaplamalı semantiğini" üçlü bir :math:`\langle GS, Zero, P\rangle` olarak temsil ediyoruz ki burada:
vi: Chúng ta cần xác định “ngữ nghĩa tính toán” của một máy tính chuỗi khối; chương trình là gì và cách chúng thực thi. Tuy nhiên, vì giao thức đồng thuận mà chúng tôi giới thiệu tương thích với một loạt các mô hình tính toán, nên rất thuận tiện để tiếp cận điều này một cách trừu tượng. Do đó, chúng tôi thể hiện cho "ngữ nghĩa tính toán" của một máy tính chuỗi khối như một bộ ba :math:`\langle GS, Zero, P\rangle` trong đó:

source: :math:`GS` is a set of states of the shared database (think that each point :math:`gs \in GS` represents a “snapshot” of the shared database) we call “global states”
fr: :math:`GS` est un ensemble d'états de la base de données partagée (pensez que chaque point :math:`gs \in GS` représente un "snapshot" de la base de données partagée) que nous appelons "états globaux" (global states).
tr: :math:`GS`, "küresel durumlar" dediğimiz, paylaşılan veritabanının bir dizi durumudur (her :math:`gs \in GS` 'nin paylaşılan veritabanının bir "anlık görüntüsünü" temsil ettiğini düşünün)
vi: :math:`GS` là một tập hợp các trạng thái của cơ sở dữ liệu được chia sẻ (hãy nghĩ rằng mỗi điểm :math:`gs \in GS` đại diện cho một "ảnh chụp nhanh"của cơ sở dữ liệu được chia sẻ) mà chúng tôi gọi là "trạng thái toàn cục"

source: :math:`Zero \in GS` is the initial state of the database
fr: :math:`Zero \in GS` est l'état initial de la base de données
tr: :math:`Zero \in GS` veritabanının ilk durumudur
vi: :math:`Zero \in GS` là trạng thái ban đầu của cơ sở dữ liệu

source: :math:`P \subset Partial(GS \rightarrow GS)` is a non-empty set of partial functions from :math:`GS` to :math:`GS`, closed under composition; elements of :math:`P` we call **transactions** (we think of them as “executable programs”)
fr: :math:`P \subset Partial(GS \rightarrow GS)` est un ensemble non vide de fonctions partielles de :math:`GS` à :math:`GS`, fermé sous composition ; les éléments de :math:`P` sont appelés **transactions** (nous les considérons comme des "programmes exécutables")
tr: :math:`P \subset Partial(GS \rightarrow GS)`, :math:`GS` den :math:`GS` ye kısmi fonksiyonların boş olmayan kümesidir, bileşimi kapalıdır, :math:`P` 'nin elemanlarına **işlemler** (onları "çalıştırılabilir programlar" olarak düşünüyoruz) diyoruz.
vi: :math:`P \subset Partial(GS \rightarrow GS)` là một tập hợp các hàm riêng không rỗng từ :math:`GS` đến :math:`GS`, được đóng thành bộ; các phần tử của :math:`P` chúng tôi gọi là **giao dịch** (chúng tôi coi chúng là “chương trình thực thi”)

source: Given a state :math:`gs \in GS` and a transaction :math:`p \in P`, we can calculate the value :math:`p(gs)` only in the case when :math:`p` is defined at :math:`gs`. We refer to this as **the execution of p**.
fr: Étant donné un état :math:`gs \in GS` et une transaction :math:`p \in P`, nous pouvons calculer la valeur :math:`p(gs)` uniquement dans le cas où :math:`p` est défini à :math:`gs`. Nous appelons cela **l'exécution de p**.
tr: :math:`gs \in GS` ve :math:`p \in P` durumları verildiğinde, :math:`p(gs)` değerini sadece :math:`p` :math:`gs` 'de tanımlandığında hesaplayabiliriz. Bunu **p'nin yürütülmesi** olarak adlandırıyoruz.
vi: Cho một trạng thái :math:`gs\in GS` và một giao dịch :math:`p \in P`, chúng ta có thể tính giá trị :math:`p(gs)` chỉ trong trường hợp khi :math:`p` được định nghĩa tại :math:`gs`. Chúng tôi gọi đây là **việc thực thi của p**.

source: When :math:`p` is not defined at point :math:`gs`, we say that **execution of p on state gs failed**. This is how we represent errors in program execution.
fr: Lorsque :math:`p` n'est pas défini au point :math:`gs`, nous disons que **l'exécution de p sur l'état gs a échoué**. C'est ainsi que nous représentons les erreurs d'exécution d'un programme.
tr: :math:`p`, :math:`gs` noktasında tanımlanmadığında, **p'nin gs durumunda yürütülmesinin başarısız olduğunu** söyleriz. Program yürütmedeki hataları bu şekilde tarif ediyoruz.
vi: Khi :math:`p` không được xác định tại điểm :math:`gs`, chúng ta nói rằng **việc thực thi p trên trạng thái gs không thành công**. Đây là cách chúng tôi trình bày các lỗi trong quá trình thực thi chương trình.

source: Executing sequences of transactions
fr: Exécution de séquences de transactions
tr: İşlem dizilerinin yürütülmesi
vi: Thực hiện các chuỗi giao dịch

source: We want to generalize this notion to sequences of transactions in such a way that the information on execution errors is retained.
fr: Nous voulons généraliser cette notion aux séquences de transactions de telle sorte que l'information sur les erreurs d'exécution soit conservée.
tr: Bu kavramı, yürütme hataları hakkındaki bilgilerin korunacağı şekilde işlem dizilerine genelleştirmek istiyoruz.
vi: Chúng tôi muốn khái quát khái niệm này cho các chuỗi giao dịch theo cách mà thông tin về lỗi thực hiện được giữ lại.

source: Having a sequence of transactions :math:`p_1, p_2, ...., p_n\in P` we'll keep the information on execution success/error as a function :math:`status: [1,2,...,n] \rightarrow \{false, true\}`.
fr: Ayant une séquence de transactions :math:`p_1, p_2, ...., p_n\in P` nous garderons l'information sur le succès/erreur d'exécution comme une fonction :math:`status : [1,2,...,n] \rightarrow \{false, true\}`.
tr: :math:`p_1, p_2, ...., p_n\in P` bir dizi işlem verilmiş olsun, yürütme başarısı/ hatası bilgisini, :math:`status: [1,2,...,n] \rightarrow \{false, true\}` fonksiyonu halinde saklayacağız.
vi: Có một chuỗi các giao dịch :math:`p_1, p_2, ...., p_n\in P`, chúng tôi sẽ giữ thông tin về thực thi thành công/lỗi dưới dạng một hàm :math:`status: [1,2,...,n] \rightarrow \{false, true\}`.

source: For any :math:`p \in P` let :math:`\triangle p: GS \rightarrow GS` be a total function that extends :math:`p` by applying identity whenever :math:`p` is not defined, hence formally as:
fr: Pour tout :math:`p \in P`, soit :math:`\triangle p : GS \rightarrow GS` une fonction totale qui étend :math:`p` en appliquant l'identité à chaque fois que :math:`p` n'est pas défini, d'où sa forme formelle :
tr: Herhangi bir :math:`p \in P` için, :math:`\triangle p: GS \rightarrow GS`, p tanımlanmadığında özdeşlik uygulayarak p'yi genişleten bir toplam fonksiyon olsun, dolayısıyla daha resmi şekliyle:
vi: Đối với bất kỳ :math:`p \in P` let :math:`\triangle p: GS \rightarrow GS` là một hàm tổng mở rộng :math:`p` bằng cách sử dụng định danh bất cứ khi nào :math:`p` không được định nghĩa, do đó biểu thức chính thức là:

source: \triangle p(x)=\begin{cases} p(x), & x \in dom(p)\\ x, & otherwise \end{cases}
tr: \triangle p(x)=\begin{cases} p(x), & x \in dom(p)\\ x, & yoksa \end{cases}

source: **Status(i)** represents the overall result (success vs failure) of the execution of **i-th** transaction in the sequence.
fr: **Status(i)** représente le résultat global (succès ou échec) de l'exécution de la **i-ième** transaction de la séquence.
tr: **Durum(i)**, sırayla **i'inci** işleminin yürütülmesinin genel sonucunu (başarısızlık veya başarı) temsil eder.
vi: **Status(i)** thể hiện kết quả tổng thể (thành công hay thất bại) của việc thực hiện giao dịch **i-th** trong chuỗi.

source: Let:
fr: Soit:
tr: Şu şekilde alır isek:
vi: Cho:

source: :math:`TSeq` be the set of finite sequences of transactions: :math:`TSeq = P^{Int}`
fr: :math:`TSeq` l'ensemble des séquences finies de transactions : :math:`TSeq = P^{Int}`
tr: :math:`TSeq` sonlu işlem dizileri kümesi olsun: :math:`TSeq = P^{Int}`
vi: :math:`TSeq` là tập hợp các chuỗi giao dịch hữu hạn: :math:`TSeq = P^{Int}`

source: :math:`StatusTraces` be the set of finite sequences of Booleans
fr: :math:`StatusTraces` est l'ensemble des séquences finies de Booleans
tr: :math:`StatusTraces` Boolean sonlu dizileri kümesi olsun
vi: :math:`StatusTraces` là tập hợp các chuỗi hữu hạn của Boolean

source: We define the execution of a sequence of transactions as:
fr: Nous définissons l'exécution d'une séquence de transactions comme :
tr: Bir dizi işlemin yürütülmesini şu şekilde tanımlarız:
vi: Chúng tôi định nghĩa việc thực hiện một chuỗi các giao dịch là:

source: … where:
fr: … où:
tr: … ki burada:
vi: … khi:

source: :math:`trace(i) = \begin{cases} false, & execution \space of \space p_i \space failed \\ true, & otherwise \end{cases}`
tr: :math:`trace(i) = \begin{cases} yanlış, & p_i \space 'ın \space \space yürütülmesi başarısız \\ doğru, & yoksa \end{cases}`

source: Intuitively, **exec** takes a pair - the initial global state and a sequence of transactions to execute. The result is also a pair - the resulting global state reached by sequentially applying all transactions and a trace of this execution saying which transactions failed along the way.
fr: Intuitivement, **exec** prend une paire - l'état global initial et une séquence de transactions à exécuter. Le résultat est également une paire - l'état global résultant atteint en appliquant séquentiellement toutes les transactions et une trace de cette exécution indiquant quelles transactions ont échoué en cours de route.
tr: Sezgisel olarak, **exec** bir çift alır - ilk küresel durum ve yürütülecek bir işlem dizisi. Sonuç da bir çifttir - tüm işlemlerin sırayla uygulanmasıyla ulaşılan sonuçtaki küresel durum ve yol boyunca hangi işlemlerin başarısız olduğunu söyleyen bu yürütmenin bir izi.
vi: Trực quan, **executive** nhận một cặp - trạng thái toàn cục ban đầu và một chuỗi các giao dịch để thực hiện. Kết quả cũng là một cặp - trạng thái toàn cục kết quả đạt được bằng cách áp dụng tuần tự tất cả các giao dịch và dấu vết của việc thực hiện này cho biết giao dịch nào không thành công trong quá trình thực hiện.

source: Executing sequences of blocks
fr: Exécution de séquences de blocs
tr: Blok dizilerinin yürütülmesi
vi: Thực thi liên tiếp các khối

source: A block contains sequences of transactions. Given some initial global state :math:`gs \in GS`, whenever we say “execute a block” we mean executing the sequence of transactions it contains starting from :math:`gs`. We usually call :math:`gs` the **pre-state** of the block, and we say **post-state** to denote the resulting global state returned by :math:`exec(gs, sequence)`.
fr: Un bloc contient des séquences de transactions. Étant donné un état global initial :math:`gs \in GS`, chaque fois que nous disons "exécuter un bloc", nous voulons dire exécuter la séquence de transactions qu'il contient à partir de :math:`gs`. Nous appelons généralement :math:`gs` le **pre-state** du bloc, et nous disons **post-state** pour désigner l'état global résultant retourné par :math:``exec(gs, séquence)`.
tr: Bir blok, işlem dizilerini içerir. :math:`gs \in GS` ilk küresel durumu verildiğinde, "bir bloğun yürütülmesi" dediğimizde :math:`gs` 'den başlayarak içerdiği işlem dizisini yürütmekten bahsediyoruz. Genellikle :math:`gs` 'ye bloğun **ön durumu** deriz, ve :math:`exec(gs, sequence)` tarafından döndürülen sonuç kürüsel durumuna da bloğun **durum sonrası** deriz.
vi: Một khối chứa các chuỗi giao dịch. Với một số trạng thái toàn cục ban đầu :math:`gs \in GS`, bất cứ khi nào chúng ta nói "thực thi một khối", chúng tôi muốn nói tới việc thực hiện chuỗi các giao dịch mà nó chứa bắt đầu từ :math:`gs`. Chúng tôi thường gọi :math:`gs` là **pre-state** của khối và chúng ta nói **post-state** để biểu thị trạng thái toàn cục kết quả được trả về bởi :math:`exec(gs, sequence)`.

source: Given any sequence of blocks we may also **execute the sequence of blocks** because it is effectively a sequence of sequences of transactions, so it may be flattened to a single sequence of transactions.
fr: Étant donné toute séquence de blocs, nous pouvons également **exécuter la séquence de blocs** car il s'agit effectivement d'une séquence de séquences de transactions, qui peut donc être aplatie en une seule séquence de transactions.
tr: Herhang bir blok dizisi alalım, aynı zamanda **blok dizisini de yürütebiliriz** çünkü bu fiilen bir işlem dizilerinin dizisidir, bu nedenle tek bir işlem dizisine düzleştirilebilir.
vi: Với bất kỳ chuỗi khối nào, chúng tôi cũng có thể **thực thi liên tiếp các khối** bởi vì nó thực sự là một chuỗi các chuỗi giao dịch, vì vậy nó có thể được làm phẳng thành một chuỗi giao dịch duy nhất.

source: Given any set of blocks :math:`B`, we sometimes consider different linear orders of such set. Given a linear order :math:`R` on set :math:`B`, we are speaking about **executing the set of blocks B along linear order R**, with the obvious semantics of taking all the blocks, arranging them in a sequence following the order :math:`R`, and then executing the resulting sequence of transactions.
fr: Étant donné tout ensemble de blocs :math:`B`, nous considérons parfois différents ordres linéaires de cet ensemble. Étant donné un ordre linéaire :math:`R` sur l'ensemble :math:`B`, nous parlons de **l'exécution de l'ensemble des blocs B selon l'ordre linéaire R**, avec la sémantique évidente de prendre tous les blocs, de les arranger dans une séquence suivant l'ordre :math:`R`, puis d'exécuter la séquence de transactions résultante.
tr: Herhangi bir :math:`B` blok kümesi verildiğinde, bazen bu kümenin farklı doğrusal sıralamalarını dikkate alırız. :math:`B` kümesinde :math:`R` doğrusal sıralaması verildiğinde, üm blokların alınıp :math:`R` sıralamasını takip edecek şekilde düzenlendiği ve sonrasında elde edilen işlem dizisinin yürütüldüğü **R doğrusal sıralamasında B blok kümesinin yürütülmesi**nden bahsediyoruzdur.
vi: Cho bất kỳ tập hợp khối nào :math:`B`, đôi khi chúng tôi xem xét các thứ tự tuyến tính khác nhau của tập hợp đó. Cho một thứ tự tuyến tính :math:`R` on set :math:`B`, chúng tôi đang nói về việc **thực hiện tập hợp các khối B theo thứ tự tuyến tính R**, với ngữ nghĩa rõ ràng là lấy tất cả các khối, sắp xếp chúng theo một trình tự theo thứ tự :math:`R`, và sau đó thực hiện chuỗi giao dịch kết quả.

source: Blockchain participants
fr: Participants à la Blockchain
tr: Blokzincir katılımcıları
vi: Người tham gia vào chuỗi khối

source: We envision the infrastructure of blockchain participants as a collection of actors (processes) communicating over a network, and where each process plays one of the following roles:
fr: Nous envisageons l'infrastructure des participants à la blockchain comme une collection d'acteurs (processus) communiquant sur un réseau, et où chaque processus joue l'un des rôles suivants :
tr: Blokzincir katılımcılarının altyapısını, bir ağ üzerinden iletişim kuran ve her sürecin aşağıdaki rollerden birini oynadığı bir aktörler (süreçler) topluluğu olarak öngörüyoruz:
vi: Chúng tôi hình dung cơ sở hạ tầng của những người tham gia blockchain như một tập hợp các tác nhân (quy trình) giao tiếp qua mạng và nơi mỗi quy trình đóng một trong các vai trò sau:

source: **validators (aka “ring 0”)** - form a P2P network that attempts to reach consensus on the ever-growing history of executed transactions; they do this by creating and validating blocks
fr: **validateurs (aka "ring 0")** - forment un réseau P2P qui tente de parvenir à un consensus sur l'historique toujours croissant des transactions exécutées ; ils le font en créant et en validant des blocs.
tr: **doğrulayıcılar (“halka 0” olarak da bilinirler)** - yürütülen işlemlerin sürekli büyüyen geçmişi üzerinde mutabakata varmaya çalışan bir P2P ağı oluşturur; bunu bloklar oluşturarak ve doğrulayarak yaparlar
vi: **nhà xác thực (hay còn gọi là “ring 0”)** - tạo thành một mạng P2P nhằm cố gắng đạt được sự đồng thuận về lịch sử ngày càng tăng của các giao dịch đã thực hiện; họ làm điều này bằng cách tạo và xác thực các khối
