Repository: casper-network/docs-archive
Catalog: locale/*/LC_MESSAGES/theory/naive-blockchain.po
Languages: fr, tr, vi

source: During its lifetime, a validator maintains the following data structures:
fr: Pendant sa durée de vie, un validateur maintient les structures de données suivantes :
tr: Doğrulayıcı, kullanım ömrü boyunca aşağıdaki veri yapılarını korur:
vi: Trong suốt thời gian tồn tại của nó, nhà xác thực duy trì các cấu trúc dữ liệu sau:

source: **deploys-buffer** - a buffer of transactions sent by clients, to be executed on the blockchain computer
fr: **deploys-buffer** - un buffer de transactions envoyées par les clients, à exécuter sur l'ordinateur blockchain
tr: **deploys-buffer** - blokzincir bilgisayarında yürütülmek üzere müşteriler tarafından gönderilen işlemlerin arabelleği
vi: **deploys-buffer** - bộ đệm các giao dịch do client gửi, được thực thi trên máy tính chuỗi khối

source: **blockdag** - keeping all blocks and ballots either produced by or received from other validators
fr: **blockdag** - conserver tous les blocs et bulletins (ballots) produits par d'autres validateurs ou reçus d'eux
tr: **blockdag** - diğer onaylayıcılar tarafından üretilen veya onlardan alınan tüm blokları ve oy pusulalarını saklamak
vi: **blockdag** - giữ tất cả các khối và phiếu bầu được tạo ra bởi hoặc nhận được từ những nhà xác thực khác

source: **messages-buffer** - a buffer of messages received, but not yet incorporated into the **blockdag**
fr: **messages-buffer** - un buffer de messages reçus, mais pas encore incorporés dans le **blockdag**
tr: **messages-buffer** - alınan, ancak henüz **blockdag**'a dahil edilmemiş mesajların arabelleği
vi: **messages-buffer** - một bộ đệm các thông điệp đã nhận, nhưng chưa được tích hợp vào **blockdag**

source: **latest-honest-messages** - a mapping from validator id to message id, pointing every validator known in the **blockdag**, excluding **equivocators**, to the corresponding swimlane tip
fr: **latest-honest-messages** - une map de l'id du validateur à l'id du message, pointant chaque validateur connu dans le **blockdag**, à l'exclusion des **équivocateurs** (validateurs éjectés), vers la pointe du swimlane correspondant.
tr: **latest-honest-messages** - doğrulayıcı kimliğinden mesaj kimliğine **blockdag**'deki bilinen her bir doğrulayıcıyı işaret eden, **çelişkiller**'i hariç tutan, karşılık gelen kulvar ipucuna bir eşleştirme.
vi: **latest-honest-messages** - ánh xạ từ id nhà xác thực đến id thông điệp, trỏ tới vùng tương ứng mọi nhà xác thực được biết đến trong **blockdag**, không bao gồm **equivocator**

source: **equivocators** - a collection of validators for which current blockdag contains an equivocation
fr: **equivocators** - une collection de validateurs pour lesquels le blockdag actuel contient une équivoque
tr: **çelişkililer** - şu anki blokdag'in bir çelişki barındırdığı doğrulayıcılar grubu
vi: **equivocators** - một tập hợp các nhà xác thực mà blockdag hiện tại chứa một vị trí tương đương

source: **reference-finalizer** - an instance of finalizer used internally (*see* **Operation of a finalizer** later in this spec for more information about what finalizers are)
fr: **reference-finalizer** - une instance de finalisateur utilisée en interne (*voir **Opération d'un finalisateur** plus loin dans cette spécification pour plus d'informations sur ce que sont les finalisateurs)
tr: **referans-kesinleştirici** - dahil olarak kullanılan, kesinleştiricinin bir örneği (Kesinleştiricilerin ne olduğu ile ilgili daha fazla bilgi için bu spesifikasyonda *bkz* **Kesinleştiricinin çalışması** )
vi: **reference-finalizer** - một phiên bản của trình hoàn thiện được sử dụng nội bộ (*xem* **Hoạt động của trình hoàn thiện** ở phần sau của tài liệu kỹ thuật này để biết thêm thông tin về trình hoàn thiện là gì)

source: **global-states-db** - mapping of global state hash to global state
fr: **global-states-db** - mapping du hash d'état global à l'état global
tr: **global-states-db** - küresel durum özetinin küresel duruma eşleştirilmesi
vi: **global-states-db** - ánh xạ từ băm trạng thái toàn cục sang trạng thái toàn cục

source: A message :math:`m` can be added to the :math:`blockdag` only if all justifications of :math:`m` are already present in the blockdag. So if a validator receives a message before receiving some of its justifications, the received message must wait in the :math:`messages\_buffer`.
fr: Un message :math:`m` ne peut être ajouté au :math:`blockdag` que si toutes les justifications de :math:`m` sont déjà présentes dans le blockdag. Ainsi, si un validateur reçoit un message avant d'avoir reçu certaines de ses justifications, le message reçu doit attendre dans le :math:`messages\_buffer`.
tr: :math:`m`, :math:`blockdag`'e, sadece, :math:`m`'in tüm gerekçeleri, blockdag'de halihazırda hazır ise eklenebilir. Bu nedenle, bir doğrulayıcı gerekçelerinin bazılarını almadan önce bir mesaj alırsa, alınan mesaj :math:`messages\_buffer`'da beklemelidir.
vi: Một thông điệp :math:`m` có thể được thêm vào :math:`blockdag` chỉ khi tất cả các biện minh của :math:`m` đã có trong blockdag. Vì vậy, nếu nhà xác thực nhận được một thông điệp trước khi nhận được một số lý do của nó, thì thông điệp nhận được phải đợi trong :math:`messages\ _buffer`.

source: A validator is concurrently executing two infinite loops of processing:
fr: Un validateur exécute simultanément deux boucles infinies de traitement :
tr: Doğrulayıcı aynı anda iki sonsuz işlem döngüsü yürütüyor:
vi: Nhà xác thực đang thực hiện đồng thời hai vòng xử lý vô hạn:

source: **Listening loop:**
tr: **Dinleme döngüsü:**
vi: **Vòng lặp lắng nghe (Listening loop:)**

source: Listen to messages incoming from other validators. Whenever a message :math:`m` (block or ballot) arrives, follow this handling scenario:
fr: Écouter les messages provenant d'autres validateurs. Lorsqu'un message :math:`m` (bloc ou ballot) arrive, suivre ce scénario de traitement :
tr: Diğer doğrulayıcılardan gelen mesajları dinle. Bir :math:`m` mesajı (blok veya oy pusulası) geldiğinde, şu işleme senaryosunu izle:
vi: Nghe tin nhắn đến từ các nhà xác thực khác. Bất cứ khi nào có thông báo :math:`m` (khối hoặc phiếu bầu) đến, hãy làm theo tình huống xử lý sau:

source: Validate the formal structure of :math:`m`. In case of any error - drop :math:`m` (invalid message) and exit.
fr: Valider la structure formelle de :math:`m`. En cas d'erreur - abandonner :math:`m` (message invalide) et quitter.
tr: :math:`m`'in biçimsel yapısını doğrula. Herhangi bir hata durumunda - :math:`m` 'i (geçersiz mesaj) bırak ve çık.
vi: Xác thực cấu trúc chính thức của :math:`m`. Trong trường hợp có lỗi - drop :math:`m` (thông báo không hợp lệ) và thoát.

source: Check if all justifications of :math:`m` are already included in :math:`blockdag`.
fr: Vérifier si toutes les justifications de :math:`m` sont déjà incluses dans :math:`blockdag`.
tr: :math:`m`'in tüm gerekçelerinin zaten :math:`blockdag` içinde olup olmadığını kontrol et.
vi: Kiểm tra xem tất cả các biện minh của :math:`m` đã được đưa vào :math:`blockdag` hay chưa.

source: if yes: continue
fr: si oui : continuer
tr: evet ise: devam et
vi: nếu có: tiếp tục

source: otherwise: append :math:`m` to the :math:`messages\_buffer`, then exit
fr: sinon : ajouter :math:`m` au :math:`messages\_buffer`, puis quitter
tr: aksi takdirde: :math:`m` ögesini :math:`messages\_buffer`'a ekle, ardından çık
vi: ngược lại: gắn :math:`m` vào :math:`messages\_buffer`, sau đó thoát

source: Perform processing specific to type of :math:`m` (block or ballot) - see below.
fr: Effectuer le traitement spécifique au type de :math:`m` (bloc ou ballot) - voir ci-dessous.
tr: :math:`m` (blok veya oy pusulası) türüne özel işlem gerçekleştir - aşağıya bakın.
vi: Thực hiện xử lý cụ thể cho kiểu :math:`m` (khối hoặc phiếu bầu) - xem bên dưới.

source: If :math:`equivocators` does not contain :math:`m.creator`:
fr: Si :math:`equivocators` ne contient pas :math:`m.creator` :
tr: :math:`equivocators`, :math:`m.creator` içermiyorsa:
vi: Nếu :math:`equivocators` không chứa :math:`m.creator`:

source: Check if :math:`m` introduces new equivocation - this is the case when :math:`latest\_honest\_messages(m.creator)` is not member of :math:`j\_past\_cone(m)`
fr: Vérifier si :math:`m` introduit une nouvelle équivoque - c'est le cas lorsque :math:`latest\_honest\_messages(m.creator)` n'est pas membre de :math:`j\_past\_cone(m)`
tr: :math:`m`'in yeni bir çelişkili davranış getirip getirmediğini kontrol et - bu :math:`latest\_honest\_messages(m.creator)`, :math:`j\_past\_cone(m)`'in üyesi olmadığında meydana gelen durumdur
vi: Kiểm tra xem :math:`m` có giới thiệu phần tương đương mới hay không - đây là trường hợp khi :math:`new\_honest\_messages(m.creator)` không phải là thành viên của:math:`j\ _past\_cone(m)'

source: If yes then add :math:`m.creator` to :math:`equivocators`
fr: Si oui, ajoutez :math:`m.creator` à :math:`equivocators`.
tr: Evet ise, :math:`m.creator` ögesini :math:`equivocators`a ekle.
vi: Nếu có thì hãy thêm :math:`m.creator` vào :math:` Equivocators`

source: If :math:`equivocators` does not contain :math:`m.creator`, update :math:`latest\_honest\_messages` map by setting :math:`latest\_honest\_messages(m.creator) = m`
fr: Si :math:`equivocators` ne contient pas :math:`m.creator`, mettre à jour la map :math:`latest\_honest\_messages` en définissant :math:`latest\_honest\_messages(m.creator) = m`
tr: Eğer, :math:`equivocators`, :math:`m.creator` içermiyorsa, :math:`latest\_honest\_messages(m.creator) = m`'i ayarlayarak :math:`latest\_honest\_messages`'ı güncelle
vi: Nếu :math:`equivocators` không chứa :math:`m.creator`, cập nhật :math:`latest\_honest\_messages` ánh xạ khi thiết lập :math:`latest\_honest\_messages(m.creator) = m`

source: Check if there is any message :math:`x` in :math:`messages\_buffer` that can now leave the buffer and be included in the :math:`blockdag` because of :math:`x.all\_justifications` are now present in the :math:`blockdag`. For first such :math:`x` found, apply steps (3) - (4) - (5) .
fr: Vérifier s'il existe un message :math:`x` dans :math:`messages\_buffer` qui peut maintenant quitter le buffer et être inclus dans le :math:`blockdag` parce que :math:`x.all\_justifications` sont maintenant présentes dans le :math:`blockdag`. Pour le premier :math:`x` de ce type trouvé, appliquer les étapes (3) - (4) - (5) .
tr: :math:`messages\_buffer`'da, :math:`x.all\_justifications` 'ın şimdi :math:`blockdag`'de bulunması nedeniyle, şu anda arabellekten ayrılabilecek ve :math:`blockdag`'de dahil edilebilecek, herhangi bir :math:`x` mesajı olup olmadığını kontrol et. Bulunan böyle bir :math:`x` için, (3) - (4) - (5) nolu adımları uygula.
vi: Kiểm tra xem có thông điệp nào không :math:`x` trong :math:`messages\_buffer` hiện có thể rời khỏi bộ đệm và được đưa vào :math:`blockdag` vì :math:`x.all\_justifications` hiện có trong :math:`blockdag`. Khi tìm thấy :math:`x` đầu tiên như vậy, áp dụng các bước (3) - (4) - (5).

source: (“Buffer pruning cascade”) Repeat step (6) as many times as there are blocks that can be released from the buffer.
fr: ("Buffer pruning cascade") Répétez l'étape (6) autant de fois qu'il y a de blocs qui peuvent être libérés du buffer.
tr: (“Arabellek budama kademesi”) Arabellekten serbest bırakılabilen bloklar olduğu sürece adım (6)'yı tekrarla.
vi: (“Luồng cắt giảm bộ đệm”) Lặp lại bước (6) nhiều lần để có các khối có thể được giải phóng khỏi bộ đệm.

source: Processing specific to type of :math:`m` goes as follows:
fr: Le traitement spécifique au type de :math:`m` se déroule comme suit :
tr: :math:`m` türüne özel işlem şu şekilde gerçekleşir:
vi: Xử lý cụ thể cho kiểu :math:`m` như sau:

source: If :math:`m` is a block:
fr: Si :math:`m` est un bloc :
tr: Eğer :math:`m` bir blok ise:
vi: Nếu :math:`m` là một khối:

source: Validate whether :math:`m` parents (main parent and secondary parents) were selected correctly:
fr: Valider si les parents :math:`m` (parent principal et parents secondaires) ont été sélectionnés correctement :
tr: :math:`m`'in üst ögelerinin (ana üst öge ve ikincil üst ögeler) doğru seçilip seçilmediğini doğrula.
vi: Xác thực xem :math:`m` lớp trên (lớp trên chính và phụ) đã được chọn đúng hay chưa:

source: run the fork-choice for the protocol state derived from justifications of :math:`m`
fr: exécuter le fork-choice pour l'état du protocole dérivé des justifications de :math:`m`.
tr: :math:`m` gerekçelerinden türetilen protokol durumu için fork-choice'i çalıştır
vi: chạy fork-choice cho trạng thái giao thức từ các biện minh của :math:`m`

source: compare calculated parents with actual parent of :math:`m`:
fr: comparer les parents calculés avec les parents réels de :math:`m` :
tr: Hesaplanan üst ögeleri, :math:`m`'in gerçek üst ögeleri ile karşılaştır
vi: so sánh lớp trên được tính toán với lớp trên thực tế của :math:`m`:

source: if they are the same: append :math:`m` to :math:`blockdag`.
fr: s'ils sont identiques : ajoutez :math:`m` à :math:`blockdag`.
tr: Eğer aynı iseler: :math:`m`'i, :math:`blockdag`'e ekle.
vi: nếu chúng giống nhau: gắn: math: `m` vào :math:`blockdag`.

source: otherwise - drop the block (invalid block) and exit
fr: sinon - abandonner le bloc (bloc invalide) et sortir
tr: değilse - bloğu bırak (geçersiz blok) ve çık
vi: nếu không - bỏ khối (khối không hợp lệ) và thoát

source: Check if parents of :math:`m` are not conflicting. If they are conflicting, then drop the block (invalid block) and exit.
fr: Vérifier si les parents de :math:`m` ne sont pas en conflit. S'ils sont en conflit, abandonnez le bloc (bloc invalide) et sortir.
tr: :math:`m` ögesinin üst ögelerinin çelişkili olup olmadığını kontrol et. Çakışıyorlarsa, bloğu bırak (geçersiz blok) ve çık.
vi: Kiểm tra xem lớp trên của :math:`m` có mâu thuẫn với nhau hay không. Nếu chúng mẫu thuẫn, sau đó bỏ khối (khối không hợp lệ) và thoát.

source: Calculate pre-state for :math:`m` by executing the transactions in the merged history that is determined by all parents of :math:`m`. Check if calculated hash of pre-state is equal to pre-state-hash stored in :math:`m`. If not, then drop :math:`m` (invalid block) and exit.
fr: Calculer le pre-state de :math:`m` en exécutant les transactions dans l'historique fusionné qui est déterminé par tous les parents de :math:`m`. Vérifier si le hash calculé du pre-state est égal au pre-state-hash stocké dans :math:`m`. Si ce n'est pas le cas, abandonner :math:`m` (bloc invalide) et sortir.
tr: :math:`m`'in tüm üst ögeleri tarafından belirlenen birleştirilmiş geçmişteki işlemleri yürüterek :math:`m` için ön durumu hesapla. Ön durumun hesaplanmış özetinin :math:`m`'de depolanan pre-state-hash'e eşit olup olmadığını kontrol et. Eğer değilse, :math:`m`'i bırak (geçersiz blok) ve çık.
vi: Tính toán tiền trạng thái cho :math:`m` bằng cách thực hiện các giao dịch trong lịch sử đã hợp nhất được xác định bởi tất cả lớp trên của :math:`m`. Kiểm tra xem băm được tính toán của tiền trạng thái có bằng với băm tiền trạng thái được lưu trữ trong :math:`m` hay không. Nếu không, hãy thả :math:`m` (khối không hợp lệ) và thoát.

source: Calculate post-state for :math:`m` by sequentially applying all transactions in :math:`m` on top of global state calculated in step (3). Check if calculated hash of post-state is equal to post-state-hash stored in :math:`m`. If not, then drop :math:`m` (invalid block) and exit.
fr: Calculer le post-state de :math:`m` en appliquant séquentiellement toutes les transactions de :math:`m` sur l'état global calculé à l'étape (3). Vérifier si le hash calculé du post-state est égal au post-state-hash stocké dans :math:`m`. Si ce n'est pas le cas, abandonner :math:`m` (bloc invalide) et sortir.
tr: Adım (3)'te hesaplanan küresel durumun üstüne :math:`m' içindeki tüm işlemleri sırayla uygulayarak :math:`m` için durum sonrasını hesapla. Hesaplanan durum sonrası özeti değerinin, :math:`m`'de saklanan post-state-hash değerine eşit olup olmadığını kontrol et. Değilse, :math:`m` (geçersiz blok) ögesini bırak ve çık.
vi: Tính toán hậu trạng thái cho :math:`m` bằng cách áp dụng tuần tự tất cả các giao dịch trong :math:`m` trên phần đầu của trạng thái toàn cục được tính ở bước (3). Kiểm tra xem hash được tính toán của post-state có bằng với post-state-hash được lưu trữ trong :math:`m` hay không. Nếu không, hãy thả :math:`m` (khối không hợp lệ) và thoát.

source: Store post-state calculated in step (4) in :math:`global\_states\_db`.
fr: Enregistrer le post-state calculé à l'étape (4) dans :math:`global\_states\_db`.
tr: Adım(4)'te hesaplanan durum sonrasını :math:`global\_states\_db`'de depola.
vi: Lưu trữ hậu trạng thái được tính ở bước (4) trong :math:`global\_states\_db`.

source: If :math:`m` is a ballot:
fr: Si :math:`m` est un scrutin (ballot):
tr: Eğer :math:`m` bir oy pusulası ise:
vi: Nếu :math:`m` là một phiếu bầu:

source: Validate whether :math:`m.target\_block` was selected correctly:
fr: Vérifier si :math:`m.target\_block` a été sélectionné correctement :
tr: :math:`m.target\_block`'un doğru şekilde seçilip seçilmediğini doğrula:
vi: Xác thực xem :math:`m.target\ _block` đã được chọn đúng hay chưa:

source: compare calculated main parent candidate with actual :math:`m.target\_block`:
fr: comparer le candidat parent principal calculé avec le :math:`m.target_block` réel
tr: Hesaplanan ana üst öge adayını gerçek :math:`m.target\_block` ile kıyasla:
vi: so sánh ứng viên lớp trên chính được tính toán với thực tế :math:`m.target\ _block`:

source: **Publishing loop:**
tr: **Yayınlama döngüsü:**
vi: **Vòng lặp xuất bản (Publishing loop):**

source: Sleep unless the next time for proposing a block arrives (typically this may be a periodic activity based on wall clock).
fr: Se mettre en sommeil jusqu'à ce que le prochain moment pour proposer un bloc arrive (typiquement, cela peut être une activité périodique basée sur un wall clock).
tr: Blok önerme gelmedikçe uyu (tipik olarak bu, duvar saatine dayalı periyodik bir aktivite olabilir).
vi: Chế độ ngủ trừ khi đến thời gian đề xuất khối tiếp theo (thông thường đây có thể là một hoạt động định kỳ dựa trên đồng hồ).

source: Run fork-choice against the current blockdag (see next section). The result is:
fr: Exécuter le fork-choice sur le blockdag actuel (voir section suivante). Le résultat est le suivant :
tr: Şu anki blockdag'e karşılık fork-choice'i çalıştır (sonraki kısma bakınız). Sonuç şu şekildedir:
vi: Chạy fork-choice dựa trên blockdag hiện tại (xem phần tiếp theo). Kết quả là:

source: Main parent - :math:`mp`.
tr: Ana üst öge - :math:`mp`.
vi: Lớp trên chính - :math:`mp`.

source: Collection of secondary parents - :math:`sp` - sorted by preference.
fr: Collection de parents secondaires - :math:`sp` - triés par préférence.
tr: İkincil üst ögelerin toplamı - :math:`sp` - tercihe göre sıralı.
vi: Tập hợp lớp trên thứ cấp - :math:`sp` - sắp xếp tuỳ ý.

source: Pick the maximal non-conflicting subset :math:`mncsp \subset sp`, respecting the selection of :math:`mp` and the ordering of :math:`sp`.
fr: Choisir le sous-ensemble maximal non conflictuel :math:`mncsp \subset sp`, en respectant la sélection de :math:`mp` et l'ordre de :math:`sp`.
tr: :math:`mp` seçimine ve :math:`sp` sıralamasına uyarak, çakışmayan maksimum alt kümeyi :math:`mncsp \subset sp` seç.
vi: Chọn tập con tối đa không xung đột :math:`mncsp \subset sp`, lưu ý lựa chọn của :math:`mp` và thứ tự của :math: `sp`.

source: Calculate merged global state :math:`merged\_gs` derived from :math:`\{mp\} \cup mncsp`.
fr: Calculer l'état global fusionné :math:`merged\_gs` dérivé de :math:`\{mp\} \cup mncsp`.
tr: :math:`\{mp\} \cup mncsp`'den türetilen, :math:`merged\_gs` birleştirilmiş küresel durumu hesaplayın.
vi: Tính toán trạng thái toàn cục đã hợp nhất :math:`merged\_gs` từ :math:`\{mp\} \cup mncsp`.

source: Check the weight of local validator in merged global state: :math:`weights\_map(merged\_gs)(vid)`
fr: Vérifier le poids du validateur local dans l'état global fusionné : :math:`weights\_map(merged\_gs)(vid)`
tr: Birleştirilmiş küresel durumda yerel doğrulayıcının ağırlığını kontrol edin: :math:`weights\_map(merged\_gs)(vid)`
vi: Kiểm tra trọng số của nhà xác thực cục bộ ở trạng thái toàn cục đã hợp nhất: :math:`weights\_map(merged\_gs)(vid)`

source: If weight is non-zero and :math:`deploys-buffer` is nonempty, we will be creating and publishing a new block.
fr: Si 'weight' est différent de zéro et que :math:`deploys-buffer` est non vide, nous allons créer et publier un nouveau bloc.
tr: Eğer ağırlık sıfırdan farklı ise ve :math:`deploys-buffer`, boş değilse, yeni bir blok oluşturup yayınlıyor olacağız.
vi: Nếu trọng số khác 0 và :math:`deploys-buffer` không trống, thì chúng tôi sẽ tạo và xuất bản một khối mới.

source: otherwise - check the status of local validator:
fr: sinon - vérifier l'état du validateur local :
tr: değilse - yerel doğrulayıcının durumunu kontrol et:
vi: nếu không - hãy kiểm tra trạng thái của nhà xác thực cục bộ:

source: VOTING_ONLY => create and publish a new ballot
fr: VOTING_ONLY => créer et publier un nouveau ballot
tr: VOTING_ONLY => yeni bir oy pusulası oluştur ve yayınla
vi: VOTING_ONLY => tạo và xuất bản một phiếu bầu mới

source: otherwise => exit
fr: sinon => sortir
tr: aksi halde => çıkış
vi: ngược lại => thoát

source: Case 1: new block
fr: Cas 1: nouveau bloc
tr: Durum 1: yeni blok
vi: Trường hợp 1: khối mới

source: Take desired subset of transactions :math:`trans` from :math:`deploys-buffer` (this part of behavior is subject to a separate spec; on this level of abstraction we accept any strategy of picking transactions from the buffer).
fr: Prendre le sous-ensemble souhaité de transactions :math:`trans` dans :math:`deploys-buffer` (cette partie du comportement fait l'objet d'une spécification séparée ; à ce niveau d'abstraction, nous acceptons toute stratégie de sélection des transactions du buffer).
tr: :math:`deploys-buffer`'dan :math:`trans` istenen işlemler alt kümesini al (davranışın bu kısmı ayrı bir spesifikasyona tabidir; soyutlamanın bu seviyesinde arabellekten işlem seçmenin herhangi bir stratejisini kabul ediyoruz).
vi: Lấy tập hợp con các giao dịch mong muốn :math:`trans` từ :math:`deploys-buffer`(phần hành vi này phải tuân theo một thông số kỹ thuật riêng; ở mức độ trừu tượng này, chúng tôi chấp nhận bất kỳ chiến lược chọn giao dịch nào từ bộ đệm).

source: Apply :math:`trans` sequentially on top of :math:`merged\_gs`. Let :math:`post\_gs` be the resulting global state.
fr: Appliquer :math:`trans` séquentiellement sur :math:`merged\_gs`. Soit :math:`post\_gs` l'état global résultant.
tr: :math:`merged\_gs` üzerine :math:`trans` sıralı olarak uygula. :math:`post\_gs` sonuç küresel durumu olacaktır.
vi: Áp dụng :math:`trans` tuần tự trên phần đầu :math:`merge\_gs`. Đặt :math:`post\_gs` là trạng thái toàn cục kết quả.

source: Create new block:
fr: Créer u nouveau bloc:
tr: Yeni blok oluştur:
vi: Tạo khối mới:

source: block id = hash of the binary representation of this block
fr: block id = hash de la représentation binaire de ce bloc
tr: blok kimliği = bu bloğun ikili kodlu gösteriminin özeti
vi: id khối = băm của biểu diễn nhị phân của khối này

source: creator id = :math:`vid`
tr: oluşturan kimliği = :math:`vid`
vi: id trình tạo = :math:`vid`

source: main parent = :math:`mp`
tr: ana üst öge = :math:`mp`
vi: lớp trên chính = :math:`mp`

source: secondary parents = :math:`mncsp`
tr: ikincil üst ögeler = :math:`mncsp`
vi: lớp trên thứ cấp = :math:`mncsp`
