Repository: casper-network/docs-archive
Catalog: locale/*/LC_MESSAGES/theory/naive-blockchain.po
Languages: fr, tr, vi

source: justifications = :math:`latest\_honest\_messages` after removing main parent, secondary parents, and redundant messages (see explanation below)
fr: justifications = :math:`latest\_honest\_messages` après avoir supprimé le parent principal, les parents secondaires et les messages redondants (voir l'explication ci-dessous)
tr: gerekçeler = :math:`latest\_honest\_messages` ana üst ögenin kaldrılması sonrasında, ikincil üst ögeler, ve fazlalık mesajlar (aşağıda açıklamasını bulabilirsiniz)
vi: biện minh = :math:`latest\_honest\_messages` sau khi xóa lớp trên chính, phụ và thông điệp thừa (xem giải thích bên dưới)

source: transactions list = :math:`trans`
tr: işlemler listesi = :math:`trans`
vi: danh sách giao dịch = :math:`trans`

source: post-state hash = :math:`hash(post\_gs)`
tr: durum sonrası özeti = :math:`hash(post\_gs)`

source: Store :math:`post\_gs` in :math:`global\_states\_db`
tr: :math:`post\_gs`'yi :math:`global\_states\_db`'de depola
vi: Lưu trữ :math:`post\_gs` in :math:`global\_states\_db`

source: Broadcast new block across validators P2P network.
fr: Diffuser le nouveau bloc à travers le réseau P2P des validateurs.
tr: Doğrulayıcılar P2P ağı genelinde yeni blok yayınlayın.
vi: Gửi đi khối mới trên mạng P2P của nhà xác thực.

source: Case 2: new ballot
fr: Cas 2: nouveau ballot
tr: Durum 2: yeni oy pusulası
vi: Trường hợp 2: phiếu bầu mới

source: Create new ballot:
fr: Créer un nouveau ballot:
tr: Yeni oy pusulası oluştur:
vi: Tạo phiếu bầu mới:

source: target block = :math:`mp`
tr: hedef blok = :math:`mp`
vi: khối đích = :math:`mp`

source: justifications = :math:`latest\_honest\_messages` after removing: target block and redundant messages (see explanation below)
fr: justifications = :math:`latest\_honest\_messages` après suppression : bloc cible et messages redondants (voir explication ci-dessous)
tr: gerekçeler = :math:`latest\_honest\_messages` şunları kaldırınca: hedef blok ve fazlalık mesajlar (açıklamasını aşağıda bulabilirsiniz)
vi: biện minh = :math:`latest\_honest\_messages` sau khi loại bỏ: khối đích và các thông báo thừa (xem giải thích bên dưới)

source: Broadcast new ballot across validators P2P network.
fr: Diffuser le nouveau ballot sur le réseau P2P des validateurs.
tr: Doğrulayıcılar P2P ağı genelinde yeni oy pusulası yayınlayın.
vi: Gửi đi phiếu bầu mới trên mạng P2P của nhà xác thực.

source: Note: we generally want to keep the collection :math:`m.justifications` as short as possible. For this, we never include there main parent, secondary parents, and target block. Also, we want the collection of justifications included in the message to be transitively reduced (= included justifications form an antichain).
fr: Note : nous voulons généralement garder la collection :math:`m.justifications` aussi courte que possible. Pour cela, nous n'incluons jamais le parent principal, les parents secondaires et le bloc cible. De plus, nous voulons que la collection de justifications incluses dans le message soit réduite de manière transitive (= les justifications incluses forment une antichaîne).
tr: Not: Biz genellikle :math:`m.justifications` toplamını mümkün olduğunca kısa tutmak isteriz. Bunun için asla ana üst öge, ikincil üst ögeler ve hedef bloğu dahil etmiyoruz. Ayrıca, mesaja dahil edilen gerekçeler toplamının geçişli olarak azaltılmasını istiyoruz (= dahil edilen gerekçeler bir antizincir oluşturur).
vi: Lưu ý: chúng tôi thường muốn giữ tập hợp :math:`m.justifications`càng ngắn càng tốt. Do đó, chúng tôi không bao giờ đưa vào lớp trên chính, lớp trên phụ và khối đích. Ngoài ra, chúng tôi muốn tập hợp các biện minh có trong thông điệp được giảm bớt một cách tạm thời (= những lời biện minh được đưa vào sẽ không tốt cho chuỗi).

source: Relative votes
fr: Votes relatifs
tr: Göreceli oylar
vi: Phiếu bầu liên quan

source: We will need the concept of “last message created by validator **v** that was a non-empty vote in **b-game**”. Given any block :math:`b` and any validator :math:`V` let us take look at the swimlane of :math:`V`. If :math:`v` is honest, then this swimlane is a chain. Any message :math:`m` counts as a non-empty vote in **b-game** only if:
fr: Nous aurons besoin du concept de "dernier message créé par le validateur **v** qui était un vote non vide dans **b-game**". Étant donné un bloc :math:`b` et un validateur :math:`V`, regardons le swimlane de :math:`V`. Si :math:`v` est honnête, alors ce swimlane est une chaîne. Tout message :math:`m` compte comme un vote non vide dans **b-game** seulement si :
tr: “**b-oyunu**'nda boş olmayan oy olan **v** doğrulayıcısı tarafından oluşturulan son mesaj” kavramına ihtiyacımız olacak. Herhangi bir :math:`b` bloğu ve herhangi bir doğrulayıcı :math:`V` verilsin, :math:`V`'nin kulvarına bakalım. Eğer :math:`v`, dürüst ise, bu kulvar bir zincirdir. Sadece şu durumlarda, :math:`m` **b-oyunu**'nda boş olmayan bir oy olarak sayılır:
vi: Chúng tôi sẽ cần khái niệm “thông báo cuối cùng được tạo bởi nhà xác thực **v** là một phiếu bầu không trống trong **b-game**”. Cho bất kỳ khối nào :math:`b` và bất kỳ nhà xác thực nào :math:`V`, chúng ta hãy nhìn vào bảng điều khiển của :math:`V`. Nếu :math:`v` là đúng, thì vùng này là một chuỗi. Bất kỳ thông điệp nào :math:`m` được tính là một phiếu bầu không trống trong **b-game** chỉ khi:

source: :math:`m` is a block and the ancestor of :math:`m` (in main-tree) is :math:`b`
fr: math:`m` est un bloc et l'ancêtre de :math:`m` (dans l'arbre principal) est :math:`b`.
tr: :math:`m` bir bloktur ve :math:`m`'in (ana ağaçta) üst soyu :math:`b`'dir.
vi: :math:`m` là một khối và nguồn gốc của :math:`m` (in main-tree) là :math:`b`

source: :math:`m` is a ballot and the ancestor of :math:`m.target\_block` (in main-tree) is :math:`b`
fr: :math:`m` est un scrutin (ballot) et l'ancêtre de :math:`m.target\_block` (dans main-tree) est :math:`b`
tr: :math:`m` bir oy pusulasıdır ve :math:`m.target\_block`'un (ana ağaçta) üst soyu :math:`b`'dir
vi: :math:`m` là một phiếu và nguồn gốc của :math:`m.target\_block` (trong main-tree) là :math:`b`

source: We start from the latest (= top-most on the diagram) message in the :math:`swimlane(v)` and we traverse the swimlane down, stopping as soon as we find a message that counts as a non-empty vote in **b-game**.
fr: Nous partons du dernier message (= le plus haut sur le diagramme) dans le :math:`swimlane(v)` et nous parcourons le swimlane vers le bas, en nous arrêtant dès que nous trouvons un message qui compte comme un vote non vide dans **b-game**.
tr: :math:`swimlane(v)` 'deki en son (=şemada en üst) mesajdan başlarız ve **b-oyunu**'nda boş olmayan olarak sayılabilecek bir mesaj bulana kadar aşağı doğru kulvarın üzerinden geçeriz,
vi: Chúng tôi bắt đầu từ thông điệp mới nhất (= ở trên cùng của sơ đồ) trong :math:`swimlane(v)` và ngang qua vùng phía dưới, dừng lại ngay khi chúng tôi tìm thấy một thông điệp được tính là một phiếu không trống trong **b-game**.

source: \ **Example:**\
fr: \ **Exemple:**\
tr: \ **Örnek:**\
vi: \ **Ví dụ:**\

source: Below is the original example of the blockdag, but with all messages that are non-empty votes in 3-game highlighted with green:
fr: Ci-dessous, l'exemple original du blockdag, mais avec tous les messages qui sont des votes non vides dans 3-game surlignés en vert :
tr: Blockdag'in orijinal örneği aşağıdadır, ancak 3-oyunda boş oy olmayan tüm mesajlar yeşil ile vurgulanmıştır:
vi: Dưới đây là ví dụ ban đầu về blockdag, nhưng tất cả các thông điệp là phiếu bầu không trống trong 3 trò chơi được đánh dấu bằng màu xanh lá cây:

source: **Example:**
fr: **Exemple**:
tr: **Örnek:**
vi: **Ví dụ:**

source: Let us again look at the example of a blockdag:
fr: Prenons à nouveau l'exemple d'un blockdag :
tr: Tekrar blockdag örneğine bakalım:
vi: Hãy cùng chúng tôi xem xét lại ví dụ về blockdag:

source: Let’s apply this definition using validator 3 as the example and find the last votes of validator 3 in various games.
fr: Appliquons cette définition en utilisant le validateur 3 comme exemple et trouvons les derniers votes du validateur 3 dans différents jeux.
tr: Bu tanımı, doğrulayıcı 3'ü örnek olarak kullanarak uygulayalım ve çeşitli oyunlarda doğrulayıcı 3'ün son oylarını bulalım.
vi: Hãy áp dụng định nghĩa này bằng cách sử dụng nhà xác thực 3 làm ví dụ và tìm các phiếu bầu cuối cùng của nhà xác nhận 3 trong các trò chơi khác nhau.

source: Block b
fr: Bloc b
tr: Blok b
vi: Khối b

source: Last non-empty vote of validator 3 in b-game
fr: Dernier vote non vide du validateur 3 dans le b-game
tr: b-oyununda doğrulayıcı 3'ün boş olmayan son oyu
vi: Phiếu bầu không trống cuối cùng của trình xác thực 3 trong b-game

source: Genesis
fr: Genèse (Genesis)
tr: Doğuş (genesis)

source: (none)
tr: (yok)

source: The goal of fork-choice is to take the decision on top of the version of the shared database history we want to build in the next step. This decision can be seen as an iterative application of the reference estimator from the “Abstract Casper Consensus”. As a result we want to get a list of blocks (ordered by preference) which will serve as parent candidates for the new block.
fr: Le but du 'fork-choice' est de prendre la décision sur la version de l'historique de la base de données partagée que nous voulons construire dans l'étape suivante. Cette décision peut être vue comme une application itérative de l'estimateur de référence du "Abstract Casper Consensus". En conséquence, nous voulons obtenir une liste de blocs (ordonnés par préférence) qui serviront de candidats parents pour le nouveau bloc.
tr: Fork-choice'in amacı, bir sonraki adımda oluşturmak istediğimiz paylaşılan veritabanı geçmişinin sürümünün üzerine karar vermektir. Bu karar, “Özet Casper Mutabakatı”ndan referans tahmincisinin yinelemeli bir uygulaması olarak görülebilir. Sonuç olarak, yeni blok için üst öge adayları olarak hizmet edecek blokların (tercihe göre sıralanmış) bir listesini almak istiyoruz.
vi: Mục tiêu của fork-choice là đưa ra quyết định về phiên bản của lịch sử cơ sở dữ liệu được chia sẻ mà chúng tôi muốn xây dựng trong bước tiếp theo. Quyết định này có thể được coi là một ứng dụng lặp đi lặp lại của công cụ ước tính tham chiếu từ “Abstract Casper Consensus”. Do đó, chúng tôi muốn có được một danh sách các khối (được sắp xếp theo tùy chọn) sẽ đóng vai trò là các ứng cử viên chính cho khối mới.

source: The algorithm goes as follows:
fr: L'algorithme est le suivant :
tr: Algoritma şu şekilde devam eder:
vi: Thuật toán diễn ra như sau:

source: Decide which protocol state :math:`ps` to use: 1. When using fork choice for creation of new block this is the point where the validator can decide on the subset of his local knowledge to reveal to outside world. Ideally, the validator reveals all local knowledge, so it takes as protocol state the whole local blockdag.
fr: Décider de l'état du protocole :math:`ps` à utiliser : 1. Lorsque le fork choice est utilisé pour la création d'un nouveau bloc, c'est le moment où le validateur peut décider du sous-ensemble de ses connaissances locales à révéler au monde extérieur. Idéalement, le validateur révèle toutes les connaissances locales, il prend donc comme état protocolaire l'ensemble du blockdag local.
tr: Hangi :math:`ps` protokol durumunun kullanılacağına karar ver: 1. Yeni blok oluşturmak için fork choice kullanırken bu, doğrulayıcının yerel bilgisinin alt kümesini dış dünyaya göstermek için karar verebileceği noktadır. İdeal olarak, doğrulayıcı tüm yerel bilgileri ortaya çıkarır, bu nedenle protokol durumu olarak tüm yerel blockdag'i alır.
vi: Quyết định trạng thái giao thức nào :math:`ps` để sử dụng: 1. Khi sử dụng sự lựa chọn nhánh để tạo khối mới, đây là điểm mà nhà xác nhận có thể quyết định tập hợp con thông tin cục bộ của mình để chia sẻ với thế giới bên ngoài. Lý tưởng nhất, nhà xác thực tiết lộ tất cả thông tin cục bộ, vì vậy nó được coi như giao thức trạng thái của toàn bộ blockdag cục bộ.

source: When using fork choice for validation of received message :math:`m`, the protocol state to take is :math:`j\_past\_cone(m)`.
fr: Lors de l'utilisation du fork choice pour la validation du message reçu :math:`m`, l'état du protocole à prendre est :math:`j\_past\_cone(m)`.
tr: Alınan :math:`m` mesajının doğrulaması için fork choice kullanırken, alınması gereken protokol durumu :math:`j\_past\_cone(m)`'dir.
vi: Khi sử dụng lựa chọn ngã nhánh để xác thực thông điệp đã nhận :math:`m`, trạng thái giao thức cần thực hiện là :math:`j\_past\_cone(m)`.

source: Take :math:`HV` - all honest validators (all creators of messages in :math:`ps` minus those seen equivocating with messages in :math:`ps`).
fr: Prendre :math:`HV` - tous les validateurs honnêtes (tous les créateurs de messages dans :math:`ps` moins ceux que l'on voit équivoquer avec des messages dans :math:`ps`).
tr: :math:`HV`'yi al - tüm dürüst doğrulayıcılar (:math:`ps`'deki mesajların tüm oluşturucuları eksi :math:`ps` ile çelişkili görülenler).
vi: Lấy :math:`HV` - tất cả những nhà xác thực trung thực (tất cả những người tạo ra thông điệp trong :math:`ps` trừ những người được thấy tương đương với thông điệp trong :math:`ps`).

source: Find latest message :math:`lm(v)` created by each validator :math:`v \in HV`, ignoring validators that produced no message.
fr: Trouver le dernier message :math:`lm(v)` créé par chaque validateur :math:`v \in HV`, en ignorant les validateurs qui n'ont produit aucun message.
tr: Hiç mesaj üretmemiş doğrulayıcıları görmezden gelerek, her bir :math:`v \in HV` doğrulayıcı tarafından oluşturulan son mesajları :math:`lm(v)` bul.
vi: Tìm thông điệp mới nhất : math:`lm(v)` được tạo bởi mỗi nhà xác thực :math:`v\in HV`, bỏ qua các nhà xác thực không tạo ra thông điệp nào.

source: For all validators that have :math:`lm(v)` defined take:
fr: Pour tous les validateurs qui ont :math:`lm(v)` défini, prendre :
tr: Tanımlı :math:`lm(v)` sahip tüm doğrulayıcılar için şu şekilde al:
vi: Đối với tất cả nhà xác thực có :math:`lm(v)` được xác định, hãy lấy:

source: tipBlock(v)=\begin{cases} lm(v), & lm(v) \space is \space a \space block \\lm(v).target\_block, & otherwise \end{cases}
tr: tipBlock(v)=\begin{cases} lm(v), & lm(v) \space bir \space \space blok \\lm(v).target\_block, & yoksa \end{cases}
vi: tipBlock(v)=\begin{cases} lm(v), & lm(v) \space là \space một \space khối \\lm(v).target\_block, & nếu không thì \end{cases}

source: Take :math:`lca\_block` = latest common ancestor along main-tree of all :math:`tipBlock(v)`
fr: Prendre :math:`lca\_block` = dernier ancêtre commun dans l'arbre principal de tous les :math:`tipBlock(v)`.
tr: :math:`lca\_block` = :math:`tipBlock(v)`'nin ana ağaç boyunca en son ortak üst soyu olarak al
vi: Lấy :math:`lca\_block` = nguồn gốc chung mới nhất dọc theo cây chính của tất cả :math:`tipBlock(v)`

source: Initialize resulting collection of blocks as one-element list :math:`Result = [lca\_block]`
fr: Initialiser la collection de blocs résultante sous forme de liste à un élément :math:`Résultat = [lca\_block]``.
tr: Elde edilen blok toplamını, bir elemanlı liste olarak olarak başlat :math:`Result = [lca\_block]`
vi: Khởi tạo tập hợp các khối kết quả dưới dạng danh sách một phần tử (one-element list) :math:`Kết quả = [lca\_block]`

source: For each block :math:`b` in :math:`Result` replace :math:`b` with its direct children in main-tree: :math:`c_1, c_2, ..., c_n`, where the list of children is ordered following this recipe:
fr: Pour chaque bloc :math:`b` dans :math:`Result`, remplacer :math:`b` par ses enfants directs dans l'arbre principal : :math:`c_1, c_2, ..., c_n`, où la liste des enfants est ordonnée selon cette recette :
tr: :math:`Result`'taki her bir :math:`b` bloğu için, :math:`b`'yi ana ağaçtaki kendisinin direkt alt ögesi ile değiştir: :math:`c_1, c_2, ..., c_n` ki burada alt ögeler şu tarife göre sıralanmıştır:
vi: Đối với mỗi khối :math:`b` trong :math:`Kết quả` thay thế :math:`b` bằng các con trực tiếp của nó trong cây chính: :math:`c_1, c_2, ..., c_n`, trong đó danh sách các lớp con được sắp xếp theo công thức này:

source: For each honest validator :math:`v` find :math:`lmb(v)` - the last message by :math:`v` voting in **b-game.**
fr: Pour chaque validateur honnête :math:`v`, trouver :math:`lmb(v)` - le dernier message par :math:`v` votant dans **b-game.**.
tr: Her bir :math:`v` dürüst doğrulayıcı için :math:`lmb(v)`'yi bul - **b-oyunu**nda oy kullanan :math:`v`'nin son mesajı.
vi: Đối với mỗi nhà xác thực đúng :math:`v` tìm :math:`lmb (v)`- thông điệp cuối cùng của :math:`v` bỏ phiếu trong **b-game.**

source: Find a child :math:`c_i` that :math:`lmb(v)` is voting for - by traversing down the main-tree.
fr: Trouver un enfant :math:`c_i` pour lequel :math:`lmb(v)` vote - en parcourant l'arbre principal.
tr: Ana ağaç boyunca takip ederek, :math:`lmb(v)`'nin oy kullandığı bir :math:`c_i` alt ögesi bul.
vi: Tìm một lớp con :math:`c_i` mà :math:` lmb(v)` đang bỏ phiếu cho - bằng cách di chuyển xuống cây chính.

source: Using :math:`validator\_weights(b)` count the votes.
fr: En utilisant :math:`validator\_weights(b)`, compter les votes.
tr: :math:`validator\_weights(b)`'yi kullanarak oyları say.
vi: Sử dụng :math:`validator\_weights(b)` đến số phiếu.

source: Order the sequence :math:`c_i` by calculated votes, using :math:`ci.id` (= block hash) as tie-breaker.
fr: Ordonner la séquence :math:`c_i` par les votes calculés, en utilisant :math:`ci.id` (= hachage de bloc) pour les départager.
tr: :math:`ci.id`'yi (= blok özeti) eşitliği bozen set olarak kullanarak :math:`c_i`'yi hesaplanan oylara göre sırala.
vi: Sắp xếp thứ tự :math:`c_i` theo số phiếu được tính toán, sử dụng :math:`ci.id` (= khối băm) làm để quyết định.

source: Repeat step 7 as long as it is changing **Result**.
fr: Répéter l'étape 7 tant qu'elle change **Result**.
tr: **Sonuc**u değiştirene kadar adım 7'yi tekrarla.
vi: Lặp lại bước 7 miễn là nó thay đổi **Kết quả**.

source: The **Result** is the list of blocks we want. The first block on the list is the main parent candidate, remaining blocks are secondary parents candidates.
fr: Le **Result** est la liste des blocs que nous voulons. Le premier bloc de la liste est le candidat parent principal, les autres blocs sont des candidats parents secondaires.
tr: **Sonuç** bizim istediğimiz blokların listesidir. Listedeki ilk blok, ana üst öge adayıdır, kalan bloklar ikincil üst öge adaylarıdır.
vi: **Kết quả** là danh sách các khối mà chúng ta muốn. Khối đầu tiên trong danh sách là ứng viên của lớp trên chính, các khối còn lại là ứng viên lớp thứ cấp.

source: Operation of a finalizer
fr: Fonctionnement d'un finalisateur
tr: Kesinleştiricinin çalışması
vi: Hoạt động của một trình hoàn thiện

source: The objective
fr: L'objectif
tr: Amaç
vi: Mục tiêu

source: Finalizer observes the growing blockchain. The objective is to recognize the subset of transactions history that:
fr: Le finalisateur (finalizer) observe la croissance de la blockchain. L'objectif est de reconnaître le sous-ensemble de l'historique des transactions qui :
tr: Kesinleştirici, büyüyen blok zincirini gözlemler. Amaç, işlem geçmişinin alt kümesini tanımaktır ki bu alt küme:
vi: Trình hoàn thiện quan sát chuỗi khối đang phát triển. Mục tiêu là nhận ra tập hợp con lịch sử giao dịch:

source: is already agreed (as a result of on-going consensus)
fr: est déjà accepté (à la suite d'un consensus permanent)
tr: halihazırda kararlaştırılmıştır (devam eden bir mutabakatın sonucu olarak)
vi: đã được đồng ý (kết quả của sự đồng thuận đang diễn ra)

source: cannot be reverted (unless the equivocators collection exceeds - by total weight - predefined threshold)
fr: ne peut pas être révoqué (sauf si la collection d'équivoques dépasse - en poids total - un seuil prédéfini)
tr: geri çevrilemez (çelişkililer toplamı - toplam ağırlık olarak - önceden tanımlanmış eşiği aşmıyorsa)
vi: không thể hoàn nguyên (trừ khi bộ sưu tập bộ tương đương vượt quá - theo tổng trọng số - ngưỡng xác định trước)

source: Parameters
fr: Paramètres
tr: Parametreler
vi: Tham số

source: In general - different finalizers will be based on different finality criteria. For the current design we assume that the criterion described in the previous chapter is in use.
fr: En général - les différents finalisateurs seront basés sur différents critères de finalité (finality criteria). Pour la conception actuelle, nous supposons que le critère décrit dans le chapitre précédent est utilisé.
tr: Genel olarak - farklı kesinleştiriciler farklı kesinlik kritererini baz alacaklardır. Şu anki tasarım için, önceki kısımda açıklanan kriterlerin kullanımda olacağını varsayıyoruz.
vi: Nói chung - các kết quả cuối cùng khác nhau sẽ dựa trên các tiêu chí cuối cùng khác nhau. Đối với thiết kế hiện tại, chúng tôi giả định rằng đang sử dụng tiêu chí được mô tả trong chương trước.

source: Hence, the finalizer is parameterized by:
fr: Par conséquent, le finalisateur est paramétré par :
tr: Sonuç olarak, kesinleştirici şu şekilde parametrelerle açıklanabilir:
vi: Do đó, trình hoàn thiện được tham số hóa bởi:

source: the type of finality detector to be used
fr: le type de détecteur de finalité à utiliser
tr: kullanılacak kesinlik algılayıcının türü
vi: kiểu dò cuối cùng sẽ sử dụng

source: **K** - acknowledgement level
fr: **K** - niveau de reconnaissance
tr: **K** - onay seviyesi
vi: **K** - mức độ nhận biết

source: **WP** (weight percentage) - expressed as a number between 0 and 1
fr: **WP** (pourcentage en poids) - exprimé par un nombre compris entre 0 et 1
tr: **WP** (ağırlık yüzdesi) - 0 ila 1 arasında bir sayı ile ifade edilir
vi: **WP** (tỷ lệ phần trăm trọng số) - được biểu thị bằng một số từ 0 đến 1

source: State
fr: État
tr: Durum
vi: Trạng thái

source: The assumption is that a finalizer can traverse the blockdag, reading contents of blocks. Also, for any block b it should be able to read post-state of b, and in particular get the weights-map from this post-state.
fr: L'hypothèse est qu'un finalisateur peut traverser le blockdag, en lisant le contenu des blocs. De plus, pour tout bloc b, il devrait pouvoir lire le post-state de b, et en particulier obtenir la map des poids à partir de ce post-state.
tr: Varsayım, bir kesinleştiricinin blockdag'i geçerek blokların içeriğini okuyabileceğidir. Ayrıca, herhangi bir b bloğu için b'nin durum sonrasını okuyabilmeli ve özellikle bu durum sonrasından ağırlık haritasını alabilmelidir.
vi: Giả định là một trình hoàn thiện có thể duyệt qua blockdag, đọc nội dung của các khối. Ngoài ra, đối với bất kỳ khối b nào, nó sẽ có thể đọc hậu trạng thái của b, và đặc biệt là lấy bản đồ trọng số từ hậu trạng thái này.

source: The internal state of the “reference” implementation of a finalizer would be:
fr: L'état interne de l'implémentation "de référence" d'un finalisateur serait :
tr: Bir kesinleştiricinin "referans" uygulamasının dahili durumu şöyle olacaktır:
vi: Trạng thái nội bộ của việc triển khai "tham chiếu" của một trình hoàn thiện sẽ là:

source: current finality detector instance - the one observing **LFB(current-game-id)-game**
fr: l'instance actuelle du détecteur de finalité (finality detector instance) - celle qui observe **LFB(current-game-id)-game**
tr: mevcut kesinlik algılayıcı örneği - **LFB(current-game-id)-game** gözlemleyen örnek
vi: phiên bản bộ dò cuối cùng hiện tại - đang quan sát **LFB(current-game-id)-game**

source: **LFB: Seq[Block]** for **i=0 … current-game-id**
tr: **i=0 … current-game-id** için **LFB: Seq[Block]**
vi: **LFB: Seq[Block]** cho **i=0 … current-game-id**

source: Initial state (on the beginning of the blockchain, the only block is Genesis):
fr: État initial (au début de la blockchain, le seul bloc est Genesis) :
tr: Başlangıç durumu (blok zincirinin başlangıcındaki tek blok Genesis'tir):
vi: Trạng thái ban đầu (ở phần đầu của blockchain, khối duy nhất là Genesis):
