Repository: casper-network/docs-archive
Catalog: locale/*/LC_MESSAGES/theory/naive-blockchain.po
Languages: fr, tr, vi

source: **J-dag** is all about attesting what I have seen so far. When I am a validator creating a new message (= block or ballot), I have to attest what is my current protocol state -- i.e., what my current blockdag looks like. I do this by including on the justifications list (which is part of the new message) pointers to all **j-dag** tips present in my blockdag. Please note that we continue to use the terminology established for j-dag from previous chapters (*See* the topic on J-dag).
fr: **J-dag** consiste à attester ce que nous avons vu jusqu'à présent. Lorsque je suis un validateur qui crée un nouveau message (= bloc ou bulletin), je dois attester de l'état actuel de mon protocole, c'est-à-dire de l'état actuel de mon blockdag. Je le fais en incluant dans la liste des justifications (qui fait partie du nouveau message) des pointeurs vers tous les points **j-dag** présents dans mon blockdag. Veuillez noter que nous continuons à utiliser la terminologie établie pour j-dag dans les chapitres précédents (*Voir* le sujet sur J-dag).
tr: **J-dag** şimdiye kadar gördüklerimi doğrulamakla ilgili. Yeni bir mesaj (= blok veya oy pusulası) oluşturan bir doğrulayıcı olduğumda, mevcut protokol durumumun ne olduğunu - yani mevcut blockdag'imin nasıl göründüğünü onaylamam gerekiyor. Bunu, engelleme listemde bulunan tüm **j-dag** ipuçlarına (yeni mesajın bir parçası olan) işaretçileri ekleyerek yapıyorum. Lütfen önceki bölümlerden j-dag için oluşturulmuş terminolojiyi kullanmaya devam ettiğimizi unutmayın (*Bkz.* J-dag başlığı).
vi: **J-dag** là việc chứng thực tất cả những gì tôi đã thấy cho đến nay. Khi tôi là nhà xác thực tạo thông điệp mới (= khối hoặc phiếu bầu), tôi phải chứng thực trạng thái giao thức hiện tại của mình - tức là thẻ khối hiện tại của tôi trông như thế nào. Tôi thực hiện việc này bằng cách đưa vào danh sách biện minh (là một phần của thông điệp mới) các con trỏ đến tất cả các **j-dag** có trong blockdag của tôi. Xin lưu ý rằng chúng tôi tiếp tục sử dụng thuật ngữ cho j-dag từ các chương trước (*Xem* chủ đề trên J-dag).

source: **Main-tree** encodes the multi-variant progress of a transaction's history. When a validator creating a block B picks block A as the main parent of B, it means “I want transactions included in B to extend the history of the blockchain that ended at block A with all transactions in A already executed”. This tree is analogous to a similar tree of blocks that forms in a previous generation of blockchains, like Bitcoin or Ethereum.
fr: **Main-tree** encode la progression multi-variante de l'historique d'une transaction. Lorsqu'un validateur créant un bloc B choisit le bloc A comme parent principal de B, cela signifie "Je veux que les transactions incluses dans B prolongent l'histoire de la blockchain qui s'est terminée au bloc A avec toutes les transactions de A déjà exécutées". Cet arbre est analogue à un arbre similaire de blocs qui se forme dans une génération précédente de blockchains, comme Bitcoin ou Ethereum.
tr: **Ana ağaç**, bir işlemin geçmişinin çok değişkenli ilerlemesini kodlar. Bir B bloğu oluşturan bir doğrulayıcı, A bloğunu B'nin üst ögesi olarak seçtiğinde, "B'ye dahil edilen işlemlerin, A bloğunda sona eren blokzincirin geçmişini A'da halihazırda yürütülen tüm işlemlerle birlikte genişletmesini istiyorum" anlamına gelir. Bu ağaç, Bitcoin veya Ethereum gibi önceki nesil blokzincirlerde oluşan benzer blok ağacına benzer.
vi: **Main-tree** mã hóa tiến trình nhiều kiểu của lịch sử giao dịch. Khi nhà xác thực tạo khối B, chọn khối A làm lớp trên chính của khối B, điều đó có nghĩa là “Tôi muốn các giao dịch được đưa vào trong B để mở rộng lịch sử của blockchain đã kết thúc ở khối A, với tất cả các giao dịch trong A đã được thực hiện”. Cây này tương tự như một cây khối tương tự hình thành trong thế hệ chuỗi khối trước đó, như Bitcoin hoặc Ethereum.

source: **P-dag** and the concept of secondary parents, corresponds to “merging of histories” -- a subtle optimization on the way we process transactions. In blockchains such as Ethereum, effectively only a single path of the main-tree ends up as “transactions that have been actually executed” while all the rest of the main-tree ends up being wasted, or - as we say - “orphaned”. In fact, the amount of wasted work can be reduced by “merging”. While creating a new block, a validator performs careful analysis of all branches of the main-tree and attempts to merge as many of them possible without introducing a concurrency conflict.
fr: **P-dag** et le concept de parents secondaires, correspond à la "fusion des historiques" -- une optimisation subtile de la façon dont nous traitons les transactions. Dans les blockchains telles qu'Ethereum, seul un chemin unique de l'arbre principal est considéré comme des "transactions qui ont été effectivement exécutées", tandis que tout le reste de l'arbre principal est gaspillé ou, comme on dit, "orphelin". En fait, la quantité de travail gaspillé peut être réduite par la "fusion". Lors de la création d'un nouveau bloc, un validateur effectue une analyse minutieuse de toutes les branches de l'arbre principal et tente d'en fusionner le plus possible sans introduire de conflit de concurrence.
tr: **P-dag** ve ikincil üst öge kavramı, "geçmişlerin birleştirilmesine" tekabül eder - işlemleri işleme şeklimizde ince bir optimizasyon. Ethereum gibi blokzincirlerde, ana ağacın yalnızca tek bir yolu "gerçekten yürütülen işlemler" olarak sonuçlanırken, ana ağacın geri kalanının tamamı boşa harcanır veya - tabiri caizse - "yetim kalır". . Aslında, boşa harcanan iş miktarı “birleştirme” ile azaltılabilir. Yeni bir blok oluştururken, bir doğrulayıcı ana ağacın tüm dallarının dikkatli bir analizini gerçekleştirir ve bir eşzamanlılık çakışması oluşturmadan mümkün olduğunca çoğunu birleştirmeye çalışır.
vi: **P-dag** và khái niệm lớp trên thứ cấp, tương ứng với "hợp nhất lịch sử" - một sự tối ưu hóa tinh tế trong cách chúng tôi xử lý giao dịch. Trong các chuỗi khối chẳng hạn như Ethereum, chỉ một đường dẫn duy nhất của cây chính kết thúc là “các giao dịch đã thực sự được thực hiện” trong khi tất cả phần còn lại của cây chính sẽ bị lãng phí, hoặc - như chúng ta nói - “mồ côi” hay "không có gốc". Trên thực tế, số lượng công việc lãng phí có thể được giảm bớt bằng cách “hợp nhất”. Trong khi tạo một khối mới, nhà xác thực thực hiện phân tích cẩn thận tất cả các nhánh của cây chính và cố gắng hợp nhất nhiều nhánh trong số chúng có thể mà không gây ra xung đột đồng thời.

source: Core mechanics of the blockchain
fr: Mécanismes fondamentaux de la blockchain
tr: Blok zincirinin temel mekaniği
vi: Cơ chế cốt lõi của chuỗi khối

source: The blockdag emerges as a combination of these central ideas:
fr: Le blockdag est né de la combinaison de ces idées centrales :
tr: Blockdag, bu belli başlı fikirlerin bir kombinasyonu olarak ortaya çıkıyor:
vi: Blockdag nổi lên như một sự kết hợp của những ý tưởng trung tâm sau:

source: Independently proposing updates of the shared database inevitably leads to a tree of transactions (blocks) because the proposing validator must choose which version of history it is about to extend. This is how the **main-tree** pops up.
fr: Proposer indépendamment des mises à jour de la base de données partagée conduit inévitablement à un arbre de transactions (blocs) car le validateur qui propose doit choisir quelle version de l'historique il s'apprête à étendre. C'est ainsi qu'apparaît le **main-tree**.
tr: Paylaşılan veritabanının güncellemelerini bağımsız olarak önermek, kaçınılmaz olarak bir işlem ağacına (bloklara) yol açar, çünkü teklifte bulunan doğrulayıcı, hangi geçmiş sürümünün genişletileceğini seçmek zorundadır. İşte **Ana ağaç** bu şekilde ortaya çıkar.
vi: Việc đề xuất cập nhật cơ sở dữ liệu được chia sẻ một cách độc lập chắc chắn dẫn đến một cây giao dịch (khối) vì nhà xác thực đề xuất phải chọn phiên bản lịch sử mà nó sắp mở rộng. Đây là cách **main-tree** bật lên.

source: All that remains is to add the mechanics for validators to collectively agree on which branch of the main-tree is the “official” one.
fr: Il ne reste plus qu'à ajouter les mécanismes permettant aux validateurs de convenir collectivement de la branche de l'arbre principal qui est la branche "officielle".
tr: Geriye kalan tek şey, doğrulayıcıların ana ağacın hangi dalının “resmi” olduğu konusunda toplu olarak mutabakata varmaları için mekanikleri eklemektir.
vi: Tất cả những gì còn lại là thêm cơ chế để những nhà xác thực cùng thống nhất về nhánh nào của cây chính là nhánh "chính thức".

source: We solve this problem by recursively applying the Abstract Casper Consensus (a.k.a. ACC).
fr: Nous résolvons ce problème en appliquant de manière récursive l'Abstract Casper Consensus (alias ACC).
tr: Bu sorunu, Özet Casper Mutabakatı'nı (namı diğer ACC) özyinelemeli olarak uygulayarak çözüyoruz.
vi: Chúng tôi giải quyết vấn đề này bằng cách áp dụng đệ quy Đồng thuận Casper trừu tượng (còn gọi là ACC - Abstract Casper Consensus).

source: The Secondary parents idea is a further refinement of the solution by merging as many non-agreed paths of a main-tree as possible without introducing inconsistencies.
fr: L'idée des parents secondaires est un raffinement supplémentaire de la solution en fusionnant autant de chemins non convenus d'un arbre principal que possible sans introduire d'incohérences.
tr: İkincil üst öge fikri, ana ağacın üzerinde mutabakata varılmamış yolların olabildiğince çok birleştirilerek çözümün daha da iyileştirilmesidir.
vi: Ý tưởng lớp trên thứ cập là một sự cải tiến thêm của giải pháp bằng cách hợp nhất càng nhiều đường dẫn không được thống nhất của một cây chính càng tốt mà không tạo ra sự mâu thuẫn.

source: The single most crucial trick here is the recursive application of the Abstract Casper Consensus -- to first try to understand this trick before diving into detailed specs of how validators and finalizers operate.
fr: L'astuce la plus cruciale ici est l'application récursive de l'Abstract Casper Consensus -- il faut d'abord essayer de comprendre cette astuce avant de plonger dans les spécifications détaillées du fonctionnement des validateurs et des finalisateurs (finalizers).
tr: Buradaki en önemli nokta, Özet Casper Mutabakatının özyinelemeli uygulamasıdır - doğrulayıcıların ve sonlandırıcıların nasıl çalıştığına dair ayrıntılı özelliklere dalmadan önce bu noktayı anlamaya çalışmaktır.
vi: Thủ thuật quan trọng nhất ở đây là ứng dụng đệ quy của Đồng thuận Casper trừu tượng - trước tiên hãy cố gắng hiểu thủ thuật này trước khi đi sâu vào thông số kỹ thuật chi tiết về cách hoạt động của nhà xác thực và trình hoàn thiện.

source: Let **b** be any block. So, **b** is a vertex in the main-tree. We will consider a projection of validators P2P protocol to a particular Abstract Casper Consensus model instance we will be calling **b-game**.
fr: Soit **b** un bloc quelconque. Ainsi, **b** est un sommet de l'arbre principal. Nous allons considérer une projection du protocole P2P des validateurs vers une instance particulière du modèle 'Abstract Casper Consensus' que nous appellerons **b-game**.
tr: **b** herhangi bir blok olsun. Yani, **b** ana ağaçta bir tepe noktasıdır. Doğrulayıcı P2P protokolünün, **b-game** olarak adlandıracağımız belirli bir Soyut Casper Mutabakat model örneğine projeksiyonunu ele alacağız.
vi: Cho **b** là một khối bất kỳ. Vì vậy, **b** là một đỉnh trong cây chính. Chúng tôi sẽ xem xét phép chiếu giao thức P2P của nhà xác thực cho một ví dụ mô hình Đồng thuận Casper trìu tượng cụ thể mà chúng tôi sẽ gọi là **b-game**.

source: Abstract Casper Consensus concept
fr: Le concept de l'Abstract Casper Consensus
tr: Özet Casper Mutabakat kavramı
vi: Khái niệm đồng thuận Casper trừu tượng (Abstract Casper Consensus)

source: How this concept maps to b-game
fr: Comment ce concept se rapporte au b-game ?
tr: Bu kavram b-game ile nasıl eşleşir?
vi: Cách khái niệm này ánh xạ đến b-game

source: validators
fr: validateurs
tr: doğrulayıcılar
vi: nhà xác thực

source: validators with non-zero weight in post-state of **b**
fr: validateurs avec un poids non nul dans le post-state de **b**
tr: **b** durum sonrasında sıfırdan farklı ağırlığa sahip doğrulayıcılar
vi: nhà xác thực có trọng số khác 0 ở hậu trạng thái **b**

source: validator weights
fr: poids des validateurs
tr: doğrulayıcı ağırlıkları
vi: trọng số của nhà xác thực

source: message
tr: mesaj
vi: thông điệp

source: message (= block or ballot)
fr: message (= block ou ballot)
tr: mesaj (=blok veya oy pusulası)
vi: thông điệp (= khối hoặc phiếu bầu)

source: consensus value
fr: valeur du consensus
tr: mutabakat değeri
vi: giá trị đồng thuận

source: direct child of **b** in the **main-tree**
fr: enfant direct de **b** dans la **main-tree**.
tr: **ana ağaçta** **b**'nin doğrudan alt ögesi
vi: lớp dưới trực tiếp của **b** trong **main-tree**

source: message **m** is voting for consensus value **c**
fr: le message **m** vote pour la valeur de consensus **c**
tr: mesaj **m**, mutabakat değeri **c** için oy veriyor
vi: thông điệp **m** đang bỏ phiếu cho giá trị đồng thuận **c**

source: for a block **m**: **m** is a descendant of **c** along the **main-tree**, for a ballot **m**: **m.target-block** is a descendant of **c** along the **main-tree** when above conditions are not met, we consider **m** as voting for nothing (empty vote)
fr: pour un bloc **m** : **m** est un descendant de **c** le long de la **main-tree**, pour un ballot **m** : **m.target-block** est un descendant de **c** le long de la **main-tree** lorsque les conditions ci-dessus ne sont pas remplies, nous considérons que **m** ne vote pour rien (vote vide).
tr: bir blok için **m**: **m**, **ana ağaç** boyunca **c**'nin alt soyudur, oy pusulası için **m**: **m.target-block**, **ana ağaç** boyunca **c**'nin alt soyudur, yukarıdaki koşullar karşılanmadığında, **m**'in oy kullanmadığını kabul ederiz (boş oy)
vi: đối với khối **m**: **m** là hậu duệ của **c** cùng với **main-tree**, đối với một phiếu bầu **m**: **m.target-block** là hậu duệ của **c** cùng với **main-tree** khi các điều kiện trên không được đáp ứng, chúng tôi coi **m** là không bỏ phiếu (bỏ phiếu trống)

source: The contents of the table above may be explained as follows:
fr: Le contenu du tableau ci-dessus peut être expliqué comme suit :
tr: Yukarıdaki tablonun içeriği şu şekilde açıklanabilir:
vi: Nội dung của bảng trên có thể được giải thích như sau:

source: Hypothetically assuming that validators already achieved consensus on the block **b** as being the part of an “official” chain of blocks, they will have to decide which direct child of **b** (in main-tree) will be the next “official” chain.
fr: En supposant que les validateurs aient déjà atteint un consensus sur le bloc **b** comme faisant partie d'une chaîne de blocs "officielle", ils devront décider quel enfant direct de **b** (dans l'arbre principal) sera la prochaine chaîne "officielle".
tr: Doğrulayıcıların, **b** bloğunun “resmi” bloklar zincirinin bir parçası olduğu üzerinde mutabakata vardıklarını varsayarsak, onların **b**'nin (ana ağaçta) hangi direkt alt ögesinin sonraki “resmi” zincir olacağına karar vermeleri gerekecektir.
vi: Theo giả thuyết, giả sử rằng nhà xác thực đã đạt được sự đồng thuận về khối **b** là một phần của chuỗi khối "chính thức", họ sẽ phải quyết định con trực tiếp của **b** (trong cây chính) sẽ là chuỗi "chính thức" tiếp theo.

source: So the focus now is on the block **b** and on its direct main-tree children.
fr: L'accent est donc mis sur le bloc **b** et sur ses enfants directs dans l'arbre principal.
tr: Bu nedenle, odak şimdi **b** bloğu ve onun direkt ana ağaç alt ögeleri üzerindedir.
vi: Vì vậy, trọng tâm bây giờ là khối **b** và trên cây chính trực tiếp con của nó.

source: We setup the Abstract Casper Consensus instance “relative to block **b**” where consensus values are direct children of **b**.
fr: Nous configurons l'instance 'Abstract Casper Consensus' "relative au bloc **b**" où les valeurs de consensus sont des enfants directs de **b**.
tr: Mutabakat değerlerinin **b**'nin doğrudan alt ögeleri olduğu “**b** bloğuna göreli” Özet Casper Mutabakat örneğini kurduk.
vi: Chúng tôi thiết lập ví dụ Đồng thuận Casper trìu tượng (Abstract Casper Consensus) “liên quan đến khối **b**” trong đó các giá trị đồng thuận là con trực tiếp của **b**.

source: Any block **x** can be seen as a vote for some child of **b** only if **x** is a descendant of **b** in the main-tree. So if **x** is not a descendant of **b**, we consider **x** as carrying an empty vote.
fr: Tout bloc **x** ne peut être considéré comme un vote pour un enfant de **b** que si **x** est un descendant de **b** dans l'arbre principal. Ainsi, si **x** n'est pas un descendant de **b**, nous considérons que **x** porte un vote vide.
tr: Herhangi bir **x** bloğu, ancak **x** ana ağaçta **b**'nin soyundan geliyorsa, **b**'nin bazı alt ögeleri için oy olarak görülebilir. Dolayısıyla **x**, **b**'nin soyundan değilse, **x**'i boş oy olarak kabul ederiz.
vi: Bất kỳ khối **x** nào cũng có thể được coi là một phiếu bầu cho một số con của **b** chỉ khi **x** là con của **b** trong cây chính. Vì vậy, nếu **x** không phải là hậu duệ của **b**, chúng ta coi **x** là bỏ phiếu trống.

source: **Note:** when defining the players of **b-game**, we exclude all equivocators, as seen in the current protocol state. This means that b-game is not “absolute”, it is rather depending on the current perspective on the blockchain that given validator has. Also, the collection of equivocators grows over time, which means that over time we may need to recalculate b-game, excluding more validators. This aspect plays a crucial role in how **finalizers** work - (*see below* the topic **Operation of a finalizer**).
fr: **Note : **Lorsque nous définissons les joueurs de **b-game**, nous excluons tous les équivocateurs (validateurs éjectés), tels que vus dans l'état actuel du protocole. Cela signifie que b-game n'est pas "absolu", il dépend plutôt de la perspective actuelle sur la blockchain qu'a un validateur donné. De plus, la collection équivocateurs augmente au fil du temps, ce qui signifie qu'au fil du temps, nous pouvons avoir besoin de recalculer le b-game, en excluant plus de validateurs. Cet aspect joue un rôle crucial dans le fonctionnement des **finalizers** (*voir ci-dessous le sujet **Fonctionnement d'un finalizer**).
tr: **Not:** **b-oyunu** oyuncularını tanımlarken, mevcut protokol durumunda görüldüğü gibi tüm çelişkilileri hariç tutuyoruz. Bu, b-oyunun “mutlak” olmadığı, daha ziyade verilen doğrulayıcının sahip olduğu blokzincirdeki mevcut bakış açısına bağlı olduğu anlamına gelir. Ayrıca, çelişkililerin toplamı zamanla büyür, bu da zamanla b-oyununu daha fazla doğrulayıcı hariç tutarak yeniden hesaplamamız gerekebileceği anlamına gelir. Bu özellik, **kesinleştiricilerin** nasıl çalıştığı konusunda çok önemli bir rol oynar - (*aşağıya bakın* **Kesinleştiricilerin çalışması** konusuna bakın).
vi: **Lưu ý:** khi xác định người chơi của **b-game**, chúng tôi loại trừ tất cả các trình tương đương, như đã thấy trong trạng thái giao thức hiện tại. Điều này có nghĩa là b-game không phải là "tuyệt đối", nó phụ thuộc vào quan điểm hiện tại về chuỗi khối mà nhà xác nhận đã cung cấp. Ngoài ra, tập hợp các nhà xác thực tương đương tăng lên theo thời gian, có nghĩa là theo thời gian, chúng tôi có thể cần phải tính toán lại b-game, loại trừ nhiều trình xác nhận hơn. Khía cạnh này đóng một vai trò quan trọng trong cách hoạt động của **trình hoàn thiện** - (*xem bên dưới* chủ đề **Hoạt động của trình hoàn thiện**).

source: Not all **b-games** tend to be equally important. What happens is presented with the following pattern:
fr: Tous les **b-games** n'ont pas la même importance. Ce qui se passe se présente avec le schéma suivant :
tr: Tüm **b-oyunları** eşit derecede önemli olma eğiliminde değildir. Neler olduğu aşağıdaki modelde sunulmuştur:
vi: Không phải tất cả **b-games** đều quan trọng như nhau. Điều gì xảy ra được trình bày theo mô hình sau:

source: The **Genesis** block is given. So, **Genesis-game** is the first game.
fr: Le bloc **Genesis** est donné. Donc, **Genesis-game** est le premier jeu.
tr: **Doğuş (genesis)** bloğu verilmiştir. Yani, **Genesis-oyunu** ilk oyundur.
vi: Khối **Genesis** được đưa ra. Vì vậy, **Genesis-game** là trò chơi đầu tiên.

source: As the blockdag grows, the **Genesis-game** is progressing towards finality.
fr: Alors que le blockdag grandit, le **Genesis-game** progresse vers la finalité (finality).
tr: Blockdag büyüdükçe, **Genesis oyunu** kesinliğe doğru ilerler.
vi: Khi blockdag phát triển, **Genesis-game** tiến dần đến sự hoàn thiện.

source: Finality of the **Genesis-game** means picking some direct child of **Genesis**. Let us name this child **LFB1**
fr: La finalité du **Genesis-game** est de choisir un enfant direct de **Genesis**. Appelons cet enfant **LFB1**.
tr: **Genesis oyununun** kesinliği, **Genesis**'in doğrudan bir alt ögesini seçmek anlamına gelir. Bu çocuğa **LFB1** adını verelim
vi: Cuối cùng của **Genesis-game** có nghĩa là chọn một phần tử con trực tiếp của **Genesis**. Hãy để chúng tôi đặt tên cho nó là **LFB1**

source: Then, the **LFB1-game** becomes the “important” game that everybody looks at.
fr: Ensuite, le **LFB1-game** devient le jeu "important" que tout le monde regarde.
tr: Ardından, **LFB1 oyunu** herkesin baktığı “önemli” oyun haline gelir.
vi: Sau đó, **LFB1-game** trở thành trò chơi “quan trọng” mà chúng ta đều xem.

source: As the blockdag grows, the **LFB1-game** is progressing towards finality.
fr: Alors que le blockdag grandit, le **LFB1-game** progresse vers la finalité (finality).
tr: Blockdag büyüdükçe, **LFB1 oyunu** kesinliğe doğru ilerler.
vi: Khi blockdag phát triển, **LFB1-game** tiến dần đến tính hoàn thiện.

source: Finality of the **LFB1-game** means picking some direct child of **LFB1**. Let us name this child **LFB2**
fr: La finalité du **LFB1-game** est de choisir un enfant direct de **LFB1**. Appelons cet enfant **LFB2**.
tr: **LFB1 oyununun** kesinliği, **LFB1**'in bazı doğrudan alt öğelerini seçmek anlamına gelir. Bu alt ögeye **LFB2** adını verelim
vi: Cuối cùng của **LFB1-game** có nghĩa là chọn một phần tử con trực tiếp của **LFB1**. Hãy để chúng tôi đặt tên cho nó **LFB2**

source: This pattern goes on forever.
fr: Ce schéma se poursuit indéfiniment.
tr: Bu model sonsuza kadar devam eder.
vi: Mô hình này tiếp tục mãi mãi.

source: “LFB” stands for “last finalized block”. For symmetry, we set **LFB0** = **Genesis**.
fr: "LFB" signifie "last finalized block" ou "dernier bloc finalisé". Par symétrie, nous avons fixé **LFB0** = **Genesis**.
tr: "LFB", "son kesinleşmiş blok" anlamına gelir. Simetri için **LFB0** = **Genesis** olarak ayarlanmıştır.
vi: “LFB” là viết tắt của “khối cuối cùng được hoàn thiện - last finalized block”. Để đối xứng, chúng tôi đặt **LFB0** = **Genesis**.

source: Why do we need ballots ?
fr: Pourquoi avons-nous besoin de bulletins de vote (ballots)?
tr: Neden oy pusulasına ihtiyacımız var?
vi: Tại sao chúng ta cần phiếu bầu?

source: The security of proof-of-stake blockchain is based on the stake in two ways:
fr: La sécurité de la blockchain proof-of-stake est basée sur l'enjeu (stake) de deux manières :
tr: Hisse kanıtı blok zincirinin güvenliği, hisseye iki şekilde dayanır:
vi: Tính bảo mật của chuỗi khối bằng chứng cổ phần dựa trên cổ phần theo hai cách:
