Repository: casper-network/docs-archive
Catalog: locale/*/LC_MESSAGES/theory/naive-blockchain.po
Languages: fr, tr, vi

source: **finalizers (aka “ring 1”)** - they observe validators and try to deduce the subset of history that is considered as “confirmed” (the “confirmed” predicate is parameterized so to reflect the expected trust level)
fr: **les finalisateurs (finalizers) (aka “ring 1”)** - ils observent les validateurs et tentent de déduire le sous-ensemble de l'historique qui est considéré comme "confirmé" (le prédicat "confirmé" est paramétré de manière à refléter le niveau de confiance attendu).
tr: **kesinleştiriciler (diğer adıyla “halka 1”)** - doğrulayıcıları gözlemler ve “onaylanmış” olarak kabul edilen geçmişin alt kümesini çıkarmaya çalışırlar (“onaylanmış” dayanak, beklenen güven düzeyini yansıtacak şekilde parametrelendirilir)
vi: **người hoàn thành (hay còn gọi là “vòng 1”) ** - họ quan sát nhà xác thực và cố gắng suy ra tập hợp con của lịch sử được coi là “xác nhận” (từ “đã xác nhận” được tham số hóa để phản ánh mức độ tin cậy dự kiến)

source: **clients (aka “ring 2” or “dapps”)** - use the blockchain computer - they send programs to be executed and react to execution results; a client connects to a validator (one or many) to send transactions while it also connects to a finalizer (one or many) to observe execution results
fr: **les clients (aka "ring 2" ou "dapps")** - utilisent l'ordinateur blockchain - ils envoient des programmes à exécuter et réagissent aux résultats de l'exécution ; un client se connecte à un validateur (un ou plusieurs) pour envoyer des transactions tandis qu'il se connecte également à un finalisateur (un ou plusieurs) pour observer les résultats de l'exécution
tr: **istemciler (“halka 2” veya “dapps” olarak da bilinir)** - blokzincir bilgisayarını kullanırlar - yürütülecek programları gönderirler ve yürütme sonuçlarına tepki verirler; bir istemci, işlem göndermek için doğrulayıcıya (bir veya daha fazla) bağlanırken, yürütme sonuçlarını gözlemlemek için kesinleştiriciye (bir veya daha fazla) bağlanır
vi: **khách hàng (hay còn gọi là “ring 2” hoặc “dapps”) ** - sử dụng máy tính blockchain - họ gửi các chương trình được thực thi và phản ứng với kết quả thực thi; khách hàng kết nối với nhà xác thực (một hoặc nhiều) để gửi giao dịch trong khi nó cũng kết nối với nhà xác thực (một hoặc nhiều) để quan sát kết quả thực hiện

source: Stake management
fr: La gestion des enjeux (Stake)
tr: Hisse yönetimi
vi: Quản lý đặt cọc (staking)

source: In proof-of-stake blockchains, **stake** is a representation of the voting power a validator has. We leave the question of exact representation of stakes open. We only summarize here the minimal assumptions we need for the mechanics of the blockchain to work.
fr: Dans les blockchains à preuve d'enjeu, **enjeu** (stake) est une représentation du pouvoir de vote d'un validateur. Nous laissons ouverte la question de la représentation exacte des enjeux. Nous résumons seulement ici les hypothèses minimales dont nous avons besoin pour que la mécanique de la blockchain fonctionne.
tr: Hisse kanıtı blokzincirlerinde **hisse**, doğrulayıcının sahip olduğu oylama gücünün bir temsilidir. Hisselerin tam olarak temsili sorusunu açık bırakıyoruz. Burada sadece blokzincirin mekaniğinin çalışması için ihtiyaç duyduğumuz minimum varsayımları özetliyoruz.
vi: Trong chuỗi khối bằng chứng cổ phần, **đặt cọc** là đại diện cho quyền biểu quyết của nhà xác thực. Chúng tôi để ngỏ câu hỏi về đại diện chính xác của cổ phần. Chúng tôi chỉ tóm tắt ở đây những giả định tối thiểu mà chúng tôi cần để cơ chế của chuỗi khối hoạt động.

source: Encoding of stakes
fr: Encodage des enjeux
tr: Hisselerin kodlanması
vi: Mã hóa tiền đặt cọc

source: The main assumption is that a global state encodes (among other things) the “weights map” - a mapping of validators to their voting power. So, mathematically we expect the existence of a function that assigns to every global state a function mapping validators to their weights:
fr: L'hypothèse principale est qu'un état global encode (entre autres choses) la "weights map" - une correspondance entre les validateurs et leur pouvoir de vote. Donc, mathématiquement, nous nous attendons à l'existence d'une fonction qui attribue à chaque état global une fonction de mise en correspondance des validateurs avec leurs poids :
tr: Ana varsayım, bir küresel durumun (diğer şeylerin yanı sıra) "ağırlık haritasını" - doğrulayıcıların oylama güçleriyle eşleştirilmesini - kodlamasıdır. Dolayısıyla, matematiksel olarak, her bir küresel durumda bir fonksiyon eşleme doğrulayıcısını ağırlığına atayan bir fonksiyonun varlığını bekliyoruz:
vi: Giả định chính là một trạng thái toàn cục mã hóa (trong một số những thứ khác) "bản đồ trọng số" - ánh xạ của những nhà xác thực cho quyền biểu quyết của họ. Vì vậy, về mặt toán học, chúng tôi mong đợi sự tồn tại của một hàm gán cho mọi trạng thái toàn cục, một hàm ánh xạ các nhà xác thực hợp lệ theo trọng số của chúng:

source: Intuitively, the stake of a validator will be (usually) defined by the amount of internal blockchain “money” allocated to the corresponding account.
fr: Intuitivement, l'enjeu (stake) d'un validateur sera (généralement) défini par la quantité de "monnaie" interne à la blockchain allouée au compte correspondant.
tr: Sezgisel olarak, bir doğrulayıcının hissesi (genellikle) ilgili hesaba tahsis edilen dahili blokzincir “parasının” miktarı ile tanımlanacaktır.
vi: Theo trực quan, cổ phần của nhà xác thực sẽ (thường) được xác định bởi số lượng “tiền” blockchain nội bộ được phân bổ cho tài khoản tương ứng.

source: Bonding and unbonding
fr: Bonding et unbonding
tr: Bağlama ve çözülme
vi: Cổ phần và huỷ cổ phần

source: Blockchain users can increase/decrease the stake of a given validator. This is to happen via executing (special) transactions.
fr: Les utilisateurs de la blockchain peuvent augmenter/diminuer l'enjeux (stake) d'un validateur donné. Pour ce faire, ils doivent exécuter des transactions (spéciales).
tr: Blokzincir kullanıcıları, belirli bir doğrulayıcının hissesini artırabilir/azaltabilir. Bu, (özel) işlemlerin yürütülmesi yoluyla gerçekleşecektir.
vi: Người dùng chuỗi khối có thể tăng/giảm cổ phần của một nhà xác thực nhất định. Điều này xảy ra thông qua thực hiện các giao dịch (đặc biệt).

source: Minimal stake **MIN_STAKE** is a parameter of the blockchain.
fr: L'enjeu minimal **MIN_STAKE** est un paramètre de la blockchain.
tr: Minimum hisse **MIN_STAKE**, blok zincirinin bir parametresidir.
vi: Số tiền đặt cược tối thiểu **MIN_STAKE** là một tham số của chuỗi khối.

source: Unbonding stages
fr: Étapes de désengagement (Unbonding)
tr: Çözülme aşamaları
vi: Các giai đoạn hủy cổ phần

source: Unbonding is always a total unbonding -- a validator transitioning to stake=0. There is no partial unbonding.
fr: Le désengagement est toujours un désengagement total - un validateur qui passe à stake=0. Il n'y a pas de désengagement partiel.
tr: Çözülme her zaman tam bir çözülmedir -- bir doğrulayıcının hisse=0'a geçişi. Kısmi çözülme yoktur.
vi: Hủy cổ phần luôn là tổng số không cổ phần - nhà xác thực chuyển đổi thành tiền cược = 0. Không thể hủy cổ phần một phần .

source: Unbonding must be go in stages, leading to the following states of a validator:
fr: Le désengagement (unbonding) doit se faire par étapes, conduisant aux états suivants d'un valideur :
tr: Çözülme, bir doğrulayıcının aşağıdaki durumlarına yol açacak şekilde, aşamalar halinde yapılmalıdır:
vi: Việc hủy cổ phần phải được thực hiện theo từng giai đoạn, dẫn đến các trạng thái sau của trình xác thực:

source: While in STAKED, a validator can produce only blocks.
fr: Alors que dans l'état STAKED, un validateur ne peut produire que des blocs.
tr: STAKED durumundayken, bir doğrulayıcı yalnızca blok üretebilir.
vi: Trong khi ở STAKED, nhà xác thực chỉ có thể tạo ra các khối.

source: While in VOTING_ONLY, a validator can produce only ballots.
fr: Lorsqu'il est en état de VOTE_ONLY, un validateur ne peut produire que des bulletins de vote.
tr: VOTING_ONLY aşamasındayken, bir doğrulayıcı yalnızca oy pusulası üretebilir.
vi: Trong khi ở VOTING_ONLY, nhà xác thực chỉ có thể tạo ra các lá phiếu.

source: While in UNBONDING_ESCROW and ZEROED, a validator is not supposed to produce messages.
fr: Alors que dans les états UNBONDING_ESCROW et ZEROED, un validateur n'est pas censé produire des messages.
tr: UNBONDING_ESCROW ve ZEROED durumundayken, bir doğrulayıcının mesaj üretmesi beklenmez.
vi: Trong khi ở UNBONDING_ESCROW và ZEROED, nhà xác thực không được phép tạo mới thông điệp.

source: The how of transitioning between states is beyond the scope of this specification (it can be based on wall clock, p-time, j-daglevel, block generation and other approaches).
fr: La manière de passer d'un état à l'autre dépasse le cadre de cette spécification (elle peut être basée sur une wall clock, p-time, j-daglevel, la génération de blocs et d'autres approches).
tr: Durumlar arasında geçişin nasıl yapılacağı bu spesifikasyonun kapsamı dışındadır (duvar saati, p-zamanı, j-daglevel, blok üretimi ve diğer yaklaşımlara dayalı olabilir).
vi: Cách chuyển đổi giữa các trạng thái nằm ngoài phạm vi của đặc điểm kỹ thuật này (nó có thể dựa trên wall clock, p-time, j-daglevel, tạo khối và các phương pháp tiếp cận khác).

source: Slashing
tr: Kesme (slashing)
vi: Phạt (Slashing)

source: Slashing is forced unbonding where the money used for the stake is burned. The intention is to penalizing equivocators.
fr: le Slashing est un désengagement (unbonding) forcé où les fonds utilisés pour l'enjeu (stake) sont brûlés. L'intention est de pénaliser les équivoques.
tr: Kesme, hisse için kullanılan paranın yakıldığı yerde zorla çözülür. Amaç, şüphelileri cezalandırmaktır.
vi: Phạt buộc phải hủy cổ phần khi số tiền được sử dụng để đặt cọc bị đốt cháy. Mục đích là để trừng phạt những giao dịch không rõ ràng.

source: Visual introduction
fr: Introduction visuelle
tr: Görsel tanıtım
vi: Giới thiệu trực quan

source: The consensus protocol is based on a data structure we call a **blockdag**, represented as a graph it looks like the following:
fr: Le protocole de consensus est basé sur une structure de données que nous appelons un **blockdag**, représenté sous forme de graphe, il ressemble à ce qui suit :
tr: Mutabakat protokolü, **blockdag** olarak adlandırdığımız ve aşağıdaki gibi bir grafik olarak temsil edilen bir veri yapısına dayanmaktadır:
vi: Giao thức đồng thuận dựa trên cấu trúc dữ liệu mà chúng tôi gọi là **blockdag**, được biểu diễn dưới dạng biểu đồ giống như sau:

source: The meaning of symbols:
fr: La signification des symboles :
tr: Sembollerin anlamları:
vi: Ý nghĩa của các biểu tượng:

source: The 3 types of vertices in the graph are as follows:
fr: Les 3 types de sommets du graphe sont les suivants :
tr: Grafikteki 3 köşe noktası aşağıdaki gibidir:
vi: 3 loại đỉnh trong đồ thị như sau:

source: **normal blocks** - contain transactions to be executed against the blockchain computer
fr: **normal blocks** - contiennent des transactions à exécuter sur l'ordinateur de la blockchain
tr: **normal bloklar** - blokzincir bilgisayarına karşı yürütülecek işlemleri içerir
vi: **khối thông thường (normal blocks)** - chứa các giao dịch được thực hiện trên máy tính blockchain

source: **ballots** - do not contain transactions, but participate in the consensus
fr: **ballots** - ne contiennent pas de transactions, mais participent au consensus
tr: **oy pusulaları** - işlemleri içermez, ancak mutabakata katılır
vi: **phiếu bầu (ballots)** - không chứa giao dịch, nhưng tham gia vào sự đồng thuận

source: **genesis** - a special block that stands as a root node of the structure
fr: **genesis** - un bloc spécial qui fait office de nœud racine de la structure
tr: **doğuş (genesis)** - yapının kök düğümü olarak duran özel bir blok
vi: **khối gốc (genesis)** - một khối đặc biệt đứng như một nút gốc của cấu trúc

source: Additionally we say:
fr: De plus, nous disons :
tr: Ek olarak:
vi: Ngoài ra, chúng tôi nói:

source: **block** - when we mean “normal block or genesis”
fr: **block** - quand nous voulons dire "bloc normal ou genesis"
tr: **blok** - "normal blok veya doğuş" ifade ederken
vi: **khối (block)** - khi chúng tôi có nghĩa là "khối bình thường hoặc khối gốc"

source: **message** - when we mean “normal block or ballot”
fr: **message** - quand nous voulons dire "bloc normal ou bulletin de vote"
tr: **mesaj** - “normal blok veya oy pusulası” derken
vi: **thông điệp (message)** - khi chúng tôi có nghĩa là "khối hoặc phiếu bầu bình thường"

source: **vertex** - when we mean “normal block or ballot or genesis”
fr: **vertex** - quand nous voulons dire "bloc normal ou bulletin de vote ou genesis"
tr: **köşe** - “normal blok veya oy pusulası veya doğuş” derken
vi: **đỉnh (vertex)** - khi chúng tôi có nghĩa là "khối bình thường hoặc phiếu bầu hoặc khối gốc"

source: We visually mark the creator of a message by placing it in a relevant swimlane. Genesis is outside swimlanes because genesis is given at blockchain initialization (= it does not have a creator).
fr: Nous marquons visuellement le créateur d'un message en le plaçant dans un swimlane approprié. Genesis est en dehors des swimlanes parce que genesis est donné à l'initialisation de la blockchain (= il n'a pas de créateur).
tr: Bir mesajın yaratıcısını ilgili bir kulvara yerleştirerek görsel olarak işaretleriz. Doğuş kulvarların dışındadır çünkü doğuş blokzincirin başlangıcında verilir (= bir yaratıcısı yoktur).
vi: Chúng tôi đánh dấu trực quan người tạo ra một thông điệp bằng cách đặt nó vào một vùng liên quan. Genesis nằm ngoài các vùng này vì genesis được đưa ra khi khởi tạo blockchain (= nó không có trình tạo ra).

source: Every normal block points to its **main parent** block (we visualize this with red arrows). Hence, blocks form a tree we call the **main tree**.
fr: Chaque bloc normal pointe vers son **bloc parent principal** (nous le visualisons avec des flèches rouges). Par conséquent, les blocs forment un arbre que nous appelons l' **arbre principal** (main tree).
tr: Her normal blok, **ana üst öge** bloğuna işaret eder (bunu kırmızı oklarla görselleştiririz). Dolayısıyla bloklar, **ana ağaç** dediğimiz bir ağaç oluşturur.
vi: Mọi khối bình thường đều trỏ đến khối **chính** của nó (chúng tôi trực quan khối này bằng các mũi tên màu đỏ). Do đó, các khối tạo thành một cây mà chúng ta gọi là **cây chính**.

source: Additionally, any normal block may point to an arbitrary number of blocks as **secondary parents**. We visualize them with blue arrows. Blocks + red arrows + blue arrows together form a directed acyclic graph we call **the p-dag**.
fr: De plus, tout bloc normal peut pointer vers un nombre arbitraire de blocs en tant que **parents secondaires**. Nous les visualisons avec des flèches bleues. Blocs + flèches rouges + flèches bleues forment ensemble un graphe acyclique dirigé que nous appelons **le p-dag**.
tr: Ek olarak, herhangi bir normal blok, **ikincil üst öge** olarak isteğe bağlı sayıda bloğa işaret edebilir. Onları mavi oklarla görselleştiriyoruz. Bloklar + kırmızı oklar + mavi oklar birlikte **p-dag** olarak adlandırdığımız yönlendirilmiş çevrimsiz bir grafik oluşturur.
vi: Ngoài ra, bất kỳ khối thông thường nào cũng có thể trỏ đến một số khối tùy ý là **lớp trên thứ cấp**. Chúng tôi trực quan chúng bằng các mũi tên màu xanh. Các khối + mũi tên đỏ + mũi tên xanh cùng nhau tạo thành một biểu đồ xoay chiều có hướng mà chúng tôi gọi là **p-dag**.

source: Any ballot points to exactly one block. We call this block “the target block of a ballot”.
fr: Tout scrutin pointe vers un seul bloc. Nous appelons ce bloc "le bloc cible d'un scrutin".
tr: Herhangi bir oy pusulası tam olarak bir bloğa işaret eder. Bu bloğa “oy pusulasının hedef bloğu” diyoruz.
vi: Bất kỳ phiếu bầu nào cũng chỉ vào đúng một khối. Chúng tôi gọi khối này là “khối đích của một phiếu bầu”.

source: Additionally, any message may point to an arbitrary number of vertices as **additional justifications**. We visualize them with **dashed arrows**.
fr: En outre, tout message peut pointer vers un nombre arbitraire de sommets comme **justifications supplémentaires**. Nous les visualisons avec des **flèches pointillées**.
tr: Ek olarak, herhangi bir mesaj **ek gerekçeler** olarak isteğe bağlı sayıda köşeye işaret edebilir. Bunları **kesikli oklarla** görselleştiriyoruz.
vi: Ngoài ra, bất kỳ thông điệp nào cũng có thể trỏ đến một số đỉnh tùy ý dưới dạng **biện minh bổ sung**. Chúng tôi trực quan chúng bằng **mũi tên đứt nét**.

source: All arrows together with all vertices form a directed acyclic graph we call the **j-dag**.
fr: Toutes les flèches ainsi que tous les sommets forment un graphe acyclique dirigé que nous appelons le **j-dag**.
tr: Tüm oklar, tüm köşelerle birlikte **j-dag** olarak adlandırdığımız yönlendirilmiş çevrimsiz bir grafik oluşturur.
vi: Tất cả các mũi tên cùng với tất cả các đỉnh tạo thành một đồ thị xoay chiều có hướng mà chúng tôi gọi là **j-dag**.

source: DAG vs POSET language
fr: DAG vs Langage POSET
tr: DAG ve POSET dili
vi: Ngôn ngữ DAG so với POSET

source: DAG is a common abbreviation for “directed acyclic graph”.
fr: DAG est une abréviation courante de "directed acyclic graph" (graphe acyclique dirigé).
tr: DAG, "yönlendirilmiş çevrimsiz grafik" için yaygın bir kısaltmadır.
vi: DAG là từ viết tắt phổ biến của "biểu đồ xoay vòng có hướng (directed acyclic graph)".

source: POSET is a common abbreviation for “partially ordered set”.
fr: POSET est une abréviation courante de “partially ordered set” (ensemble partiellement ordonné).
tr: POSET, “kısmen sıralı küme” için yaygın bir kısaltmadır.
vi: POSET là một từ viết tắt phổ biến của “tập hợp có thứ tự một phần (partially ordered set)”.

source: When a DAG has at most one edge between any pair of vertices, we say this DAG is “simple”.
fr: Lorsqu'un DAG a au plus une arête entre une paire de sommets, on dit que ce DAG est "simple".
tr: Bir DAG, herhangi bir köşe çifti arasında en fazla bir kenara sahip olduğunda, bu DAG'ın “basit” olduğunu söyleriz.
vi: Khi một DAG có nhiều nhất một cạnh giữa bất kỳ cặp đỉnh nào, chúng ta nói rằng DAG này là "đơn giản".

source: Any POSET can be seen as a simple DAG when you define an edge **a \rightarrow b** to be present whenever **a < b**.
fr: Tout POSET peut être vu comme un simple DAG lorsque vous définissez une arête **a \rightarrow b** pour être présente chaque fois que **a < b**.
tr: Herhangi bir POSET, **a < b** olduğunda mevcut olacak bir kenar **a \rightarrow b** tanımladığınızda basit bir DAG olarak görülebilir.
vi: Bất kỳ POSET nào cũng có thể được xem như một DAG đơn giản khi bạn xác định một cạnh **a \rightarrow b** để biểu diễn bất cứ khi nào **a < b**.

source: Any simple DAG leads to a POSET by taking its transitive closure and saying that **a < b** iff there is an edge **a \rightarrow b**. By symmetry, taking **a < b** iff there is an edge **b \rightarrow a** is also a POSET (just based on inverted order). Going in the other direction - from POSET to a DAG - is analogous.
fr: Tout DAG simple conduit à un POSET en prenant sa closure transitive et en disant que **a < b** s'il existe une arête **a \rightarrow b**. Par symétrie, prendre **a < b** s'il y a une arête **b \rightarrow a** est aussi un POSET (juste basé sur l'ordre inversé). Aller dans l'autre sens - d'un POSET à un DAG - est analogue.
tr: Geçişli kapalılık (transitive closure) alınıp, **a < b** olduğu söylenirse, **a \rightarrow b** şeklinde bir köşe var ise, herhangi bir basit DAG, bir POSET'e yol açar. Simetrik olarak, **a < b** alırsak, **b \rightarrow a** şeklinde bir köşe var ise, bu da bir POSET'tir (tersten sıralamayı baz alarak). Diğer yönde gidince de - POSET'ten DAG'a - benzerdir.
vi: Bất kỳ DAG đơn giản nào cũng dẫn đến một POSET bằng cách bắc cầu của nó và nói rằng **a < b** nếu có một cạnh *a \rightarrow b**. Theo tính đối xứng, lấy **a < b** nếu có cạnh **b \rightarrow a** cũng là một POSET (chỉ dựa trên thứ tự đảo ngược). Theo hướng khác - từ POSET đến DAG - cũng tương tự.

source: In practice, POSET is “like a simple DAG” where we do not distinguish between DAGs with the same transitive closure. In particular, for visualization purposes it is convenient to draw a POSET as a transitive reduction of a corresponding DAG.
fr: En pratique, un POSET est "comme un simple DAG" où nous ne faisons pas de distinction entre les DAGs ayant la même closure transitive. En particulier, à des fins de visualisation, il est pratique de dessiner un POSET comme une réduction transitive d'un DAG correspondant.
tr: Pratikte POSET, aynı geçişli kapalılığa sahip DAG'ler arasında ayrım yapmadığımız “basit bir DAG gibidir”. Özellikle, görselleştirme açısından, bir POSET'i karşılık gelen bir DAG'nin geçişli bir indirgemesi olarak çizmek uygundur.
vi: Trên thực tế, POSET “giống như một DAG đơn giản”, nơi chúng tôi không phân biệt giữa các DAG với cùng một quá trình bắc cầu. Đặc biệt, đối với mục đích trực quan, rất thuận tiện để vẽ một POSET dưới dạng giảm bắc cầu của một DAG tương ứng.

source: When talking about **j-dag** and **p-dag**, we blur the difference between DAG language and POSET language, because essentially one language is convertible to another.
fr: En parlant de **j-dag** et **p-dag**, nous brouillons la différence entre le langage DAG et le langage POSET, car essentiellement un langage est convertible en un autre.
tr: **j-dag** ve **p-dag** hakkında konuşurken, DAG dili ile POSET dili arasındaki farkı bulanıklaştırıyoruz çünkü esasen bir dil diğerine dönüştürülebilir.
vi: Khi nói về **j-dag** và **p-dag**, chúng tôi làm mờ sự khác biệt giữa ngôn ngữ DAG và ngôn ngữ POSET, vì về cơ bản một ngôn ngữ này có thể chuyển đổi sang ngôn ngữ khác.

source: Understanding the layers of the blockdag
fr: Comprendre les couches du blockdag
tr: Blockdag'ın katmanlarını anlama
vi: Hiểu về các lớp của blockdag

source: Here we explain only the intuition behind the blockdag. These ideas are formalized later in this document.
fr: Nous n'expliquons ici que l'intuition derrière le blockdag. Ces idées sont formalisées plus loin dans ce document.
tr: Burada sadece blockdagin arkasındaki sezgiyi açıklıyoruz. Bu fikirler bu belgede daha sonra resmileştirilmiştir.
vi: Ở đây chúng tôi chỉ giải thích trực quan đằng sau blockdag. Những ý tưởng này được chính thức hóa sau, trong tài liệu này.
