Repository: casper-network/docs-archive
Catalog: locale/*/LC_MESSAGES/dapp-dev-guide/contract-dsl/advanced.po
Languages: fr, ru, tr, vi

source: Advanced Optimization
fr: Optimisation avancée
ru: Продвинутая оптимизация
tr: Gelişmiş Optimizasyon
vi: Tối ưu hoá nâng cao

source: During advanced development, you may wish to optimize the output of the DSL for the blockchain once the base logic of your smart contract is in place. This requires digging into the actual code that the DSL generates, and here is where the `cargo expand <https://github.com/dtolnay/cargo-expand>`_ command becomes a useful tool.
fr: Au cours du développement avancé, vous pouvez souhaiter optimiser la sortie du DSL pour la blockchain une fois que la logique de base de votre contrat intelligent est en place. Cela nécessite de se plonger dans le code réel que le DSL génère, et c'est ici que la commande `cargo expand <https://github.com/dtolnay/cargo-expand>`_ devient un outil utile.
ru: В процессе разработки, когда базовая логика вашего смарт контракта реализована, вы можете захотеть оптимизировать результат работы DSL. Для этого вам необходимо разобраться в коде который генерирует DSL, и здесь команда `cargo expand <https://github.com/dtolnay/cargo-expand>`_ становится полезным инструментом.
tr: İleri geliştirme sırasında, akıllı kontratın temel mantığı yerine oturduğunda, blokzincir için DSL çıktısını optimize etmek isteyebilirsiniz. Bu, DSL'nin oluşturduğu gerçek kodun içine derinleşmeyi gerektirir ve işte burada `cargo expand <https://github.com/dtolnay/cargo-expand>`_ komutu yararlı bir araç haline gelir.
vi: Trong quá trình phát triển nâng cao, bạn có thể muốn tối ưu hóa đầu ra của DSL cho chuỗi khối khi logic cơ sở của hợp đồng thông minh của bạn đã có sẵn. Điều này đòi hỏi phải đào sâu vào mã hiện tại mà DSL tạo ra và đây là nơi lệnh `cargo expand <https://github.com/dtolnay/cargo-expand>`_ trở thành một công cụ hữu ích.

source: Expanding the Macros
fr: Extension des Macros
ru: Расширение макросов
tr: Makroları Genişletmek
vi: Mở rộng Macros

source: To see the code that the DSL generates, you can use the ``cargo expand`` command. To install it, you can simply type the following in your terminal:
fr: Pour voir le code que le DSL génère, vous pouvez utiliser la commande ``cargo expand``. Pour l'installer, vous pouvez simplement saisir la commande suivante dans votre terminal :
ru: Для просмотра кода генерируемого DSL, вы можете использовать команду ``cargo expand`` . Для установки выполните в терминале следующее:
tr: DSL'nin oluşturduğu kodu görmek için ``cargo expand`` komutunu kullanabilirsiniz. Yüklemek için uçbiriminize aşağıdakini yazmanız yeterlidir:
vi: Để xem mã mà DSL tạo ra, bạn có thể sử dụng lệnh ``cargo expand``. Để cài đặt nó, bạn chỉ cần nhập thông tin sau vào thiết bị của mình:

source: Once installed, you can go into your contract folder and type:
fr: Une fois installé, vous pouvez aller dans votre dossier de contrat et saisir :
ru: После установки, перейдите в папку с вашим контрактом и выполните следующее:
tr: Kurulduktan sonra, kontrat klasörünüze gidebilir ve şunu yazabilirsiniz:
vi: Sau khi cài đặt, bạn có thể vào thư mục hợp đồng của mình và nhập:

source: To pipe it into a file for viewing, you can use this command:
fr: Pour le placer dans un fichier afin de le visualiser, vous pouvez utiliser cette commande :
ru: Если вы хотите перенаправить вывод в файл используйте следующую команду:
tr: Görüntülemek üzere bir dosyaya aktarmak için şu komutu kullanabilirsiniz:
vi: Để chuyển nó thành một tệp để xem, bạn có thể sử dụng lệnh sau:

source: Once you view the output, you should see that the expanded file is much larger and more complex than the contract we viewed a moment ago. The DSL does a fantastic job of abstracting all this boilerplate code away from the development process.
fr: Une fois le résultat affiché, vous devriez constater que le fichier développé est beaucoup plus volumineux et complexe que le contrat que nous avons vu il y a un instant. Le DSL fait un travail fantastique pour abstraire tout ce code passe-partout du processus de développement.
ru: После просмотра вывода вы должны увидеть, что расширенный файл намного больше и сложнее, чем контракт, который мы просматривали минуту назад. DSL делает фантастическую работу по абстрагированию всего этого шаблонного кода от процесса разработки.
tr: Çıktıyı bir kez görüntülediğinizde, genişletilmiş dosyanın biraz önce incelediğimiz kontrattan çok daha büyük ve daha karmaşık olduğunu görmelisiniz. DSL, tüm bu basmakalıp kodu geliştirme sürecinden soyutlayarak harika bir iş çıkarır.
vi: Khi bạn xem kết quả đầu ra, bạn sẽ thấy rằng tệp được mở rộng lớn hơn và phức tạp hơn nhiều so với hợp đồng mà chúng ta đã xem trước đó. DSL thực hiện một công việc tuyệt vời là trừu tượng hóa tất cả mã soạn sẵn này khỏi quá trình phát triển.

source: You usually do not need to generate the expanded code. When the Rust compiler encounters each of the macros, it expands the code in place. The resultant expanded code is then compiled to a WASM binary, which can then be deployed to the blockchain.
fr: Vous n'avez généralement pas besoin de générer le code augmenté. Lorsque le compilateur Rust rencontre chacune des macros, il étend le code en place. Le code augmenté qui en résulte est ensuite compilé en un binaire WASM, qui peut ensuite être déployé sur la blockchain.
ru: Обычно вам не нужно генерировать расширенный код. Когда компилятор Rust встречает макросы, он расширяет код на месте. Результирующий расширенный код затем компилируется в двоичный файл WASM, который затем может быть развернут в блокчейн.
tr: Genellikle genişletilmiş kodu oluşturmanız gerekmez. Rust derleyicisi makroların her biriyle karşılaştığında, kodu yerinde genişletir. Elde edilen genişletilmiş kod daha sonra bir WASM ikili koduna derlenir ve daha sonra blokzincire dağıtılabilir.
vi: Bạn thường không cần tạo mã mở rộng. Khi trình biên dịch Rust gặp từng macro, nó sẽ mở rộng mã tại chỗ. Sau đó, mã mở rộng kết quả được biên dịch thành tệp nhị phân WASM, mã này sau đó có thể được triển khai vào chuỗi khối.

source: Also, keep in mind that once you have expanded and changed the generated code, you should remove the macros from the project configuration before saving the changes and building it.
fr: N'oubliez pas non plus qu'une fois que vous avez développé et modifié le code généré, vous devez supprimer les macros de la configuration du projet avant d'enregistrer les modifications et de le construire (build).
ru: Также имейте в виду, что после того, как вы расширили и изменили сгенерированный код, вам следует удалить макросы из конфигурации проекта, прежде чем сохранять изменения и собирать его.
tr: Ayrıca, oluşturulan kodu genişletip değiştirdikten sonra, değişiklikleri kaydetmeden ve kodu derlemeden önce makroları proje yapılandırmasından kaldırmanız gerektiğini unutmayın.
vi: Ngoài ra, hãy nhớ rằng khi bạn đã mở rộng và thay đổi mã đã tạo, bạn nên xóa macro khỏi cấu hình dự án trước khi lưu các thay đổi và xây dựng nó.

source: Building and Testing the Hello World Contract
fr: Construire et tester le contrat Hello World
ru: Сборка и тестирование контракта Hello World
tr: Merhaba Dünya Kontratını Derleme ve Test Etme
vi: Xây dựng và kiểm thử Hello World Contract

source: By building and testing the `Hello World <https://github.com/casper-ecosystem/hello-world>`_ contract, you can see how the DSL expands the macros.
fr: En construisant et en testant le contrat `Hello World <https://github.com/casper-ecosystem/hello-world>`_, vous pouvez voir comment le DSL étend les macros.
ru: Собрав и протестировав контракт Hello World `Hello World <https://github.com/casper-ecosystem/hello-world>`_ , вы можете увидеть, как DSL расширяет макросы.
tr: `Merhaba Dünya <https://github.com/casper-ecosystem/hello-world>`_ kontratını derleyip test ederek, DSL'nin makroları nasıl genişlettiğini görebilirsiniz.
vi: Bằng cách xây dựng và thử nghiệm hợp đồng ``Hello World <https://github.com/casper-ecosystem/hello-world>`_, bạn có thể thấy cách DSL mở rộng các macro.

source: The build process is identical to the one used in the `Getting Started <https://docs.casperlabs.io/en/latest/dapp-dev-guide/setup-of-rust-contract-sdk.html>`_ section, but here we do not have the *build.rs* script that was used before. The following steps will help you manually build the contract.
fr: Le processus de construction (build) est identique à celui utilisé dans la section `Getting Started <https://docs.casperlabs.io/en/latest/dapp-dev-guide/setup-of-rust-contract-sdk.html>`_, mais ici nous n'avons pas le script *build.rs* qui était utilisé auparavant. Les étapes suivantes vous aideront à construire manuellement le contrat.
ru: Процесс сборки идентичен тому, который используется в разделе `Getting Started <https://docs.casperlabs.io/en/latest/dapp-dev-guide/setup-of-rust-contract-sdk.html>`_, но здесь у нас нет скрипта * build.rs *, который использовался раньше. Следующие шаги помогут вам вручную создать контракт.
tr: Derleme süreci, `Başlarken <https://docs.casperlabs.io/en/latest/dapp-dev-guide/setup-of-rust-contract-sdk.html>`_ bölümünde kullanılanla aynıdır. , ancak burada daha önce kullanılan *build.rs* betiği yok. Aşağıdaki adımlar, kontratı el ile derlemenize yardımcı olacaktır.
vi: Quy trình xây dựng giống với quy trình được sử dụng trong phần `Bắt đầu <https://docs.casperlabs.io/en/latest/dapp-dev-guide/setup-of-rust-contract-sdk.html>`_, nhưng ở đây chúng ta không có tập lệnh *build.rs* đã được sử dụng trước đây. Các bước sau đây sẽ giúp bạn xây dựng hợp đồng theo cách thủ công.

source: First, we need to add the WASM target:
fr: D'abord, nous devons ajouter la cible (target) WASM :
ru: Во-первых, нам нужно добавить цель WASM:
tr: İlk olarak, WASM hedefini eklememiz gerekiyor:
vi: Trước hết chúng ta cần thêm mục tiêu của WASM:

source: Next, build the contract into a WASM binary:
fr: Ensuite, construire (build) le contrat dans un binaire WASM :
ru: Затем произвести сборку контракта в двоичный файл WASM:
tr: Ardından, kontratı bir WASM ikili kodunun içine derleyin:
vi: Tiếp theo, xây dựng hợp đồng thành tệp nhị phân WASM:

source: Then we can copy the WASM file into the ``tests`` folder and run the tests:
fr: Ensuite, nous pouvons copier le fichier WASM dans le dossier ``tests`` et exécuter les tests:
ru: Затем мы должны скопировать двоичный файл WASM в папку ``tests`` и запустить тесты:
tr: Ardından WASM dosyasını ``tests`` klasörüne kopyalayıp testleri çalıştırabiliriz:
vi: Sau đó, chúng tôi có thể sao chép tệp WASM vào thư mục ``tests`` và chạy các bài kiểm thử:

source: If you successfully ran the two tests (``should_run`` and ``should_update``), the DSL properly expanded your macros, built the binary, executed the contract, and called the update function. You should see an output similar to this if it worked correctly:
fr: Si vous avez réussi à exécuter les deux tests (``should_run`` and ``should_update``), le DSL a correctement étendu vos macros, construit le binaire, exécuté le contrat et appelé la fonction de mise à jour. Vous devriez voir une sortie similaire à celle-ci si tout a fonctionné correctement :
ru: Если вы успешно выполнили два теста (``should_run`` и ``should_update``), DSL правильно расширил ваши макросы, построил двоичный файл, выполнил контракт и вызвал функцию обновления. Вы должны увидеть результат, похожий на этот, если он отработал правильно:
tr: Eğer iki testi (``should_run`` ve ``should_update``) başarılı bir şekilde çalıştırdıysanız, DSL makrolarınızı uygun şekilde genişletip, ikili kodu oluşturup, kontratı yürütüp güncelleme işlevini çağırmıştır. Eğer doğru çalıştıysa, buna benzer bir çıktı görmelisiniz:
vi: Nếu bạn đã chạy thành công hai bài kiểm tra (``should_run`` và ``should_update``), DSL đã mở rộng đúng cách các macro của bạn, tạo nhị phân, thực thi hợp đồng và gọi hàm cập nhật. Bạn sẽ thấy một đầu ra tương tự như thế này nếu nó hoạt động chính xác:

source: Using the Makefile
fr: Utilisation du Makefile
ru: Использование Makefile
tr: Makefile'ı kullanmak
vi: Sử dụng Makefile

source: If you examine the repository contents, you’ll see that there is a Makefile. This is an alternative to using a build script, as we did in the `Getting Started guide <https://docs.casperlabs.io/en/latest/dapp-dev-guide/setup-of-rust-contract-sdk.html>`_. To duplicate the steps we took above, you would simply run the following two commands in your terminal:
fr: Si vous examinez le contenu du dépôt, vous verrez qu'il y a un Makefile. C'est une alternative à l'utilisation d'un script de construction, comme nous l'avons fait dans le guide `Getting Started' <https://docs.casperlabs.io/en/latest/dapp-dev-guide/setup-of-rust-contract-sdk.html>`_. Pour reproduire les étapes que nous avons suivies ci-dessus, il vous suffit d'exécuter les deux commandes suivantes dans votre terminal :
ru: Если вы изучите содержимое репозитория, вы увидите, что существует Makefile. Это альтернатива использованию сценария сборки, как мы делали в `Getting Started guide <https://docs.casperlabs.io/en/latest/dapp-dev-guide/setup-of-rust-contract-sdk.html>`_. Чтобы повторить шаги, которые мы предприняли выше, вы просто запустите следующие две команды в своем терминале:
tr: Kod deposu içeriklerini incelerseniz içerisinde Makefile olduğunu göreceksiniz. Bu, `Başlarken rehberinde <https://docs.casperlabs.io/en/latest/dapp-dev-guide/setup-of-rust-contract-sdk.html>`_. yaptığımız gibi bir derleme betiği kullanmaya bir alternatiftir. Yukarıda attığımız adımların kopyasını almak için terminalinizde aşağıdaki iki komutu çalıştırabilirsiniz:
vi: Nếu bạn kiểm tra nội dung của kho lưu trữ, bạn sẽ thấy rằng có một Makefile. Đây là một giải pháp thay thế cho việc sử dụng tập lệnh xây dựng như chúng tôi đã làm trong ``Hướng dẫn bắt đầu <https://docs.casperlabs.io/en/latest/dapp-dev-guide/setup-of-rust-contract-sdk.html>`_. Để sao chép các bước chúng tôi đã thực hiện ở trên, bạn chỉ cần chạy hai lệnh sau trong thiết bị của mình:
