Repository: casper-network/docs-archive
Catalog: locale/*/LC_MESSAGES/dapp-dev-guide/contract-dsl/getting-started.po
Languages: fr, ru, tr, vi

source: The DSL Macros
fr: Le DSL Macros
ru: Макросы DSL
tr: DSL Makroları
vi: DSL Macros

source: In this guide, we describe how to configure Rust smart contracts to use the Casper DSL, making it easier for developers to start writing their smart contracts.
fr: Dans ce guide, nous décrivons comment configurer les contrats intelligents Rust pour utiliser le DSL Casper, nous permettant ainsi d'écrire plus facilement nos contrats intelligents.
ru: В данном гайде мы объясняем, как конфигурировать смарт-контракты на Rust для использования Casper DSL, что упрощает разработчикам начало работы с написанием смарт-контрактов.
tr: Bu kılavuzda, Rust akıllı kontratlarının Casper DSL'yi kullanacak şekilde nasıl yapılandırılacağını açıklayarak geliştiricilerin akıllı kontratlarını yazmaya başlamasını kolaylaştırıyoruz.
vi: Trong hướng dẫn này, chúng tôi mô tả cách định cấu hình hợp đồng thông minh Rust để sử dụng Casper DSL, giúp các nhà phát triển bắt đầu viết hợp đồng thông minh của họ dễ dàng hơn.

source: The DSL consists of three macro directives dividing the boilerplate code between *headers*, *constructor*, and *method blocks*. The smart contract is being treated much like a class in OOP terms.
fr: Le DSL consiste en trois directives macro divisant le code passe-partout en trois parties: *en-têtes*, *constructeur* et *blocs de méthodes*. Le contrat intelligent est ainsi similaire à une classe dans le cadre de la programmation orientée objet (OOP).
ru: DSL состоит из трех макрос директив, разделяющих шаблонный код на заголовки *headers*, конструктор *constructor*, и методические блоки *method blocks*. В терминах объектно-ориентированного языка программирования, здесь смарт-контракт понимается как класс.
tr: DSL, standart kodu *headers*, *constructor* ve *method blocks* şeklinde bölen üç makro yönergeden oluşur. Akıllı kontrat, OOP açısından bir sınıf gibi ele alınmaktadır.
vi: DSL bao gồm ba chỉ mục macro phân chia mã soạn sẵn thành các khối * headers*, *constructor*, và *method blocks*. Hợp đồng thông minh đang được đối xử giống như một lớp trong OOP.

source: Here is a brief description of the three macros before we take a look at a sample contract utilizing them:
fr: Voici une courte description des trois macros avant de voir un exemple de contrat les utilisant :
ru: Ниже краткое описание трех макросов, прежде чем мы ознакомимся с сэмплом контракта, использующего их:
tr: Bunları kullanan örnek bir sözleşmeye bakmadan önce, üç makronun kısa bir açıklaması:
vi: Dưới đây là mô tả ngắn gọn về ba macro trước khi chúng ta xem xét một hợp đồng mẫu sử dụng chúng:

source: Macro
ru: Макрос
tr: Makro

source: Instruction
ru: Инструкция
tr: Talimat
vi: Hướng dẫn

source: Description
ru: Описание
tr: Tanım
vi: Mô tả

source: Contract
fr: Contrat
ru: Контракт
tr: Kontrat
vi: Hợp đồng

source: This macro generates the code for the headers for each of the entry points that use it. It sits at the very top of the contract module and includes the necessary code for contract execution.
fr: Cette macro génère le code des en-têtes ( headers) pour chacun des points d'entrée qui l'utilisent. Elle se trouve tout en haut du module de contrat et inclut le code nécessaire à son exécution.
ru: Этот макрос генерирует код для заголовков для каждой из точек входа, использующих его. Он расположен в самом верху модуля контракта и включает в себя необходимый код для исполнения контракта.
tr: Bu makro, onu kullanan giriş noktalarının her biri için başlıklar için kod oluşturur. Kontrat modülünün en üstünde yer alır ve kontratın yürütülmesi için gerekli kodu içerir.
vi: Macro này tạo mã cho các tiêu đề cho mỗi điểm nhập sử dụng nó. Nó nằm ở đầu mô-đun hợp đồng và bao gồm mã cần thiết để thực hiện hợp đồng.

source: Constructor
fr: Constructeur
ru: Конструктор
tr: Yapıcı
vi: Bộ dựng

source: This macro creates the code that sets up the contract in the runtime and locates it when execution begins. Underneath the hood, this is the deploy function that creates the contract entry point and stores the deploy hash under a function name in the Casper runtime. You can think of the function decorated by the constructor macro as the main function of the contract.
fr: Cette macro crée le code qui configure le contrat dans le Runtime et le localise lorsque l'exécution commence. Sous le capot, il s'agit de la fonction deploy qui crée le point d'entrée du contrat et stocke le hash deploy sous un nom de fonction dans le moteur d'exécution Casper. Vous pouvez considérer la fonction décorée par la macro constructeur comme la fonction principale du contrat.
ru: Этот макрос создает код, который устанавливает контракт в рабочую среду и размещает его, когда начинается исполнение. По своей сути это развертывающая функция, которая создает входную точку контракта и хранит хеш от развертывания в виде функции внутри рабочей среды Casper. Можете считать эту функцию, собранную конструктором, главной функцией контракта.
tr: Bu makro, kontratı çalışma zamanında ayarlayan kodu oluşturur ve yürütme başladığında onu bulur. Arkaplanda, bu, kontrat giriş noktasını oluşturan ve dağıtım özetini (hash) Casper çalışma zamanında bir işlev adı altında saklayan dağıtım işlevidir. Yapıcı makrosu tarafından dekore edilen işlevi, sözleşmenin ana işlevi olarak düşünebilirsiniz.
vi: Macro này tạo mã thiết lập hợp đồng trong thời gian chạy và định vị nó khi bắt đầu thực thi. Bên dưới đó, đây là hàm triển khai tạo điểm nhập hợp đồng và lưu trữ hàm băm triển khai dưới dạng tên hàm trong thời gian chạy Casper. Bạn có thể coi hàm được tạo ra bởi bộ dựng macro là hàm chính của hợp đồng.

source: Method
fr: Méthode
ru: Метод
tr: Yöntem
vi: Phương thức

source: This macro creates an entry point for any function in your contract that you wish to expose in the smart contract. Functions that are only used internally should not be decorated with this macro. Continuing the OOP metaphor, this directive would essentially be declaring a smart contract function as being public.
fr: Cette macro crée un point d'entrée pour toute fonction de votre contrat que vous souhaitez exposer dans le contrat intelligent. Les fonctions qui ne sont utilisées qu'en interne ne doivent pas être décorées avec cette macro. En poursuivant la comparaison avec la POO, cette directive revient essentiellement à déclarer une fonction du contrat intelligent comme étant publique.
ru: Этот макрос создает точку входа для любой функции вашего контракта, которую вы хотели бы раскрыть в смарт-контракте. Функции, которые используются только внутри, не должны быть декорированы этим макросом. Если использовать термины ООП, эта директива должна объявить функцию смарт-контракта публичной.
tr: Bu makro, akıllı kontratta göstermek istediğiniz kontratınızdaki herhangi bir işlev için bir giriş noktası oluşturur. Sadece dahili olarak kullanılan fonksiyonlar bu makro ile dekor edilmelidir. OOP metaforunu sürdüren bu yönerge, esasen bir akıllı kontrat işlevinin halka açık olduğunu ilan ediyor olacaktır.
vi: Macro này tạo một điểm vào cho bất kỳ hàm nào trong hợp đồng của bạn mà bạn muốn hiển thị trong hợp đồng thông minh. Các chức năng chỉ được sử dụng trong nội bộ không nên được tạo ra bằng macro này. Tiếp tục tương tự OOP, chỉ mục này về cơ bản sẽ là khai báo một hàm của hợp đồng thông minh là công khai.

source: Prerequisites
fr: Prérequis
ru: Пререквизиты
tr: Önkoşullar
vi: Điều kiện tiên quyết

source: The DSL relies upon working in a Rust contract, which means you need to have your development environment up and running. In the `Getting Started section <https://docs.casperlabs.io/en/latest/dapp-dev-guide/setup-of-rust-contract-sdk.html>`_, we compiled and tested a sample contract to verify our setup was functional. If you have not completed that section, please complete it before continuing with this guide.
fr: Le DSL repose sur le fonctionnement dans un contrat Rust, ce qui signifie que vous devez avoir un environnement de développement opérationnel. Dans l `Getting Started section <https://docs.casperlabs.io/en/latest/dapp-dev-guide/setup-of-rust-contract-sdk.html>`_, nous avons compilé et testé un exemple de contrat pour vérifier que notre configuration était fonctionnelle. Si vous n'avez pas terminé cette section, veuillez la compléter avant de continuer avec ce guide.
ru: DSL опирается на работу внутри контракта на Rust, поэтому ваша среда разработки должна быть запущена и работать. В секции `Getting Started section <https://docs.casperlabs.io/en/latest/dapp-dev-guide/setup-of-rust-contract-sdk.html>`_ мы компилировали и тестировали сэмпл контракта, чтобы проверить функциональность нашего сетапа. Если вы не выполнили эту секцию, пожалуйста сделайте это прежде чем продолжать работу с гайдом.
tr: DSL, bir Rust kontratında çalışmaya dayanır, bu da geliştirme ortamınızı çalışır durumda tutmanız gerektiği anlamına gelir. `Başlarken bölümünde <https://docs.casperlabs.io/en/latest/dapp-dev-guide/setup-of-rust-contract-sdk.html>`_, kurulumunuzun işlevsel oluğunu doğrulamak için örnek bir sözleşme derledik ve test ettik. Bu bölümü tamamlamadıysanız, lütfen bu kılavuza devam etmeden önce tamamlayın.
vi: DSL phụ thuộc vào việc làm việc trong một hợp đồng Rust, có nghĩa là bạn cần thiết lập và vận hành môi trường phát triển của mình. Trong phần `Bắt đầu <https://docs.casperlabs.io/en/latest/dapp-dev-guide/setup-of-rust-contract-sdk.html>`_, chúng tôi đã biên soạn và thử nghiệm một hợp đồng mẫu để xác minh thiết lập của chúng tôi đã hoạt động. Nếu bạn chưa hoàn thành phần đó, vui lòng hoàn thành phần đó trước khi tiếp tục với hướng dẫn này.

source: [Recommended] Getting the Macros
fr: [Recommandé] Obtention des macros
ru: [Рекомендуется] Извлечение макросов
tr: [Önerilen] Makroları Alma
vi: [Được khuyến nghị] Lấy ra Macros

source: If you are new to Casper development, we recommend following this guide using the sample `Hello World <https://github.com/casper-ecosystem/hello-world>`_ contract. This smart contract Rust file has all the macros in place, and the configuration is already set up to import the macros for you.
fr: Si vous êtes débutant dans le développement de Casper, nous vous recommandons de suivre ce guide en utilisant l'exemple de `Hello World <https://github.com/casper-ecosystem/hello-world>`_contrat. Ce fichier Rust de contrat intelligent possède toutes les macros en place, et la configuration est déjà prête à importer les macros pour vous.
ru: Если вы новичок в разработке Casper, рекомендуем следовать данному гайду используя семпл контракта Hello World <https://github.com/casper-ecosystem/hello-world>`_ . Этот файл смарт-контракта на Rust уже содержит все необходимые макросы, и конфигурация настроена под импорт ваших макросов.
tr: Casper geliştirme konusunda yeniyseniz, `Merhaba Dünya <https://github.com/casper-ecosystem/hello-world>`_ kontrat örneğini kullanarak bu kılavuzu izlemenizi öneririz. Bu akıllı kontrat Rust dosyasında tüm makrolar yerinde ve makroları sizin için içe aktarmak üzere yapılandırma zaten ayarlandı.
vi: Nếu bạn chưa quen với việc phát triển Casper, chúng tôi khuyên bạn nên làm theo hướng dẫn này bằng cách sử dụng hợp đồng mẫu `Hello World <https://github.com/casper-ecosystem/hello-world>`_ . Tệp Rust của hợp đồng thông minh này có tất cả các macro và cấu hình đã được thiết lập để kết nhập macro cho bạn.

source: [Advanced] Getting the Macros
fr: [Avancé] Obtention des macros
ru: [Продвинутые функции] Извлечение макросов
tr: [Gelişmiş] Makroları Alma
vi: [Nâng cao] Lấy ra Macros

source: If you already have been working with Casper contracts and you wish to simply add the macros to your existing smart contract, then you can retrieve the macros from `GitHub <https://github.com/CasperLabs/casperlabs_contract_macro>`_.
fr: Si vous avez déjà travaillé avec des contrats Casper et que vous souhaitez simplement ajouter les macros à votre contrat intelligent existant, vous pouvez alors récupérer les macros sur `GitHub <https://github.com/CasperLabs/casperlabs_contract_macro>`_.
ru: Если вы уже работали со смарт-контрактами в среде Casper и вы хотите просто добавить макросы в уже существующий смарт-контракт, вы можете вытащить макросы из `GitHub <https://github.com/CasperLabs/casperlabs_contract_macro>`_.
tr: Zaten Casper kontratlarıyla çalışıyorsanız ve makroları mevcut akıllı kontratınıza eklemek istiyorsanız, makroları `GitHub <https://github.com/CasperLabs/casperlabs_contract_macro>`_ adresinden alabilirsiniz.
vi: Nếu bạn đã làm việc với hợp đồng Casper và bạn chỉ muốn thêm macro vào hợp đồng thông minh hiện có của mình, thì bạn có thể truy xuất macro từ `GitHub <https://github.com/CasperLabs/casperlabs_contract_macro>`_.

source: Importing the Macros
fr: Importation des macros
ru: Импорт макросов
tr: Makroları İçe Aktarma
vi: Kết nhập Macros

source: The sample contract already has this done for you, but you should know how to do it for future contracts. To import the macros, just include a line in the ``Cargo.toml`` file in the *contract* folder of your smart contract. The entry needs to appear in the *[dependencies]* section of the file. Then ``cargo`` will import the macros into your project when you build it.
fr: Le contrat Exemple a déjà fait cela pour vous, mais vous devez savoir comment le faire pour les futurs contrats. Pour importer les macros, il suffit d'inclure une ligne dans le fichier ``Cargo.toml`` dans le dossier *contract* de votre contrat intelligent. L'entrée doit apparaître dans la section *[dépendances]* du fichier. Ensuite, ``cargo`` importera les macros dans votre projet lorsque vous le construirez.
ru: Сэмпл контракта уже сделал это за вас, но на будущее вам необходимо знать, как это делается. Чтобы импортировать макросы, добавьте строку в файл ``Cargo.toml`` в папке *contract* вашего смарт-контракта. Запись должна появиться в секции файла *[dependencies]* . Затем ``cargo`` импортирует макросы в ваш проект на этапе сборки.
tr: Örnek kontrat bunu sizin için zaten yaptı, ancak gelecekteki kontratlar için bunu nasıl yapacağınızı bilmelisiniz. Makroları içe aktarmak için akıllı kontratınızın *contract* klasöründeki ``Cargo.toml`` dosyasına bir satır eklemeniz yeterlidir. Girişin, dosyanın *[dependencies]* bölümünde görünmesi gerekir. Ardından ``cargo``, projenizi oluşturduğunuzda makroları projenize aktaracaktır.
vi: Hợp đồng mẫu đã có điều này thực hiện cho bạn, nhưng bạn nên biết cách thực hiện nó cho các hợp đồng sau này. Để nhập macro, chỉ cần bao gồm một dòng trong tệp ``Cargo.toml`` trong thư mục *contract* hợp đồng thông minh của bạn. Mục nhập cần xuất hiện trong phần *[dependencies]* của tệp. Sau đó, ``cargo`` sẽ nhập các macro vào dự án của bạn khi bạn xây dựng nó.

source: For example, if you placed the macros inside your project in a folder named *contract_macro* next to the *contract* folder, you would add this line to the dependencies section of the ``Cargo.toml`` file:
fr: Par exemple, si vous avez placé les macros à l'intérieur de votre projet dans un dossier nommé *contract_macro* à côté du dossier *contract*, vous devez ajouter cette ligne à la section des dépendances du fichier ``Cargo.toml``:
ru: Например, если вы поместили макросы внутри проекта в папке под названием *contract_macro* следом за папкой *contract*, вы добавляете эту строку в секцию зависимостей файла ``Cargo.toml`` :
tr: Örneğin, projenizin içindeki makroları *contract* klasörünün yanında *contract_macro* adlı bir klasöre yerleştirdiyseniz, bu satırı ``Cargo.toml`` dosyasının bağımlılıklar bölümüne eklersiniz:
vi: Ví dụ: nếu bạn đặt macro bên trong dự án của mình trong một thư mục có tên **contract_macro* bên cạnh thư mục *contract*, bạn sẽ thêm dòng này vào phần phụ thuộc của tệp ``Cargo.toml``:

source: Alternatively, you can get the macros directly from Github without downloading them:
fr: Vous pouvez également obtenir les macros directement de Github sans les télécharger :
ru: Как альтернатива, можно извлечь макросы напрямую из Github, не загружая их:
tr: Alternatif olarak, makroları indirmeden doğrudan Github'dan alabilirsiniz:
vi: Ngoài ra, bạn có thể lấy các macro trực tiếp từ Github mà không cần tải chúng xuống:

source: This second approach is what the `Hello World <https://github.com/casper-ecosystem/hello-world>`_ smart contract is utilizing, so if you are starting there, it has already been done for you.
fr: Cette deuxième approche est ce que le contrat intelligent `Hello World <https://github.com/casper-ecosystem/hello-world>`_ utilise, donc si vous commencez par là, tout a déjà été fait pour vous.
ru: Этот второй подход как раз используется в смарт-контракте `Hello World <https://github.com/casper-ecosystem/hello-world>`_ , так что если вы начинаете оттуда, эта работа уже сделана за вас.
tr: Bu ikinci yaklaşım, `Merhaba Dünya <https://github.com/casper-ecosystem/hello-world>`_ akıllı kontratının kullandığı şeydir, yani oradan başlıyorsanız, sizin için zaten yapılmıştır.
vi: Cách tiếp cận thứ hai này là những gì hợp đồng thông minh `Hello World <https://github.com/casper-ecosystem/hello-world>`_ đang sử dụng, vì vậy nếu bạn đang bắt đầu ở đó, nó đã được thực hiện cho bạn.

source: Using the DSL
fr: Utilisation du DSL
ru: Использование DSL
tr: DSL Kullanmak
vi: Sử dụng DSL

source: To use the DSL, simply add the following line to the *use section* of the contract (usually found at the top of the file in *main.rs*):
fr: Pour utiliser le DSL, il suffit d'ajouter la ligne suivante à la section *use section* du contrat (qui se trouve généralement en haut du fichier dans *main.rs*) :
ru: Чтобы использовать DSL просто добавьте следующую строку в секцию *use section* контракта (обычно располагается в верхней части файла в *main.rs*):
tr: DSL'yi kullanmak için, kontratın *kullan bölümüne* aşağıdaki satırı eklemeniz yeterlidir (genellikle dosyanın en üstünde *main.rs* içinde bulunur):
vi: Để sử dụng DSL, chỉ cần thêm dòng sau vào *use section* của hợp đồng (thường được tìm thấy ở đầu tệp trong *main.rs*):

source: Examining the Hello World Example
fr: Examen de l'exemple Hello World
ru: Проверка примера Hello World
tr: Merhaba Dünya Örneğinin İncelenmesi
vi: Kiểm tra ví dụ Hello World

source: Clone the `Hello World <https://github.com/casper-ecosystem/hello-world>`_ example contract and open the ``main.rs`` file. Examine the following section:
fr: Clonez le contrat exemple `Hello World <https://github.com/casper-ecosystem/hello-world>`_ et ouvrez le fichier ``main.rs``. Examinez la section suivante :
ru: Клонируйте файл `Hello World <https://github.com/casper-ecosystem/hello-world>`_ example contract and open the ``main.rs`` . Проверьте следующий раздел:
tr: `Merhaba Dünya <https://github.com/casper-ecosystem/hello-world>`_ örnek kontratını klonlayın ve ``main.rs`` dosyasını açın. Aşağıdaki bölümü inceleyin:
vi: Sao chép hợp đồng ví dụ `Hello World <https://github.com/casper-ecosystem/hello-world>`_ và mở tệp ``main.rs``. Kiểm tra phần sau:

source: Notice that all three macros are being utilized and that the file is relatively compact. This is a very simple contract that initializes a key named *special_value* with the value *hello world* once the contract is compiled and executed thanks to the constructor macro. The function *update* is decorated with the ``casperlabs_method`` macro and will thus be accessible for updating the value. However, notice that *set_key* is not prefaced with the macro. Since this function is used internally, it does not need to have an entry point in the Casper runtime.
fr: Remarquez que les trois macros sont utilisées et que le fichier est relativement compact. Il s'agit d'un contrat très simple qui initialise une clé nommée *special_value* avec la valeur *hello world* une fois que le contrat est compilé et exécuté grâce à la macro constructeur. La fonction *update* est décorée avec la macro ``casperlabs_method`` et sera donc accessible pour la mise à jour de la valeur. Cependant, notez que *set_key* n'est pas précédé de la macro. Cette fonction étant utilisée en interne, il n'est pas nécessaire qu'elle ait un point d'entrée dans le runtime Casper.
ru: Обратите внимание, что все три макроса применены и файл относительно компактный. Это очень простой контракт, который запускает ключ под названием *special_value* со значением *hello world*, как только контракт скомпилирован и исполнен благодаря макросу-конструктору. Функция *update* оформляется макросом ``casperlabs_method`` дабы сделать доступным обновление значений. Также обратите внимание, что перед *set_key* нет макроса. Так как эта функция используется внутри, ей не требуется точка входа в рабочей среде Casper.
tr: Üç makronun da kullanıldığına ve dosyanın nispeten kompakt olduğuna dikkat edin. Bu, yapıcı makro sayesinde kontrat derlenip yürütüldükten sonra *special_value* adlı bir anahtarı *merhaba dünya* değeriyle başlatan çok basit bir sözleşmedir. *güncelleme* işlevi "casperlabs_method" makrosu ile dekore edilmiştir ve bu nedenle değeri güncellemek için erişilebilir olacaktır. Ancak, *set_key* bölümünün makro ile başlamadığına dikkat edin. Bu işlev dahili olarak kullanıldığından, Casper çalışma zamanında bir giriş noktası olması gerekmez.
vi: Lưu ý rằng tất cả ba macro đang được sử dụng và tệp tương đối nhỏ gọn. Đây là một hợp đồng rất đơn giản, khởi tạo một khóa có tên là *special_value* với giá trị *hello world* sau khi hợp đồng được biên dịch và thực thi nhờ bộ dựng macro. Hàm *update* được tạo bằng macro with the ``casperlabs_method`` và do đó sẽ có thể truy cập được để cập nhật giá trị. Tuy nhiên, lưu ý rằng *set_key* không được mở đầu bằng macro. Vì chức năng này được sử dụng nội bộ nên nó không cần phải có điểm vào trong thời gian chạy Casper.
